{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Ivan Lozano, Android Team\n\nThe Android team has been working on introducing the Rust programming language into the Android Open Source Project (AOSP) since 2019 as a memory-safe alternative for platform native code development. As with any large project, introducing a new language requires careful consideration. For Android, one important area was assessing how to best fit Rust into Android’s build system. Currently this means the Soong build system (where the Rust support resides), but these desi…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/RTirZGlM7IY/integrating-rust-into-android-open.html",
          "publishedOn": "2021-05-11T17:31:00.001Z",
          "wordCount": 2603,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Integrating Rust Into the Android Open Source Project"
        },
        {
          "description": "Posted by Priya Wadhwa, Jake Sanders, Google Open Source Security Team\n\nWith over 16 million pulls per month, Google’s `distroless` base images are widely used and depended on by large projects like Kubernetes and Istio. These minimal images don’t include common tools like shells or package managers, making their attack surface (and download size!) smaller than traditional base images such as `ubuntu` or `alpine`. Even with this additional protection, users could still fall prey to typosquatting attacks, or…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/FLp9ykAkb4U/making-internet-more-secure-one-signed.html",
          "publishedOn": "2021-05-06T13:00:00.002Z",
          "wordCount": 869,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Making the Internet more secure one signed container at a time"
        },
        {
          "description": "Alex Gough, Engineer, Chrome Platform Security Team\nChrome 90 for Windows adopts Hardware-enforced Stack Protection, a mitigation technology to make the exploitation of security bugs more difficult for attackers. This is supported by Windows 20H1 (December Update) or later, running on processors with Control-flow Enforcement Technology (CET) such as Intel 11th Gen or AMD Zen 3 CPUs. With this mitigation the processor maintains a new, protected, stack of valid return addresses (a shadow stack). This improves…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/IB3cidyQPkc/enabling-hardware-enforced-stack.html",
          "publishedOn": "2021-05-04T17:00:00.018Z",
          "wordCount": 2167,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Enabling Hardware-enforced Stack Protection (cetcompat) in Chrome"
        },
        {
          "description": "Posted by Krish Vitaldevara, Director of Product Management Trust & Safety, Google Play\n\nProviding safe experiences to billions of users and millions of Android developers has been one of the highest priorities for Google Play for many years. Last year we introduced new policies, improved our systems, and further optimized our processes to better protect our users, assist good developers and strengthen our guard against bad apps and developers. Additionally, in 2020, Google Play Protect scanned over 100B in…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/W4mBUTFAZVU/how-we-fought-bad-apps-and-developers.html",
          "publishedOn": "2021-04-21T17:01:00.000Z",
          "wordCount": 1022,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "How we fought bad apps and developers in 2020"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "90% of AI / ML applications never make it to market, because fine tuning models for maximum performance across disparate ML software solutions and hardware backends requires a ton of manual labor and is cost-prohibitive.  Luis Ceze and his team created Apache TVM at the University of Washington, then left founded OctoML to bring the project to market.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by do…",
          "link": "https://changelog.com/practicalai/134",
          "publishedOn": "2021-05-18T20:45:00.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 134: Apache TVM and OctoML"
        },
        {
          "description": "Bitcoin’s Proof of work (PoW) consensus mechanism is hotly debated these days due it its energy consumption. Proof of stake (PoS) is a different way to skin the consensus cat.\nWhile it’s less proven to work in the real world (Bitcoin’s uptime and security over the network’s 12-year lifespan is perhaps its greatest asset), PoS is quite promising and we’re starting to see the fruit of that promise with early numbers from Ethereum 2.\nEthereum will be completing the transition to Proof-of-Stake in the upcoming …",
          "link": "https://blog.ethereum.org/2021/05/18/country-power-no-more/",
          "publishedOn": "2021-05-18T16:44:00.000Z",
          "wordCount": 1037,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ethereum will use at least ~99.95% less energy post merge"
        },
        {
          "description": "Patrick DeVivo:\nThis is a project in Go that compiles to a SQLite runtime loadable extension, which brings Redis commands into a SQL context. This allows you to write SQL queries against data in a Redis instance, using Redis commands like LRANGE as SQL functions.\nExperimental for now. But why? Patrick says:\nIn general, Redis is fairly accessible from many programming languages, and any query using reqlite could probably be implemented in a language of your choice using a Redis client. However, sometimes dec…",
          "link": "https://github.com/augmentable-dev/reqlite",
          "publishedOn": "2021-05-18T15:58:00.000Z",
          "wordCount": 1119,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reqlite lets you query Redis with SQL"
        },
        {
          "description": "For far too long React has encouraged to people to cram their data layer into their view layer. If you learn anything from the Clojure community, this is a flawed approach. I argue that we can do better, and need a data-first frontend revolution, which relegates React to what it does best: diff and render DOM nodes.\nDiscuss on Changelog News",
          "link": "https://kea.js.org/blog/2021/05/14/data-first-frontend-revolution",
          "publishedOn": "2021-05-18T15:12:00.000Z",
          "wordCount": 877,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "It's time for a data-first frontend revolution"
        },
        {
          "description": "Stephen Lindberg takes cues from the level design in Super Mario 3D World and applies it to user experience design:\nYou may not know what a Conkdor is, but the design problem is universal: “how do we reduce cognitive load without sacrificing interest and fun?” To summarize the video, game designers would approach the problem like this:\nIntroduce a new concept in a way that the player is not punished for failing.\nBuild upon that concept in a way that challenges the player.\nCombine the concept with other fami…",
          "link": "https://thoughtbot.com/blog/designing-for-failure",
          "publishedOn": "2021-05-18T13:44:00.000Z",
          "wordCount": 716,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Designing for failure"
        },
        {
          "description": "Here’s a sneak peek of our upcoming episode of The Changelog (plus bonus videos) starring Julia Evans, Drew Neil, Suz Hinton, and Gary Bernhardt!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=Qcar5QqOZZY",
          "publishedOn": "2021-05-17T18:02:00.000Z",
          "wordCount": 19,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why we 💚 Vim (a teaser trailer)"
        },
        {
          "description": "Ashley Kolodziej speaking directly to HTML:\nYou are the foundation of the Internet. You are the bridge between humans and information. When we say HTML isn’t an expertise in and of itself, when we take you for granted, we leave behind the people and systems who access that information using web crawlers and accessibility technology.\nand CSS:\nThere is a time and place for specificity, and I cherish your ability to manage that. I love your system of overrides, of thinking ahead to what should and shouldn’t be…",
          "link": "https://css-tricks.com/a-love-letter-to-html-css/",
          "publishedOn": "2021-05-17T16:39:00.000Z",
          "wordCount": 1356,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A love letter to HTML & CSS"
        },
        {
          "description": "It’s fun seeing the proliferation of TODO comments over time on these bastions of open source. One not-surprising (but still unfortunate) trend: they all pretty much move up and to the right 📈, but a few have had some dramatic reversals 📉 at certain points in time. Go had a crazy month in April 2018 &amp; TypeScript’s TODOs exploded in the Spring of 2018.\nDiscuss on Changelog News",
          "link": "https://schleiss.io/plotting-source-code-todos-for-open-source-projects",
          "publishedOn": "2021-05-17T15:51:00.000Z",
          "wordCount": 336,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Plotting the source code \"TODO\" history of the most popular open source projects"
        },
        {
          "description": "There are a lot of screencasts, recordings of user group gatherings and conference talks available online. I try to commit myself watching at least two new talks every week, and I’ve been doing this for quite some time now. I created this list of online talks that I really enjoyed watching. I’ll also be updating this list whenever I’ve watched another awesome talk that is worthy enough. Suggestions are always appreciated through a pull request.\nDiscuss on Changelog News",
          "link": "https://github.com/JanVanRyswyck/awesome-talks",
          "publishedOn": "2021-05-17T14:13:00.000Z",
          "wordCount": 1797,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Awesome online talks and screencasts"
        },
        {
          "description": "This week we’re talking about open source on Mars. Martin Woodward (Senior Director of Developer Relations at GitHub) joins us to talk about the new Mars badge GitHub introduced. This collaboration between GitHub and NASA confirmed nearly 12,000 people contributed code, documentation, graphic design, and more to the open source software that made Ingenuity’s launch possible. Today’s show is a celebration of this human achievement and the impact of open source on space exploration as we know it.\nDiscuss on C…",
          "link": "https://changelog.com/podcast/440",
          "publishedOn": "2021-05-14T19:00:00.000Z",
          "wordCount": 543,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 440: Open source goes to Mars 🚀"
        },
        {
          "description": "Ever wanted a language like JavaScript, but without the warts, with a great type system, and with a lean build toolchain that doesn’t waste your time?\nPatrick Ecker from the ReScript Association sits down with Jerod and Feross to tell us all about  this “JavaScript-like language you have been waiting for”.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kube…",
          "link": "https://changelog.com/jsparty/175",
          "publishedOn": "2021-05-14T16:00:00.000Z",
          "wordCount": 380,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 175: This is ReScript"
        },
        {
          "description": "Syncthing synchronizes files between two or more computers. Its goals are to be:\nSafe From Data Loss\nSecure Against Attackers\nEasy to Use\nAutomatic\nUniversally Available\nFor Individuals\nEverything Else (!)\nThere’s a Goals document where these ideas are explained and expanded upon, which is neat.\nDiscuss on Changelog News",
          "link": "https://github.com/syncthing/syncthing",
          "publishedOn": "2021-05-14T15:57:00.000Z",
          "wordCount": 1296,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Syncthing is a continuous file synchronization program"
        },
        {
          "description": "This is just one of four (as of now) mysteries put together by Julia Evans to help us practice our debugging skills. Can you crack the case?!\nDiscuss on Changelog News",
          "link": "https://mysteries.wizardzines.com/50ms-request.html",
          "publishedOn": "2021-05-14T14:53:00.000Z",
          "wordCount": 14268,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The case of the 50ms request"
        },
        {
          "description": "This article won’t help you write better code, but it might help you better manage your relationship with Twitter. (Which could help you write better code.) It’s also really well written.\nSocial media are the Trojans at the gates of your mind. Their wooden horse is magnificent. It glistens with all of the fittest memes. I let those Trojans into the fortress of my mind, and it was a mistake.\nIf you’re intrigued by faustian bargains, incremental games, and petrichor… give it a read.\nDiscuss on Changelog News",
          "link": "https://mccormick.cx/news/entries/one-million-people-saw-my-dumbest-tweet",
          "publishedOn": "2021-05-14T14:05:00.000Z",
          "wordCount": 680,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "One million people saw my dumbest tweet"
        },
        {
          "description": "Use TypeScript as your preprocessor. Write type‑safe, locally scoped classes, variables and themes, then generate static CSS files at build time.\nFirst-class theming, framework agnostic, and type-safety so you can cow[boy|girl] code those styles and let your tooling catch typos and variable name changes.\nDiscuss on Changelog News",
          "link": "https://vanilla-extract.style/",
          "publishedOn": "2021-05-13T18:10:00.000Z",
          "wordCount": 558,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Zero-runtime stylesheets in TypeScript"
        },
        {
          "description": "In this episode we talk with Daniel and Steve about their experience with event-driven systems and shed some light on what they are and who they might be for. We explore topics like the complexity of setting up an event-driven system, the need to embrace eventual consistency, useful tools for building event-driven systems, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Quickly access any resource anywhere usi…",
          "link": "https://changelog.com/gotime/179",
          "publishedOn": "2021-05-13T16:00:00.000Z",
          "wordCount": 472,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 179: Event-driven systems"
        },
        {
          "description": "You may have heard that Dark Sky (the beloved weather app for iOS) was acquired by Apple and its accompanying developer API will be shut down soon, which left a lot of devs scrambling for alternatives. Enter the PirateWeather API:\nWeather forecasts are primarily determined using models run by government agencies, but the outputs aren’t easy to use or in formats built for applications. To try to address this, I’ve put together a service (built on AWS Lambda) that reads public weather forecasts and serves it …",
          "link": "https://pirateweather.net/",
          "publishedOn": "2021-05-13T14:03:00.000Z",
          "wordCount": 2,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A weather forecast API to replace Dark Sky's"
        },
        {
          "description": "App structure is complicated.\nGood app structure improves the developer experience. It can help you isolate what they are working on without needing to keep the entire codebase in your head. A well structured app can help prevent bugs by decoupling components and making it easier to write useful tests.\nA poorly structured application can do the opposite; it can make testing harder, it can make it challenging to find relevant code, and it can introduce needless complexity and verbosity that slows you down wi…",
          "link": "https://changelog.com/posts/on-go-application-structure",
          "publishedOn": "2021-05-12T18:19:40.000Z",
          "wordCount": 2504,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Thoughts on how to structure Go code"
        },
        {
          "description": "This API supports multiple deep learning frameworks (TensorFlow, PyTorch, etc), supports multiple hardware accelerators (CPU, GPU, egdeTPU), and is based on open source models. You can think of it a bit like the Google’s Cloud Vision API, only open source and self-hosted.\nDiscuss on Changelog News",
          "link": "https://openvisionapi.com/",
          "publishedOn": "2021-05-12T13:50:00.000Z",
          "wordCount": 70,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An open source computer vision API"
        },
        {
          "description": "To say that Jeff Adams is a trailblazer when it comes to speech technology is an understatement. Along with many other notable accomplishments, his team at Amazon developed the Echo, Dash, and Fire TV changing our perception of how we could interact with devices in our home. Jeff now leads Cobalt Speech and Language, and he was kind enough to join us for a discussion about human computer interaction, multimodal AI tasks, the history of language modeling, and AI for social good.\nDiscuss on Changelog News\nJoi…",
          "link": "https://changelog.com/practicalai/133",
          "publishedOn": "2021-05-11T19:00:00.000Z",
          "wordCount": 458,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 133: 25 years of speech technology innovation"
        },
        {
          "description": "Hidde de Vries takes a strong, reasoned stance to online criticism of others’ work:\nThis week, a friend shared a blog post that critiqued a popular framework for CSS. Twitter started to discuss if it’s okay to criticise tools. In this post, I’ll say it is not just okay, it is also important.\nThis is a tough subject because we identify so closely with the things we create (our code), but Hidde is right: if we want to progress as an industry (and individually) we need to be able to criticize (constructively) …",
          "link": "https://hiddedevries.nl/en/blog/2021-05-08-criticism-pushes-the-web-forward/",
          "publishedOn": "2021-05-11T15:27:00.000Z",
          "wordCount": 2811,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Criticism pushes the web forward"
        },
        {
          "description": "A nice primer on the many aspects of building full-text search, such as: data preparation, indexing, searching, term frequency, and computing relevance. It’s amazing what 150 lines of code can get done…\nDiscuss on Changelog News",
          "link": "https://bart.degoe.de/building-a-full-text-search-engine-150-lines-of-code/",
          "publishedOn": "2021-05-10T17:23:00.000Z",
          "wordCount": 3085,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building a full-text search engine in 150 lines of Python code"
        },
        {
          "description": "There are obvious upsides to pair programming. This post from Nat Bennett shares both the ups and the downs of pairing all day for years…\nSo I paired all day, most days, for about five years. This had a lot of upsides, far more than I can list here. There’s a standard list of benefits and drawbacks to pairing that you might be familiar with, but the impact of pairing, especially pairing that much, goes much deeper than its impact on the code, on the particular work the team delivers that week.\nNat goes on t…",
          "link": "https://www.simplermachines.com/the-mortifying-ordeal-of-pairing-all-day/",
          "publishedOn": "2021-05-10T16:37:50.000Z",
          "wordCount": 1473,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What happens when you pair all day, most days, for years?"
        },
        {
          "description": "AMA Happy Hour with Priyanka Sharma \n\nAd-hoc conversations with you Carlos, Chico, Katie, Rahul &amp; Silviu were my favourite. They would not have happened was it not for your Happy Hour sessions Priyanka. And what would brilliant ideas be without your hard work Colleen &amp; Kristi, and the rest of your teams?\nI really appreciate how well this event came together. The virtual platform and diversity played a big part in this world-class experience. This was the perfect one to Ship It!, a brand new Changelo…",
          "link": "https://changelog.com/posts/kubecon-cloudnativecon-europe-2021",
          "publishedOn": "2021-05-10T16:00:00.000Z",
          "wordCount": 1398,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "🚀 KubeCon + CloudNativeCon Europe 2021"
        },
        {
          "description": "After working as a software engineer for 20 years, it’s still exciting to see how the results of your work become alive and you still feel yourself as a kid at that moment :)\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/excitement-of-making/",
          "publishedOn": "2021-05-10T15:46:00.000Z",
          "wordCount": 433,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The excitement of making things real"
        },
        {
          "description": "Stripe Atlas has a wide array of guides to running an internet business that are totally open and free for everyone. This guide, written by Dr. Sherry Walling (a clinical psychologist), on “managing founder stress” covers everything from running smart (not just hard), coping with chronic stress, mastering the ups and downs, and a reminder that as a founder you are not alone.\nIf you like this guide, then you’ll probably be a fan of my podcast Founders Talk too.\nDiscuss on Changelog News",
          "link": "https://stripe.com/atlas/guides/founder-stress",
          "publishedOn": "2021-05-10T15:00:01.000Z",
          "wordCount": 7895,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Guide to managing founder stress"
        },
        {
          "description": "Bash is great, but when it comes to writing scripts, people usually choose a more convenient programming language. JavaScript is a perfect choice, but standard Node.js library requires additional hassle before using. zx package provides useful wrappers around child_process, escapes arguments and gives sensible defaults.\nI wouldn’t say JavaScript is a perfect choice for this kind of scripting, but it’s definitely a suitable one (especially if it’s the language you already know well). Here’s what scripting lo…",
          "link": "https://github.com/google/zx",
          "publishedOn": "2021-05-10T13:50:00.000Z",
          "wordCount": 1053,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "google/zx – a tool for writing better scripts"
        },
        {
          "description": "This week Elixir creator José Valim joins Jerod and Practical AI’s Daniel Whitenack to discuss Numerical Elixir, his new project that’s bringing Elixir into the world of machine learning. We discuss why José chose this as his next direction, the team’s layered approach, influences and collaborators on this effort, and their awesome collaborative notebook project that’s built on Phoenix LiveView.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappe…",
          "link": "https://changelog.com/podcast/439",
          "publishedOn": "2021-05-07T21:00:00.000Z",
          "wordCount": 446,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 439: Elixir meets machine learning"
        },
        {
          "description": "The benefits of such a setup are numerous, especially for small sites and side projects:\nHosting a static website is much easier than a “real” server - there’s many free and reliable options (like GitHub, GitLab Pages, Netlify, etc), and it scales to basically infinity without any effort.\nThe how is also super interesting:\nSo how do you use a database on a static file hoster? Firstly, SQLite (written in C) is compiled to WebAssembly. SQLite can be compiled with emscripten without any modifications, and the …",
          "link": "https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/",
          "publishedOn": "2021-05-07T17:28:00.000Z",
          "wordCount": 1707,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Hosting SQLite databases on GitHub Pages"
        },
        {
          "description": "Paul Bakaus from Google Web Creators joins Amal, Nick, &amp; Jerod to talk about this new initiative to promote, educate, and equip people to create on the web.\nAlong the way we discuss Web Stories, AMP, RSS, Google Reader, and more, of course. Join us: for a more dope web!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just op…",
          "link": "https://changelog.com/jsparty/174",
          "publishedOn": "2021-05-07T16:30:00.000Z",
          "wordCount": 410,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 174: For a more dope web!"
        },
        {
          "description": "Mark Eriksen:\nMany great Phoenix LiveView examples exist. They often show the ease and power of LiveView but stop at multiple browsers talking to a single web server. I wanted to go further and create a fully clustered, globally distributed, privately networked, secure application. What’s more, I wanted to have fun doing it.\nSo I set out to see if I could create a fully distributed, clustered, privately networked, global game server system. Spoiler Alert: I did.\nI like the way he frames his experience. He s…",
          "link": "https://fly.io/blog/building-a-distributed-turn-based-game-system-in-elixir/",
          "publishedOn": "2021-05-07T14:33:00.000Z",
          "wordCount": 1384,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building a distributed turn-based game system in Elixir"
        },
        {
          "description": "Paul Graham on preposterous sounding ideas and how easy they are to dismiss:\nMost implausible-sounding ideas are in fact bad and could be safely dismissed. But not when they’re proposed by reasonable domain experts. If the person proposing the idea is reasonable, then they know how implausible it sounds. And yet they’re proposing it anyway. That suggests they know something you don’t. And if they have deep domain expertise, that’s probably the source of it.\nSuch ideas are not merely unsafe to dismiss, but d…",
          "link": "http://paulgraham.com/newideas.html",
          "publishedOn": "2021-05-07T13:47:00.000Z",
          "wordCount": 1304,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Crazy new ideas"
        },
        {
          "description": "Perspectives from both the workshop leaders perspective, as well as the workshop participants. What are some top tips, things to watch out for, and ways to innovate and keep your participants engaged, especially in the remote world we are now living in.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Quickly access any resource anywhere using a Unified Access Plane that consolidates access controls and auditing across a…",
          "link": "https://changelog.com/gotime/178",
          "publishedOn": "2021-05-06T15:25:00.000Z",
          "wordCount": 376,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 178: What makes wonderful workshops?"
        },
        {
          "description": "The motivation for building Slidev:\nI always found myself spending too much time styling and layouting slides when using apps like PowerPoint / Keynote / Google Slides. Whenever I need to share code snippets, I would also need to use other tools to generate the highlighted code as images over and over again.\nSo as a frontend developer, why not solve it the way that fits better with what I am good at?\nLooks slick: themeable, hackable, and you write your slides in Markdown. 👌\nDiscuss on Changelog News",
          "link": "https://sli.dev/",
          "publishedOn": "2021-05-06T14:56:00.000Z",
          "wordCount": 75,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Slidev – presentation slides for developers"
        },
        {
          "description": "ClearURLs is an add-on based on the new WebExtensions technology and is optimized for Firefox and Chrome based browsers.\nThis extension will automatically remove tracking elements from URLs to help protect your privacy when browse through the Internet, which is regularly updated by us and can be found here.\nDiscuss on Changelog News",
          "link": "https://github.com/ClearURLs/Addon/",
          "publishedOn": "2021-05-05T15:40:00.000Z",
          "wordCount": 1348,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An extension that automatically removes tracking elements from URLs"
        },
        {
          "description": "Wormhole lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.\nOur #1 goal is speed – you should be able to get a share link in less than 2 seconds with the absolute minimum number of clicks.\nThat’s why Wormhole supports instant file streaming. There’s no need to wait for your files to finish uploading before you can copy the link and send it to your recipient. The recipient can star…",
          "link": "https://wormhole.app/?ref=changelog",
          "publishedOn": "2021-05-05T14:47:00.000Z",
          "wordCount": 62,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wormhole – Simple, fast, private file sharing ✨"
        },
        {
          "description": "This comes from Mike Bostock (D3.js) who knows a thing or two about visualizing data in the browser.\nIt has a concise and (hopefully) memorable API to foster fluency — and plenty of examples to learn from and copy-paste.\n\nDiscuss on Changelog News",
          "link": "https://observablehq.com/@observablehq/plot",
          "publishedOn": "2021-05-05T13:26:00.000Z",
          "wordCount": 8,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Plot – a JS library to help you quickly visualize tabular data"
        },
        {
          "description": "Smart home data is complicated. There are all kinds of devices, and they are in many different combinations, geographies, configurations, etc. This complicated data situation is further exacerbated during a pandemic when time series data seems to be filled with anomalies. Evan Welbourne joins us to discuss how Amazon is synthesizing this disparate data into functionality for the next generation of smart homes. He discusses the challenges of working with smart home technology, and he describes how they devel…",
          "link": "https://changelog.com/practicalai/132",
          "publishedOn": "2021-05-04T15:30:00.000Z",
          "wordCount": 434,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 132: Generating \"hunches\" using smart home data 🏠"
        },
        {
          "description": "This repository offers a collection of services with great free tiers for developers on a budget. Because not everyone has 20$ per month to spend on app or database hosting for every single side-project.\nNowadays, a lot of services are offering really good free tier more than enough for testing small apps and even put them in production. They are just waiting to be used by you.\nI got a kick out of their FTDD acronym: Free Tier Driven Development\nDiscuss on Changelog News",
          "link": "https://github.com/255kb/stack-on-a-budget",
          "publishedOn": "2021-05-04T14:23:00.000Z",
          "wordCount": 1015,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A collection of services with great free tiers for developers on a budget"
        },
        {
          "description": "This article provides an in-depth view and comparison on modern regular expression engines. Hyperscan and RE2 come out on top and offer great scalability for large scale regex applications.\nDiscuss on Changelog News",
          "link": "https://geekmonkey.org/regular-expression-matching-at-scale-with-hyperscan/",
          "publishedOn": "2021-05-04T13:37:00.000Z",
          "wordCount": 1998,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Regular expression matching at scale with Hyperscan"
        },
        {
          "description": "In the wake of recent events at Basecamp (and DHH’s continued involvement with Ruby on Rails), many have questioned the governance process for Rails. This post from “The Rails Team” is meant to “clarify how the team is structured,” and how they operate.\n…no one on the Core team, or their employers, have sole control over the framework or community. There is no individual or subset of individuals who have power to enact policies unilaterally in the Rails community spaces that we operate (for example on issue…",
          "link": "https://weblog.rubyonrails.org/2021/5/2/rails-governance/",
          "publishedOn": "2021-05-03T16:19:08.000Z",
          "wordCount": 287,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Clarity on Rails' governance"
        },
        {
          "description": "Thanks to Muhammad Raza for sharing some of his favorite command line one liners to make his workflow productive and more efficient.\nAs a regular Linux user, I have been using commandline extensively to perform daily tasks such as creating files, navigating through directories, moving files and editing files using vim.\nDiscuss on Changelog News",
          "link": "https://muhammadraza.me/2021/Oneliners/",
          "publishedOn": "2021-05-03T16:01:29.000Z",
          "wordCount": 489,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "My favorite (command line) one liners"
        },
        {
          "description": "Any git repository may contain tons of information about commits, contributors, and files. Extracting this information is not always trivial, mostly because there are a gadzillion options to a gadzillion git commands – I don’t think there is a single person alive who knows them all. Probably not even Linus Torvalds himself :).\n\nDiscuss on Changelog News",
          "link": "https://github.com/arzzen/git-quick-stats",
          "publishedOn": "2021-05-03T15:31:00.000Z",
          "wordCount": 1708,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A simple and efficient way to access various stats in a Git repo"
        },
        {
          "description": "David Cassel, on The New Stack:\nWidely-respected security expert Dan Kaminsky passed away on April 23 from diabetic ketoacidosis at the age of 42. His considerable legacy went beyond expertise with a rare and memorable kindness.\nI met Dan very briefly at ShmooCon back in 2004. His kindness was memorable, for sure, but the thing I remember most was just how larger-than-life he was to me at the time. The guy contributed so much to the infosec community and yet remained humble and kind despite it all. It was s…",
          "link": "https://thenewstack.io/remembering-dan-kaminsky/",
          "publishedOn": "2021-05-03T14:42:00.000Z",
          "wordCount": 2474,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Remembering Dan Kaminsky"
        },
        {
          "description": "The feed is hosted on GitHub Pages (which means it’s public to all) and is static until it gets rebuilt. Building is done periodically via a GitHub Action; configuration is via a YAML file (It’d be cooler if you could import an OPML instead). Even if it’s not something you’d use, I think this project is interesting for two reasons:\nIt’s part of a “GitHub as Stack” meta-trend\nIt promotes RSS, which is one of the web’s great treasures\nDiscuss on Changelog News",
          "link": "https://github.com/osmoscraft/osmosfeed",
          "publishedOn": "2021-05-03T13:50:00.000Z",
          "wordCount": 1197,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A web-based RSS reader running entirely from your GitHub repo"
        },
        {
          "description": "KBall, Amal, and Feross are joined by special guest Jenn Creighton to talk about all things Apollo. How does Apollo fit into the GraphQL ecosystem, what’s the next big thing, and when would you choose to use it?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open your browser and dive in. Learn more and keep your teams’ sk…",
          "link": "https://changelog.com/jsparty/173",
          "publishedOn": "2021-04-30T16:00:00.000Z",
          "wordCount": 397,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 173: Blasting off with Apollo 🚀"
        },
        {
          "description": "A handy shell script to help you undo all the things (commits, pushes, pulls, you name it).\n\nDiscuss on Changelog News",
          "link": "https://github.com/Bhupesh-V/ugit",
          "publishedOn": "2021-04-30T14:16:00.000Z",
          "wordCount": 1093,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "ugit helps you undo your last git command with grace"
        },
        {
          "description": "SQLite is so hot right now.\nEven if you start out small and later need to upscale, as long as your web application can run on the same machine as the database, which it can in 99% of the time, you can just upgrade the hardware to a beefier machine and keep business as usual.\nThe only time you need to consider a client-server setup is…\nDiscuss on Changelog News",
          "link": "https://unixsheikh.com/articles/sqlite-the-only-database-you-will-ever-need-in-most-cases.html",
          "publishedOn": "2021-04-30T13:30:00.000Z",
          "wordCount": 1499,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "SQLite is the only database you will ever need in most cases"
        },
        {
          "description": "Startups are all about iterating quickly, building MVPs, and finding that elusive product market fit, so how does Go fit into that picture? Is Go a good choice for startups, or is it exclusively for the larger corporations? In this episode Jon is joined by four startup founders to learn about their experience building a startup with Go.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, d…",
          "link": "https://changelog.com/gotime/177",
          "publishedOn": "2021-04-29T15:45:00.000Z",
          "wordCount": 440,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 177: Building startups with Go"
        },
        {
          "description": "A solid primer on using openssl to encrypt all the things, which in this day and age is a skill that shoiuld be taught in secondary school right alongside how to bake a cake and change a tire.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/21/4/encryption-decryption-openssl",
          "publishedOn": "2021-04-29T15:43:00.000Z",
          "wordCount": 3214,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Encrypting and decrypting files with OpenSSL"
        },
        {
          "description": "This article starts with a concise description of the relationship and differences of these 3 commonly used industry terms. Then it digs into the history.\nDeep learning is a subset of machine learning, which in turn is a subset of artificial intelligence, but the origins of these names arose from an interesting history. In addition, there are fascinating technical characteristics that can differentiate deep learning from other types of machine learning…essential working knowledge for anyone with ML, DL, or …",
          "link": "https://www.exxactcorp.com/blog/Deep-Learning/difference-between-ai-machine-learning-and-deep-learning",
          "publishedOn": "2021-04-29T14:15:00.000Z",
          "wordCount": 6510,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Disentangling AI, machine learning, and deep learning"
        },
        {
          "description": "Most software companies have to make decisions on whether to build a custom software or buy it from a vendor. In the last year I read many good articles on the web that helped shape my thoughts on how to approach these discussions. This article lists of questions that I have started to use to understand and make these decisions.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2021/03/06/questions-to-ask-when-making-build-versus-buy-decision/",
          "publishedOn": "2021-04-29T13:26:00.000Z",
          "wordCount": 2146,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Questions to ask when making Build vs Buy decisions"
        },
        {
          "description": "April Fool’s may be over, but once we set up a system to react every time someone typed Command+C, we realized there was also an opportunity to learn about how people use our site. Here’s what we found.\nTLDR; one in four users copy something within five minutes of hitting a page. But this blog post (and accompanying podcast episode) goes deep into the details and lays it all out for you with pretty charts.\nDiscuss on Changelog News",
          "link": "https://stackoverflow.blog/2021/04/19/how-often-do-people-actually-copy-and-paste-from-stack-overflow-now-we-know/",
          "publishedOn": "2021-04-28T18:37:00.000Z",
          "wordCount": 6419,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How often do people actually copy/paste from Stack Overflow? Now we know"
        },
        {
          "description": "This is a solid move in protecting people’s privacy, especially for those completely unaware. Sounds like WordPress is considering the same  and a helpful Hacker News commenter typed up how to accomplish it on a bevy of popular web servers.\nRelated: I just deployed this to changelog.com as well. 😎\nDiscuss on Changelog News",
          "link": "https://github.blog/changelog/2021-04-27-github-pages-permissions-policy-interest-cohort-header-added-to-all-pages-sites/",
          "publishedOn": "2021-04-28T16:07:00.000Z",
          "wordCount": 174,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "GitHub blocks FLoC across all of GitHub Pages"
        },
        {
          "description": "Casey Newton interviewed a half-dozen Basecamp employees, as well as David Heinemeier Hansson (Basecamp co-founder) to write this account of recent events.\nHow a list of “funny” customer names triggered an internal reckoning. The controversy that embroiled enterprise software maker Basecamp this week began more than a decade ago, with a simple list of customers. Around 2009, Basecamp customer service representatives began keeping a list of names that they found funny. More than a decade later, current emplo…",
          "link": "https://www.platformer.news/p/-what-really-happened-at-basecamp",
          "publishedOn": "2021-04-28T13:26:00.000Z",
          "wordCount": 2704,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What really happened at Basecamp"
        },
        {
          "description": "Ro Gupta from CARMERA teaches Daniel and Chris all about road intelligence.  CARMERA maintains the maps that move the world, from HD maps for automated driving to consumer maps for human navigation.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open your browser and dive in. Learn more and keep your teams’ skills sharp at…",
          "link": "https://changelog.com/practicalai/131",
          "publishedOn": "2021-04-27T19:15:00.000Z",
          "wordCount": 8664,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 131: Mapping the world"
        },
        {
          "description": "WSLg provides an integrated experience for developers, scientists or enthusiasts that prefer or need to run Windows on their PC but also need the ability to run tools or applications which works best, or exclusively, in a Linux environment. While users can accomplish this today using a multiple system setup, with individual PC dedicated to Windows and Linux, virtual machine hosting either Windows or Linux, or an XServer running on Windows and projected into WSL, WSLg provides a more integrated, user friendl…",
          "link": "https://github.com/microsoft/wslg",
          "publishedOn": "2021-04-27T15:35:00.000Z",
          "wordCount": 4017,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "WSLg brings Linux GUI apps to Windows in a fully integrated fashion"
        },
        {
          "description": "“The tests are timing out again!”, someone yells. “Alright I’ll bump them”, you instinctively respond. Then you pause and feel uneasy. Is there another way?\nIn this blog post, I share my growing disconnect with code-coverage and unit-testing. I then detail the method I’ve been using for the greater part of 7 years and how it still allows me to preach at length that being correct is the single most important thing for a developer.\nDiscuss on Changelog News",
          "link": "https://www.iamjonas.me/2021/04/the-test-plan.html",
          "publishedOn": "2021-04-27T14:47:00.000Z",
          "wordCount": 2857,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The test-plan"
        },
        {
          "description": "What does “developer productivity” mean to you?\nAt face value, when we think of developer productivity we might think of effectiveness in time management, communication, and task completion. Although we are drawn to personal workflow or time management tools, and learning secrets to improving our productivity, ironically this quest for the holy grail can sometimes take us off course and be a detriment to our productivity. … As a developer of scientific software, and one who has transitioned to working remot…",
          "link": "https://cacm.acm.org/opinion/articles/252174-the-10-best-practices-for-remote-software-engineering/fulltext",
          "publishedOn": "2021-04-27T13:45:00.000Z",
          "wordCount": 4572,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "10 best practices for remote software engineering"
        },
        {
          "description": "This week we’re talking about NFTs — that’s right, non-fungible tokens and we’re joined by Mikeal Rogers, who’s leading all things InterPlanetary Linked Data at Protocol Labs. We go down the NFT rabbit hole on a very technical level and we come out the other side with clarity and a compelling use of NFTs.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourcegraph is universal code search for every developer and team…",
          "link": "https://changelog.com/podcast/438",
          "publishedOn": "2021-04-27T11:00:00.000Z",
          "wordCount": 16131,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 438: Let's mint some NFTs"
        },
        {
          "description": "Marko Denic shared 10 or so very interesting CSS tips (and tricks) in this post with Codepen examples to play with. There were a few I hadn’t heard of, which is awesome.\nDiscuss on Changelog News",
          "link": "https://markodenic.com/css-tips/",
          "publishedOn": "2021-04-26T20:03:00.000Z",
          "wordCount": 746,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "CSS tips and tricks (you won’t see in most tutorials)"
        },
        {
          "description": "High-profile entrepreneurs like Elon Musk, venture capitalists like Peter Thiel and Keith Rabois, and big companies like Oracle and HP Enterprise are all leaving California. During COVID-19, Zoom-enabled tech workers have discovered the benefits of remote work from cheaper, less congested communities elsewhere. Is this the end of Silicon Valley as we know it? Perhaps. But other challenges to Silicon Valley’s preeminence are more fundamental than the tech diaspora.\nUnderstanding four trends that may shape th…",
          "link": "https://www.oreilly.com/radar/the-end-of-silicon-valley-as-we-know-it/?sfmc_id=194547222",
          "publishedOn": "2021-04-26T19:10:45.000Z",
          "wordCount": 6345,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The end of Silicon Valley as we know it?"
        },
        {
          "description": "Brett Cannon, who is a Python core developer (and a tall, snarky Canadian):\nI felt it was time to do another blog post to directly address the issue of entitlement by some open source users which is hurting open source, both for themselves and for others. I want to get the point across that open source maintainers owe you quite literally nothing when it comes to their open source code, and treating them poorly is unethical. And to me, this is the underlying social contract of open source. (emphasis added)\nY…",
          "link": "https://snarky.ca/the-social-contract-of-open-source/",
          "publishedOn": "2021-04-26T16:16:00.000Z",
          "wordCount": 2066,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The social contract of open source"
        },
        {
          "description": "Mongita is a lightweight embedded document database that implements a commonly-used subset of the MongoDB/PyMongo interface. Mongita differs from MongoDB in that instead of being a server, Mongita is a self-contained Python library.  Mongita can be configured to store its documents either on disk or in memory.\nI can’t speak to the implementation, but I love the idea behind this project. Already know and love Mongo? Here’s a way to use it in an embedded fashion with all of the advantages that come with such …",
          "link": "https://github.com/scottrogowski/mongita",
          "publishedOn": "2021-04-26T15:26:00.000Z",
          "wordCount": 1396,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mongita is to MongoDB as SQLite is to SQL"
        },
        {
          "description": "This is an excellent article about understanding technical debt:\nIt is a fact that, over time, all development teams get slowed down by the existing codebase. But why? Is it because maintenance is inevitable? Or because we could do something better in the first place? Or both?\nLuca argues that technical debt is introduced as a by-product of disagreement, which itself is a by-product of two phenomena: wrong design, and rapid evolution. Thoughtful stuff. Well worth your time.\nDiscuss on Changelog News",
          "link": "https://refactoring.fm/p/the-true-meaning-of-technical-debt",
          "publishedOn": "2021-04-26T14:24:00.000Z",
          "wordCount": 1484,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The true meaning of technical debt 💸"
        },
        {
          "description": "Oli Larkin:\nThis is a curated list of my favourite music DSP and audio programming resources. It was originally meant to be an official “Awesome list”, but apparently you are not meant to write in the first person, so it is now a “more awesome” list.\nI’m still giving this the awesome topic, despite his first person point of view. Oli is a long-time audio programmer, so he’s well positioned to curate a list like this one.\nDiscuss on Changelog News",
          "link": "https://github.com/olilarkin/awesome-musicdsp",
          "publishedOn": "2021-04-26T13:15:00.000Z",
          "wordCount": 3424,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A curated list of music DSP and audio programming resources"
        },
        {
          "description": "The gang talks about thier favorite software and hardware as developers. Brian Douglas joins to share his unique and open GitHub Actions flow.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open your browser and dive in. Learn more and keep your teams’ skills sharp at oreilly.com/changelog\n\n    \nSquare – Develop on the pla…",
          "link": "https://changelog.com/jsparty/172",
          "publishedOn": "2021-04-23T15:20:00.000Z",
          "wordCount": 10500,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 172: Sweet setups for easier dev"
        },
        {
          "description": "In my 15+ years of web development, there are very few things I can say are unequivocally a good idea. It almost always does depend.\nStoring timestamps instead of booleans, however, is one of those things I can go out on a limb and say it doesn’t really depend all that much. You might as well timestamp it. There are plenty of times in my career when I’ve stored a boolean and later wished I’d had a timestamp. There are zero times when I’ve stored a timestamp and regretted that decision.\nWhy is that? Because …",
          "link": "https://changelog.com/posts/you-might-as-well-timestamp-it",
          "publishedOn": "2021-04-23T14:17:23.000Z",
          "wordCount": 1416,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "You might as well timestamp it"
        },
        {
          "description": "Thomas Ptacek writing on Fly’s blog:\nEven though most of our users deliver software to us as Docker containers, we don’t use Docker to run them. Docker is great, but we’re high-density multitenant, and despite strides, Docker’s isolation isn’t strong enough for that. So, instead, we transmogrify container images into Firecracker micro-VMs.\nThis is a fun, technical read about how they’re converting Docker’s OCI images (turns out they’re just a stack of tarballs) into Firecracker VMs. It’s much simpler to acc…",
          "link": "https://fly.io/blog/docker-without-docker/",
          "publishedOn": "2021-04-23T13:28:00.000Z",
          "wordCount": 2331,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Docker without Docker"
        },
        {
          "description": "The internet wouldn’t exist as we know it if it weren’t for TCP and UDP, yet many developers don’t quite understand the technology powering the web. In this episode we talk with Adam Woodbeck, author of Network Programming with Go, to learn about TCP and UDP; what they are, how they work, and how one can experiment with tools like Wireshark and Go to learn more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – …",
          "link": "https://changelog.com/gotime/176",
          "publishedOn": "2021-04-22T16:15:00.000Z",
          "wordCount": 12013,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 176: TCP & UDP"
        },
        {
          "description": "The accompanying video (22:36) explains why and walks you through the development process as well.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jdah/tetris-os",
          "publishedOn": "2021-04-22T14:29:00.000Z",
          "wordCount": 864,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An operating system that only plays Tetris"
        },
        {
          "description": "You can think of Julia Evans’ new dnspeep tool as similar to tcpdump but specifically for watching your machine’s DNS queries.\nOne thing I like about this tool is that it gives me a sense for what programs on my computer are using the Internet! For example, I found out that something on my computer is making requests to ping.manjaro.org from time to time for some reason, probably to check I’m connected to the internet.\nA friend of mine actually discovered using this tool that he had some corporate monitorin…",
          "link": "https://jvns.ca/blog/2021/03/31/dnspeep-tool/",
          "publishedOn": "2021-04-22T13:42:00.000Z",
          "wordCount": 1346,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tool to spy on your DNS queries"
        },
        {
          "description": "The music you hear is generated in your browser by a randomised algorithm, below you can see the notes and parameters that are currently in use. You can also interact with various parameters and buttons manually. The green autopilot switches change how automatic playback is. Leave them on for a lean-back experience. Buttons labelled ⟳ will generate new patterns. Source Code is on GitHub.\nBangin’\n\nDiscuss on Changelog News",
          "link": "https://github.com/vitling/acid-banger",
          "publishedOn": "2021-04-21T16:19:00.000Z",
          "wordCount": 627,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An algorithmic human-computer techno jam"
        },
        {
          "description": "John Resig and Loren Sands-Ramshaw first announced the beta of their GraphQL book (discussed here) nearly three years ago. After years of writing and re-writing, it’s now ready to be released. Loren had this to say in the linked announcement post:\nThis project has taken much longer than we expected, and the length of the book has wound up being much longer than we expected. We’d like to give a huge shout-out to our 740 beta readers who stuck with us through four major versions of the in-progress text.\nThe G…",
          "link": "https://blog.graphql.guide/releasing-the-graphql-guide-d9be04747148?source=friends_link&sk=425e4952c1fbf88f1fcb538d726344a3",
          "publishedOn": "2021-04-21T15:32:00.000Z",
          "wordCount": 1160,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Releasing The GraphQL Guide"
        },
        {
          "description": "Lily Cook:\nIn this article, I will talk about trending tech skills in 2021 that may help trainees or junior developers secure their desired position at FAANG. I will also uncover some tips for successful interviewing at the Big Five tech giants and reveal whether a cover letter can assist you in your FAANG job search. Let’s dive in.\nDiscuss on Changelog News",
          "link": "https://cvcompiler.com/blog/getting-into-faang-as-an-aspiring-developer/",
          "publishedOn": "2021-04-21T14:43:00.000Z",
          "wordCount": 2390,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Getting into FAANG as a junior developer"
        },
        {
          "description": "Learn the history and evolution of same-origin policy and CORS, understand CORS and the different types of cross-origin access in depth, and learn (some) best practices.\nDiscuss on Changelog News",
          "link": "https://ieftimov.com/post/deep-dive-cors-history-how-it-works-best-practices/",
          "publishedOn": "2021-04-21T13:43:00.000Z",
          "wordCount": 4177,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A deep dive on CORS"
        },
        {
          "description": "Raj Dutt, CEO and co-founder of Grafana Labs:\nOur company has always tried to balance the “value creation” of open source and community with the “value capture” of our monetization strategy. The choice of license is a key pillar of this strategy, and is something that we’ve deliberated on extensively since the company began.\nOver the last few years, we’ve watched closely as almost every at-scale open source company that we admire (such as Elastic, Redis Labs, MongoDB, Timescale, Cockroach Labs, and many oth…",
          "link": "https://grafana.com/blog/2021/04/20/grafana-loki-tempo-relicensing-to-agplv3/",
          "publishedOn": "2021-04-20T19:26:00.000Z",
          "wordCount": 1545,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Grafana, Loki, and Tempo will be relicensed to AGPLv3"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": [
        {
          "description": "We’re giving away free hats with the purchase of a comma two, and that’s great! But what if you already bought a comma two and still want a free hat? We’ve got you covered, we’re organizing a little treasure hunt so everybody has a chance at a free hat.\nSomewhere in southern California hides a weatherproof box, this box contains two free hats and one Benjamin Franklin. The first person to find the box, gets the prize. Below is a picture and a table, those will serve as your two clues.\nThe hats and $100 have…",
          "link": "https://blog.comma.ai/hidden-treasure/",
          "publishedOn": "2021-05-06T18:00:00.000Z",
          "wordCount": 435,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "Hidden Treasure"
        },
        {
          "description": "We’re giving away free hats with the purchase of a comma two, and that’s great! But what if you already bought a comma two and still want a free hat? We’ve got you covered, we’re organizing a little treasure hunt so everybody has a chance at a free hat.\nSomewhere in southern California hides a weatherproof box, this box contains two free hats and one Benjamin Franklin. The first person to find the box, gets the prize. Below is a picture and a table, those will serve as your two clues.\nOnce we’ve heard the p…",
          "link": "comma.ai/hidden-treasure/",
          "publishedOn": "2021-05-06T18:00:00.000Z",
          "wordCount": null,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "Hidden Treasure"
        }
      ]
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "It’s great to be back hosting our I/O Developers Conference this year. Pulling up to our Mountain View campus this morning, I felt a sense of normalcy for the first time in a long while. Of course, it’s not the same without our developer community here in person. COVID-19 has deeply affected our entire global community over the past year and continues to take a toll. Places such as Brazil, and my home country of India, are now going through their most difficult moments of the pandemic yet. Our thoughts are …",
          "link": "https://blog.google/technology/developers/io21-helpful-google/",
          "publishedOn": "2021-05-18T18:55:00.000Z",
          "wordCount": 2629,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Google I/O 2021: Being helpful in moments that matter"
        },
        {
          "description": "Artificial intelligence (AI) has the potential to help clinicians care for patients and treat disease — from improving the screening process for breast cancer to helping detect tuberculosis more efficiently. When we combine these advances in AI with other technologies, like smartphone cameras, we can unlock new ways for people to stay better informed about their health, too.  \n\nToday at  I/O, we shared a preview of an AI-powered dermatology assist tool that helps you understand what’s going on with issues r…",
          "link": "https://blog.google/technology/health/ai-dermatology-preview-io-2021/",
          "publishedOn": "2021-05-18T18:45:00.000Z",
          "wordCount": 1380,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Using AI to help find answers to common skin conditions"
        },
        {
          "description": "Today we’re sharing new AI research that aims to improve screening for one of the top causes of death worldwide: tuberculosis (TB). TB infects 10 million people per year and disproportionately affects people in low-to-middle-income countries. Diagnosing TB early is difficult because its symptoms can mimic those of common respiratory diseases.\nCost-effective screening, specifically chest X-rays, has been identified as one way to improve the screening process. However, experts aren’t always available to inter…",
          "link": "https://blog.google/technology/health/tuberculosis-screening-ai-io-2021/",
          "publishedOn": "2021-05-18T18:45:00.000Z",
          "wordCount": 1261,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Tackling tuberculosis screening with AI"
        },
        {
          "description": "AI is a critical part of what makes Google Maps so helpful. With it, we’re able to map roads over 10 times faster than we could five years ago, and we can bring maps filled with useful information to virtually every corner of the world. Today, we’re giving you a behind-the-scenes look at how AI makes two of the features we announced at I/O possible.\n\n\nTeaching Maps to identify and forecast when people are hitting the brakes\nLet’s start with our routing update that helps you avoid situations that cause you t…",
          "link": "https://blog.google/products/maps/google-maps-101-ai-power-new-features-io-2021/",
          "publishedOn": "2021-05-18T18:00:00.000Z",
          "wordCount": 1773,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "A smoother ride and a more detailed Map thanks to AI"
        },
        {
          "description": "Within the decade, Google aims to build a useful, error-corrected quantum computer. This will accelerate solutions for some of the world’s most pressing problems, like sustainable energy and reduced emissions to feed the world’s growing population, and unlocking new scientific discoveries, like more helpful AI.\n\n\nTo begin our journey, today we’re unveiling our new Quantum AI campus in Santa Barbara, California. This campus includes our first quantum data center, our quantum hardware research laboratories, a…",
          "link": "https://blog.google/technology/ai/unveiling-our-new-quantum-ai-campus/",
          "publishedOn": "2021-05-18T17:30:00.000Z",
          "wordCount": 1459,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Unveiling our new Quantum AI campus"
        },
        {
          "description": "We've always had a soft spot for language at Google. Early on, we set out to translate the web. More recently, we’ve invented machine learning techniques that help us better grasp the intent of Search queries. Over time, our advances in these and other areas have made it easier and easier to organize and access the heaps of information conveyed by the written and spoken word.\nBut there’s always room for improvement. Language is remarkably nuanced and adaptable. It can be literal or figurative, flowery or pl…",
          "link": "https://blog.google/technology/ai/lamda/",
          "publishedOn": "2021-05-18T17:22:00.000Z",
          "wordCount": 1447,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "LaMDA: our breakthrough conversation technology"
        },
        {
          "description": "“Our dictionary doesn’t have a word for shoe” my Uncle Allan Lena said, so when kids ask him what to call it in Yugambeh, he’ll say “jinung gulli” - a foot thing.\n\nUncle Allan Lena is a frontline worker in the battle to reteach the Yugambeh Aboriginal language to the children of southeast Queensland, Australia, where it hasn’t been spoken fluently for decades and thus is – like many other languages around the world – in danger of disappearing.  \n\nFor the younger generation, even general language can be a ch…",
          "link": "https://blog.google/outreach-initiatives/arts-culture/woolaroo-new-tool-exploring-indigenous-languages/",
          "publishedOn": "2021-05-05T20:00:00.000Z",
          "wordCount": 1117,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Woolaroo: a new tool for exploring indigenous languages"
        },
        {
          "description": "Throughout history, from photography to video to hypertext, artists have pushed the expressive limits of new technologies, and artificial intelligence is no exception. At I/O 2019, Google Research and Google Arts &amp; Culture launched the Artists + Machine Intelligence Grants, providing a range of support and technical mentorship to six artists from around the globe following an open call for proposals. The inaugural grant program sought to expand the field of artists working with Machine Learning (ML) and…",
          "link": "https://blog.google/outreach-initiatives/arts-culture/when-artists-and-machine-intelligence-come-together/",
          "publishedOn": "2021-04-29T00:01:00.000Z",
          "wordCount": 1309,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "When artists and machine intelligence come together"
        },
        {
          "description": "A couple of years ago, Google AI for Social Good’s Bioacoustics team created a ML model that helps the scientific community detect the presence of humpback whale sounds using acoustic recordings. This tool, developed in partnership with the National Oceanic and Atmospheric Association, helps biologists study whale behaviors, patterns, population and potential human interactions. \nWe realized other researchers could use this model for their work, too — it could help them better understand the oceans and prot…",
          "link": "https://blog.google/technology/ai/whale-tale-about-responsibility-and-ai/",
          "publishedOn": "2021-04-22T15:00:00.000Z",
          "wordCount": 1026,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "A whale of a tale about responsibility and AI"
        },
        {
          "description": "The book that led to my visit to Google.\n\nWhen I first visited Google back in 2002, I was a computer science professor at UC Berkeley. My colleague John Hennessey and I were updating our textbook on computer architecture, and Larry Page — who rode a hot-rodded electric scooter at the time — agreed to show me how his then three-year-old company designed its computing for Search. I remember the setup was lean yet powerful: just 6,000 low-cost PC servers and 12,000 PC disks answering 70 million queries around …",
          "link": "https://blog.google/technology/ai/minimizing-carbon-footprint/",
          "publishedOn": "2021-04-22T03:00:00.000Z",
          "wordCount": 1616,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "How we’re minimizing AI’s carbon footprint"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "One day in March 1998 I released a little file transfer tool I called curl. The first ever curl release. That was good. 10 By the end of July the same year, I released the 10th curl release. I&#8217;ve always believed in release early release often as a service to users and developers alike. 20 &#8230; Continue reading 200 OK &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/17/200-ok/",
          "publishedOn": "2021-05-17T08:43:00.000Z",
          "wordCount": 973,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "200 OK"
        },
        {
          "description": "(This is a repost of a stackoverflow answer I once wrote on this topic. Slightly edited. Copied here to make sure I own and store my own content properly.) curl knows the HTTP method You normally use curl without explicitly saying which request method to use. If you just pass in a HTTP URL like &#8230; Continue reading curl -G vs curl -X GET &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/14/curl-g-vs-curl-x-get/",
          "publishedOn": "2021-05-14T21:39:04.000Z",
          "wordCount": 963,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl -G vs curl -X GET"
        },
        {
          "description": "I&#8217;ve worked hard on making the presentation I ended up calling libcurl under the hood. A part of that presentation is spent on explaining the main libcurl transfer state machine and here I&#8217;ll try to document some of what, in a written form. Understanding the main transfer state machine in libcurl could be valuable and &#8230; Continue reading The libcurl transfer state machine &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/10/the-libcurl-transfer-state-machine/",
          "publishedOn": "2021-05-10T07:13:47.000Z",
          "wordCount": 1417,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "The libcurl transfer state machine"
        },
        {
          "description": "curl up 2021 happened today. We had five presentations done, all prerecorded and made available before the event. At the Sunday afternoon we gathered to discuss the presentations and everything around those topics. The presentations The state of curl 2021 &#8211; Daniel Stenberg curl security 2021 &#8211; Daniel Stenberg libcurl under the hood &#8211; Daniel &#8230; Continue reading curl up 2021 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/09/curl-up-2021/",
          "publishedOn": "2021-05-09T14:18:30.000Z",
          "wordCount": 799,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl up 2021"
        },
        {
          "description": "&#8220;Memes&#8221; or other fun images involving curl. Please send or direct me to other ones you think belong in this collection! Kept here solely to boost my ego. All modern digital infrastructure This is the famous xkcd strip number 2347, modified to say Sweden and 1997 by @tsjost. I&#8217;ve seen this picture taking some &#8220;extra &#8230; Continue reading curl pictures &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/07/curl-pictures/",
          "publishedOn": "2021-05-07T08:11:28.000Z",
          "wordCount": 849,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl pictures"
        },
        {
          "description": "This image originally comes from cowbirdsinlove.com but sadly it seems the page that once showed it is no longer there. I saved it from that site already back in 2015, but I cannot recall the exact URL it used. The image is still available at https://cowbirdsinlove.com/comics/base10[1].png. Since I consider this picture such an iconic classic &#8230; Continue reading Every base is base 10 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/04/every-base-is-base-10/",
          "publishedOn": "2021-05-04T15:40:27.000Z",
          "wordCount": 693,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Every base is base 10"
        },
        {
          "description": "In the curl project we make great efforts to store a lot of meta data about each and every vulnerability that we have fixed over the years &#8211; and curl is over 23 years old. This data set includes CVE id, first vulnerable version, last vulnerable version, name, announce date, report to the project date, &#8230; Continue reading fixed vulnerabilities were once created &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/04/30/fixed-vulnerabilities-were-once-created/",
          "publishedOn": "2021-04-30T07:51:23.000Z",
          "wordCount": 1611,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "fixed vulnerabilities were once created"
        },
        {
          "description": "tldr: starting now, you need to select which TLS to use when you run curl&#8217;s configure script. How it started In June 1998, three months after the first release of curl, we added support for HTTPS. We decided that we would use an external library for this purpose &#8211; for providing SSL support &#8211; and &#8230; Continue reading Please select your TLS &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/04/23/please-select-your-tls/",
          "publishedOn": "2021-04-23T06:40:56.000Z",
          "wordCount": 1248,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Please select your TLS"
        },
        {
          "description": "You know that question you can get asked casually by a person you&#8217;ve never met before or even by someone you&#8217;ve known for a long time but haven&#8217;t really talked to about this before. Perhaps at a social event. Perhaps at a family dinner. &#8211; So what do you do? The implication is of course &#8230; Continue reading &#8220;So what exactly is curl?&#8221; &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/04/22/so-what-exactly-is-curl/",
          "publishedOn": "2021-04-22T14:09:09.000Z",
          "wordCount": 1642,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "“So what exactly is curl?”"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform.html",
          "publishedOn": "2021-05-10T12:26:01.303Z",
          "wordCount": 4869,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "Learn how we design a system that stores and retrieves ad impression metadata accurately and consistently in Twitter's ads ecosystem.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/storing-and-retrieving-millions-of-ad-impressions-per-second.html",
          "publishedOn": "2021-05-10T12:26:01.245Z",
          "wordCount": 2583,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Storing and retrieving millions of ad impressions per second"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks.html",
          "publishedOn": "2021-05-10T12:26:01.222Z",
          "wordCount": 3599,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data.html",
          "publishedOn": "2021-05-10T12:26:01.190Z",
          "wordCount": 1788,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research.html",
          "publishedOn": "2021-05-10T12:26:01.174Z",
          "wordCount": 1489,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache.html",
          "publishedOn": "2021-05-10T12:26:01.152Z",
          "wordCount": 2274,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks.html",
          "publishedOn": "2021-05-10T12:26:01.111Z",
          "wordCount": 1636,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan.html",
          "publishedOn": "2021-05-10T12:26:01.003Z",
          "wordCount": 2254,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning.html",
          "publishedOn": "2021-05-10T12:26:00.956Z",
          "wordCount": 3228,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Introducing Twitter Text Editor, a standalone, flexible API that provides a full-featured rich text editor for iOS applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/introducing-twitter-text-editor.html",
          "publishedOn": "2021-05-10T12:26:00.893Z",
          "wordCount": 826,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter Text Editor"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_pr131atimb8l-1>li:before{content:\"\\0025cb  \"}.lst-kix_pr131atimb8l-0>li:before{content:\"\\0025cf  \"}.lst-kix_pr131atimb8l-3>li:before{content:\"\\0025cf  \"}.lst-kix_pr131atimb8l-2>li:before{content:\"\\0025a0  \"}ul.lst-kix_785jj4szr34a-4{list-style-type:none}ul.lst-kix_hg7n0a8dlgvf-6{list-style-type:none}.lst-kix_pr131atimb8l-7>li:before{content:\"\\0025cb  \"}ul.lst-kix_785jj4szr34a-5{list-style-type:none}ul.lst-kix_h…",
          "link": "https://googleprojectzero.blogspot.com/2021/04/designing-sockfuzzer-network-syscall.html",
          "publishedOn": "2021-04-22T18:05:00.004Z",
          "wordCount": 10378,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "Designing sockfuzzer, a network syscall fuzzer for XNU"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Hacking veteran @ralamosm has been in the business of bug hunting for 20+ years. In this week’s Hacker Spotlight, he dives into his hacking journey and provides inspiration on living up to your hacking potential.",
          "link": "https://www.hackerone.com/blog/hacker-spotlight-ama-ralamosm",
          "publishedOn": "2021-05-14T15:00:00.000Z",
          "wordCount": 998,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hacker Spotlight AMA: ralamosm"
        },
        {
          "description": "I was still digesting last week’s fascinating roundtable with Nicole Perlroth, cybersecurity journalist and author of This Is How They Tell Me The World Ends, when the news broke that the US’s biggest fuel pipeline had been taken out by a ransomware attack. Nicole’s closing prediction that cyber criminals, emboldened by their success in targeting hospitals with ransomware, would move onto other critical infrastructure, was coming true before my eyes.",
          "link": "https://www.hackerone.com/blog/so-how-they-tell-me-world-ends",
          "publishedOn": "2021-05-12T22:28:12.000Z",
          "wordCount": 1094,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "So This Is How They Tell Me The World Ends?"
        },
        {
          "description": "On World Password Day, I’m not going to talk about passwords. At the end of last year, HackerOne ran an exclusive campaign with a select group of hackers in which we challenged them to look for information exposures for 11 customers. The data found by the hackers included everything from passwords and authentication tokens to sensitive documents. No matter how secure your passwords are, your data is out there in different clouds and across various third-party vendors — it's only a matter of time before a le…",
          "link": "https://www.hackerone.com/blog/what-do-when-you-dont-know-youve-been-compromised",
          "publishedOn": "2021-05-07T00:00:00.000Z",
          "wordCount": 963,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What To Do When You Don’t Know You’ve Been Compromised"
        },
        {
          "description": "During HackerOne's recent series of webinars, we caught up with Matt Southworth, CISO of Priceline, and Matt Adams, Global Security Architect at Costa Coffee, to learn their 5 secrets to building a highly effective vulnerability management program.",
          "link": "https://www.hackerone.com/blog/5-secrets-mature-vulnerability-management-program",
          "publishedOn": "2021-05-05T00:00:00.000Z",
          "wordCount": 1192,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "The 5 Secrets Of A Mature Vulnerability Management Program"
        },
        {
          "description": "One year after launching their private bug bounty program on HackerOne, we sat down with financial services provider Saxo Bank’s CISO, Mads Syska Hasling, to get his insights and learnings from 12 months with a bug bounty program. Read on to see how Saxo Bank thinks about digital security as a non-negotiable for their customers and partners, how bug bounty fits into the broader security program, and advice to other CISOs and stakeholders on leveraging hacker-powered security.",
          "link": "https://www.hackerone.com/blog/saxo-bank-celebrates-one-year-bug-bounties-qa-ciso-mads-syska-hasling-1",
          "publishedOn": "2021-05-03T15:00:00.000Z",
          "wordCount": 1042,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Saxo Bank Celebrates One Year of Bug Bounties: Q&A with CISO Mads Syska Hasling"
        },
        {
          "description": "Hacker @Wolf101 shares his predictions on the future of bug bounties and tips on getting started.",
          "link": "https://www.hackerone.com/blog/hacker-spotlight-ama-wolf101",
          "publishedOn": "2021-04-30T19:00:00.000Z",
          "wordCount": 1187,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hacker Spotlight AMA: Wolf101"
        },
        {
          "description": "HackerOne sees vulnerability management as a process combining software tools and security analyst actions to reduce risk. In many cases, successful Vulnerability Management requires a joint effort between security operations, who find vulnerabilities, and IT operations responsible for fixing, or patching, vulnerabilities.",
          "link": "https://www.hackerone.com/blog/how-hackerone-helps-vulnerability-management-process-2",
          "publishedOn": "2021-04-29T16:00:00.000Z",
          "wordCount": 1714,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How HackerOne Helps the Vulnerability Management Process"
        },
        {
          "description": "A few weeks ago, HackerOne and PortSwigger teamed up to shine a light on the innovative ways that customers and security analysts are scaling risk assessments. Read on for key learnings.",
          "link": "https://www.hackerone.com/blog/security-engineer-and-hacker-share-their-experiences-security-assessments",
          "publishedOn": "2021-04-27T16:00:00.000Z",
          "wordCount": 1102,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "A Security Engineer and Hacker Share Their Experiences with Security Assessments"
        },
        {
          "description": "Chilean hacker @debsec shares his secrets to program selection and the best way to choose your scope in this week's Hacker Spotlights.",
          "link": "https://www.hackerone.com/blog/hacker-spotlight-ama-debsec",
          "publishedOn": "2021-04-23T16:00:00.000Z",
          "wordCount": 1054,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hacker Spotlight AMA: debsec"
        },
        {
          "description": "HackerOne has rolled out new product features to secure cloud workloads, investigate and respond to vulnerability trends, and answer auditors’ questions all in one place. Read on for details!",
          "link": "https://www.hackerone.com/blog/hackerone-product-enhancements-help-detect-remediate-and-analyze-cloud-misconfigurations",
          "publishedOn": "2021-04-22T13:00:00.000Z",
          "wordCount": 1003,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "HackerOne Product Enhancements Help Detect, Remediate, and Analyze Cloud Misconfigurations"
        },
        {
          "description": "HackerOne sold our founding vulnerability as an NFT and donated the proceeds — 3.3 ETH / $7,086.19 — to Hack the Hood. Read on to learn why!",
          "link": "https://www.hackerone.com/blog/why-we-sold-our-founding-vulnerability-nft-0",
          "publishedOn": "2021-04-20T16:30:00.000Z",
          "wordCount": 1541,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Why we sold our founding vulnerability as an NFT"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}