{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2023/02/the-us-government-says-companies-should.html",
          "author": null,
          "description": "Posted by Kent Walker, President, Global Affairs & Chief Legal Officer, Google & Alphabet and Royal Hansen, Vice President of Engineering for Privacy, Safety, and Security \nShould companies be responsible for cyberattacks? The U.S. government thinks so – and frankly, we agree. \nJen Easterly and Eric Goldstein of the Cybersecurity and Infrastructure Security Agency at the Department of Homeland Security planted a flag in the sand:  \n     “The incentives for developing and selling technology have eclipsed customer safety in importance. […] Americans…have unwittingly come to accept that it is normal for new software and devices to be indefensible by design. They accept products that are released to market with dozens, hundreds, or even thousands of defects. They accept that the cybersecurity …",
          "link": "http://security.googleblog.com/2023/02/the-us-government-says-companies-should.html",
          "publishedOn": "2023-02-13T17:01:00.000Z",
          "wordCount": 1543,
          "title": "The US Government says companies should take more responsibility for cyberattacks. We agree."
        },
        {
          "id": "http://security.googleblog.com/2023/02/taking-next-step-oss-fuzz-in-2023.html",
          "author": null,
          "description": "Posted by Oliver Chang, OSS-Fuzz team \nSince launching in 2016, Google's free OSS-Fuzz code testing service has helped get over 8800 vulnerabilities and 28,000 bugs fixed across 850 projects. Today, we’re happy to announce an expansion of our OSS-Fuzz Rewards Program, plus new features in OSS-Fuzz and our involvement in supporting academic fuzzing research. \nRefreshed OSS-Fuzz rewards \n  \nThe OSS-Fuzz project's purpose is to support the open source community in adopting fuzz testing, or fuzzing — an automated code testing technique for uncovering bugs in software. In addition to the OSS-Fuzz service, which provides a free platform for continuous fuzzing to critical open source projects, we established an OSS-Fuzz Reward Program in 2017 as part of our wider Patch Rewards Program. \nWe’ve ope…",
          "link": "http://security.googleblog.com/2023/02/taking-next-step-oss-fuzz-in-2023.html",
          "publishedOn": "2023-02-01T18:00:00.000Z",
          "wordCount": 1082,
          "title": "Taking the next step: OSS-Fuzz in 2023"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/1/1978",
          "author": null,
          "description": "This week we’re talking to Rachel Potvin, former VP of Engineering at GitHub about what it takes to scale engineering. Rachel says it’s a game-changer when engineering scales beyond 100 people. So we asked to her to share everything she has learned in her career of leading and scaling engineering.\nDiscuss on Changelog News\nChangelog++ members get a bonus 7 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code CHANGELOG and get the team plan free for three months.\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you ca…",
          "link": "https://changelog.com/podcast/527",
          "publishedOn": "2023-02-17T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 527: What it takes to scale engineering",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/527/the-changelog-527.mp3",
            "length": "83835706",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/2004",
          "author": null,
          "description": "Amal sits down for a one-on-one with Alex Russell, Microsoft Partner on the Edge team, and former Web Standards Tech Lead for Chrome, whose recent post, The Market for Lemons, stirred up a BIG conversation in the web development community.\nHave we really lost a decade in potential progress? What happened? Where do we go from here?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code PARTYTIME and get the team plan free for three months.\n\nLolo Code – If you’re familiar with building severless apps, think …",
          "link": "https://changelog.com/jsparty/263",
          "publishedOn": "2023-02-17T21:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 263: Web development's lost decade",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/263/js-party-263.mp3",
            "length": "75720860",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJae",
          "author": "Jerod Santo",
          "description": "Sloth is a native Mac app that shows all open files, directories, sockets, pipes, and devices in use by all running processes on your system. This makes it easy to inspect which apps are using which files, etc.\nlsof is powerful, but I use it infrequently and its CLI is inscrutable. That’s a perfect setup for a GUI like this.\n\nDiscuss on Changelog News",
          "link": "https://github.com/sveinbjornt/Sloth",
          "publishedOn": "2023-02-17T15:59:00.000Z",
          "wordCount": null,
          "title": "A nice Mac GUI for `lsof`",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoQz",
          "author": "Jerod Santo",
          "description": "Nikola Đuza lays out a way you can customize your README to stand out from the crowd:\nGitHub supports adding HTML in Markdown, but it is pretty aggressive when removing HTML that can be potentially dangerous to users. Things like scripts, iframes, and similar will get removed or “silenced” to avoid malicious content from being served to users.\nLuckily, there’s one way to sneak in some HTML (or a web page) inside the README. You can do it via SVG and foreignObject SVG element.\n\nDiscuss on Changelog News",
          "link": "https://pragmaticpineapple.com/adding-custom-html-and-css-to-github-readme/",
          "publishedOn": "2023-02-17T15:13:00.000Z",
          "wordCount": null,
          "title": "Sneaking custom HTML & CSS in to your GitHub README",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1995",
          "author": null,
          "description": "Our “what’s new in Go” correspondent Carl Johnson joins Mat & Johnny to discuss… what’s new in Go 1.20, of course! What’d you expect, an episode about Rust?! That’s preposterous…\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in thei…",
          "link": "https://changelog.com/gotime/267",
          "publishedOn": "2023-02-16T23:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 267: What's new in Go 1.20",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/267/go-time-267.mp3",
            "length": "70084181",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMNN",
          "author": "Jerod Santo",
          "description": "Homebrew project lead, Mike McQuaid:\nToday, I’d like to announce Homebrew 4.0.0. The most significant change since 3.6.0 enables significantly faster Homebrew-maintained tap updates by migrating from Git-cloned taps to JSON downloads.\nDiscuss on Changelog News",
          "link": "https://brew.sh/2023/02/16/homebrew-4.0.0/",
          "publishedOn": "2023-02-16T19:56:00.000Z",
          "wordCount": null,
          "title": "Homebrew 4.0.0 is ready for consumption 🍻",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7d5",
          "author": "Jerod Santo",
          "description": "Anybody following our news and/or podcast feeds for a bit already know of SQLite and have likely used it and continue to use it, but for those just joining us, here’s yet another dev with effusive praise for the little database engine that could:\nSQLite is one of those projects that I wish I had known about long before I did. I had heard about it, but for many years I never thought about taking a serious look at it because I was under the false impression that is was a tiny database only useful for personal address books and small embedded devices.\nI highly recommend you take a look at SQLite!\nDiscuss on Changelog News",
          "link": "https://www.unixsheikh.com/articles/sqlite-the-only-database-you-will-ever-need-in-most-cases.html",
          "publishedOn": "2023-02-16T15:39:00.000Z",
          "wordCount": null,
          "title": "SQLite the only database you will ever need in most cases",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1954",
          "author": null,
          "description": "Tim McNamara is known as New Zealand’s Rust guy. He is the author of Rust in Action, and also a Senior Software Engineer at AWS, where he helps other builders with all things Rust.\nThe main reason why Gerhard is intrigued by Rust is the incredible resource frugality. Fewer CPUs means less energy used, which is good for the planet, and good for the monthly bill. This becomes most noticeable at Amazon’s scale, when S3, Lambda, CloudFront and other services start adding Rust components.\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platfor…",
          "link": "https://changelog.com/shipit/89",
          "publishedOn": "2023-02-16T14:50:00.000Z",
          "wordCount": null,
          "title": "Ship It! 89: Rust efficiencies at AWS scale",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/89/ship-it-89.mp3",
            "length": "61205933",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8lAk",
          "author": "Jerod Santo",
          "description": "Rust and Haskell don’t shy away from powerful features. As a result, both languages have steep learning curves when compared with other languages. Trying to learn Rust or Haskell can be frustrating, especially in the first couple of months.\nBut if you already know Rust, you have a head start with Haskell; and vice versa.\nIn this article, we want to show how knowledge of one of these languages can help you get up to speed with another.\nDiscuss on Changelog News",
          "link": "https://serokell.io/blog/rust-vs-haskell",
          "publishedOn": "2023-02-15T16:02:00.000Z",
          "wordCount": null,
          "title": "Rust vs. Haskell",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MbaG",
          "author": "Jerod Santo",
          "description": "Tired of pushing to test your .gitlab-ci.yml? With this tool, you can run those pipelines locally in your shell or Docker to make sure everything’s working right before sending it off to GitLab to be processed.\nDiscuss on Changelog News",
          "link": "https://github.com/firecow/gitlab-ci-local",
          "publishedOn": "2023-02-15T15:16:00.000Z",
          "wordCount": null,
          "title": "A tool for running your GitLab CI/CD pipelines locally",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2008",
          "author": null,
          "description": "We’ve been hearing about “serverless” CPUs for some time, but it’s taken a while to get to serverless GPUs. In this episode, Erik from Banana explains why its taken so long, and he helps us understand how these new workflows are unlocking state-of-the-art AI for application developers. Forget about servers, but don’t forget to listen to this one!\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nErik Dunteman – Twitter, GitHub, LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\nBanana - Scale your machine learning inference and training on serverless GPUs.\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:43) - Erik Dunteman\n(02:34) - What does serverless mean to you?\n(07:17) - What's the secret sauce?\n(09:30) - How does serverless affect our workflows?\n(13:21) - Sponsor: Changelog++\n(14:21) - What languages do you prefer?\n(17:20) - The Banana workflow\n(20:33) - The necessary minimum skills to use Banana\n(24:51) - A typical win\n(26:20) - Incompatible workflows\n(30:11) - Future Banana-AWS compatability?\n(32:53) - Tips to choose your GPU\n(35:23) - What's the future of serverless?\n(37:46) - Outro",
          "link": "https://changelog.com/practicalai/211",
          "publishedOn": "2023-02-14T21:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 211: Serverless GPUs",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/211/practical-ai-211.mp3",
            "length": "37217175",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/nj48",
          "author": "Jerod Santo",
          "description": "In a post about overestimating our short-term ability and underestimate our long-term ability, Paavan drops this nugget:\nIt’s important to recognise the value of quantity over quality. This is best illustrated by an anecdote that I first heard from Kevin Cannon at PUSH Conference: a potter who spends time making 100 vases will end up with one that’s better quality than if they spent the same amount of time trying to just make 1 perfect vase. So, while quality is obviously important, focussing on quantity at the start of a creative journey is the way to get there.\nI’ve never heard that anecdote before, but I absolutely love the truth it so clearly represents.\nDiscuss on Changelog News",
          "link": "https://paavandesign.com/blog/ostaulta/",
          "publishedOn": "2023-02-14T20:55:00.000Z",
          "wordCount": null,
          "title": "The value of quantity over quality",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ojW4",
          "author": "Jerod Santo",
          "description": "As Amos Wenger says in the opener to this 37 minute read:\nSome bugs are merely fun. Others are simply delicious! Today’s pick is the latter.\nIt’ll take a deep dive into UTF-8 and UTF-16 to get to the bottom of this delicious bug. 🥺\nDiscuss on Changelog News",
          "link": "https://fasterthanli.me/articles/the-bottom-emoji-breaks-rust-analyzer",
          "publishedOn": "2023-02-14T15:51:00.000Z",
          "wordCount": null,
          "title": "The bottom emoji breaks rust-analyzer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXEZ",
          "author": "Adam Stacoviak",
          "description": "Discuss on Changelog News",
          "link": "https://github.com/Nutlope/aicommits",
          "publishedOn": "2023-02-14T13:30:00.000Z",
          "wordCount": null,
          "title": "AI Commits - a CLI that writes your commit messages for you",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2007",
          "author": null,
          "description": "Alice Girard Guittard finds out how much she could you really get out of a $4 VPS, Brett Cannon wonders if using TOML for .env files is a good idea, Nic Mulvaney details how they count unique visitors to a website without using cookies, UIDS, or fingerprinting, after a few months, Chris Coyier is still using the Arc browser & Alex Kladov pens a love letter to Deno.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nRIHANNA LOOK OUT\nHow much can you really get out of a 4$ VPS?\n\nK6\nCRUD benchmark code\nUse TOML for .env files?\n\nTOML\nCounting unique visitors without using cookies, UIDs or fingerprinting.\nStill on Arc\n\narc.net\nA love letter to Deno\n\nRyan Dahl on JS Party #256\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:39) - How much can you get from a $4 VPS?\n(01:57) - Use TOML for `.env` files?\n(03:23) - Counting unique visitors privately\n(04:52) - Still on Arc\n(06:17) - A love letter to Deno\n(08:29) - Outro",
          "link": "https://changelog.com/podcast/news-2023-02-13",
          "publishedOn": "2023-02-13T20:15:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Load testing a $4 VPS, TOML for .env files, counting unique visitors sans cookies, the Arc browser & a love letter to Deno",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-02-13/the-changelog-news-2023-02-13.mp3",
            "length": "9516139",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/aQap",
          "author": "Jerod Santo",
          "description": "Great for generating code snippets, shell commands, documentation & more.\n\nDiscuss on Changelog News",
          "link": "https://github.com/TheR1D/shell_gpt",
          "publishedOn": "2023-02-13T13:34:00.000Z",
          "wordCount": null,
          "title": "Call GPT-3 from your terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2005",
          "author": null,
          "description": "This week we invited our friend Mat Ryer to join us for some good conversation about some Git tooling that’s been on our radar. You may know Mat from Go Time and also Grafana’s Big Tent, which we help to produce. We speculate, we discuss, we laugh, and Mat even breaks into song a few times. It’s good fun.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nPostman – Build APIs together — More than 20 million developers …",
          "link": "https://changelog.com/podcast/526",
          "publishedOn": "2023-02-10T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 526: Git with your friends",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/526/the-changelog-526.mp3",
            "length": "97028737",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1967",
          "author": null,
          "description": "The panel dives into the current hot topic that is Generative AI. They start by defining it (a surprisingly difficult topic), then go into experiences they’ve had, how to get started working with it as a developer, and where they think it will and will not be useful in the near future.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nLolo Code – If you’re familiar with building severless apps, think of Lolo Code as your backend with a visual editor that lets you think and build at the same time. All this without having to provision or manage servers. Use the visual editor to build your app, connect nodes, and add any npm libraries you need. You can even write your own integrations. This makes Lolo Co…",
          "link": "https://changelog.com/jsparty/262",
          "publishedOn": "2023-02-10T20:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 262: Generative AI for devs",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/262/js-party-262.mp3",
            "length": "57646219",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/O5ao",
          "author": "Jerod Santo",
          "description": "Lucas F. Costa:\nIn this blog post, I’ll elucidate why backlogs exist and why they never shrink. Then, I’ll expound on why they’re useless and harmful. Finally, I’ll demonstrate how one can work without a backlog and explain why it’s much more productive to do so.\nI agree whole heartedly with his “why they never shrink” logic, but I’m not willing to say that makes them “useless and harmful.” I’m not sure Lucas even believes that, since his advice of what to do instead at the end of the post boils down to “keep a short backlog.”\nStill, I enjoy Lucas’s thought process and you might too. Recommended reading.\nDiscuss on Changelog News",
          "link": "https://lucasfcosta.com/2023/02/07/backlogs-are-useless.html",
          "publishedOn": "2023-02-10T16:40:00.000Z",
          "wordCount": null,
          "title": "Why backlogs are useless, why they never shrink, and what to do instead",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7YAY",
          "author": "Browser London",
          "description": "Aiming for one ‘big bang’ release is asking for trouble. Continuous improvement is a better route to creating great digital products. In this post, we take you on a thought experiment to prove this out.\nDiscuss on Changelog News",
          "link": "https://www.browserlondon.com/blog/2023/02/10/continuous-improvement-beats-big-tada-releases/",
          "publishedOn": "2023-02-10T15:54:00.000Z",
          "wordCount": null,
          "title": "Continuous improvement beats big ‘tada’ releases",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3L92",
          "author": "Jerod Santo",
          "description": "Jay Mody:\nMy goal with this post is to provide a simple and hackable yet complete technical introduction to the GPT as an educational tool. As such, we ONLY implement the forward pass code, using already trained model weights.\nDiscuss on Changelog News",
          "link": "https://jaykmody.com/blog/gpt-from-scratch/",
          "publishedOn": "2023-02-10T14:27:00.000Z",
          "wordCount": null,
          "title": "GPT in 60 lines of NumPy",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1973",
          "author": null,
          "description": "A quick look at the history of building web apps, followed by a discussion of htmx and how it compares to both modern and traditional ways of building.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You …",
          "link": "https://changelog.com/gotime/266",
          "publishedOn": "2023-02-09T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 266: Is htmx the way to Go?",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/266/go-time-266.mp3",
            "length": "73783708",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/1WAP",
          "author": "Jerod Santo",
          "description": "Like it or not, Facebook’s engineering decisions have steered the developer world in various directions over the years, especially on iOS. InfoQ’s Sergio De Simone does a solid job summarizing the last ten years of that history for all of us to learn from.\nDiscuss on Changelog News",
          "link": "https://www.infoq.com/news/2023/02/Facebook-app-ten-years/",
          "publishedOn": "2023-02-09T14:33:01.000Z",
          "wordCount": null,
          "title": "The ten year journey of Facebook's app for iOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bJbZ",
          "author": "Jerod Santo",
          "description": "An open-source knowledge-based community software. You can use it quickly to build Q&A community for your products, customers, teams, and more.\nIt looks like a lot of work has been put into this, with more cool stuff coming (integrations, gamification).\n\nDiscuss on Changelog News",
          "link": "https://answer.dev",
          "publishedOn": "2023-02-08T16:50:00.000Z",
          "wordCount": null,
          "title": "Build a Q&A community with Answer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jNa",
          "author": "Jerod Santo",
          "description": "StackQL allows you to create, modify and query the state of services and resources across all three major public cloud providers (Google, AWS and Azure) using a common, widely known DSL…SQL.\nI have to admit, it does look pretty darn simple:\nSELECT * FROM google.compute.instances \nWHERE zone = 'australia-southeast1-b' \nAND project = 'my-project';\n\nDiscuss on Changelog News",
          "link": "https://stackql.io",
          "publishedOn": "2023-02-08T16:00:00.000Z",
          "wordCount": null,
          "title": "Query, provision, secure & operate cloud resources using SQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwV4",
          "author": "Jerod Santo",
          "description": "Designers often complain about the quality of feedback they get from senior stakeholders without realizing it’s usually because of the way they initially have framed the request. In this article, Andy Budd shares a better way of requesting feedback: rather than sharing a linear case study that explains every design revision, the first thing to do would be to better frame the problem.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2023/02/designers-ask-receive-high-quality-feedback/",
          "publishedOn": "2023-02-08T15:14:01.000Z",
          "wordCount": null,
          "title": "How designers should ask for (and receive) high-quality feedback",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2001",
          "author": null,
          "description": "Worlds are colliding! This week we join forces with the hosts of the MLOps.Community podcast to discuss all things machine learning operations. We talk about how the recent explosion of foundation models and generative models is influencing the world of MLOps, and we discuss related tooling, workflows, perceptions, etc.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nDemetrios Brinkmann – Twitter\nMihail Eric – Twitter, GitHub, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\nMLOps.Community\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:43) - Demetrios and Mihail\n(01:54) - What is the MLOps Community?\n(05:14) - Chris throws a hand grenade into the convo\n(09:44) - MLOps vs DevOps when deploying\n(15:30) - Ops vs experiment tracking\n(16:43) - Where is MLOps going?\n(25:57) - Is this even legal??\n(32:22) - Sponsor: Changelog++\n(33:21) - Is generative model bloat an issue?\n(36:35) - MLOps' diverse uses\n(42:52) - You are not Google\n(54:07) - Wrap up\n(56:07) - Outro",
          "link": "https://changelog.com/practicalai/210",
          "publishedOn": "2023-02-07T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 210: MLOps is alive and well",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/210/practical-ai-210.mp3",
            "length": "54829494",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/3L62",
          "author": "Jerod Santo",
          "description": "This short piece by Jim Nielsen resonated with me (much like Manu’s post resonated with Jim). He says:\nI like this idea of beginning to notice and bring attention to people or creative works that intentionally bring closure, even when you’re left wanting a little more.\nWhen it comes to open source software, people often see a lack of activity and proclaim that a project is unmaintained. Sometimes that’s true, but sometimes the project is merely finished, and that’s okay. In fact, it’s better than okay. It’s downright successful.\nThere’s a big difference between quitting and finishing. Quitting is in the realm of failure, but finishing is in the realm of success. The key is to define what finished means before you get there, lest you feel like you’re merely quitting.\nThe art of knowing when to quit? Sure. But how about the art of knowing how to finish?\nDiscuss on Changelog News",
          "link": "https://blog.jim-nielsen.com/2023/art-of-knowing-when-to-quit/",
          "publishedOn": "2023-02-07T16:34:00.000Z",
          "wordCount": null,
          "title": "The art of knowing when to quit",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2000",
          "author": null,
          "description": "OpenAI’s working on an AI classifier trained to distinguish between AI-written and human-written text, Oz Nova and Myles Byrne created a guide to teach yourself computer science, Charles Genschwap recently realized that all the various programming philosophies can be boiled down into a simple statement about how to work with state, you probably don’t need Lodash or Underscore anymore & Waseem Daher thinks scalability is overrated.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nNew AI classifier for indicating AI-written text\nTeach Yourself Computer Science\n\nOz on The Changelog #260\nAll Programming Philosophies Are About State\nYou might not need Lodash/Underscore\nScalability is overrated\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:16) - OpenAI's classifier for AI-written text\n(02:33) - Teach Yourself Computer Science\n(03:56) - All philosophies are about state\n(04:52) - You might not need Lodash or Underscore\n(06:02) - Scalability is overrated\n(07:08) - Outro",
          "link": "https://changelog.com/podcast/news-2023-02-06",
          "publishedOn": "2023-02-06T21:40:00.000Z",
          "wordCount": null,
          "title": "Changelog News: OpenAI's new text classifier, teach yourself CS, programming philosophies are about state, you might not need Lodash & overrated scalability",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-02-06/the-changelog-news-2023-02-06.mp3",
            "length": "7881589",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8l8Z",
          "author": "Jacob Zelko",
          "description": "For many hackers, programmers, and computer scientists, having an understanding of graph theory is immensely helpful. But what about those who do not have this background?\nThis blog posts adapts Scott Young’s Ultralearning approach and applies it to learning graph theory for those who many not have a formal training in maths!\nDiscuss on Changelog News",
          "link": "https://jacobzelko.com/01012023000122-graph-theory-learning/#roadmap",
          "publishedOn": "2023-02-06T16:25:00.000Z",
          "wordCount": null,
          "title": "Achieving an undergrad level understanding of graph theory",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqMw",
          "author": "Jerod Santo",
          "description": "Creator Tyler Deitz says:\nStreetPass is a browser extension that helps you find your people on Mastodon. It piggybacks off the way Mastodon handles decentralized identity verification and turns it into a simple discovery tool that recommends users based on the websites you visit! Available for Chrome and Firefox (soon Safari).\nDiscovery is one of the more challenging facets of federated social networking. It gets even more challenging now that Twitter’s API is getting paywall’d, so most of the free tools to port your Twitter social graph over to Mastodon will quit working. I expect more tools like StreetPass to pop up in the coming days as the Fediverse seems to be capturing that hacker spirit Twitter once embraced.\nDiscuss on Changelog News",
          "link": "https://streetpass.social",
          "publishedOn": "2023-02-06T15:33:00.000Z",
          "wordCount": null,
          "title": "StreetPass: Find your people on Mastodon",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bJMe",
          "author": "Jerod Santo",
          "description": "What’s old is new cool again. Here’s Andy Jiang, writing on Deno’s blog:\nIn the past 10 years, the median size for a desktop webpage has gone from 468 KB to 2284 KB, a 388.3% increase. For mobile, this jump is even more staggering — 145 KB to 2010 KB — a whopping 1288.1% increase.\nThat’s a lot of weight to ship over a network, especially for mobile. As a result, users experience terrible UX, slow loading times, and a lack of interactivity until everything is rendered. But all that code is necessary to make our sites work the way we want.\nThis is the problem with being a frontend dev today. What started out fun for frontend developers, building shit-hot sites with all the bells and whistles, has kinda turned into not fun. We’re now fighting different browsers to support, slow networks to ship code over, and intermittent, mobile connections. Supporting all these permutations is a giant headache.\nHow do we square this circle? By heading back to the server (Swiss basement not required).\nHe goes on to talk about isomorphic JavaScript frameworks and Deno’s offerings in this space. But hey, you don’t need all that fancy stuff to do SSR. All you need is a programming language that can render HTML (this is almost all languages) and a server…\nDiscuss on Changelog News",
          "link": "https://deno.com/blog/the-future-and-past-is-server-side-rendering",
          "publishedOn": "2023-02-03T20:06:00.000Z",
          "wordCount": null,
          "title": "The future (and the past) of the web is server-side rendering",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1965",
          "author": null,
          "description": "A deep dive into Qwik, how it makes your apps fast by default, and the carefully calibrated amount of “magic” that makes it uniquely powerful.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nMiško Hevery – Twitter, GitHub\nKevin Ball – Twitter, GitHub, LinkedIn, Website\n\nShow Notes:\n\nQwik is a new kind of web framework\nQwik\nQwik Discord\nStackblitz Qwik Trial\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:55) - Welcoming Misko back to the pod\n(01:47) - A quick recap on Qwik\n(04:09) - App framework vs content framework\n(06:45) - The problem with React\n(10:01) - Qwik Listeners\n(13:15) - What makes Qwik City unique\n(17:40) - Sponsor: Changelog++\n(18:35) - Qwik is black magic\n(25:40) - $ function magic\n(26:41) - Optimizer magic\n(28:33) - Loader magic\n(29:53) - Qwik City vs Remix\n(32:38) - Not too much magic tho\n(34:22) - Serializing framework state vs app state\n(40:04) - Implications of serialization\n(42:44) - Challenges when adopting Qwik\n(46:35) - Qwik's solution to memory leaks\n(48:03) - How to get started\n(48:57) - The real value of Qwik\n(51:41) - Wrapping Up\n(52:31) - Outro",
          "link": "https://changelog.com/jsparty/261",
          "publishedOn": "2023-02-03T17:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 261: Qwik has just the right amount of magic",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/261/js-party-261.mp3",
            "length": "51930001",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/49d4",
          "author": "Jerod Santo",
          "description": "Filippo Valsorda:\nLast May I left my job on the Go team at Google to experiment with more sustainable paths for open-source maintainers. I held on to my various maintainer hats (Go cryptography, transparency tooling, age, mkcert, yubikey-agent…), iterated on the model since September, and I’m happy to report that I am now a full-time independent open-source maintainer.\nPeople like Filippo are still (unfortunately) the exception, not the rule. BUT! I’ll celebrate every time an open source maintainer makes it to the promised land, hopefully paving the way for others to follow after.\nI’m sharing details about my progress to hopefully popularize the model, and eventually help other maintainers adopt it, although I’m not quite ready to recommend anyone else drop everything to try this just yet.\nDiscuss on Changelog News",
          "link": "https://words.filippo.io/full-time-maintainer/",
          "publishedOn": "2023-02-03T15:50:00.000Z",
          "wordCount": null,
          "title": "I’m now a full-time professional open source maintainer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qMnN",
          "author": "Jerod Santo",
          "description": "Learning Kubernetes can seem overwhelming. It’s a complex container orchestration system, that has a steep learning curve. But with the right roadmap and understanding of the foundational concepts, it’s something that any developer or ops person can learn.\nIn this Kubernetes learning roadmap, I have added prerequisites and complete Kubernetes learning path covering basic to advanced Kubernetes concepts.\nDiscuss on Changelog News",
          "link": "https://github.com/techiescamp/kubernetes-learning-path",
          "publishedOn": "2023-02-03T15:03:01.000Z",
          "wordCount": null,
          "title": "A roadmap to learn Kubernetes from scratch",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoMM",
          "author": "Jerod Santo",
          "description": "GraphGPT converts unstructured natural language into a knowledge graph. Pass in the synopsis of your favorite movie, a passage from a confusing Wikipedia page, or transcript from a video to generate a graph visualization of entities and their relationships.\n\nDiscuss on Changelog News",
          "link": "https://github.com/varunshenoy/GraphGPT",
          "publishedOn": "2023-02-02T20:15:00.000Z",
          "wordCount": null,
          "title": "Extrapolate knowledge graphs from unstructured text using GPT-3 🕵️‍♂️",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1983",
          "author": null,
          "description": "It’s “Call For Papers” (CFP) season in Go land, so we gathered some seriously experienced conference organizers to help YOUR submission be the best ever.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – Yo…",
          "link": "https://changelog.com/gotime/265",
          "publishedOn": "2023-02-02T18:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 265: How to ace that CFP",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/265/go-time-265.mp3",
            "length": "65046529",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1955",
          "author": null,
          "description": "In our ops & infra world, we learn to optimise for redundancy, for mean time to recovery and for graceful degradation. We instinctively recognise single points of failure, and try to mitigate the risks associated with them.\nFor some years now, Daniel Vassallo has been doing the same, but in the context of life & work. Daniel talks about the role of randomness, about learning from small wins & about optimising for a lifestyle that matches your true preferences,. Apparently, ideas too should be treated like cattle, not pets.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery net…",
          "link": "https://changelog.com/shipit/88",
          "publishedOn": "2023-02-02T16:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 88: Treat ideas like cattle, not pets",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/88/ship-it-88.mp3",
            "length": "66637555",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/oja4",
          "author": "Bruno Calza",
          "description": "While playing with the SQLite vs Filesystem benchmark, I became intrigued by how the cache between the two approaches behaved.  That led me to discover a super exciting tool called vmtouch, which allows you to interact with the Operating System page cache and do some performance debugging.\nDiscuss on Changelog News",
          "link": "https://brunocalza.me/the-day-i-discoverd-vmtouch/",
          "publishedOn": "2023-02-02T15:17:00.000Z",
          "wordCount": null,
          "title": "The day I discovered vmtouch",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/QpMQ",
          "author": "Jerod Santo",
          "description": "Richard MacManus from The New Stack spoke with Netlify CEO Matt Biilmann about the deal and their new catchphrase: “composable architectures”\nBiilmann described it as a “change away from monolithic solutions,” citing a couple of examples: Adobe Experience Manager “as the DXP [digital experience platform] system for all your web productions” and Drupal “as the core engine that both powers the backend and the frontend of your site, the business logic and the UI layer, and so on.” He argues that these types of “monolithic” solutions can “start to feel very legacy and very dated.”\nI’m not sure if “composable architectures” will stick, but they sure did a good job of making “jamstack” a thing, so time will tell on that.\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/netlify-acquires-gatsby-its-struggling-jamstack-competitor/",
          "publishedOn": "2023-02-01T16:45:00.000Z",
          "wordCount": null,
          "title": "Netlify acquires Gatsby",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDaV",
          "author": "Jerod Santo",
          "description": "This Python-based tool scans through your git log and generates a heat map like the one below from the cpython repo, which highlights the files that Guido van Rossum changed the most.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jmforsythe/Git-Heat-Map",
          "publishedOn": "2023-02-01T15:24:00.000Z",
          "wordCount": null,
          "title": "A heat map for your git repo 🔥",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8lgk",
          "author": "Jerod Santo",
          "description": "Greg Schier from Railway:\nThe theory goes that if you ship code on Friday you’ll inevitably be working Saturday to fix what you broke. This makes logical sense; software is messy and mistakes are unavoidable.\nBut no, shipping code on Friday isn’t bad. At least, it doesn’t have to be.\nThe key to their success is confidence, which comes from having a solid deployment pipeline and shipping through it often. Gerhard Lazu hit that nail on the head in this short clip as well.\nDiscuss on Changelog News",
          "link": "https://blog.railway.app/p/ship-on-friday",
          "publishedOn": "2023-02-01T14:35:00.000Z",
          "wordCount": null,
          "title": "Why we ship the most code on Friday",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Pb",
          "author": "Jerod Santo",
          "description": "Bryan Braun reflects on years of pairing:\nI’ve pair-programmed in a lot of different situations. I’ve been the junior developer who needed to be unblocked. I’ve been the new team member, being onboarded to a new codebase. I’ve paired with peers for knowledge-sharing and productivity. And I’ve been the senior dev.\nHe goes on to say that it’s easy to put a pairing session on rails to avoid embarrassment, but:\nWhen I think back, my favorite pair-programming sessions were the one where things went wrong. These were the moments that taught me what being a programmer is all about. What do you do when you don’t know what to do? How do you break down a new problem? What tools do you reach for? When do you abandon your current approach? These are things you can’t learn from a blog post.\nDiscuss on Changelog News",
          "link": "https://www.bryanbraun.com/2022/12/31/the-best-part-of-pair-programming/",
          "publishedOn": "2023-01-31T20:56:00.000Z",
          "wordCount": null,
          "title": "The best part of pair programming is when things go wrong",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1994",
          "author": null,
          "description": "What’s the current reality and practical implications of using 3D environments for simulation and synthetic data creation? In this episode, we cut right through the hype of the Metaverse, Multiverse, Omniverse, and all the “verses” to understand how 3D assets and tooling are actually helping AI developers develop industrial robots, autonomous vehicles, and more. Beau Perschall is at the center of these innovations in his work with NVIDIA, and there is no one better to help us explore the topic!\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nBeau Perschall – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\n\nNVIDIA’s Omniverse\nBeau’s GTC 2023 session around how to build simulation-ready USD 3D assets\nTech blog around Omniverse and SimReady assets\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:42) - Beau Perschall\n(05:30) - Omniverse 101\n(10:27) - What can you do in the omniverse?\n(13:26) - Will Omniverse be unique for everyone?\n(20:13) - Will Omniverse have good 3D?\n(26:39) - Omniverse in context\n(30:43) - Synthetic data\n(35:31) - Nvidia's plan for low internet areas\n(38:44) - What keeps you up at night?\n(41:11) - Wrap up\n(41:46) - Outro",
          "link": "https://changelog.com/practicalai/209",
          "publishedOn": "2023-01-31T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 209: 3D assets & simulation at NVIDIA",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/209/practical-ai-209.mp3",
            "length": "41064571",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1Ml",
          "author": "Jerod Santo",
          "description": "Robin Linacre:\nSQL should be the first option considered for new data engineering work. It’s robust, fast, future-proof and testable. With a bit of care, it’s clear and readable. A new SQL engine - DuckDB - makes SQL competitive with other high performance dataframe libraries, making SQL a good candidate for data of all sizes.\nYou can make a similar argument for SQL that Gary Bernhardt made for Vim. Here’s Gary on Vim, run your own s/Vim/SQL/g filter on this as you read it:\n…just for me, 15 years; at the beginning of that time, TextMate was just becoming popular. Then it was Sublime Text was cool. Then Atom was cool. Then VS Code was cool. A lot of people switched between two of those, three of those, maybe all four of those, and that whole time I was just getting better and better and better at Vim… And you multiply that out by the length of a career, you use Vim for 40 years - you’re gonna be so good at it by the end, and it’s still gonna be totally relevant, I think.\nDiscuss on Changelog News",
          "link": "https://www.robinlinacre.com/recommend_sql/",
          "publishedOn": "2023-01-31T15:49:00.000Z",
          "wordCount": null,
          "title": "SQL should be your default choice for data engineering pipelines",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1993",
          "author": null,
          "description": "Jeremia Kimelman takes stock of his “data tool belt”, Build Your Own Redis with C/C++ is ready to read, giscus is a comments system powered by GitHub Discussions, Matt Rickard says prompt engineering shouldn’t be a thing and won’t be a thing in the future & Kolja Lubitz’s ALPACA is engine for building adventure games and interactive comics.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nTaking stock of my “data tool belt”\nThe “Build Your Own Redis” book is completed\n\nfree web version\npurchaseable version\nA comments system powered by GitHub Discussions\nPrompt Engineering Shouldn’t Exist\nThe ALPACA game engine\n\nPortal Dogs\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:08) - Taking stock of my \"data tool belt\"\n(02:06) - The \"Build Your Own Redis\" book\n(02:50) - The giscus comments system\n(04:15) - Prompt Engineering Shouldn't Exist\n(05:25) - The ALPACA game engine\n(06:28) - Outro",
          "link": "https://changelog.com/podcast/news-2023-01-30",
          "publishedOn": "2023-01-30T20:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Data tool belts, Build Your Own Redis, the giscus comments system, prompt engineering shouldn't exist & ALPACA",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-01-30/the-changelog-news-2023-01-30.mp3",
            "length": "7014173",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9lkg",
          "author": "Jerod Santo",
          "description": "We linked to Fathy a few months back when he forked Chrome to turn HTML into SVG, but this time he’s really outdone himself by making it render to the terminal. What resulted is the Carbonyl web browser.\n\nDiscuss on Changelog News",
          "link": "https://fathy.fr/carbonyl",
          "publishedOn": "2023-01-30T15:52:00.000Z",
          "wordCount": null,
          "title": "Forking Chrome to render in a terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQMp",
          "author": "Jerod Santo",
          "description": "An opinionated rant to accompany your Monday morning coffee:\nWhen you work with a format as complex as yaml, it is difficult to be aware of all the features and subtle behaviors it has. There is an entire website dedicated to picking one of the 63 different multi-line string syntaxes. This means that it can be very difficult for a human to predict how a particular document will parse. Let’s look an example to highlight this…\nDiscuss on Changelog News",
          "link": "https://ruudvanasseldonk.com/2023/01/11/the-yaml-document-from-hell",
          "publishedOn": "2023-01-30T15:02:00.000Z",
          "wordCount": null,
          "title": "The yaml document from hell",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1977",
          "author": null,
          "description": "This week we’re talking about Mainframes with Cameron Seay, Adjunct Professor at East Carolina University and a member of the Governing Board of the Open Mainframe Project. If you’ve been curious about Mainframes, this show will be a great guide. Cameron explains exactly what a Mainframe is and how it’s different from the Cloud. We talk COBOL and the state of education and opportunities around that language. We cover the state-of-the-art in Mainframe land, System Z, Linux on Mainframe, and more.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what…",
          "link": "https://changelog.com/podcast/524",
          "publishedOn": "2023-01-27T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 524: Mainframes are still a big thing",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/524/the-changelog-524.mp3",
            "length": "62508418",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1877",
          "author": null,
          "description": "Ole Bulbuk & Sandor Szücs join Natalie to discuss the ins & outs of long-term code maintenance. What does it take to maintain a codebase for a decade or more? How do you plan for that? What about inheriting a codebase for the long term? Oh, and (how) can AI help?\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the w…",
          "link": "https://changelog.com/gotime/264",
          "publishedOn": "2023-01-27T20:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 264: Long-term code maintenance",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/264/go-time-264.mp3",
            "length": "42834325",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/2l59",
          "author": "Juanjo Aguililla",
          "description": "Manage your resume as structured data, in a modular fashion, within the comfort of your code editor, rendered your way and out of word processors. Here’s a quick 3 minute demo.\nDiscuss on Changelog News",
          "link": "https://github.com/hexagonkt/codecv",
          "publishedOn": "2023-01-27T15:57:01.000Z",
          "wordCount": null,
          "title": "CV spec and tools to manage your resume",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7YXY",
          "author": "Jerod Santo",
          "description": "I love a good “I built a thing and here is how I built that thing” post, especially when it’s penned by someone like Chris who’s sure to keep you entertained along the way.\nWouldn’t it be neat to have aggregated data (for a website, daily email, push alert, etc) of kids events in our surrounding area so we know about them right away?\n— My wife, possibly salty we missed out on Bluey Live tickets in Portland\nDiscuss on Changelog News",
          "link": "https://chriscoyier.net/2023/01/23/a-very-basic-scraper-aggregator-site-in-next-js-with-go-cloud-functions-and-supabase/",
          "publishedOn": "2023-01-27T15:08:01.000Z",
          "wordCount": null,
          "title": "A very basic aggregator site in Next.js with Go cloud functions and Supabase",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwgA",
          "author": "Jerod Santo",
          "description": "Chip Huyen:\nWhen we actively hire, our startup gets 150 - 200 applications each month. I read every single one of them. Sometimes, I’d talk to a candidate and see that what we perceived as their strongest aspects actually weren’t included in their resume. Occasionally, a candidate would tell me that they didn’t expect their resume to still be screened by humans – had they known, they would have written their resume differently.\nThe resume evaluation process is pretty much a black box for most candidates. And it is so because few hiring managers have publicly discussed this. I thought I should start the conversation.\nChip’s team mostly hires for infra and ML roles, so some of the advice here will be catered towards those positions. Still, if you’re on the job market you’d be well-served by spending 15-20 minutes reading this post and tweaking your resume where applicable.\nDiscuss on Changelog News",
          "link": "https://huyenchip.com//2023/01/24/what-we-look-for-in-a-candidate.html",
          "publishedOn": "2023-01-26T15:24:00.000Z",
          "wordCount": null,
          "title": "What we look for in a resume",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1956",
          "author": null,
          "description": "Last September, at the 🇨🇭 Swiss Cloud Native Day, Florian Forster, co-founder & CEO of ZITADEL, talked about why they switched to serverless containers. ZITADEL has a really interesting workload that is both CPU intensive and latency sensitive. On top of this, their users are global, and traffic is bursty. Florian talks about how they evaluated AWS, GCP & Azure before they settled on the platform that met their requirements.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changel…",
          "link": "https://changelog.com/shipit/87",
          "publishedOn": "2023-01-26T14:35:00.000Z",
          "wordCount": null,
          "title": "Ship It! 87: Why we switched to serverless containers",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/87/ship-it-87.mp3",
            "length": "65738692",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/6rkg",
          "author": "Jerod Santo",
          "description": "This post introduces the concept of durable execution, which is used by Stripe, Netflix, Coinbase, Snap, and many others to solve a wide range of problems in distributed systems. Then it shows how simple it is to write durable code in Node.\nDiscuss on Changelog News",
          "link": "https://temporal.io/blog/building-reliable-distributed-systems-in-node",
          "publishedOn": "2023-01-26T14:20:00.000Z",
          "wordCount": null,
          "title": "Building reliable distributed systems in Node",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlyR",
          "author": "Jerod Santo",
          "description": "I’m currently working at a top tier investment bank as a software engineer. I’m an insignificant cog in a machine that skims the cream from the milk. I’m earning the most money I’ve ever made and yet I’m the least fulfilled I’ve ever been.\nRight now in the UK and across the world, things are uncertain. Companies are laying workers off, there’s a cost of living and energy crisis. I’m excruciatingly lucky to have been in the right place at the right time to develop the skillset I’ve got. In times like these every signal is telling me to stay on the path I’m on, enjoying the comfort and safety of a high paying job.\nI’m not going to listen. I’m quitting and I’m leaving this place. I’ll see you in the mountains.\nAfter this post blew up, Seán wrote a follow-up on what quitting the rat race means to him.\nDiscuss on Changelog News",
          "link": "https://seanbarry.dev/posts/quitting-the-rat-race",
          "publishedOn": "2023-01-25T16:04:00.000Z",
          "wordCount": null,
          "title": "Seán Barry is quitting the rat race",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9pz",
          "author": "Jerod Santo",
          "description": "Run displayplacer list to print your current layout’s args so you can create profiles for scripting/hotkeys with Automator, BetterTouchTool, etc.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jakehilborn/displayplacer",
          "publishedOn": "2023-01-25T15:15:01.000Z",
          "wordCount": null,
          "title": "A macOS CLI to configure multi-display arrangements",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqw0",
          "author": "Jerod Santo",
          "description": "The creators of this new Nix resource thought the existing Nix docs were a bit difficult to navigate for beginners and believe flakes are the future of Nix and wanted to introduce more people to them early in the learning process.\nDiscuss on Changelog News",
          "link": "https://zero-to-nix.com/",
          "publishedOn": "2023-01-25T14:28:00.000Z",
          "wordCount": null,
          "title": "An unofficial, opinionated, gentle introduction to Nix",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1991",
          "author": null,
          "description": "Creating and sharing reproducible development environments for AI experiments and production systems is a huge pain. You have all sorts of weird dependencies, and then you have to deal with GPUs and NVIDIA drivers on top of all that! brev.dev is attempting to mitigate this pain and create delightful GPU dev environments. Now that sounds practical!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nNader Khalil – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\nbrev.dev\nDISCOUNT for our listeners 🔥:\nUse coupon code “practical-ai-2023” for 5 hours of free GPU compute!\nbrev.dev doesn’t offer credits often, so the credit redemption button is hidden by default. Go to this link to expose the button.\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:45) - Welcome to Practical AI\n(01:20) - Nader Khalil\n(07:56) - Dependency issues\n(10:22) - Stepping away from the classical approach\n(13:55) - Getting excited about Brev.dev\n(18:14) - Multi-cloud considerations\n(24:57) - Brev.dev Templates\n(31:16) - Collaboration with Brev\n(32:59) - Brev in private environments\n(35:30) - Nader's future\n(39:05) - Outro",
          "link": "https://changelog.com/practicalai/208",
          "publishedOn": "2023-01-24T21:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 208: GPU dev environments that just work",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/208/practical-ai-208.mp3",
            "length": "38480271",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJ6e",
          "author": "Adam Stacoviak",
          "description": "Discuss on Changelog News",
          "link": "https://initialcommit.com/blog/git-sim",
          "publishedOn": "2023-01-24T17:00:00.000Z",
          "wordCount": null,
          "title": "Git-sim — Visually simulate Git operations on your repos",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM4N",
          "author": "Adam Stacoviak",
          "description": "Yup, that Neon. Congrats to Nikita and team for this big win.\nDatabases and web apps go together like peanut butter and jelly. In a word, they’re inseparable. And despite all the amazing innovations in NoSQL data stores, often a good old relational database is the most reliable tool for the job.\nWe want to make it completely seamless to develop applications that need databases on Replit. Starting today, you can create and instantly begin to use PostgreSQL databases from within the Replit workspace.\nThe fine print.\nUnder the hood, this product is powered by our friends at Neon who have created a lightning-fast serverless database. The database will go to sleep after 5 minutes of inactivity. Most clients should handle the reconnection seamlessly.\nDiscuss on Changelog News",
          "link": "https://blog.replit.com/postgresql-db-launch",
          "publishedOn": "2023-01-24T15:00:00.000Z",
          "wordCount": null,
          "title": "Neon is powering Replit's serverless Postgres",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1979",
          "author": null,
          "description": "Fred K. Schott joins the party again to discuss all the new and fun changes in Astro 2. Nick and KBall dig in on what’s new, what’s exciting, and what to expect from the framework built around content.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and chec…",
          "link": "https://changelog.com/jsparty/260",
          "publishedOn": "2023-01-24T14:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 260: What's new in Astro 2",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/260/js-party-260.mp3",
            "length": "50390576",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ZobM",
          "author": "Adam Stacoviak",
          "description": "Inspired by NES.css\n\nDiscuss on Changelog News",
          "link": "https://micah5.github.io/PSone.css/",
          "publishedOn": "2023-01-24T14:00:00.000Z",
          "wordCount": null,
          "title": "PSone.css — Playstation 1 style CSS framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1990",
          "author": null,
          "description": "Max Countryman wrote up a framework for prioritizing tech debt, shadcn builds a copy/paste-able UI component library in public, Justin Etheredge shares 20 things he’s learned in his 20 years as a software engineer, Jacob Stopak’s git-sim lets you easily visualize git operations without affecting your repo & Mattias Wadman implemented jq in jq.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nA framework for prioritizing tech debt\n\nGood tech debt featuring Jon Thornton from Squarespace\nUI components to copy/paste into your apps\n\nkelseyhightower/nocode\nRadix UI\nThings I’ve Learned in my 20 Years as a Software Engineer\nVisually simulate git operations with git-sim\njq implementation of jq\n\nfq is jq for binary formats\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:07) - A framework for prioritizing tech debt\n(04:01) - UI components to copy/paste into your apps\n(05:40) - Learnings from 20 years in software\n(06:28) - Visually simulate git operations with git-sim\n(07:10) - jq implementation of jq\n(08:28) - Outro",
          "link": "https://changelog.com/podcast/news-2023-01-23",
          "publishedOn": "2023-01-23T19:50:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Prioritizing tech debt, UI components to copy/paste, learnings from 20 years in software, git-sim & jqjq",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-01-23/the-changelog-news-2023-01-23.mp3",
            "length": "9033538",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JgNe",
          "author": "Jerod Santo",
          "description": "Ruby on Jets allows you to create and deploy serverless services with ease, and to seamlessly glue AWS services together with the most beautiful dynamic language: Ruby. It includes everything you need to build an API and deploy it to AWS Lambda. Jets leverages the power of Ruby to make serverless joyful for everyone.\nI’m not (yet) big on serverless things, but if I were, I’d love to run some Ruby code there.\nDiscuss on Changelog News",
          "link": "https://rubyonjets.com",
          "publishedOn": "2023-01-23T16:20:00.000Z",
          "wordCount": null,
          "title": "Ruby and Lambda had a baby and that child's name is Jets",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/QpzQ",
          "author": "Jerod Santo",
          "description": "This is a Pythonic wrapper around stable diffusion with image editing by InstructPix2Pix. The four images featured below (top) are generated by the following command:\nimagine \"a scenic landscape\" \"a photo of a dog\" \"photo of a fruit bowl\" \"portrait photo of a freckled woman\"\n\nThen they are edited (bottom) with the following commands:\n>> aimg edit scenic_landscape.jpg \"make it winter\" --prompt-strength 20\n>> aimg edit dog.jpg \"make the dog red\" --prompt-strength 5\n>> aimg edit bowl_of_fruit.jpg \"replace the fruit with strawberries\"\n>> aimg edit freckled_woman.jpg \"make her a cyborg\" --prompt-strength 13\n\n\nDiscuss on Changelog News",
          "link": "https://github.com/brycedrennan/imaginAIry",
          "publishedOn": "2023-01-23T15:33:00.000Z",
          "wordCount": null,
          "title": "ImaginAIry imagines & edits images from text inputs",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/outreach-initiatives/arts-culture/9-ways-ai-can-interact-with-culture/",
          "author": null,
          "description": "Explore how AI has been applied to the world of culture through 9 of Google Arts & Culture’s most intriguing projects.",
          "link": "https://blog.google/outreach-initiatives/arts-culture/9-ways-ai-can-interact-with-culture/",
          "publishedOn": "2023-02-08T14:10:00.000Z",
          "wordCount": 1715,
          "title": "9 ways AI can interact with culture"
        },
        {
          "id": "https://blog.google/products/maps/sustainable-immersive-maps-announcements/",
          "author": null,
          "description": "Announcing the launch of immersive view, updates to Live View, new EV charging tools, and glanceable directions on Maps.",
          "link": "https://blog.google/products/maps/sustainable-immersive-maps-announcements/",
          "publishedOn": "2023-02-08T14:10:00.000Z",
          "wordCount": 1670,
          "title": "New ways Maps is getting more immersive and sustainable"
        },
        {
          "id": "https://blog.google/products/search/visual-search-ai/",
          "author": null,
          "description": "We’re sharing a few new ways we’re applying our advancements in AI to make exploring information even more natural and intuitive.",
          "link": "https://blog.google/products/search/visual-search-ai/",
          "publishedOn": "2023-02-08T14:10:00.000Z",
          "wordCount": 1246,
          "title": "From images to videos, how AI is helping you search visually"
        },
        {
          "id": "https://blog.google/technology/ai/bard-google-ai-search-updates/",
          "author": null,
          "description": "Introducing Bard, Google's experimental conversational AI service powered by LaMDA — plus, new AI features in Search coming soon.",
          "link": "https://blog.google/technology/ai/bard-google-ai-search-updates/",
          "publishedOn": "2023-02-06T19:00:00.000Z",
          "wordCount": 1858,
          "title": "An important next step on our AI journey"
        },
        {
          "id": "https://blog.google/technology/ai/how-ai-is-improving-agriculture-sustainability-in-india/",
          "author": null,
          "description": "A look at how AI can help agriculture and sustainable farming in India.",
          "link": "https://blog.google/technology/ai/how-ai-is-improving-agriculture-sustainability-in-india/",
          "publishedOn": "2023-01-30T17:00:00.000Z",
          "wordCount": 1387,
          "title": "How AI is improving agriculture sustainability in India"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=21466",
          "author": "Daniel Stenberg",
          "description": "Welcome to the final and last release in the series seven. The next release is planned and intended to become version 8. Numbers the 213th release5 changes56 days (total: 9,098)173 bug-fixes (total: 8,665)250 commits (total: 29,821)0 new public libcurl function (total: 91)0 new curl_easy_setopt() option (total: 302)1 new curl command line option (total: 250)78 contributors, … Continue reading curl 7.88.0 seven stops here →",
          "link": "https://daniel.haxx.se/blog/2023/02/15/curl-7-88-0-seven-stops-here/",
          "publishedOn": "2023-02-15T07:29:18.000Z",
          "wordCount": 1065,
          "title": "curl 7.88.0 seven stops here"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21420",
          "author": "Daniel Stenberg",
          "description": "curl is actually something which is critical, especially to our data management system. It is being used very widely across NASA. Dr Steve Crawford 2020 Back in 2020 I started getting emails from NASA asking for details and specifics about curl’s origins and in particular about where contributors to the project works, and I first … Continue reading Closing the NASA loop →",
          "link": "https://daniel.haxx.se/blog/2023/02/07/closing-the-nasa-loop/",
          "publishedOn": "2023-02-07T08:49:01.000Z",
          "wordCount": 589,
          "title": "Closing the NASA loop"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21367",
          "author": "Daniel Stenberg",
          "description": "At FOSDEM 2023, fossasia sold a fun badge with bright red 44×11 leds on them. Looking like this: Lots of people walked around the conference this year with sarcastic or otherwise amusing messages scrolling or blinking on them. GitHub Social When a few people at the GitHub Social event on the Saturday evening showed up … Continue reading A badger badge for bagder →",
          "link": "https://daniel.haxx.se/blog/2023/02/06/a-badger-bagde-for-bagder/",
          "publishedOn": "2023-02-06T15:38:45.000Z",
          "wordCount": 1145,
          "title": "A badger badge for bagder"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21362",
          "author": "Daniel Stenberg",
          "description": "In the beginning and for many years, the curl project used no CI services at all. It instead used a distributed build and test systems where volunteers ran machines that pulled the latest code repeatedly, built curl, ran the tests and reported back the results to a central server. One In 2013, the year curl … Continue reading curl’s use of many CI services →",
          "link": "https://daniel.haxx.se/blog/2023/02/01/curls-use-of-many-ci-services/",
          "publishedOn": "2023-02-01T10:19:38.000Z",
          "wordCount": 1372,
          "title": "curl’s use of many CI services"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2023-02-17T12:17:31.603Z",
          "wordCount": 888,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2023-02-16T12:17:56.315Z",
          "wordCount": 1706,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2023-02-14T12:18:22.123Z",
          "wordCount": 832,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "publishedOn": "2023-02-10T12:17:10.223Z",
          "wordCount": 991,
          "title": "How Twitter uses rasdaemon for hardware reliability"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2023-02-09T12:18:22.971Z",
          "wordCount": 1494,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2023-02-09T12:18:15.528Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "author": null,
          "description": "As any team and its infrastructure grows, the risk of an unplanned service outage and potential data loss will grow.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "publishedOn": "2023-02-09T12:18:15.442Z",
          "wordCount": 1108,
          "title": "The data platform cluster operator service for Hadoop cluster management"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2023-01-23T12:17:02.747Z",
          "wordCount": 2277,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2023-01-22T12:15:17.609Z",
          "wordCount": 1352,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47958",
          "author": "James Graham",
          "description": "Interop 2022 showed significant improvements in the interoperability of multiple platform features, along with several cross-browser investigations that looked into complex, under-specified, areas of the platform where interoperability has been difficult to achieve. Building on this, we're pleased to announce Interop 2023, the next iteration of the Interop project.\nThe post Announcing Interop 2023 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2023/02/announcing-interop-2023/",
          "publishedOn": "2023-02-01T17:02:13.000Z",
          "wordCount": 1656,
          "title": "Announcing Interop 2023"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47954",
          "author": "James Graham",
          "description": "Last March we announced the Interop 2022 project, a collaboration between Apple, Bocoup, Google, Igalia, Microsoft, and Mozilla to improve the quality and consistency of their implementations of the web platform.\nNow that it's 2023 and we're deep into preparations for the next iteration of Interop, it's a good time to reflect on how the first year of Interop has gone.\nThe post Interop 2022: Outcomes appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2023/01/interop-2022-outcomes/",
          "publishedOn": "2023-01-31T17:04:42.000Z",
          "wordCount": 900,
          "title": "Interop 2022: Outcomes"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=70169",
          "author": "Walker Chabbott",
          "description": "Learn about CodeQL's improved user experience and enhancements that let you scan new languages, detect new types of CWEs, and perform deeper analyses of your applications.",
          "link": "https://github.blog/2023-02-16-icymi-codeql-enhancements/",
          "publishedOn": "2023-02-16T16:54:25.000Z",
          "wordCount": 1413,
          "title": "ICYMI: CodeQL enhancements"
        },
        {
          "id": "https://github.blog/?p=70133",
          "author": "Kevin Xu",
          "description": "Looking back over a year’s worth of developer-first content moderation and, new in this report, making our data more accessible to researchers.",
          "link": "https://github.blog/2023-02-15-2022-transparency-report/",
          "publishedOn": "2023-02-15T20:50:30.000Z",
          "wordCount": 5133,
          "title": "2022 Transparency Report"
        },
        {
          "id": "https://github.blog/?p=70077",
          "author": "Taylor Blau",
          "description": "Git users are encouraged to upgrade to the latest version, especially if they use `git apply` or `git clone` against untrusted patches or repositories.",
          "link": "https://github.blog/2023-02-14-git-security-vulnerabilities-announced-3/",
          "publishedOn": "2023-02-14T18:45:56.000Z",
          "wordCount": 867,
          "title": "Git security vulnerabilities announced"
        },
        {
          "id": "https://github.blog/?p=70082",
          "author": "Shuyin Zhao",
          "description": "We’re launching new improvements to GitHub Copilot to make it more powerful and more responsive for developers.",
          "link": "https://github.blog/2023-02-14-github-copilot-now-has-a-better-ai-model-and-new-capabilities/",
          "publishedOn": "2023-02-14T17:56:01.000Z",
          "wordCount": 1266,
          "title": "GitHub Copilot now has a better AI model and new capabilities"
        },
        {
          "id": "https://github.blog/?p=70062",
          "author": "Thomas Dohmke",
          "description": "GitHub Copilot is the world’s first at-scale AI developer tool and we’re now offering it to every developer, team, organization, and enterprise.",
          "link": "https://github.blog/2023-02-14-github-copilot-for-business-is-now-available/",
          "publishedOn": "2023-02-14T17:55:33.000Z",
          "wordCount": 1093,
          "title": "GitHub Copilot for Business is now available"
        },
        {
          "id": "https://github.blog/?p=70053",
          "author": "Kevin Xu",
          "description": "Our mission to accelerate human progress through developer collaboration requires us, from time to time, to fight against legal developments that would needlessly impair developers’ right to innovate. That’s why GitHub has filed an amicus brief in the appeal of Yout LLC v. Recording Industry of America, Inc.",
          "link": "https://github.blog/2023-02-13-yout-amicus-fighting-for-developers-right-to-innovate/",
          "publishedOn": "2023-02-13T17:00:55.000Z",
          "wordCount": 1306,
          "title": "Yout amicus: fighting for developers’ right to innovate"
        },
        {
          "id": "https://github.blog/?p=69941",
          "author": "Michelle Mannering",
          "description": "Welcome to our special edition of the Release Radar 🎄. Between Christmas festivities, end of the year parties, Chinese New Year, or simply enjoying some time off, almost everyone has been celebrating – us too! Now we’re taking a moment to celebrate these awesome open source projects that shipped major version releases during December and […]",
          "link": "https://github.blog/2023-02-08-release-radar-dec-2022-jan-2023/",
          "publishedOn": "2023-02-08T23:05:03.000Z",
          "wordCount": 2307,
          "title": "Release Radar, Festive Edition · December 2022 – January 2023"
        },
        {
          "id": "https://github.blog/?p=69904",
          "author": "Timothy Clem",
          "description": "A look at what went into building the world's largest public code search index.",
          "link": "https://github.blog/2023-02-06-the-technology-behind-githubs-new-code-search/",
          "publishedOn": "2023-02-06T17:00:46.000Z",
          "wordCount": 3552,
          "title": "The technology behind GitHub’s new code search"
        },
        {
          "id": "https://github.blog/?p=68491",
          "author": "Mark Paulsen",
          "description": "Explore how GitHub Advanced Security can help address several of the OWASP Top 10 vulnerabilities",
          "link": "https://github.blog/2023-02-06-how-to-mitigate-owasp-vulnerabilities-while-staying-in-the-flow/",
          "publishedOn": "2023-02-06T15:02:16.000Z",
          "wordCount": 1291,
          "title": "How to mitigate OWASP vulnerabilities while staying in the flow"
        },
        {
          "id": "https://github.blog/?p=70011",
          "author": "Lee Reilly",
          "description": "We’ve got ten top games from the latest Ludum Dare game jam plus source code for you to check out. Pun intended.",
          "link": "https://github.blog/2023-02-03-ludum-dare-52-staff-picks/",
          "publishedOn": "2023-02-04T01:55:37.000Z",
          "wordCount": 836,
          "title": "Ludum Dare 52 staff picks 🕹"
        },
        {
          "id": "https://github.blog/?p=69898",
          "author": "Thomas Dohmke",
          "description": "Below are my prepared remarks delivered at the EU Open Source Policy Summit in Brussels on Feb 3rd.",
          "link": "https://github.blog/2023-02-03-europes-chance-to-be-a-leader-in-the-age-of-ai/",
          "publishedOn": "2023-02-03T13:00:58.000Z",
          "wordCount": 2002,
          "title": "Europe’s chance to be a leader in the age of AI"
        },
        {
          "id": "https://github.blog/?p=69886",
          "author": "Steve Guntrip",
          "description": "Explore how the GitHub Docs team uses GitHub Projects for content coordination, reviews, and publishing.",
          "link": "https://github.blog/2023-02-02-how-the-github-docs-team-uses-github-projects/",
          "publishedOn": "2023-02-02T19:00:54.000Z",
          "wordCount": 1294,
          "title": "How the GitHub Docs team uses GitHub Projects"
        },
        {
          "id": "https://github.blog/?p=69851",
          "author": "Grant Birkinbine",
          "description": "What if developers want to leverage branch deployments but don't have a full ChatOps stack integrated with their repositories? We wanted to set out to find a way for all developers to be able to take advantage of branch deployments with ease, right from their GitHub repository, and so the branch-deploy Action was born!",
          "link": "https://github.blog/2023-02-02-enabling-branch-deployments-through-issueops-with-github-actions/",
          "publishedOn": "2023-02-02T18:03:36.000Z",
          "wordCount": 1743,
          "title": "Enabling branch deployments through IssueOps with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=69804",
          "author": "Sarah Oyetubo",
          "description": "The DEI Resource Hub is a vetted collection of resources, tools, and best practices designed to help open source maintainers create and maintain inclusive and diverse open source communities.",
          "link": "https://github.blog/2023-02-01-announcing-the-launch-of-the-all-in-for-maintainers-dei-resource-hub/",
          "publishedOn": "2023-02-01T23:00:15.000Z",
          "wordCount": 1326,
          "title": "Announcing the launch of the All In for Maintainers DEI Resource Hub"
        },
        {
          "id": "https://github.blog/?p=69793",
          "author": "Abby Cabunoc Mayes",
          "description": "We’re taking a look at how open source software has evolved on GitHub, and how the role of a maintainer and contributor has changed alongside the massive growth in open source software.",
          "link": "https://github.blog/2023-02-01-open-sources-impact-on-the-worlds-100-million-developers/",
          "publishedOn": "2023-02-01T18:01:36.000Z",
          "wordCount": 1193,
          "title": "Open source’s impact on the world’s 100 million developers"
        },
        {
          "id": "https://github.blog/?p=69788",
          "author": "Jakub Oleksy",
          "description": "In January, we experienced two incidents, one that resulted in degraded performance for Packages and Pages and another that impacted Git users.",
          "link": "https://github.blog/2023-02-01-github-availability-report-january-2023/",
          "publishedOn": "2023-02-01T16:00:30.000Z",
          "wordCount": 656,
          "title": "GitHub Availability Report: January 2023"
        },
        {
          "id": "https://github.blog/?p=69783",
          "author": "Demetris Cheatham",
          "description": "In the coming months, we’re scaling, expanding, and launching new programming to further DEI within open source communities.",
          "link": "https://github.blog/2023-01-31-skilling-for-the-future-how-github-is-advancing-diversity-equity-and-inclusion-within-open-source-communities/",
          "publishedOn": "2023-01-31T22:41:29.000Z",
          "wordCount": 1586,
          "title": "Skilling for the future: How GitHub is advancing diversity, equity, and inclusion within open source communities"
        },
        {
          "id": "https://github.blog/?p=69758",
          "author": "Alexis Wales",
          "description": "Update to the latest version of Desktop and previous version of Atom before February 2.",
          "link": "https://github.blog/2023-01-30-action-needed-for-github-desktop-and-atom-users/",
          "publishedOn": "2023-01-30T18:01:58.000Z",
          "wordCount": 1101,
          "title": "Action needed for GitHub Desktop and Atom users"
        },
        {
          "id": "https://github.blog/?p=69731",
          "author": "Alvaro Munoz",
          "description": "Object Graph Notation Language (OGNL) is a popular, Java-based, expression language used in popular frameworks and applications, such as Apache Struts and Atlassian Confluence. Learn more about bypassing certain OGNL injection protection mechanisms including those used by Struts and Atlassian Confluence, as well as different approaches to analyzing this form of protection so you can harden similar systems.",
          "link": "https://github.blog/2023-01-27-bypassing-ognl-sandboxes-for-fun-and-charities/",
          "publishedOn": "2023-01-27T16:00:49.000Z",
          "wordCount": 4364,
          "title": "Bypassing OGNL sandboxes for fun and charities"
        },
        {
          "id": "https://github.blog/?p=69711",
          "author": "Mark Paulsen",
          "description": "Laying the groundwork for developer-enabled compliance.",
          "link": "https://github.blog/2023-01-26-setting-the-foundations-for-compliance/",
          "publishedOn": "2023-01-26T17:00:18.000Z",
          "wordCount": 1615,
          "title": "Setting the foundations for compliance"
        },
        {
          "id": "https://github.blog/?p=69694",
          "author": "Thomas Dohmke",
          "description": "There are now 100 million developers around the world using GitHub. Here’s what this means—and why it’s just the beginning.",
          "link": "https://github.blog/2023-01-25-100-million-developers-and-counting/",
          "publishedOn": "2023-01-25T17:52:46.000Z",
          "wordCount": 746,
          "title": "100 million developers and counting"
        },
        {
          "id": "https://github.blog/?p=69672",
          "author": "Jill Moné-Corallo",
          "description": "We're excited to share the newest addition to our GitHub Bug Bounty Program!",
          "link": "https://github.blog/2023-01-23-introducing-the-github-bug-bounty-swag-store/",
          "publishedOn": "2023-01-23T17:00:58.000Z",
          "wordCount": 680,
          "title": "Introducing the GitHub Bug Bounty swag store"
        },
        {
          "id": "https://github.blog/?p=69576",
          "author": "Man Yue Mo",
          "description": "It turns out that the first “all Google” phone includes a non-Google bug. Learn about the details of CVE-2022-38181, a vulnerability in the Arm Mali GPU. Join me on my journey through reporting the vulnerability to the Android security team, and the exploit that used this vulnerability to gain arbitrary kernel code execution and root on a Pixel 6 from an Android app.",
          "link": "https://github.blog/2023-01-23-pwning-the-all-google-phone-with-a-non-google-bug/",
          "publishedOn": "2023-01-23T15:05:19.000Z",
          "wordCount": 5659,
          "title": "Pwning the all Google phone with a non-Google bug"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=20351",
          "author": "BU Team",
          "description": "Most of the time, financial apps are not built for the customer. But, when it comes to Nubank, we're different from everything.\nThe post How we created Tabs: a new UI for a new financial experience appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-we-created-tabs/",
          "publishedOn": "2023-02-17T21:17:47.000Z",
          "wordCount": 3757,
          "title": "How we created Tabs: a new UI for a new financial experience"
        },
        {
          "id": "https://building.nubank.com.br/?p=20309",
          "author": "Arthur Fücher - Developer Advocate at Nubank",
          "description": "If your company talks about diversity but doesn't discuss equal parental leave, it's time to start.\nThe post About fathers and daughters: my experience with Nubank’s parental leave appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/my-experience-with-nubanks-parental-leave/",
          "publishedOn": "2023-02-15T14:39:14.000Z",
          "wordCount": 3414,
          "title": "About fathers and daughters: my experience with Nubank’s parental leave"
        },
        {
          "id": "https://building.nubank.com.br/?p=20288",
          "author": "BU Team",
          "description": "A look into the career of a Product Operations at Nubank, the scope of work, and the main differences with other Product positions.\nThe post What is it like being a Product Operations at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/product-operations-at-nubank/",
          "publishedOn": "2023-02-10T19:22:56.000Z",
          "wordCount": 3298,
          "title": "What is it like being a Product Operations at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=20176",
          "author": "Keith Harper - Staff Software Engineer at Nubank",
          "description": "Query-stats is a new feature that gives users visibility into the decisions made by the query engine while it's processing your query.\nThe post Leveraging Datomic query-stats to Optimize Clause Ordering appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/optimizing-datomic-queries/",
          "publishedOn": "2023-02-03T21:58:12.000Z",
          "wordCount": 4045,
          "title": "Leveraging Datomic query-stats to Optimize Clause Ordering"
        },
        {
          "id": "https://building.nubank.com.br/?p=20161",
          "author": "Nubank Editorial",
          "description": "Do you want to know how to create a great design experience? Learn from Cris Luckner, NuConta's Design Manager.\nThe post Design experiences based on storytelling: Nubank’s framework appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/storytelling-nubanks-framework/",
          "publishedOn": "2023-01-27T13:53:00.000Z",
          "wordCount": 4996,
          "title": "Design experiences based on storytelling: Nubank’s framework"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/view-other-side-security-analysts-perspective-bug-bounty-triage",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/view-other-side-security-analysts-perspective-bug-bounty-triage",
          "publishedOn": "2023-02-18T02:55:39.000Z",
          "wordCount": 2875,
          "title": "The View from the Other Side: A Security Analyst's Perspective on Bug Bounty Triage"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/outsmart-cybercriminals-proactive-attack-surface-management-asm",
          "author": "Naz Bozdemir",
          "description": "Why is ASM Important?\nYour attack surface is the sum of all entry points an attacker could use to access your systems, applications, devices, or ne",
          "link": "https://www.hackerone.com/vulnerability-management/outsmart-cybercriminals-proactive-attack-surface-management-asm",
          "publishedOn": "2023-02-07T19:34:24.000Z",
          "wordCount": 1445,
          "title": "Outsmart Cybercriminals with Proactive Attack Surface Management (ASM)"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hacker-afk-rhynorater",
          "author": "HackerOne",
          "description": "Today's hacker Rhynorater\nJXoaT: Where did you first hear about hacking? What was your first exposure to it?\nRhynorater: So, my first exp",
          "link": "https://www.hackerone.com/hackerone-community-blog/hacker-afk-rhynorater",
          "publishedOn": "2023-02-06T18:14:20.000Z",
          "wordCount": 2776,
          "title": "Hacker AFK: Rhynorater"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-encryptsaan123",
          "author": "HackerOne",
          "description": "What made you want to become an ambassador? \nThere are several reasons why I decided to become an ambassador at HackerOne. Firstly, I am passion",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-encryptsaan123",
          "publishedOn": "2023-02-03T16:40:41.000Z",
          "wordCount": 1465,
          "title": "Ambassador Spotlight: Encryptsaan123"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/beyond-vdp-how-challenge-brings-proactive-security-your-agency",
          "author": "HackerOne",
          "description": "Vulnerability Disclosure Programs create an effective means for researchers and other users to report discovered vulnerabilities and weaknesses. Becau",
          "link": "https://www.hackerone.com/vulnerability-management/beyond-vdp-how-challenge-brings-proactive-security-your-agency",
          "publishedOn": "2023-01-31T14:00:00.000Z",
          "wordCount": 1345,
          "title": "Beyond a VDP: How a Challenge Brings Proactive Security to Your Agency"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/f19b400243",
          "author": "Netflix Technology Blog",
          "description": "We tackle some of the unique challenges of scaling multimodal machine learning models that operate on media assets (video, audio, and…",
          "link": "https://netflixtechblog.com/scaling-media-machine-learning-at-netflix-f19b400243?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-02-13T17:59:51.000Z",
          "wordCount": 2355,
          "title": "Scaling Media Machine Learning at Netflix"
        },
        {
          "id": "https://medium.com/p/295e4d788db5",
          "author": "Netflix Technology Blog",
          "description": "By Grace Tang, Aneesh Vartakavi, Julija Bagdonaite, Cristina Segalin, and Vi Iyengar",
          "link": "https://netflixtechblog.com/discovering-creative-insights-in-promotional-artwork-295e4d788db5?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-01-30T16:16:03.000Z",
          "wordCount": 1990,
          "title": "Discovering Creative Insights in Promotional Artwork"
        },
        {
          "id": "https://medium.com/p/f5ba9266d428",
          "author": "Netflix Technology Blog",
          "description": "In Marken (Scalable Annotation Service at Netflix), an annotation is a piece of metadata which can be attached to an object from any domain.",
          "link": "https://netflixtechblog.com/scalable-annotation-service-marken-f5ba9266d428?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-01-26T03:07:29.000Z",
          "wordCount": 2549,
          "title": "Scalable Annotation Service — Marken"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}