{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Guoli Ma, Sebastian Lekies &amp; Claudio Criscione, Google Vulnerability Management Team\n\nOne year ago, we published the Tsunami security scanner with the goal of detecting high severity, actively exploited vulnerabilities with high confidence. In the last several months, the Tsunami scanner team has been working closely with our vulnerability rewards program, Bug Hunters, to further improve Tsunami's security detection capabilities.\nToday, we are announcing a new experimental Patch Reward Program…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/QEPIl_i_moY/announcing-new-patch-reward-program-for.html",
          "publishedOn": "2021-09-28T13:00:00.002Z",
          "wordCount": 687,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing New Patch Reward Program for Tsunami Security Scanner"
        },
        {
          "description": "Posted by Priya Wadhwa and Appu Goundan, Google Open Source Security Team\n\n\nA few months ago we announced that we started signing all distroless images with cosign, which allows users to verify that they have the correct image before starting the build process. Signing our images was our first step towards fully securing the distroless supply chain. Since then, we’ve implemented even more accountability in our supply chain and are excited to announce that distroless builds have achieved SLSA 2. SLSA is a se…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/21fk7__SXrc/distroless-builds-are-now-slsa-2.html",
          "publishedOn": "2021-09-22T16:00:00.001Z",
          "wordCount": 6509,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Distroless Builds Are Now SLSA 2"
        },
        {
          "description": "Adrian Taylor, Andrew Whalley, Dana Jansens and Nasko Oskov, Chrome security team \nSecurity is a cat-and-mouse game. As attackers innovate, browsers always have to mount new defenses to stay ahead, and Chrome has invested in ever-stronger multi-process architecture built on sandboxing and site isolation. Combined with fuzzing, these are still our primary lines of defense, but they are reaching their limits, and we can no longer solely rely on this strategy to defeat in-the-wild attacks. \nLast year, we showe…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/XKkN9QXslxE/an-update-on-memory-safety-in-chrome.html",
          "publishedOn": "2021-09-21T17:00:00.001Z",
          "wordCount": 1040,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "An update on Memory Safety in Chrome"
        },
        {
          "description": "Posted by Kaylin Trychon, Google Open Source Security Team&nbsp;\n\nWe recently pledged to provide $100 million to support third-party foundations that manage open source security priorities and help fix vulnerabilities. As part of this commitment, we are excited to announce our support of the Open Source Technology Improvement Fund (OSTIF) to improve security of eight open-source projects.\nGoogle’s support will allow OSTIF to launch the Managed Audit Program (MAP), which will expand in-depth security reviews…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/J6olq6dpQeo/google-supports-open-source-technology.html",
          "publishedOn": "2021-09-15T18:17:00.003Z",
          "wordCount": 621,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Google Supports Open Source Technology Improvement Fund"
        },
        {
          "description": "Posted by Suzanne Frey, VP, Product, Android & Play Security and Privacy\n\nWe introduced Android’s Private Compute Core in Android 12 Beta. Today, we're excited to announce a new suite of services that provide a privacy-preserving bridge between Private Compute Core and the cloud.   \nRecap: What is Private Compute Core? \nAndroid’s Private Compute Core is an open source, secure environment that is isolated from the rest of the operating system and apps. With each new Android release we’ll add more privacy-pre…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/Omu-IejlSFU/introducing-androids-private-compute.html",
          "publishedOn": "2021-09-09T17:00:00.000Z",
          "wordCount": 813,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Android’s Private Compute Services"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "This is a super cool feature of Lighthouse (use it in PageSpeed Insights or Chrome Canary) that produces a visualization of JavaScript dependencies. Sourcemaps are required to get the per-module breakdown like you see below in GitHub’s results.\n\nDiscuss on Changelog News",
          "link": "https://sia.codes/posts/lighthouse-treemap/",
          "publishedOn": "2021-09-29T17:08:00.000Z",
          "wordCount": 1498,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Explore your JS dependencies with Lighthouse Treemap"
        },
        {
          "description": "This cool open source project provides transparent client-side encryption to be used with your cloud file storage of choice. Which choices, you ask?\nWorks with Dropbox, Google Drive, OneDrive, MEGA, pCloud, ownCloud, Nextcloud and any other cloud storage service which synchronizes with a local directory\n\nDiscuss on Changelog News",
          "link": "https://cryptomator.org/",
          "publishedOn": "2021-09-29T16:21:00.000Z",
          "wordCount": 916,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Cryptomator – put a lock on your cloud files"
        },
        {
          "description": "Chris Coyier does a great job rounding up and summarizing conversations around #AppleBrowserBan:\nJust last week I got one of those really?! 🤨 faces when this fact came up in conversation amongst smart and engaged fellow web developers: there is no browser choice on iOS. It’s all Safari. You can download apps that are named Chrome or Firefox, or anything else, but they are just veneer over Safari. If you’re viewing a website on iOS, it’s Safari.\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/ios-browser-choice/",
          "publishedOn": "2021-09-29T14:02:00.000Z",
          "wordCount": 1798,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "On (the lack of) iOS browser choice"
        },
        {
          "description": "Polarity Mapping is a framework to “help problems be solved in a realistic and multidimensional manner” (see here for more info). In this week’s fully connected episode, Chris and Daniel use this framework to help them discuss how an organization can strike a good balance between human intelligence and AI. AI can’t solve everything and humans need to be in-the-loop with many AI solutions.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSpo…",
          "link": "https://changelog.com/practicalai/151",
          "publishedOn": "2021-09-28T21:20:00.000Z",
          "wordCount": 435,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 151: Balancing human intelligence with AI"
        },
        {
          "description": "Recently I discovered additional reasons to write tests for my code! Besides obvious and well-known ones described in books and many blog posts, I realized that the process of writing tests has also psychological effects for me. These effects are especially helpful in cases of hotfixes that need to be deployed as soon as possible.\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/why-do-i-write-tests/",
          "publishedOn": "2021-09-28T14:28:00.000Z",
          "wordCount": 409,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why do I write tests?"
        },
        {
          "description": "When most teams complain about poor quality, they usually mean reliability woes; however, quality spans a more extensive spectrum and can mean many things. This post posits a quality hierarchy that identifies the pertinent challenges and helps with making the right tradeoffs.\nDiscuss on Changelog News",
          "link": "https://abdulapopoola.com/2021/09/22/no-surprises-a-framework-for-software-quality/",
          "publishedOn": "2021-09-28T13:36:00.000Z",
          "wordCount": 1872,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A framework for software quality (no surprises)"
        },
        {
          "description": "In this video I kick the tires on Mat Ryer’s xbar, an open source utility that lets you “put anything in your macOS menu bar.” I get it to tell us dad jokes, keep us abreast of Covid case counts, and write a custom plugin that pulls from Plausible Analytics to display changelog.com’s real-time visitor count.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=Ai6HquEyEak",
          "publishedOn": "2021-09-27T21:42:00.000Z",
          "wordCount": 25,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Let's use xbar to show changelog.com's real-time visitors in the menu bar"
        },
        {
          "description": "Eugene Yan, in a post titled The first rule of machine learning: start without machine learning:\nApplying machine learning effectively is tricky. You need data. You need a robust pipeline to support your data flows. And most of all, you need high-quality labels. As a result, most of the time, my first iteration doesn’t involve machine learning at all.\nEugene is stating the obvious with this post, but hey sometimes you just gotta state it. What’s even more interesting to me is how nicely the format generaliz…",
          "link": "https://eugeneyan.com/writing/first-rule-of-ml/",
          "publishedOn": "2021-09-27T14:57:00.000Z",
          "wordCount": 1624,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The first rule of X: start without X"
        },
        {
          "description": "Datree is a CLI tool that supports Kubernetes admins in their roles, by preventing developers from making errors in Kubernetes configurations that can cause clusters to fail in production. Our CLI tool is open source, enabling it to be supported by the Kubernetes community.\nIt’s far more effective than manual processes, such as sending an email to a slew of developers, begging them to set various limits, which likely falls on deaf ears because developers are already overwhelmed.\nIn addition the CIL, Datree …",
          "link": "https://github.com/datreeio/datree",
          "publishedOn": "2021-09-27T14:05:00.000Z",
          "wordCount": 1125,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Datree is a CLI to ensure K8s manifests and Helm charts follow best practices"
        },
        {
          "description": "In this post, I cover in a step by step manner how to do software estimation for project bids where there is limited clarity and a lot of ambiguity. I cover how we can use an uncertainty factor to cover the unknowns, questions/things to ask/consider at each step of the software estimation process, and some practical advice. This process is based on estimates I have done for multiple projects in the last couple of years.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2021/09/23/doing-software-estimation-within-constraints-of-hofstadters-law-and-parkinsons-law/",
          "publishedOn": "2021-09-27T13:18:00.000Z",
          "wordCount": 3136,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "My software estimation process"
        },
        {
          "description": "This week we’re talking with Evan Weaver about Fauna — the database for a new generation of applications. Fauna is a transactional database delivered as a secure and scalable cloud API with native GraphQL. It’s the first implementation of its kind based on the Calvin paper as opposed to Spanner. We cover Evan’s history leading up to Fauna, deep details on the Calvin algorithm, the CAP theorem for databases, what it means for Fauna to be temporal native, applications well suited for Fauna, and what’s to come…",
          "link": "https://changelog.com/podcast/461",
          "publishedOn": "2021-09-24T21:30:00.000Z",
          "wordCount": 524,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 461: Fauna is rethinking the database"
        },
        {
          "description": "This is our second Kaizen episode, where Adam, Jerod &amp; Gerhard talk about changelog.com improvements since episode 10. OK, so Gerhard deleted the DNS API token. Not only did he take the time to understand how that happened, so that he could actually learn from his mistake, but now we have a system in place so that we can share learnings from incidents. By the way, these are publicly available in our #incidents Slack channel.\nA great and unexpected thing that happened since we recorded this, is Jerod fix…",
          "link": "https://changelog.com/shipit/20",
          "publishedOn": "2021-09-24T20:00:00.000Z",
          "wordCount": 633,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 20: Kaizen! Five incidents later"
        },
        {
          "description": "Chris McCord gives a deep history on Phoenix LiveView, going all the way back to the state of Ruby on Rails in 2013 up to the present. A 30-minute read! (LiveView-based uploads looks particularly interesting to me, since I’m rewriting how our uploads work at the moment.)\nDiscuss on Changelog News",
          "link": "https://fly.io/blog/how-we-got-to-liveview/",
          "publishedOn": "2021-09-24T18:50:00.000Z",
          "wordCount": 3590,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How we got to LiveView"
        },
        {
          "description": "Mitch and Andrew from the 1Password team talk with Amal and Nick about the company’s transition to Electron and web technologies, and how the company utilized its existing web stack to shape the future of its desktop experience.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance…",
          "link": "https://changelog.com/jsparty/194",
          "publishedOn": "2021-09-24T16:00:00.000Z",
          "wordCount": 456,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 194: 1Password is all in on its web stack"
        },
        {
          "description": "This is part 1 of a 5-part series on learning Astro, a new-kid-on-the-block static site builder that’s capturing the hearts of web developers due to its Bring Your Own Framework (BYOF) approach and Zero Emitted JS (ZEJS?) by default.\nThroughout this series, I’ll walk you, step-by-step, through building an Astro-based blog(codenamed: Astro-Ink). You’ll discover more of Astro, its benefits, and super-interesting constructs and patterns that Astro brings to the table.\nDiscuss on Changelog News",
          "link": "https://aalam.in/blog/astro-get-up-and-running",
          "publishedOn": "2021-09-24T13:31:00.000Z",
          "wordCount": 2678,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Get up & running with Astro"
        },
        {
          "description": "Ever wonder how new features get added to the go command? Or where tools like gopls come from? Well, there’s an open team that handles just those things.\nJust like the programming language itself, many of the tools that Go engineers use everyday are discussed and developed in the open. In this episode we’ll talk about this team, how it started, where it’s going, and how you can get involved.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\n…",
          "link": "https://changelog.com/gotime/198",
          "publishedOn": "2021-09-23T20:30:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 198: The little known team that keeps Go going"
        },
        {
          "description": "This is a continuation of bashtop and bpytop only in C++. Linux today, but macOS &amp; BSD are planned.\n\nDiscuss on Changelog News",
          "link": "https://github.com/aristocratos/btop",
          "publishedOn": "2021-09-23T20:19:01.000Z",
          "wordCount": 2885,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "BTOP++ is a power resource monitor for Linux"
        },
        {
          "description": "Craig Kerstiens on the little wins coming in Postgres 14, which is scheduled for the end of September:\nPostgres is, and for some time will continue to be, the first database I turn to. As Postgres focuses on the little things, it just deepens my commitment to it. Why look elsewhere when the bond just grows over time? So today I wanted to call some extra attention to those little things, the ones that don’t get the spotlight, but simply make a developer’s life better.\nHe goes on to highlight the JSON syntax …",
          "link": "https://blog.crunchydata.com/blog/postgres-14-its-the-little-things",
          "publishedOn": "2021-09-23T19:30:00.000Z",
          "wordCount": 1177,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Postgres 14: it's the little things"
        },
        {
          "description": "Trisha Gee writes (because Someone Is Wrong On The Internet):\nThe problem is not that we shouldn’t write readable code. Of course we should aim to write readable code, if only for our own poor selves further down the line (there is no one less capable of reading my code the following week than me). The problem is that these two issues are not mutually exclusive. It’s not “write readable code” or “learn to read code”. That’s like saying, “I’m going to drive really economically so I don’t need to put petrol i…",
          "link": "https://trishagee.com/2020/09/07/reading-code-is-a-skill/",
          "publishedOn": "2021-09-23T13:57:00.000Z",
          "wordCount": 3361,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reading code is a skill"
        },
        {
          "description": "I’ve never gone full mouseless (nor do I necessarily recommend it), but there’s extreme productivity wins to be mined by keeping your hands on the home row as much as possible.\nBuilding a development environment with the shell as a keystone offers multiple benefits. You can use tools that fit nicely with each other, you can customize everything depending on your own needs, and the biggest of all, you can control your entire development environment with your keyboard. This can save a lot of cognitive energy …",
          "link": "https://www.smashingmagazine.com/2021/09/mouseless-development-environment/",
          "publishedOn": "2021-09-23T13:10:00.000Z",
          "wordCount": 4144,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to build your own mouseless development environment"
        },
        {
          "description": "Dan Moren writing for Six Colors:\nSafari Keyword Search is a little tool that allows you to define shortcuts for searching specific sites. For example, you could type “imdb George Clooney” to be taken directly to the IMDb search results for George Clooney, or “w iPhone 13” to go straight to the Wikipedia page for the iPhone 13. You can also define your own shortcuts, so, for example, I’ve defined “sc” as a Google search limited to sixcolors.com, which helps me quickly turn up articles here…\nOn iOS 15, Mobil…",
          "link": "https://sixcolors.com/post/2021/09/safari-keyword-search-hits-2-0-comes-to-ios/",
          "publishedOn": "2021-09-22T14:35:00.000Z",
          "wordCount": 472,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Safari Keyword Search hits 2.0, comes to iOS"
        },
        {
          "description": "Nice is a highly customizable and lightweight framework for crafting CLI apps.\nNice respects idiomatic Go code and focuses to be clear, efficient and easy to write and maintain.\nYou can use it as a full-featured non-opinionated framework or use any nice packages as stand-alone libraries.\nI’m a big fan of the similar projects section in the README. Classy!\n\nDiscuss on Changelog News",
          "link": "https://github.com/SuperPaintman/nice",
          "publishedOn": "2021-09-22T13:47:00.000Z",
          "wordCount": 693,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A highly customizable and lightweight framework for crafting Go CLIs"
        },
        {
          "description": "Will McGugan is a full-stack developer and Python expert who is offering up free reviews for any/all qualifying open source projects.What a great idea/service to the community!\nThe reviews will focus on API design and general architection of your project with a view to making them a) more maintainable b) future proof and c) user friendly, but will avoid anything that a linter could do for you. Reviews are intended to be constructive and hopefully give advice you can act on, but are in no way a “grade”.\nI wo…",
          "link": "https://github.com/willmcgugan/codereviews",
          "publishedOn": "2021-09-21T19:05:00.000Z",
          "wordCount": 686,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Free code reviews for open source Python projects"
        },
        {
          "description": "As you start developing an AI/ML based solution, you quickly figure out that you need to run workflows. Not only that, you might need to run those workflows across various kinds of infrastructure (including GPUs) at scale. Ville Tuulos developed MetaFlow while working at Netflix to help data scientists scale their work. In this episode, Ville tells us a bit more about MetaFlow, his new book on data science infrastructure, and his approach to helping scale ML/AI work.\nDiscuss on Changelog News\nJoin Changelog…",
          "link": "https://changelog.com/practicalai/150",
          "publishedOn": "2021-09-21T14:45:00.000Z",
          "wordCount": 387,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 150: From notebooks to Netflix scale with MetaFlow"
        },
        {
          "description": "Encore now supports the two most highly requested features from our users!\nNative support for building REST APIs\nSupport for ORMs and other database query helpers\nEncore v0.17 also comes with improvements to authentication, and lots of minor improvements and bug fixes!\nDiscuss on Changelog News",
          "link": "https://encore.dev/blog/encore-v0.17",
          "publishedOn": "2021-09-21T14:00:00.000Z",
          "wordCount": 736,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Time to REST — Encore v0.17 is released"
        },
        {
          "description": "Alexey Milovidov, announcing the formation of a (VC funded) corporation around ClickHouse, an open source analytics DBMS:\nToday I’m happy to announce ClickHouse Inc., the new home of ClickHouse. The development team has moved from Yandex and joined ClickHouse Inc. to continue building the fastest (and the greatest) analytical database management system. The company has received nearly $50M in Series A funding led by Index Ventures and Benchmark with participation by Yandex N.V. and others. I created ClickHo…",
          "link": "https://clickhouse.com/blog/en/2021/clickhouse-inc/",
          "publishedOn": "2021-09-20T19:33:00.000Z",
          "wordCount": null,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Introducing ClickHouse, Inc."
        },
        {
          "description": "Seed is a Rust framework that uses an Elm-like architecture to help you build fast and reliable web apps that run on WebAssembly. Here’s why you might want to use it:\nSeed allows you to develop the front-end with all the benefits of Rust, meaning speed, safety, and too many more things to count.\nThe Seed templating system uses a macro syntax that makes Rustaceans feel right at home. This means linting, formatting, and commenting will work, and it’s all in Rust. This is opposed to a JSX-like syntax that reli…",
          "link": "https://github.com/seed-rs/seed",
          "publishedOn": "2021-09-20T18:45:00.000Z",
          "wordCount": 1069,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Seed – build your frontend in Rust"
        },
        {
          "description": "Following thanks to all contributors, the blog notes:\nMost applications that worked with OpenSSL 1.1.1 will still work unchanged and will simply need to be recompiled (although you may see numerous compilation warnings about using deprecated APIs). Some applications may need to make changes to compile and work correctly, and many applications will need to be changed to avoid the deprecations warnings.\nAnd points out a couple of new features:\nOpenSSL 3.0 introduces a number of new concepts that application d…",
          "link": "https://www.openssl.org/blog/blog/2021/09/07/OpenSSL3.Final/",
          "publishedOn": "2021-09-20T17:51:00.000Z",
          "wordCount": 661,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "OpenSSL 3.0: API and license changes"
        },
        {
          "description": "After seeing TODO or die in Rust here a few days ago, I wanted to have the same feature available in Python. No reason this should only be available in Ruby and Rust. Python deserved better TODOs too!\nDiscuss on Changelog News",
          "link": "https://github.com/achedeuzot/py-todo-or-die",
          "publishedOn": "2021-09-20T16:58:00.000Z",
          "wordCount": 742,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Todo or Die - Python Edition"
        },
        {
          "description": "This post is a confession of an “egocentric maniac” (his words) and how damaging code review can be:\nThis review I kicked off the article with? I didn’t send it. Instead I gave the guy a couple of comments and politely asked to fix a couple of things. No big deal if the code’s not good, I can fix it myself it I need to. But I can’t fix the psyche of a guy broken by dozens of harsh reviews.\nMy personality today isn’t my disease. It’s a disease of the whole industry, at least in Russia. Our mentality is predi…",
          "link": "https://habr.com/en/post/440736/",
          "publishedOn": "2021-09-20T16:08:00.000Z",
          "wordCount": 1828,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I ruin developers’ lives with my code reviews and I'm sorry"
        },
        {
          "description": "This week we’re joined by Adam Jacob, CEO of System Initiative and Co-Founder of Chef, about open source business models and the model he thinks is the right one to choose, his graceful exit from Chef and some of the details behind Chef’s acquisition in 2020 for $220 million…in cash, and how his perspective on open source has or has not changed as a result. Adam also shared as much stealth mode details as he could about System Initiative.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get c…",
          "link": "https://changelog.com/podcast/460",
          "publishedOn": "2021-09-17T20:30:00.000Z",
          "wordCount": 545,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 460: The business model of open source"
        },
        {
          "description": "Russel Goldenberg &amp; Caitlyn Ralph from The Pudding join Amelia &amp; Nick to talk about how they create data-driven, interactive articles, how the team works on both The Pudding’s data journalism articles and Polygraph’s client work. We also dive into how the team works with contractors and how the company manages itself using a Holocratic method.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and P…",
          "link": "https://changelog.com/jsparty/193",
          "publishedOn": "2021-09-17T16:30:00.000Z",
          "wordCount": 447,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 193: Puddin' together cool data-driven essays"
        },
        {
          "description": "Chris Fidao:\nI’ve been using AWS “professionally” since about 2015. In that time, I’ve made lots of mistakes.\nOther than occasionally deleting production data, the mistakes all arose from ignorance - there’s so much to know about AWS that it’s easy to miss something important.\nHere’s a collection of the most commonly missed things when using AWS with Laravel Forge!\nLearning from your mistakes is powerful. Learning from other people’s mistakes can be just as powerful without the major drawback of, you know, …",
          "link": "https://laravel-news.com/aws-mistakes",
          "publishedOn": "2021-09-17T15:12:00.000Z",
          "wordCount": 1199,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mistakes I've made in AWS"
        },
        {
          "description": "This week Emile Vauge, founder &amp; CEO of Traefik, joins Gerhard to share a story that started as a solution to a 2000 microservices challenge, the real-world implications of shipping many times a day for years, and the difficulties of sustaining an inclusive and healthy open-source community while building a product company.\nWorking every day on keeping the open-source community in sync with the core team was an important lesson. The second learning was around big changes between major versions.\nThe jour…",
          "link": "https://changelog.com/shipit/19",
          "publishedOn": "2021-09-17T14:25:00.000Z",
          "wordCount": 536,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 19: Real-world implications of shipping many times a day"
        },
        {
          "description": "At the moment, there is only a dozen emoji sets, most of them from big tech companies. These emoji are visually adapted to the respective appearance of their software platforms. In addition, the usage rights are often very restrictive (e.g. the terms of use of Apple’s emoji).\nThat is why we have developed OpenMoji as the first open source and independent emoji system to date. When designing the OpenMoji system, we have developed visual guidelines that are not linked to a specific branding. In addition, our …",
          "link": "https://openmoji.org/",
          "publishedOn": "2021-09-17T13:51:00.000Z",
          "wordCount": 680,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "OpenMoji – open source emojis for the rest of us"
        },
        {
          "description": "Natalie sits down with Go book authors Bill Kennedy &amp; Sau Sheong Chang to discuss the ins and outs of writing (and reading) books about Go!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug is…",
          "link": "https://changelog.com/gotime/197",
          "publishedOn": "2021-09-16T18:20:00.000Z",
          "wordCount": 388,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 197: Books that teach Go"
        },
        {
          "description": "Wise words from Rach Smith:\nWhat I’ve learnt through experience is that the number of languages I’ve learned or the specific frameworks I’ve gained experience with matters very little. What actually matters is my ability to up-skill quickly and effectively. My success so far has nothing to do with the fact I know React instead of Vue, or have experience with AWS and not Azure. What has contributed to my success is the willingness to learn new tools as the need arises.\nDiscuss on Changelog News",
          "link": "https://rachsmith.com/i-completely-ignored-the-front-end-development-scene-for-6-months-it-was-fine/",
          "publishedOn": "2021-09-16T15:05:00.000Z",
          "wordCount": 599,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I completely ignored the front end development scene for 6 months. It was fine"
        },
        {
          "description": "The author of this site handed a neural network brief text descriptions of a bunch of movies and let it generate image that represent each. Read how he did it or just have fun trying to guess the movie titles from the images. Harder than I thought it’d be!\n\nDiscuss on Changelog News",
          "link": "https://noahveltman.com/aimovies/",
          "publishedOn": "2021-09-16T14:15:00.000Z",
          "wordCount": 271,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "AI movie posters"
        },
        {
          "description": "In this article, three experts discuss some of the key findings of the State of Technical Debt 2021 report including the impact of technical debt on engineering teams, the pros and cons of dealing with maintenance work continuously, the future of technical debt, and what each engineering teams can do to communicate the importance of dealing with technical debt to leadership.\nRemember, not all tech debt is bad, but even good tech debt has its ramifications. Solid insights here.\nDiscuss on Changelog News",
          "link": "https://www.infoq.com/articles/reduce-technical-debt/",
          "publishedOn": "2021-09-15T15:47:00.000Z",
          "wordCount": 5688,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Technical debt isn't technical: what companies can do to reduce technical debt"
        },
        {
          "description": "Here’s how Tom Payne describes his project:\nchezmoi is a popular dotfile manager (currently over 4.5K stars on GitHub and increasing quickly). chezmoi helps you get your prefered environment synchronized across multiple machines (e.g. your home desktop, your work laptop, and a temporary development container in the cloud) while easily coping with differences from machine to machine and keeping all your secrets safe either with your password manager or encryption. Using chezmoi feels very much like using git…",
          "link": "https://github.com/twpayne/chezmoi",
          "publishedOn": "2021-09-15T14:52:00.000Z",
          "wordCount": 1627,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Easy, secure dotfiles management with chezmoi"
        },
        {
          "description": "Any AI play that lacks an underlying data strategy is doomed to fail, and a big part of any data strategy is labeling. Michael, from Label Studio, joins us in this episode to discuss how the industry’s perception of data labeling is shifting. We cover open source tooling, validating labels, and integrating ML/AI models in the labeling loop.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline …",
          "link": "https://changelog.com/practicalai/149",
          "publishedOn": "2021-09-14T20:30:00.000Z",
          "wordCount": 357,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 149: Trends in data labeling"
        },
        {
          "description": "A (short) must-read piece from rachelbythebay:\n“Everyone knows” that code is something you type into a computer, that gets interpreted by a computer, and is run by a computer. But that’s not really the end of it. Before that, it’s being “run” on whoever’s working on it. After that, it’s “running” on whoever’s digging into it to fix a bug or add some feature.\nYou can throw all kinds of wicked, nasty, complicated, Klein-bottle-wannabe tricks into code and the computer will shrug and slog on through it.\nTry fe…",
          "link": "https://rachelbythebay.com/w/2021/09/05/clever/",
          "publishedOn": "2021-09-14T14:51:00.000Z",
          "wordCount": 478,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Code runs on people. Please keep it simple."
        },
        {
          "description": "This is phoboslab’s entry in this year’s JS 13k Games competition. Stunning what you can accomplish with so little. View the source right here and play the game (desktop only) right here.\n\nDiscuss on Changelog News",
          "link": "https://js13kgames.com/entries/q1k3",
          "publishedOn": "2021-09-14T13:48:00.000Z",
          "wordCount": 181,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An homage to Quake in 13kb of JS"
        },
        {
          "description": "I read about KDL (pronounced “cuddle”) over the weekend. Color me impressed!\nKat (and others) put a lot of thought into this.\nKDL is a document language with xml-like semantics that looks like you’re invoking a bunch of CLI commands! It’s meant to be used both as a serialization format and a configuration language, much like JSON, YAML, or XML.\nCheck out the FAQ for all the common objections (like why not YAML or TOML or ETC) as well as a note about the XKCD comic you’re probably thinking about. Here’s hopi…",
          "link": "https://kdl.dev/",
          "publishedOn": "2021-09-13T22:12:00.000Z",
          "wordCount": 1448,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The KDL document language"
        },
        {
          "description": "Chris Coyier on some of the new(ish) CSS compilers (such as Assembler) and how they’re flipping the script:\nThe popular Tailwind framework supports it. It kind of flips the mental model of Tailwind on its head, to me. Rather than providing a huge pile of CSS utility classes to use — then “purging” what is unused — it only creates what it needs to begin with.\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/just-in-time-css/",
          "publishedOn": "2021-09-13T14:14:00.000Z",
          "wordCount": 2121,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "“Just in Time” CSS"
        },
        {
          "description": "The latest Phoenix release ditches webpack and npm for esbuild and… nothing?\nOf course, these are just the defaults — docs for Elixir’s esbuild clearly state that NPM is still supported and you can always pass --no-assets and do things 100% your way. But it’s easy to underestimate the power of defaults, especially those that cover area outside of target audience’s expertise — which is the case of Phoenix devs and JS bundlers.\nIn this post, the author lays out how they stitched together an esbuild + npm setu…",
          "link": "https://cloudless.studio/wrapping-your-head-around-assets-in-phoenix-1-6",
          "publishedOn": "2021-09-13T13:26:00.000Z",
          "wordCount": null,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wrapping your head around assets in Phoenix 1.6"
        },
        {
          "description": "On this special edition of The Changelog, we’re talking with Cory Wilkerson, Senior Director of Engineering at GitHub, about GitHub Codespaces. For years now, the possibility of coding in the cloud seemed so close, yet so far away for a number of reasons. According to Cory, the raw ingredients to make coding in the cloud a reality have been there for years. The challenge has really been how the industry thinks, and we are now at a place where the skepticism in cloud based workflows is “non-existent.”\nAfter …",
          "link": "https://changelog.com/podcast/459",
          "publishedOn": "2021-09-11T04:00:00.000Z",
          "wordCount": 439,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 459: Coding in the cloud with Codespaces"
        },
        {
          "description": "This looks great for those of us who haven’t memorized the command-line flags yet.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jely2002/youtube-dl-gui",
          "publishedOn": "2021-09-10T19:28:00.000Z",
          "wordCount": 1069,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "youtube-del gets an Electron-based GUI"
        },
        {
          "description": "Migrating off jQuery? So was Sachin Neravath:\nMost of the projects use only 15% to 20% or less than 30% of the jquery methods And in most of the cases, I didn’t want to support all the edge cases or legacy browsers. The hardest part was finding the jQuery methods in the existing project and writing the alternative vanilla js methods without making much changes in the codebase. So I wrote this library which automatically finds jquery methods in any particular JavaScript file and generates readable, chainable…",
          "link": "https://github.com/sachinchoolur/replace-jquery",
          "publishedOn": "2021-09-10T18:36:00.000Z",
          "wordCount": 2214,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Auto-generate vanilla JS alternatives for jQuery methods"
        },
        {
          "description": "Your favorite web dev podcasts join forces for a super collab that’ll knock you frontend off! Amelia joins Chris Coyier and Dave Rupert from ShopTalk Show while Divya teams up with Wes Box &amp; Scott Tolinski from Syntax. Let the FEUDing begin!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool For Startups – More and more startups are using Retool to focus their time on their core product. That’s exactly why Retool launched …",
          "link": "https://changelog.com/jsparty/192",
          "publishedOn": "2021-09-10T16:15:00.000Z",
          "wordCount": 492,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 192: Frontend Feud: ShopTalk vs Syntax"
        },
        {
          "description": "Amazon EKS Anywhere is a new deployment option for Amazon EKS that enables you to easily create and operate Kubernetes clusters on-premises with your own virtual machines. It brings a consistent AWS management experience to your data center, building on the strengths of Amazon EKS Distro, the same distribution of Kubernetes that powers EKS on AWS. Its goal is to include full lifecycle management of multiple Kubernetes clusters that are capable of operating completely independently of any AWS services.\nDiscu…",
          "link": "https://github.com/aws/eks-anywhere",
          "publishedOn": "2021-09-10T13:41:00.000Z",
          "wordCount": 999,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "You can now run Amazon EKS on your own infra"
        },
        {
          "description": "In this episode, Gerhard talks to David and Marques from Equinix Metal about the importance of bare metal for steady workloads. Terraform, Kubernetes and Tinkerbell come up, as does Crossplane - this conversation is a partial follow-up to episode 15.\nDavid Flanagan, a.k.a. Rawkode, needs no introduction. Some of you may remember Marques Johansson from The new changelog.com setup for 2019. Marques was behind the Linode Terraforming that we used at the time, and our infrastructure was simpler because of it!\nT…",
          "link": "https://changelog.com/shipit/18",
          "publishedOn": "2021-09-09T21:00:00.000Z",
          "wordCount": 579,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 18: Bare metal meets Kubernetes"
        },
        {
          "description": "Building software is difficult and time consuming, but the maintenance of software is where we spend the majority of our time. In this episode, Ian and sam join Johnny and Kris to discuss how to build actually maintainable software, the features of Go that make it good for writing maintainable software, and different ways that we might define the term “maintenance”.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Telepo…",
          "link": "https://changelog.com/gotime/196",
          "publishedOn": "2021-09-09T15:00:00.000Z",
          "wordCount": 416,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 196: Building actually maintainable software"
        },
        {
          "description": "You gently face-palm and let out a groan. Your bug is so obvious now. How did you miss it before? Thank goodness you didn’t blame Bob publicly.\nIn this blog post we will look at how to get unstuck with things you do not understand (yet). It’s a methodical approach to solving insight problems - problems where all the information is known but you need to see it a different light to solve it. We start from writing down the problem and move through increasingly more esoteric phases such as changing location to …",
          "link": "https://www.iamjonas.me/2021/08/i-dont-understand-this-yet.html",
          "publishedOn": "2021-09-09T14:50:00.000Z",
          "wordCount": 2352,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I don't understand this (yet)"
        },
        {
          "description": "Should you use small or large instances in a Kubernetes cluster? It depends. You should consider a few factors when selecting an instance type:\nWhat kind of workloads you deploy (i.e. memory and CPU requirements).\nThe blast radius you can tolerate.\nHow you design your HA strategy.\nHow many resources are available to the pods.\nThis calculator helps you select what’s right from over 700 instances from the major cloud providers.\nDiscuss on Changelog News",
          "link": "https://learnk8s.io/kubernetes-instance-calculator",
          "publishedOn": "2021-09-09T14:04:00.000Z",
          "wordCount": 2072,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Kubernetes instance calculator"
        },
        {
          "description": "Emma Hyde:\nI have seen a staggering amount of Ruby is Dead missives in the last few years, and a decline, or at least, an often discussed decline, of the language’s popularity and ranking. But what makes Ruby so much worse than other languages?\nShe goes on to discuss how Ruby 3.0 addresses two of the most criticized elements of Ruby: its ability to handle processes simultaneously and and its overall performance.\nDiscuss on Changelog News",
          "link": "https://medium.com/retention-science/ruby-is-still-a-diamond-b789d2661266",
          "publishedOn": "2021-09-09T13:15:00.000Z",
          "wordCount": 3408,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ruby is still a diamond"
        },
        {
          "description": "This is a ~15 minute presentation (with transcript) by Álvaro Hernández at a Data on Kubernetes Community event about why he believes Kubernetes solves a big problem with running Postgres in production.\nRunning a Postgres installation, with or without containers, is trivial. However, setting up a production environment is a whole different matter. Postgres is not by itself a production-ready software: it requires a set of side tools to complement its functionality: connection pooling, monitoring, backup too…",
          "link": "https://dok.community/blog/deploying-postgres-on-kubernetes/",
          "publishedOn": "2021-09-08T19:43:00.000Z",
          "wordCount": 4073,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why you should be deploying Postgres primarily on Kubernetes"
        },
        {
          "description": "git-cliff can generate changelog files from the Git history by utilizing conventional commits as well as regex-powered custom parsers. The changelog template can be customized with a configuration file to match the desired format.\n\nDiscuss on Changelog News",
          "link": "https://github.com/orhun/git-cliff",
          "publishedOn": "2021-09-08T14:03:00.000Z",
          "wordCount": 3121,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Generate a changelog from your conventional git commits"
        },
        {
          "description": "This week we’re bringing JS Party to The Changelog — Nick Nisi and Christopher Hiller had an awesome conversation with Luis Villa, co-founder and General Counsel at Tidelift. They discuss GitHub Copilot and the implications of an AI pair programmer and fair use from a legal perspective.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGitpod – Spin up fresh, ephemeral automated dev environments, in the cloud, in seconds. Their free…",
          "link": "https://changelog.com/podcast/458",
          "publishedOn": "2021-09-08T12:00:00.000Z",
          "wordCount": 522,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 458: We ask a lawyer about GitHub Copilot"
        },
        {
          "description": "htmlq uses CSS selectors to extract bits of content from HTML files. Mozilla’s MDN has a good reference for CSS selector syntax.\nThis looks super handy. Examples!\n// Find part of a page by ID\ncurl --silent https://www.rust-lang.org/ | htmlq '#get-help'\n\n// Find all links in a page\ncurl --silent https://www.rust-lang.org/ | htmlq --attribute href a\n\n// Get the text content of a post\ncurl --silent https://nixos.org/nixos/about.html | htmlq  --text .main\n\nDiscuss on Changelog News",
          "link": "https://github.com/mgdm/htmlq",
          "publishedOn": "2021-09-07T19:04:00.000Z",
          "wordCount": 924,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tool like jq, but for HTML"
        },
        {
          "description": "Yonatan Geifman of Deci makes Daniel and Chris buckle up, and takes them on a tour of the ideas behind his amazing new inference platform.  It enables AI developers to build, optimize, and deploy blazing-fast deep learning models on any hardware.  Don’t blink or you’ll miss it!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipe…",
          "link": "https://changelog.com/practicalai/148",
          "publishedOn": "2021-09-07T18:00:00.000Z",
          "wordCount": 382,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 148: Stellar inference speed via AutoNAS"
        },
        {
          "description": "Problem: TODOs as comments are too often forgotten or neglected\nSolution: TODOs as code that triggers compile errors based on set criteria\n// trigger a compile error if we're past a certain date\ntodo_or_die::after_date!(3000, 1, 1); // its the year 3000!\n\n// or a GitHub issue has closed\ntodo_or_die::issue_closed!(&quot;rust-lang&quot;, &quot;rust&quot;, 44265); // GATs are here!\n\n// or the latest version of a crate matches some expression\ntodo_or_die::crates_io!(&quot;serde&quot;, &quot;&gt;1.0.9000&quot;);…",
          "link": "https://github.com/davidpdrsn/todo-or-die",
          "publishedOn": "2021-09-07T16:06:00.000Z",
          "wordCount": 588,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "These TODOs will self-destruct in 10... 9..."
        },
        {
          "description": "I’ve often wondered this as well. My conclusion, after not thinking too deeply about the issue, was that it’s a combination of the difficulty in match making and poor tooling. (There are many startups trying to solve those problems, but it doesn’t seem like anybody has cracked the nut yet).\nThere’s lots of wisdom in this post by Curt Corginia:\nA wise, mature person would treat the software engineer interview process as a pure learning experience. He, or she, would enjoy learning about companies out there fo…",
          "link": "https://betterprogramming.pub/if-software-engineering-is-in-demand-why-is-it-so-hard-to-get-a-software-engineering-job-c043a964e463",
          "publishedOn": "2021-09-07T15:19:00.000Z",
          "wordCount": 1892,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An attempt to answer the question, “If software engineering is in demand, why is it so hard to get a software engineering job?”"
        },
        {
          "description": "Ars Technica gave some of our favorite command-line tools the deep-dive they deserve:\nInstead of giving you encyclopedic listings of every possible argument and use case for each of these ubiquitous commands, we’re going to teach you how to think about them—and how to easily, productively incorporate them in your own daily command-line use.\nDiscuss on Changelog News",
          "link": "https://arstechnica.com/gadgets/2021/08/linux-bsd-command-line-101-using-awk-sed-and-grep-in-the-terminal/",
          "publishedOn": "2021-09-07T14:33:00.000Z",
          "wordCount": 1331,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Learn to think in sed, awk, and grep"
        },
        {
          "description": "This is an article about exploring Inlets, a cloud native tunnel, with various use cases (including the Apple Silicon RC version of inlets-pro) in my home lab along with its surrounding open source ecosystem. Also some tips about using inlets-operator and MetalLB at the same time, and what could be done in a Kubernetes cluster.\nDiscuss on Changelog News",
          "link": "https://blog.zespre.com/inlets-the-cloud-native-tunnel.html",
          "publishedOn": "2021-09-07T13:45:00.000Z",
          "wordCount": 2381,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tour of Inlets (a tunnel built for the cloud)"
        },
        {
          "description": "Today Adam is joined by Kurt Mackey, co-founder and CEO of Fly.io — a platform for running full stack apps and databases close to users. This conversation with Kurt talks through his journey as a developer and entrepreneur, fundraising, getting into Y Combinator (twice), and how they’ve iterated on the Fly platform since 2017 to get to where they are right now.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The Zero DevO…",
          "link": "https://changelog.com/founderstalk/80",
          "publishedOn": "2021-09-03T20:00:00.000Z",
          "wordCount": 449,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 80: Iterating to globally distributed apps and databases"
        },
        {
          "description": "Amal, KBall, and Nick welcome David Khourshid to the show to talk about his project, XState. XState brings state management to a new level using finite state machines and is compatible with your stack. We talk about how the idea came to fruition, its practical uses, and where it’s going.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool For Startups – More and more startups are using Retool to focus their time on their core p…",
          "link": "https://changelog.com/jsparty/191",
          "publishedOn": "2021-09-03T16:40:00.000Z",
          "wordCount": 469,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 191: X gon' State it to ya"
        },
        {
          "description": "In the recent months there’s been a lot of noise in the area of supply chain security because of increase in attacks, with notable ones like Microsoft Exchange Server or SolarWinds breach. These attacks could have been prevented with proper tools in place, yet finding the right tool for the job might be difficult as this area is hard to navigate and most of us - developers - aren’t security experts. There’s however a project that can solve this. Its name is sigstore and in this article we will look at what …",
          "link": "https://martinheinz.dev/blog/55",
          "publishedOn": "2021-09-03T15:47:00.000Z",
          "wordCount": 15,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A solution to software supply chain security"
        },
        {
          "description": "What Vercel has enabled teams to do with Next.js is next level, and it’s truly evident when you read stories like this one from Cory Etzkorn on Notion migrating their marketing site to Next.js.\nWe rebuilt our entire marketing site from scratch, choosing to go with a statically generated architecture over our former purely client-rendered approach. Two months and 109 React components later, we’ve now fully migrated to our framework of choice, Next.js, and couldn’t be happier with our decision. Here’s how we …",
          "link": "https://www.notion.so/blog/migrating-notion-marketing-to-next-js",
          "publishedOn": "2021-09-03T15:01:01.000Z",
          "wordCount": 2485,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Notion's journey to Next.js"
        },
        {
          "description": "Ultra is a web framework that leans hard into your browser’s native features. Embrace the future of ES Modules, Import Maps, and Web Streams. All while supporting some of the non-standards that many normal people love for some reason (JSX and TypeScript).\nDiscuss on Changelog News",
          "link": "https://ultrajs.dev/",
          "publishedOn": "2021-09-03T14:52:00.000Z",
          "wordCount": 48,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno + React: No build, no bundle, all streaming"
        },
        {
          "description": "I’m Gerhard Lazu, host of Ship It! A show with weekly episodes about getting your best ideas into the world and seeing what happens. We talk about code, ops, infrastructure, and the people that make it happen.\nLike Charity Majors from Honeycomb… clip from episode #11\nAnd Dave Farley, one of the founders of Continuous Delivery… clip from episode #5\nWe even experiment on our own open source podcasting platform so that you can see how we implement specific tools and services within changelog.com.\nWhat works an…",
          "link": "https://changelog.com/shipit/trailer-1",
          "publishedOn": "2021-09-03T14:00:00.000Z",
          "wordCount": 273,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! Let's Ship It!"
        },
        {
          "description": "The news is in the headline on this one, but here’s a bit more meat from the article:\nUsing rigorous and detailed scientific analysis, the study concluded that upon testing 1,692 programs generated in 89 different code-completion scenarios, 40 percent were found to be vulnerable.\n\nDiscuss on Changelog News",
          "link": "https://www.theinsaneapp.com/2021/09/github-copilot-generated-40-percent-insecure-code.html",
          "publishedOn": "2021-09-03T13:19:00.000Z",
          "wordCount": 876,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "GitHub Copilot generated insecure code in 40% of circumstances"
        },
        {
          "description": "Ain was born out of the frustration of working with many API endpoints in GUI clients.\nWhile pretty, I could’t use any shell-scripts or commands such as uuidgen as input to the endpoints without copy pasting from a terminal. And I had to copy-paste the resulting output back into the terminal to further slice and dice it.\nI had become a human pipe and my ctrl+c, ctrl+v fingers were hurting. By using curl and/or httpie for the heavy lifting, Ain removes you from the piping of input and output. With Ain, you c…",
          "link": "https://github.com/jonaslu/ain",
          "publishedOn": "2021-09-02T20:34:00.000Z",
          "wordCount": 2638,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ain is a terminal API client (alternative to Postman, Paw, Insomnia)"
        },
        {
          "description": "Here’s their pitch:\nDo you have a home server you want to run a few apps on, but don’t want everything to\nDo you have a work server that you want to run a few small services on, but don’t want\nHarbormaster is for you.\nYou create a YAML config file with all the git repos you want it to include and it’ll watch them for changes (on a timer) and do the necessary cloning/pulling, service restarting, etc. that needs doing to make it all run. Simple. Neat!\nDiscuss on Changelog News",
          "link": "https://gitlab.com/stavros/harbormaster",
          "publishedOn": "2021-09-02T19:47:00.000Z",
          "wordCount": 215,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Harbormaster – easily deploy many Docker-Compose apps on a single host"
        },
        {
          "description": "To build or to buy, that’s a constant question we ask ourselves as software engineers. In this episode we dig into the nuance of these options and the space between them with an eye toward both the building of software and its eventual maintenance.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any computing resource anywhere. Engineers and security teams can unify access to SSH se…",
          "link": "https://changelog.com/gotime/195",
          "publishedOn": "2021-09-02T16:00:00.000Z",
          "wordCount": 12494,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 195: To build, or to buy, that is the question"
        },
        {
          "description": "From Niels Leenheer:\nIt is not difficult to find some incredibly shitty takes on Electron, and every time it boils down to: It’s slow. Downloads are huge, and it uses a lot of memory. Electron apps are just websites. Developers that are using Electron are taking the lazy or easy approach to cross-platform development. Native apps are just better in every single way.\nAnd somehow, these arguments often come from Apple fans when they discover one of their apps isn’t “native” or when a macOS favourite is consid…",
          "link": "https://nielsleenheer.com/articles/2021/why-electron-apps-are-fine/",
          "publishedOn": "2021-09-02T13:57:20.000Z",
          "wordCount": 1160,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why Electron apps are fine"
        },
        {
          "description": "Big news from Deno today.\nToday we are releasing Deploy Beta 2. This is the second in a series of beta releases that will be made over the coming months. Each release will add features and refine the programming model. The releases will culminate in a General Availability announcement that we estimate will happen in Q4 2021.\nOver the past eight months, we have been quietly designing this hosted service to supplement workflows with the open source Deno CLI. Deploy does not run on AWS Lambda nor does it use C…",
          "link": "https://deno.com/blog/deploy-beta2",
          "publishedOn": "2021-09-01T17:25:31.000Z",
          "wordCount": 578,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno Deploy Beta 2"
        },
        {
          "description": "Routing might be implemented in a number of ways: it’s sometimes code running on a server that maps a path to files on disk, or logic in a single-page app that waits for changes to the current location and creates a corresponding piece of DOM to display.\nBuggy routing (and breaking your browser’s Back button) has been the achilles heel of SPAs since forver. Hopefully better tooling like this URLPattern proposal will help developers better handle the need.\nI like what I see from the linked write-up. The feat…",
          "link": "https://web.dev/urlpattern/",
          "publishedOn": "2021-09-01T16:48:00.000Z",
          "wordCount": 2300,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "URLPattern brings routing to the web platform"
        },
        {
          "description": "The resulting maps are quite varied and absolutely stunning. 🤩\n\nDiscuss on Changelog News",
          "link": "https://github.com/marceloprates/prettymaps",
          "publishedOn": "2021-09-01T16:01:00.000Z",
          "wordCount": 986,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A small set of Python functions to draw pretty maps from OpenStreetMap"
        },
        {
          "description": "On this week’s episode, Gerhard is joined by Kathy Korevec, former Senior Director of Product at GitHub, and now Vercel’s Head of Product. Docs play an essential role in GitHub Actions, and Gerhard’s experience has proven that. Building, testing, and shipping code with GitHub Actions works better because of their excellent docs. However, the docs that Kathy pictures are not what you are imagining. She explains it best in her post, Maybe it’s time we re-think docs, which is what started this whole conversati…",
          "link": "https://changelog.com/shipit/17",
          "publishedOn": "2021-09-01T15:15:00.000Z",
          "wordCount": 505,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 17: Docs are not optional"
        },
        {
          "description": "Yes, to all of this! Dave Bailey, author of The Founder Coach, shared ten useful patterns to help nurture more generous interpretations of others’ behaviors.\nReading this makes me really miss producing Brain Science.\nWhen we encounter emotions and behaviours that don’t make sense to us, it’s often because we don’t have all the information. And in the absence of information, we tend to assume the worst.\n‘Emotional generosity’ is the ability to see past behaviours that we don’t understand and proactively look…",
          "link": "https://medium.dave-bailey.com/the-art-of-not-taking-things-personally-b7a8395ce172",
          "publishedOn": "2021-09-01T14:51:39.000Z",
          "wordCount": 1715,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The art of not taking things personally"
        },
        {
          "description": "In this episode, Peter Wang from Anaconda joins us again to go over their latest “State of Data Science” survey. The updated results include some insights related to data science work during COVID along with other topics including AutoML and model bias. Peter also tells us a bit about the exciting new partnership between Anaconda and Pyston (a fork of the standard CPython interpreter which has been extensively enhanced to improve the execution performance of most Python programs).\nDiscuss on Changelog News\n…",
          "link": "https://changelog.com/practicalai/147",
          "publishedOn": "2021-09-01T14:40:00.000Z",
          "wordCount": 7858,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 147: Anaconda + Pyston and more"
        },
        {
          "description": "From Shruti Kapoor on PayPal’s technology blog:\nWe started our GraphQL adoption journey by building our checkout experience. We saw tremendous benefits in adopting GraphQL when our checkout app built with GraphQL became our guiding light.We built more apps, provided infrastructure support, launched a public GraphQL API, and provided trainings and learning materials across the company. We also set up a standards body, provided a GraphQL tools fanny pack, and built sample apps to help teams get started.\nToday…",
          "link": "https://medium.com/paypal-tech/graphql-at-paypal-an-adoption-story-b7e01175f2b7",
          "publishedOn": "2021-09-01T14:33:07.000Z",
          "wordCount": 3153,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The story of PayPal's adoption of GraphQL"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": [
        {
          "description": "In the past, we’ve had blog posts every two years, describing the various building blocks of openpilot that work together to drive your car. With each iteration, you’ll notice that openpilot has simultaneously become much simpler (service/car abstraction, end-to-end) and much more complex (infrastructure, testing, models), while getting undeniably better. It’s been two years since that last post, so in keeping with tradition, here we go - how does openpilot really work?\nHow Does openpilot Really Work?\nopenp…",
          "link": "https://blog.comma.ai/openpilot-tour/",
          "publishedOn": "2021-09-22T18:00:00.000Z",
          "wordCount": 1475,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "How openpilot works - Take 3"
        },
        {
          "description": "A getting started guide for openpilot development\nTime required: ~30 minutes\nSet up your development environment (Ubuntu 20.04)\n# clone openpilot into your home directory\ncd ~\ngit clone --recurse-submodules https://github.com/commaai/openpilot.git\n\n# setup ubuntu environment\nopenpilot/tools/ubuntu_setup.sh\n\n# build openpilot\ncd openpilot &amp;&amp; scons -j$(nproc)\n\n\nTODO: Add Windows and Mac instructions.\nRun a route replay and ui\nTODO: you might have to log in to access the demo route. see the replay read…",
          "link": "https://blog.comma.ai/turning-the-speed-blue/",
          "publishedOn": "2021-09-14T18:00:00.000Z",
          "wordCount": 522,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "Turning the speed blue"
        }
      ]
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "Today, there’s more information accessible at people’s fingertips than at any point in human history. And advances in artificial intelligence will radically transform the way we use that information, with the ability to uncover new insights that can help us both in our daily lives and in the ways we are able to tackle complex global challenges.\nAt our Search On livestream event today, we shared how we’re bringing the latest in AI to Google’s products, giving people new ways to search and explore information…",
          "link": "https://blog.google/products/search/how-ai-making-information-more-useful/",
          "publishedOn": "2021-09-29T17:45:00.000Z",
          "wordCount": 1676,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "How AI is making information more useful"
        },
        {
          "description": "Look around you right now and consider everything that was created by an inventor. The computer you’re reading this article on, the internet necessary to load this article, the electricity that powers the screen, even the coffee maker you used this morning. \n\nTo recognize the incredible contributions of those inventors and the benefits they bring to our everyday life, the National Inventors Hall of Fame has inducted a new group of honorees every year since 1973. In this year’s combined inductee class of 202…",
          "link": "https://blog.google/technology/ai/marian-croak-inventors-hall-fame/",
          "publishedOn": "2021-09-21T14:30:00.000Z",
          "wordCount": 1777,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Googler Marian Croak is now in the Inventors Hall of Fame"
        },
        {
          "description": "There’s a lot to love about online shopping: It’s fast, it’s easy and there are a ton of options to choose from. But there’s one obvious challenge — you can’t try anything on. This is something Google product manager Debbie Biswas noticed, as a tech industry veteran and startup founder herself. “Historically, the fashion industry only celebrates people of a certain size and skin color,” she says. “This was something I wanted to change.”\nDebbie grew up in India and moved to the U.S. after she graduated colle…",
          "link": "https://blog.google/technology/ai/this-googlers-team-is-making-shopping-more-inclusive/",
          "publishedOn": "2021-09-01T15:00:00.000Z",
          "wordCount": 1288,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "This Googler’s team is making shopping more inclusive"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "I&#8217;ve been traveling this road for a while. Here&#8217;s my collection of 15 of the most common mistakes and issues people will run into when writing applications and services that use libcurl. I&#8217;ve also done recorded presentations on this topic that you can watch if you prefer that medium. Most of these issues are shared &#8230; Continue reading Common mistakes when using libcurl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/27/common-mistakes-when-using-libcurl/",
          "publishedOn": "2021-09-27T07:28:34.000Z",
          "wordCount": 2281,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Common mistakes when using libcurl"
        },
        {
          "description": "September 25, 2001 is the official release date for Mac OS X 10.1. Exactly twenty years ago today. Mac OS X 10.1 This was the first macOS release from Apple that bundled curl. It was a complete surprise to me as well when I realized this had happened. Nobody had told me about it ahead &#8230; Continue reading curl&#8217;s first twenty years on the mac &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/25/curls-first-twenty-years-on-the-mac/",
          "publishedOn": "2021-09-24T22:02:28.000Z",
          "wordCount": 1642,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl’s first twenty years on the mac"
        },
        {
          "description": "In April 2019 we launched the current curl bug-bounty program under the Hackerone umbrella and from my point of view it has been nothing but a raging success. Until today we&#8217;ve paid almost 17,000 USD in rewards and and the average payment amount has been increasing all the time. The reward money in this program &#8230; Continue reading curl joins the reborn IBB bug-bounty program &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/23/curl-joins-the-reborn-ibb-bug-bounty-program/",
          "publishedOn": "2021-09-23T05:56:12.000Z",
          "wordCount": 1330,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl joins the reborn IBB bug-bounty program"
        },
        {
          "description": "Within 24 hours of the previous release, 7.79.0, we got a bug-report filed that identified a pretty serious regression in the HTTP/2 code that we deemed required a fairly quick fix instead of waiting a full release cycle for it. So here&#8217;s 7.79.1 with several bug-fixes that we managed to queue up and merge in &#8230; Continue reading curl 7.79.1 &#8211; patched up and ready &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/22/curl-7-79-1-patched-up-and-ready/",
          "publishedOn": "2021-09-22T06:22:43.000Z",
          "wordCount": 1316,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.79.1 – patched up and ready"
        },
        {
          "description": "WebSockets has been one of the most requested features and protocol to add to curl and libcurl in the annual user survey. Repeatedly, over the last few years. WebSockets is not perfectly suitable to be done by libcurl since it&#8217;s not really an upload or download transfer protocol, but is more something like &#8220;a TCP &#8230; Continue reading You wanted WebSockets? &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/16/you-wanted-websockets/",
          "publishedOn": "2021-09-16T20:57:46.000Z",
          "wordCount": 1139,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "You wanted WebSockets?"
        },
        {
          "description": "The curl factory has once again cranked out a new curl release. Release presentation Numbers the 202nd release3 changes56 days (total: 8,580)128 bug-fixes (total: 7,270)186 commits (total: 27,651)0 new public libcurl function (total: 85)0 new curl_easy_setopt() option (total: 290)0 new curl command line option (total: 242)62 contributors, 25 new (total: 2,484)41 authors, 16 new (total: &#8230; Continue reading curl 7.79.0 &#8211; secure local cookies &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/15/curl-7-79-0-secure-local-cookies/",
          "publishedOn": "2021-09-15T06:24:59.000Z",
          "wordCount": 1488,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.79.0 – secure local cookies"
        },
        {
          "description": "There&#8217;s plan for version 8 being forged! Let me just take you back a bit in time first.. The early days When we first created libcurl, we bumped the major version number of the project from the previous version 6 to version 7. In late summer of 2000 we shipped curl and libcurl 7.1 as &#8230; Continue reading Heading towards curl eight &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/13/heading-towards-curl-eight/",
          "publishedOn": "2021-09-13T10:22:42.000Z",
          "wordCount": 1658,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Heading towards curl eight"
        },
        {
          "description": "Here are six requirements that I have on a project for it to reach my gold approval for stellar docs. Then something about what I&#8217;ve done recently to further improve the docs for curl. Your docs belong in the code repository It needs to be next to the code so that authors and contributors can &#8230; Continue reading Making world-class docs takes effort &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/04/making-world-class-docs-takes-effort/",
          "publishedOn": "2021-09-04T09:30:11.000Z",
          "wordCount": 2329,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Making world-class docs takes effort"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-09-14T12:25:23.132Z",
          "wordCount": 2283,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-09-14T12:25:23.118Z",
          "wordCount": 3223,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-09-14T12:25:23.104Z",
          "wordCount": 1793,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-09-14T12:25:22.872Z",
          "wordCount": 1452,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2021-09-14T12:25:22.860Z",
          "wordCount": 2391,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Logging at Twitter: Updated"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-09-14T12:25:22.838Z",
          "wordCount": 2221,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2021-09-13T12:28:03.910Z",
          "wordCount": 1292,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Applying flame graphs outside of performance analysis"
        },
        {
          "description": "In this post, we will discuss our recent work on neural graph diffusion networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "publishedOn": "2021-09-10T12:25:27.270Z",
          "wordCount": 2883,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Graph Neural Networks as Neural Diffusion PDEs"
        },
        {
          "description": "As part of this year’s DEFCON AI Village, we’re trying something radical by introducing the industry’s first algorithmic bias bounty competition.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-09-10T12:25:24.016Z",
          "wordCount": 888,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter’s first algorithmic bias bounty challenge"
        },
        {
          "description": "Sharing learnings from the first algorithmic bias bounty challenge",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-09-10T09:47:55.991Z",
          "wordCount": 1408,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings from the first algorithmic bias bounty challenge"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "ul.lst-kix_do14k59gl4sr-0{list-style-type:none}ul.lst-kix_do14k59gl4sr-1{list-style-type:none}ul.lst-kix_do14k59gl4sr-2{list-style-type:none}ul.lst-kix_do14k59gl4sr-3{list-style-type:none}.lst-kix_u927wi79aeqb-0>li:before{content:\"-  \"}.lst-kix_u927wi79aeqb-1>li:before{content:\"-  \"}.lst-kix_u927wi79aeqb-2>li:before{content:\"-  \"}.lst-kix_do14k59gl4sr-2>li:before{content:\"-  \"}ul.lst-kix_do14k59gl4sr-4{list-style-type:none}.lst-kix_u927wi79aeqb-5>li:before{content:\"-  \"}ul.lst-kix_do14k59gl4sr-5{list-style-…",
          "link": "https://googleprojectzero.blogspot.com/2021/09/fuzzing-closed-source-javascript.html",
          "publishedOn": "2021-09-14T17:14:00.000Z",
          "wordCount": 3272,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "Fuzzing Closed-Source JavaScript Engines with Coverage Feedback"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Last week, HackerOne held its fifth annual one-of-a-kind global Security@ conference featuring the best-kept secret in cybersecurity—hackers.",
          "link": "https://www.hackerone.com/ethical-hacker/how-hackers-best-kept-secret-cybersecurity-can-help-your-organization-protect-its",
          "publishedOn": "2021-09-28T15:50:00.000Z",
          "wordCount": 1164,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hackers—the Best Kept Secret in Cybersecurity—Can Help Your Organization Protect its Assets and Improve Security"
        },
        {
          "description": "Widespread digital transformation means increased cloud security risk. Learn how human intelligence—hacker-powered security—can help your organization defend against new attack vectors, mitigate risk, and improve cloud security.",
          "link": "https://www.hackerone.com/application-security/top-5-cloud-security-risks-how-hacker-powered-security-can-help",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 1012,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "The Top 5 Cloud Security Risks: How Hacker-Powered Security Can Help"
        },
        {
          "description": "Time is not kind to the security of an organization. The longer you wait, the weaker you are. The more things drag out, the higher the risk of breach. Delays in responding to threats, incidents, and compromises mean exponential cost increases. \n\nYour organization doesn’t have to be completely secure (which is not even possible), but it has to be more secure than the other targets of the adversary. You must make it unattractive or at least very costly for anyone to try to compromise your digital systems.",
          "link": "https://www.hackerone.com/from-the-ceo/time-issue-your-own-cyber-executive-order",
          "publishedOn": "2021-09-20T15:00:00.000Z",
          "wordCount": 1178,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Time to Issue Your Own Cyber Executive Order"
        },
        {
          "description": "Curious about vulnerability testing techniques? We explain processes such as vulnerability assessments, vulnerability scanning, and penetration testing.",
          "link": "https://www.hackerone.com/vulnerability-management/vulnerability-testing-best-techniques-assessing-risks",
          "publishedOn": "2021-09-17T19:00:00.000Z",
          "wordCount": 1455,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Testing | Best Techniques for Assessing Risks"
        },
        {
          "description": "Curious about vulnerability testing techniques? We explain processes such as vulnerability assessments, vulnerability scanning, and penetration testing.",
          "link": "https://www.hackerone.com/vulnerability-testing-best-techniques-assessing-risks",
          "publishedOn": "2021-09-17T19:00:00.000Z",
          "wordCount": 1421,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Testing | Best Techniques for Assessing Risks"
        },
        {
          "description": "Challenges for Traditional Security Teams \n\nTraditional security teams are typically reactive. They’re seen as change-resistant, out of sync with development, and unable to predict or understand risk. For teams to go from reacting to cyberattacks to strategically and tactically planning for risk reduction, they need to plan and prioritize.",
          "link": "https://www.hackerone.com/how-hacker-powered-security-can-help-security-teams-become-more-data-driven",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 1300,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hacker-Powered Security Can Help Security Teams Become More Data-Driven"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "Release time comes around so quickly! This month we have quite a few CSS updates, along with the new Object.hasOwn() static method for JavaScript.\nThe post Time for a review of Firefox 92 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/09/time-for-a-review-of-firefox-92/",
          "publishedOn": "2021-09-08T15:17:15.000Z",
          "wordCount": 558,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Time for a review of Firefox 92"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "Today, we’re excited to announce that GitHub Enterprise Server 3.2 is generally available. This release brings over 70 new features and changes that improve developer experience and deliver new security capabilities.",
          "link": "https://github.blog/2021-09-28-github-enterprise-server-3-2-generally-available/",
          "publishedOn": "2021-09-28T16:21:10.000Z",
          "wordCount": 502,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.2 is now generally available"
        },
        {
          "description": "As part of GitHub's strong commitment to developer privacy, we are excited to announce updates to our privacy agreements in line with new legal requirements and our own robust data protection practices.",
          "link": "https://github.blog/2021-09-27-revised-enterprise-dpa-new-standard-contractual-clauses/",
          "publishedOn": "2021-09-28T00:51:12.000Z",
          "wordCount": 542,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Revised enterprise DPA with new standard contractual clauses"
        },
        {
          "description": "In 2019, to meet GitHub's growth and availability challenges, we set a plan in motion to improve our tooling and ability to partition relational databases.",
          "link": "https://github.blog/2021-09-27-partitioning-githubs-relational-databases-scale/",
          "publishedOn": "2021-09-27T16:02:13.000Z",
          "wordCount": 2210,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Partitioning GitHub’s relational databases to handle scale"
        },
        {
          "description": "npm access tokens will now follow the established format of GitHub authentication tokens.",
          "link": "https://github.blog/2021-09-23-announcing-npms-new-access-token-format/",
          "publishedOn": "2021-09-23T17:19:34.000Z",
          "wordCount": 538,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Announcing npm’s new access token format"
        },
        {
          "description": "We’re excited to announce that the GitHub Advisory Database now includes curated security advisories on the Rust ecosystem!",
          "link": "https://github.blog/2021-09-23-github-advisory-database-now-supports-rust/",
          "publishedOn": "2021-09-23T16:09:35.000Z",
          "wordCount": 564,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Advisory Database now supports Rust"
        },
        {
          "description": "If you're a GitHub Enterprise Cloud customer, you can now set up a stream of audit log and Git events to Splunk or an Azure Event Hub.",
          "link": "https://github.blog/2021-09-16-audit-log-streaming-public-beta/",
          "publishedOn": "2021-09-16T17:32:09.000Z",
          "wordCount": 868,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Audit log streaming is now in public beta"
        },
        {
          "description": "In August of 2020, we started highlighting stories that showcase how developers, maintainers, and organizations are moving humanity forward through The ReadME Project.",
          "link": "https://github.blog/2021-09-14-the-readme-project-a-look-back-community-stories/",
          "publishedOn": "2021-09-14T16:00:10.000Z",
          "wordCount": 566,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "The ReadME Project: A look back at the community stories that shape us"
        },
        {
          "description": "What did we ship in August? Codespaces, Discussions, and lots of other updates, from the general availability of the dark high contrast theme to an auto-generated table of contents for wikis.",
          "link": "https://github.blog/2021-09-13-whats-new-from-github-changelog-august-2021-recap/",
          "publishedOn": "2021-09-13T17:01:15.000Z",
          "wordCount": 1370,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? August 2021 Recap"
        },
        {
          "description": "Announcing recipients of the GitHub Open Source Grants and opening of GitHub Sponsors in India.",
          "link": "https://github.blog/2021-09-12-recipients-open-source-grants-github-sponsors-india/",
          "publishedOn": "2021-09-13T03:30:45.000Z",
          "wordCount": 654,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Announcing recipients of the GitHub Open Source Grants and GitHub Sponsors now open in India"
        },
        {
          "description": "GitHub Enterprise Server 3.2 is available today as a release candidate. With this release, we’re shipping over 70 new features and changes to improve the developer experience and deliver new security capabilities for our customers.",
          "link": "https://github.blog/2021-09-09-github-enterprise-server-3-2-color-modes-security/",
          "publishedOn": "2021-09-09T17:26:30.000Z",
          "wordCount": 886,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.2 brings new color modes and added security capabilities"
        },
        {
          "description": "We put out a call to open source developers and security researchers to talk about the security vulnerability disclosure process. Here's what we found.",
          "link": "https://github.blog/2021-09-09-analysis-developer-security-researcher-interactions-vulnerability-disclosure/",
          "publishedOn": "2021-09-09T17:23:06.000Z",
          "wordCount": 2417,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "An analysis on developer-security researcher interactions in the vulnerability disclosure process"
        },
        {
          "description": "Between July 21, 2021 and August 13, 2021 we received reports through one of our private security bug bounty programs from researchers regarding vulnerabilities in tar and @npmcli/arborist.",
          "link": "https://github.blog/2021-09-08-github-security-update-vulnerabilities-tar-npmcli-arborist/",
          "publishedOn": "2021-09-08T16:00:32.000Z",
          "wordCount": 2282,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub security update: Vulnerabilities in tar and @npmcli/arborist"
        },
        {
          "description": "How GitHub uses code scanning to increase developer happiness, and how you can too.",
          "link": "https://github.blog/2021-09-07-increasing-developer-happiness-github-code-scanning/",
          "publishedOn": "2021-09-07T16:10:42.000Z",
          "wordCount": 974,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Increasing developer happiness with GitHub code scanning"
        },
        {
          "description": "The end of financial year is complete, tax time is over, and everyone is back to shipping awesome projects. During August, our community has been super busy shipping lots of new updates. These new releases",
          "link": "https://github.blog/2021-09-03-release-radar-aug-2021/",
          "publishedOn": "2021-09-03T21:00:55.000Z",
          "wordCount": 1297,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · August 2021 Edition"
        },
        {
          "description": "Applications are now open for the MLH Fellowship: GitHub Externship Track. Apply by September 13.",
          "link": "https://github.blog/2021-09-02-introducing-the-mlh-fellowship-github-externship-track/",
          "publishedOn": "2021-09-02T20:18:04.000Z",
          "wordCount": 643,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing the MLH Fellowship: GitHub Externship Track"
        },
        {
          "description": "In August, we experienced two distinct incidents resulting in significant impact and degraded state of availability for Git operations, API requests, webhooks, issues, pull requests, GitHub Pages, GitHub Packages, and GitHub Actions services.",
          "link": "https://github.blog/2021-09-01-github-availability-report-august-2021/",
          "publishedOn": "2021-09-01T17:30:56.000Z",
          "wordCount": 846,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: August 2021"
        },
        {
          "description": "We’re changing which keys are supported in SSH and removing unencrypted Git protocol. Only users connecting via SSH or git:// will be affected. If your Git remotes start with https://, nothing in this post will affect you. If you’re an SSH user, read on for the details and timeline.",
          "link": "https://github.blog/2021-09-01-improving-git-protocol-security-github/",
          "publishedOn": "2021-09-01T17:00:12.000Z",
          "wordCount": 1622,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Improving Git protocol security on GitHub"
        },
        {
          "description": "Calling all students! Get the most out of your GitHub Education experience by joining the GitHub student community on our new digital campus.",
          "link": "https://github.blog/2021-09-01-introducing-github-global-campus/",
          "publishedOn": "2021-09-01T16:00:29.000Z",
          "wordCount": 651,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing GitHub Global Campus"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "How Nubank switched to a Contract and Acceptance testing strategy to scale to over 1k engineers\nThe post Why We Killed Our End-to-End Test Suite appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/why-we-killed-our-end-to-end-test-suite/",
          "publishedOn": "2021-09-24T14:58:34.000Z",
          "wordCount": 4862,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Why We Killed Our End-to-End Test Suite"
        },
        {
          "description": "Nubank customers will have access to products and services from Creditas, a digital lending platform, by the end of the year. \nThe post Nubank and Creditas announce partnership appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-creditas/",
          "publishedOn": "2021-09-14T00:43:53.000Z",
          "wordCount": 3224,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank and Creditas announce partnership"
        },
        {
          "description": "The Bug Bounty program rewards cybersecurity researchers who find potential vulnerabilities in our systems.\nThe post Nubank launches reward program for ethical hackers in partnership with HackerOne appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-launches-reward-program-for-ethical-hackers-in-partnership-with-hackerone/",
          "publishedOn": "2021-09-09T13:03:12.000Z",
          "wordCount": 3093,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank launches reward program for ethical hackers in partnership with HackerOne"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}