{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/09/use-after-freedom-miracleptr.html",
          "author": null,
          "description": "Posted by Adrian Taylor, Bartek Nowierski and Kentaro Hara on behalf of the MiraclePtr team \nMemory safety bugs are the most numerous category of Chrome security issues and we’re continuing to investigate many solutions – both in C++ and in new programming languages. The most common type of memory safety bug is the “use-after-free”. We recently posted about an exciting series of technologies designed to prevent these. Those technologies (collectively, *Scan, pronounced “star scan”) are very powerful but likely require hardware support for sufficient performance. \nToday we’re going to talk about a different approach to solving the same type of bugs. \nIt’s hard, if not impossible, to avoid use-after-frees in a non-trivial codebase. It’s rarely a mistake by a single programmer. Instead, one p…",
          "link": "http://security.googleblog.com/2022/09/use-after-freedom-miracleptr.html",
          "publishedOn": "2022-09-13T16:59:00.000Z",
          "wordCount": 1968,
          "title": "Use-after-freedom: MiraclePtr"
        },
        {
          "id": "http://security.googleblog.com/2022/09/fuzzing-beyond-memory-corruption.html",
          "author": null,
          "description": "Posted by Jonathan Metzman, Dongge Liu and Oliver Chang, Google Open Source Security Team \nRecently, OSS-Fuzz—our community fuzzing service that regularly checks 700 critical open source projects for bugs—detected a serious vulnerability (CVE-2022-3008): a bug in the TinyGLTF project that could have allowed attackers to execute malicious code in projects using TinyGLTF as a dependency.   \nThe bug was soon patched, but the wider significance remains: OSS-Fuzz caught a trivially exploitable command injection vulnerability. This discovery shows that fuzzing, a type of testing once primarily known for detecting memory corruption vulnerabilities in C/C++ code, has considerable untapped potential to find broader classes of vulnerabilities. Though the TinyGLTF library is written in C++, this vuln…",
          "link": "http://security.googleblog.com/2022/09/fuzzing-beyond-memory-corruption.html",
          "publishedOn": "2022-09-08T16:00:00.000Z",
          "wordCount": 1231,
          "title": "Fuzzing beyond memory corruption: Finding broader classes of vulnerabilities automatically"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/qMDp",
          "author": "Jerod Santo",
          "description": "Tobias Bieniek:\nHave you ever worked with JavaScript? Have you been annoyed by the three hundred copies of left-pad in all of the node_modules folders on your disk? Would you prefer if all of your projects shared their node_modules folders instead of each getting their own copy?\nThe single character that saved him all that space? The p in pnpm…\nDiscuss on Changelog News",
          "link": "https://mainmatter.com/blog/2022/09/29/pnpm",
          "publishedOn": "2022-09-30T20:49:00.000Z",
          "wordCount": null,
          "title": "node_modules: How one character saved 50 GB of disk space",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1833",
          "author": null,
          "description": "This week we turn the mics on ourselves, kind of. Lars Wikman joins the show to give us a guided tour through ID3 esoterica and the shiny new open source Elixir library he developed for us. We talk about what ID3 is, its many versions, what it aims to be and what it could have been, how our library project got started, all the unique features and failed dreams of the ID3v2 spec, how ID3v2 and Podcast 2.0 are solving the problem differently, and how all of this maps back to us giving you (our listeners) a better experience while listening to our shows.\nDiscuss on Changelog News\nChangelog++ members get a bonus 15 minutes at the end of this episode and zero ads. Join today!\nSponsors\nInfluxData – The time series platform for building and operating time series applications — InfluxDB empowers d…",
          "link": "https://changelog.com/podcast/508",
          "publishedOn": "2022-09-30T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 508: A guided tour through ID3 esoterica",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/508/the-changelog-508.mp3",
            "length": "79685048",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/jqDl",
          "author": "Jerod Santo",
          "description": "Jean Yang:\nThere’s clearly a lot of programmer pain. But why we don’t see more tech transfer of these “deep” technologies from research into industry is something I have been thinking about since I was in college, when I decided I wanted to spend my life making programmers’ lives better. Many other fields, from robotics to databases, have clearer paths to commercialization. But when it comes to new programming languages or software analyses, the path of tech transfer is often decades-long, if it exists at all.\nShe goes on to describe a few factors that are in the way of “deep tech” dev tools investing, how some of those things are changing, and how others still need to change.\nDiscuss on Changelog News",
          "link": "https://www.akitasoftware.com/blog-posts/why-arent-there-more-programming-languages-startups",
          "publishedOn": "2022-09-30T19:50:00.000Z",
          "wordCount": null,
          "title": "Why aren't there more programming languages startups?",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1853",
          "author": null,
          "description": "Patformatic co-founders Matteo Collina & Luca Maraschi join Amal & Chris to discuss their just-announced (and we mean just announced) open source database tool: Platformatic DB!\nIt’s a daemon that can turn any PostgreSQL, MySQL, MariaDB, or SQLite database into a REST and GraphQL endpoint. What makes it special is that it allows massive customization thanks to the flexibility of Fastify plugins.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nFeaturing\nMatteo Collina – Twitter, GitHub, Website\nLuca Maraschi – Twitter, GitHub\nAmal Hussein – Twitter, GitHub\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\n🎧 JS Party #197: Fastify served with a refreshing Pino 🍷\nOur first Open Source tool: Platformatic DB\nPlatformatic on GitHub\n@databases\nAdventures in Nodeland\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/245",
          "publishedOn": "2022-09-30T18:20:00.000Z",
          "wordCount": null,
          "title": "JS Party 245: Launching Platformatic DB 🚀",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/245/js-party-245.mp3",
            "length": "60400760",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1808",
          "author": null,
          "description": "We did an episode on functional programming in Go with Aaron Schlesinger back in 2019… But that was before generics were a thing. Let’s revisit the topic and discuss the pros and cons now that we have generics. What’s changed? What hasn’t?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nAaron Schlesinger – Twitter, GitHub, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nGo Time #87: Functional programming?\nDylan Meeus’s GopherCon 2020\nAaron’s GopherCon 2017\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/249",
          "publishedOn": "2022-09-30T16:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 249: Functional programming with generics?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/249/go-time-249.mp3",
            "length": "51999278",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1mJ",
          "author": "Jerod Santo",
          "description": "Dracula UI is a dark-first collection of UI patterns and components. Key features:\nBuilt for Dark Mode:  Most templates are built using light colors and later on adapted to dark colors. Dark themes shouldn’t be an afterthought, they should be a top priority.\nDesigner Friendly: Speed up the prototyping phase by using a highly configurable Design System. Collaborate easily by taking advantage of a carefully crafted Figma file.\nGreat Developer Experience: Don’t worry about class names, just use the Visual Studio Code snippets. You can take advantage of autocomplete and also access the entire documentation right from your code editor.\nDiscuss on Changelog News",
          "link": "https://twitter.com/zenorocha/status/1575476765228560384",
          "publishedOn": "2022-09-30T16:09:00.000Z",
          "wordCount": null,
          "title": "Dracula UI is now free and open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE71",
          "author": "AJ Kerrigan",
          "description": "This is a neat little CLI utility from Kelly Brazil that parses the output of common Unix system commands into JSON/YAML. We’re linking to the latest version (1.22.0) which adds new magic parsers for /proc files. This handy glue-type tool gets one click neater every release!\n\nDiscuss on Changelog News",
          "link": "https://blog.kellybrazil.com/2022/09/27/jc-version-1-22-0-released/",
          "publishedOn": "2022-09-29T19:24:00.000Z",
          "wordCount": null,
          "title": "JC converts the output of popular commands to JSON for easier parsing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgpn",
          "author": "Jerod Santo",
          "description": "Point Refurb at your Python code to see how bad good it is. Here’s the author’s motivation:\nI love doing code reviews: I like taking something and making it better, faster, more elegant, and so on. Lots of static analysis tools already exist, but none of them seem to be focused on making code more elegant, more readable, or more modern. That is where Refurb comes in.\nDiscuss on Changelog News",
          "link": "https://github.com/dosisod/refurb",
          "publishedOn": "2022-09-29T18:37:00.000Z",
          "wordCount": null,
          "title": "A tool for refurbishing and modernizing Python codebases",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2549",
          "author": "Lars Wikman",
          "description": "The podcast moguls of Changelog Media have been keen to introduce chapters into their podcast episodes and they reached out to me for a hand. And would you know, now they have chapters and the Elixir community has a shiny new ID3 tag library.\nChapters are neat, they let you see a Table of Contents, jump to specific parts and similar. The changelog.com site is an open source project built in Elixir. I love working with Elixir. It is a steadily growing but still somewhat niche language and it doesn’t have every library under the sun, only most of them. It hasn’t had a fully fledged ID3v2 library so far. There are a few libraries that let you parse a tag in one specific way, targeting a subset. I haven’t found any that allow writing a tag. To create podcast chapters you need to update the ID3…",
          "link": "https://changelog.com/posts/id3vx-a-library-for-parsing-and-encoding-id3-tags",
          "publishedOn": "2022-09-29T14:30:40.000Z",
          "wordCount": null,
          "title": "Id3vx – a library for parsing and encoding ID3 tags",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1790",
          "author": null,
          "description": "One of our listeners, Andrew Welker, suggested that we talk about Klustered, so a few hours before David Flanagan was about to do his workshop at Container Days, we recorded this episode. We talked about all the weird and wonderful Kubernetes debugging sessions on Klustered, a YouTube playlist with 43 videos and counting.\nWe then talked about Rawkode Academy, and we finished with conferences. Good thing we did, because David almost forgot about KubeHuddle, the conference that he is co-organising next week. Gerhard is looking forward to talking at it! No, seriously, check it out at kubehuddle.com.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly w…",
          "link": "https://changelog.com/shipit/72",
          "publishedOn": "2022-09-29T13:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 72: Klustered & Rawkode Academy",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/72/ship-it-72.mp3",
            "length": "64734951",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/rXZ9",
          "author": "Jerod Santo",
          "description": "MNT Research… is going small for its next project. The MNT Pocket Reform has a seven-inch screen with a clamshell design that, when closed, will be less than five centimeters thick. If its perky purple facade looks a bit retro, that’s no surprise; the Pocket’s inspirations read like a ‘greatest hits’ list of pocketable computers.\nThey’re taking open source seriously:\nMNT’s open-source promise is not limited to an open source operating system or select internal components The Pocket Reform, as with MNT’s full-size Reform laptop, will provide mainboard schematics, 3D models for physical components, and open source drivers, among other things.\nComing soon to a crowd fund near you.\n\nDiscuss on Changelog News",
          "link": "https://spectrum.ieee.org/meet-an-open-source-pc-that-can-fit-in-your-pocket",
          "publishedOn": "2022-09-28T18:27:00.000Z",
          "wordCount": null,
          "title": "MNT's Reform is an open source PC that fits in your pocket",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lVw",
          "author": "Jerod Santo",
          "description": "Zsot Varga explains how Prerender saved $800k annually by removing their reliance on AWS and building in-house infrastructure to handle traffic and cached data. This was no minor migration, and it took months to pull off, but it’s a solid lesson in testing your assumptions.\nThe cloud (which is AWS in most cases) is the default for most businesses today. That’s a good starting place for many reasons, but once you get up and going you may find it’s not the best choice for your business, like the folks at Prerender learned.\nDiscuss on Changelog News",
          "link": "https://levelup.gitconnected.com/how-we-reduced-our-annual-server-costs-by-80-from-1m-to-200k-by-moving-away-from-aws-2b98cbd21b46",
          "publishedOn": "2022-09-28T17:07:00.000Z",
          "wordCount": null,
          "title": "We reduced our server costs 80% by moving away from AWS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwoR",
          "author": "Stefan",
          "description": "It’s Hacktoberfest again, but you don’t know where to find interesting projects? This CLI will help you find participating projects based on your starred repositories. Simply run:\nnpx hacktoberfest-hunt\n\nDiscuss on Changelog News",
          "link": "https://github.com/stefanbuck/hacktoberfest-hunt",
          "publishedOn": "2022-09-28T16:21:00.000Z",
          "wordCount": null,
          "title": "Hacktoberfest-hunt CLI",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3LDJ",
          "author": "Jerod Santo",
          "description": "I love that people are bringing HTML back to the forefront:\nOur mission is to enable anyone to build multi-page dynamic web apps while staying as close to the platform as possible. Enhance fills in the gaps to make building for the backend, and the browser a seamless experience for web authors and consumers.\nModern JavaScript frameworks bring more problems than they solve; recreating native web platform features adding unnecessary weight and complexity, which is challenging to unravel.\nEnhance provides a dependable foundation built on standards-based web platform features, allowing developers to create web applications that are lightweight, flexible, and future-proof.\nDiscuss on Changelog News",
          "link": "https://enhance.dev/docs/",
          "publishedOn": "2022-09-27T20:26:00.000Z",
          "wordCount": null,
          "title": "Enhance is a web standards-based HTML framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1860",
          "author": null,
          "description": "It’s one thing to gather some labels for your data. It’s another thing to integrate data labeling into your workflows and infrastructure in a scalable, secure, and useful way. Mark from Xelex joins us to talk through some of what he has learned after helping companies scale their data annotation efforts. We get into workflow management, labeling instructions, team dynamics, and quality assessment. This is a super practical episode!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMark Christensen – LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nXelex.ai\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/195",
          "publishedOn": "2022-09-27T19:40:00.000Z",
          "wordCount": null,
          "title": "Practical AI 195: Production data labeling workflows",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/195/practical-ai-195.mp3",
            "length": "30685243",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7YJQ",
          "author": "Jerod Santo",
          "description": "Vivian Qu states her case as to why Apple’s decision to remove outdated apps from the App Store is dumb, especially for indies like her.\nNever mind the fact that my app has a 5-star rating and was still being downloaded, with no complaints from any of my users. Also disregard the fact that I had other highly-rated apps up on the App Store, some of which had been updated much more recently than July 2019, clearly showing that I have not abandoned these apps entirely. If there had been an actual reviewer who checked my outdated app, they would have discovered that I architected the app from the beginning to dynamically scale the UI so it resizes to fit the latest iPhone devices. All these could be signals that indicate to Apple that this is not a garbage-filled scam app that is lowering the quality of their App Store.\nShe goes on to tell the entire saga that she (and others) were put through to keep their apps on the store. Sometimes an app isn’t outdated, it’s just complete. Ya know?\nDiscuss on Changelog News",
          "link": "https://vivqu.com/blog/2022/09/25/outdated-apps/",
          "publishedOn": "2022-09-27T19:27:00.000Z",
          "wordCount": null,
          "title": "In defense of apps that don’t need updates",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2lkV",
          "author": "Jerod Santo",
          "description": "Michael Knyszek:\nSince our last blog post about the Go GC in 2018 the Go GC, and the Go runtime more broadly, has been steadily improving. We’ve tackled some large projects, motivated by real-world Go programs and real challenges facing Go users. Let’s catch you up on the highlights!\nLots of invisible changes/improvements, but Michael focuses in on a new knob that he’s encouraging gophers to play with: the soft memory limit\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/go119runtime",
          "publishedOn": "2022-09-27T15:04:00.000Z",
          "wordCount": null,
          "title": "4 years of progress on the Go runtime",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rQn",
          "author": "Jerod Santo",
          "description": "This is a great starter snippet for any web page:\nmain {\n  max-width: 38rem;\n  padding: 2rem;\n  margin: auto;\n}\n\nThe linked post explains the why behind these rules and expands with a 100 byte alternative and the comments have a bunch of variants and conversation about each specific rule.\nDiscuss on Changelog News",
          "link": "https://gist.github.com/JoeyBurzynski/617fb6201335779f8424ad9528b72c41",
          "publishedOn": "2022-09-26T16:45:00.000Z",
          "wordCount": null,
          "title": "58 bytes of CSS to look great nearly everywhere",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1859",
          "author": null,
          "description": "Mozilla says Firefox will continue to support current content blockers, Nabeel Suleiman thinks NATS is great and recommends you check it out, InfoQ breaks down Uber’s recent security breach, Klemen Sever explained OAuth2 by drawing cute shapes & Jorge Manrubia reflects back as an aging programmer.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nFirefox will continue to support current content blockers\nNats: You Need it Now!\n\nDwayne Bradley’s comment\nMulti-Factor Authentication Fatigue Key Factor in Uber Breach\nOAuth2 explained with cute shapes\n\n🎧 [Aaron Parecki on The Changelog #456])(https://changelog.fm/456)\nA nice Twitter review\nAging programmer\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-26",
          "publishedOn": "2022-09-26T15:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Firefox supports blockers, NATS is great, Uber's MFA fatigue, OAuth2 drawn in cute shapes & an aging programmer",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-26/the-changelog-news-2022-09-26.mp3",
            "length": "5456100",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lO8m",
          "author": "Daniele Scasciafratte",
          "description": "This book is my condensed personal experience in the last 12 years in various projects, communities and roles in Open Source. Including my best practice, tips and a lot of examples and resources.\nAfter 2 years a new edition is here with new stuff and also available on Amazon Kindle.\nDiscuss on Changelog News",
          "link": "https://daniele.tech/2022/09/contribute-to-open-source-the-right-way-3rd-edition/",
          "publishedOn": "2022-09-26T13:32:00.000Z",
          "wordCount": null,
          "title": "Contribute to open source: the right way 3rd edition (Free 📘)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jz1",
          "author": "Jerod Santo",
          "description": "This project is a web implementation of the raining green code seen in the Matrix franchise. It’s built right on top of the upcoming graphics API WebGPU, but falls back to the functional WebGL wrapper, REGL; its previous Three.js version is maintained in a separate branch.\nI used to spend countless hours in college scouring the web for the best digital rain screen saver for my laptop. Sounds like the author is with me on that:\nThe number of implementations out there of this effect is a testament to the size of the film’s impact on popular culture. For decades, I’ve enjoyed searching for and comparing them from time to time. That’s probably how you arrived here— it’s fun to see what kinds of solutions different people come up with to a problem, when the process is purely recreational and its success is subjective.\nThis one’s really nice and even has a 3D mode. The README says it’s “made with love”, but from what I can tell it’s almost entirely JavaScript. 😜\n\nDiscuss on Changelog News",
          "link": "https://github.com/Rezmason/matrix",
          "publishedOn": "2022-09-26T12:42:00.000Z",
          "wordCount": null,
          "title": "A web-based implementation of The Matrix's digital rain",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1844",
          "author": null,
          "description": "This week we’re talking about product development structures as systems with Lucas da Costa. The last time we had Lucas on the show he was living the text-mode only life, and now we’re more than 3 years later, Lucas has doubled down on all things text mode. Today’s conversation with Lucas maps several ideas he’s shared recently on his blog. We talk about deadlines being pointless, trajectory vs roadmap and the downfall of long-term planning, the practices of daily stand-ups and what to do instead, measuring queues not cycle time, and probably the most controversial of them all — actually talking to your customers. Have you heard? It’s this newly disruptive Agile framework that seems to be working well.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this e…",
          "link": "https://changelog.com/podcast/507",
          "publishedOn": "2022-09-23T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 507: Product development structures as systems",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/507/the-changelog-507.mp3",
            "length": "84133443",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqJ2",
          "author": "Jerod Santo",
          "description": "This looks awesome:\nWe are a group of programmers helping each other build new things, whether it be writing complex encryption programs, or simple ciphers. Our goal is to work together to document and model beautiful, helpful and interesting algorithms using code.\nWe are an open-source community - anyone can contribute. We check each other’s work, communicate and collaborate to solve problems. We strive to be welcoming, respectful, yet make sure that our code follows the latest programming guidelines.\nDiscuss on Changelog News",
          "link": "https://the-algorithms.com/",
          "publishedOn": "2022-09-23T19:16:00.000Z",
          "wordCount": null,
          "title": "Algorithms & data structures implemented in many programming languages",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1842",
          "author": null,
          "description": "We’re back with another 🌶️ spicy YepNope debate! This time, Amelia and KBall are arguing that there’s real value to (continue) using React in 2022, while Amal and special guest (and author of the post which stemmed the whole debate) Josh Collinsworth argue that React’s time leading innovation has passed. Of course, the stance each panelist is taking is assigned ahead of time. Is that how they really feel? Tune in and find out!\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs,…",
          "link": "https://changelog.com/jsparty/244",
          "publishedOn": "2022-09-23T18:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 244: The spicy React debate show 🌶️🌶️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/244/js-party-244.mp3",
            "length": "61050176",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJRR",
          "author": "Jerod Santo",
          "description": "We recently logged jqq (an interactive wrapper around jq), but Ruby means installing it can be a burden. jqp wraps gojq, so it compiles to a universal binary and the UI is pretty compelling as well.\n\nDiscuss on Changelog News",
          "link": "https://github.com/noahgorstein/jqp",
          "publishedOn": "2022-09-23T15:34:00.000Z",
          "wordCount": null,
          "title": "A TUI playground for exploring jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1kJ",
          "author": "Jerod Santo",
          "description": "Unlike the alternatives, Rocketry’s scheduler is statement-based. Rocketry natively supports the same scheduling strategies as the other options, including cron and task pipelining, but it can also be arbitrarily extended using custom scheduling statements.\nThat’s pretty useful! I used to struggle to shove conditionals in to my cron jobs. Example time:\nfrom rocketry.conds import daily, time_of_week\nfrom pathlib import Path\n\n@app.cond()\ndef file_exists(file):\n    return Path(file).exists()\n\n@app.task(daily.after(\"08:00\") & file_exists(\"myfile.csv\"))\ndef do_work():\n    ...\n\nDiscuss on Changelog News",
          "link": "https://github.com/Miksus/rocketry",
          "publishedOn": "2022-09-23T14:46:00.000Z",
          "wordCount": null,
          "title": "A statement-based scheduling framework for Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZokW",
          "author": "Jerod Santo",
          "description": "PyScript is a Pythonic alternative to Scratch, JSFiddle, and other “easy to use” programming frameworks, with the goal of making the web a friendly, hackable place where anyone can author interesting and interactive applications.\nLots of code examples of various apps (clock, repl, todos, etc) here. I love the why behind this effort:\nAs an industry, we have focussed on making the impossible possible, rather than focussing on making the possible accessible to all.\nThey want to bring programming to the 99%. Somebody’s gotta do it…\nDiscuss on Changelog News",
          "link": "https://pyscript.net/",
          "publishedOn": "2022-09-22T19:12:00.000Z",
          "wordCount": null,
          "title": "Create rich Python apps in the browser with HTML",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdlG",
          "author": "Nabeel Sulieman",
          "description": "If you are running Kubernetes, or really any kind of microservice architecture, you will eventually run into challenges with communication and synchronization between your instances. To solve this, I recommend deploying an instance of NATS as part of your initial infrastructure setup.\nNATS is great! I tell you why in this blog post.\nDiscuss on Changelog News",
          "link": "https://nabeel.dev/2022/09/17/nats",
          "publishedOn": "2022-09-22T18:10:00.000Z",
          "wordCount": null,
          "title": "NATS: you need it now!",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1800",
          "author": null,
          "description": "In this episode, we will be exploring interviewing as a Software Engineer. Tips, tricks, and gotchas, as well as potentially some interviewing horror stories and red flags to avoid at all costs. We’re joined by Emma Draper, Engineering Manager at the New York Times based in Arizona, and Kate Jonas, goes by Jonas, Technical Enablement Manager at Datadog based in Denver.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFeaturing\nEmma Draper – GitHub, LinkedIn\nJonas – Twitter, LinkedIn\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/248",
          "publishedOn": "2022-09-22T17:20:00.000Z",
          "wordCount": null,
          "title": "Go Time 248: Engineering interview tips & tricks",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/248/go-time-248.mp3",
            "length": "59508146",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2548",
          "author": "Jerod Santo",
          "description": "Adam and I have wanted our podcasts to have chapters for a looooong time.\nLike, multiple years long.\nThey’re such a great way to navigate and explore an episode. You can skip directly to the subjects that interest you, skip past the ones that don’t, and even discover new parts of the show1 that pique your interest.\nI’m a big chapters user myself; have been ever since the feature was added to my podcast app of choice and some podcasts I listen to added them. But we never put in the work to chapter our podcasts because of various challenges in our way.\nThe challenges\nWe’ve self-hosted (and self-content-managed) our podcasts since 2016. To get that done, we built our own web app because, well, we’re software developers2 and as the saying goes:\nhaters gonna hate, liars gonna lie, developers go…",
          "link": "https://changelog.com/posts/a-new-chapter-for-changelog-podcasts",
          "publishedOn": "2022-09-22T14:47:12.000Z",
          "wordCount": null,
          "title": "A new chapter for Changelog podcasts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jg4n",
          "author": "Jerod Santo",
          "description": "They’re really putting the Open in OpenAI with this one…\nWhisper is an automatic speech recognition (ASR) system trained on 680,000 hours of multilingual and multitask supervised data collected from the web. We show that the use of such a large and diverse dataset leads to improved robustness to accents, background noise and technical language. Moreover, it enables transcription in multiple languages, as well as translation from those languages into English. We are open-sourcing models and inference code to serve as a foundation for building useful applications and for further research on robust speech processing.\nWe might need to give this a spin on our transcripts. Who knows, maybe our next big innovation could be The Changelog in German, French, Spanish, etc!\nDiscuss on Changelog News",
          "link": "https://openai.com/blog/whisper/",
          "publishedOn": "2022-09-22T14:38:00.000Z",
          "wordCount": null,
          "title": "OpenAI introduces Whisper (open source speech recognition)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qpkd",
          "author": "Jerod Santo",
          "description": "Nick Nisi hasn’t played it yet, but he’s already declared TDungon to be the “Game of the Year”…\n\nDiscuss on Changelog News",
          "link": "https://github.com/cassiozen/TDungeon",
          "publishedOn": "2022-09-22T13:52:00.000Z",
          "wordCount": null,
          "title": "A text adventure game that runs on TypeScript's type system",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1600",
          "author": null,
          "description": "Dave Farley, co-author of Continuous Delivery, is back to talk about his latest book, Modern Software Engineering, a Top 3 Software Engineering best seller on Amazon UK this September. Shipping good software starts with you giving yourself permission to do a good job. It continues with a healthy curiosity, admitting that you don’t know, and running many experiments, safely, without blowing everything up. And then there is scope creep…\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear u…",
          "link": "https://changelog.com/shipit/71",
          "publishedOn": "2022-09-21T17:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 71: Modern Software Engineering",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/71/ship-it-71.mp3",
            "length": "79449270",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1ko",
          "author": "Jerod Santo",
          "description": "Dave Rupert brainstorms some new CSS organization acronyms.\nI’m not anti-BEM nor anti-roboclasses, but as we enter a new era for CSS I think we have an opportunity to rethink best practices around architecting CSS. Before we get lost rethinking the wheel, let’s hold on to some good principles from the past decade or so:\nWe want to author in components\nWe generally want low-specificity to avoid collisions\nWe want a bucket of global utility classes/variables for ad-hoc composition or customizations\nWith those principles, let’s dive into some CSS architecture alternatives.\nHe goes on to describe CUBE, HECS, WILS, GPC, and other systems that haven’t even been named yet 😆\nDiscuss on Changelog News",
          "link": "https://daverupert.com/2022/08/modern-alternatives-to-bem/",
          "publishedOn": "2022-09-21T17:07:01.000Z",
          "wordCount": null,
          "title": "Modern alternatives to BEM",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4983",
          "author": "Jerod Santo",
          "description": "iliana etaoin:\nThere is a lot of attention on securing “software supply chains.” The usual approach is that you want to try to avoid security issues in your underlying components from impacting customers of your product; and when they do, you want to be able to respond quickly to fix the issue. The people who care about this class of problem are often software companies. The class of components that are most concerning these companies are ones where unpaid hobbyist maintainers wrote something for themselves with no maintenance plan.\nThis is where the supply chain metaphor — and it is just that, a metaphor — breaks down…\nI think we all know this intrinsically, but it’s easy to forget. iliana goes on to describe feelings I’ve heard expressed by a few maintainers recently:\nI just want to publish software that I think is neat so that other hobbyists can use and learn from it, and I otherwise want to be left the hell alone. I should be allowed to decide if something I wrote is “done”. The focus on securing the “software supply chain” has made it even more likely that releasing software for others to use will just mean more work for me that I don’t benefit from. I reject the idea that a concept so tenuous can be secured in the first place.\nDiscuss on Changelog News",
          "link": "https://iliana.fyi/blog/software-supply-chain/",
          "publishedOn": "2022-09-21T14:16:00.000Z",
          "wordCount": null,
          "title": "There is no “software supply chain”",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM6L",
          "author": "Jerod Santo",
          "description": "The picture below explains it better than I can with words. 👇\n\nDiscuss on Changelog News",
          "link": "https://github.com/dalibo/pg_activity",
          "publishedOn": "2022-09-21T13:28:00.000Z",
          "wordCount": null,
          "title": "pg_activity is like htop for Postgres activity monitoring",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1849",
          "author": null,
          "description": "WeightWatcher, created by Charles Martin, is an open source diagnostic tool for analyzing Neural Networks without training or even test data! Charles joins us in this episode to discuss the tool and how it fills certain gaps in current model evaluation workflows. Along the way, we discuss statistical methods from physics and a variety of practical ways to modify your training runs.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nCharles Martin – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nWeightWatcher\nTalk from the Silicon Valley ACM meetup\nA deep dive into the theory behind WeightWatcher (a talk from ENS)\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/194",
          "publishedOn": "2022-09-20T19:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 194: Evaluating models without test data",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/194/practical-ai-194.mp3",
            "length": "43329620",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/QpLE",
          "author": "Travis Turner",
          "description": "This essential guide is designed to be useful for pretty much any team member: find out why your project would benefit from a shared set of practices and patterns between designers and frontend engineers.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/5-signs-your-project-needs-a-design-system",
          "publishedOn": "2022-09-20T15:53:00.000Z",
          "wordCount": null,
          "title": "5 signs your project needs a design system",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1ld",
          "author": "Adam Stacoviak",
          "description": "Here’s Paul Graham with some wise advice he’s learned from YC’s users — this also tees up a large conversation on this Friday’s episode of The Changelog (talk to your users).\nI recently told applicants to Y Combinator that the best advice I could give for getting in, per word, was. Explain what you’ve learned from users.\nHere’s why that makes sense.\nThat tests a lot of things: whether you’re paying attention to users, how well you understand them, and even how much they need what you’re making.\nBut giving this advice made Paul consider what he has learned from YC’s users (the startups they’ve funded). This one is almost cliché at this point, but still quite true.\nFocus is doubly important for early stage startups, because not only do they have a hundred different problems, they don’t have anyone to work on them except the founders. If the founders focus on things that don’t matter, there’s no one focusing on the things that do.\nDiscuss on Changelog News",
          "link": "http://paulgraham.com/users.html",
          "publishedOn": "2022-09-20T15:04:27.000Z",
          "wordCount": null,
          "title": "What I've learned from users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7oJ",
          "author": "Klemen Sever",
          "description": "We’re currently refurbishing 🙃 our authentication stack at Back Market, and we need to onboard our developers and teams to various OAuth2 concepts. Here’s our take on OAuth2 (with cute shapes.\n\nDiscuss on Changelog News",
          "link": "https://engineering.backmarket.com/oauth2-explained-with-cute-shapes-7eae51f20d38",
          "publishedOn": "2022-09-20T14:35:00.000Z",
          "wordCount": null,
          "title": "OAuth2 explained with cute shapes",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1850",
          "author": null,
          "description": "Andreas Kling’s new cross-platform browser project, Dan Hollick’s nerdy deep-dive on QR code tech, Stephan Dilly’s Rust-based terminal UI for Git, Miłosz Piechocki’s opinion on junior vs senior engineers & Divam Gupta’s Tensorflow port of Stable Diffusion.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\n📥 Subscribe to Changelog Weekly\nLadybird: A new cross-platform browser project\nQR Codes\nGitUI\n\nGitX-dev\nGitUp\nWhat makes a Senior Engineer?\nTensorflow port of the Stable Diffusion model\n\nDiffusion Bee\nr/stablediffusion\n🎧 Lucas Da Costa on The Changelog #340\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-19",
          "publishedOn": "2022-09-19T18:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Ladybird, how QR codes work, GitUI, software vs systems & Stable Diffusion ported to Tensorflow",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-19/the-changelog-news-2022-09-19.mp3",
            "length": "7909753",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7Y09",
          "author": "Jerod Santo",
          "description": "Tan Li Hau gave this talk at Front Conference, but the videos won’t be out for a year (!), so he gave the talk again and posted it to his YouTube channel. Here’s how he described the video to us:\nWatch the <1 hour video to write a simplified Svelte compiler <300 lines of code is amazing! Easy to follow, inspiring, and gives a great overview of how to write a compiler.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=mwvyKGw2CzU",
          "publishedOn": "2022-09-19T15:21:00.000Z",
          "wordCount": null,
          "title": "Build your own Svelte",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lgm",
          "author": "Jerod Santo",
          "description": "Here’s the motivation behind this Rust-based TUI:\nI do most of my git work in a terminal but I frequently found myself using git GUIs for some use-cases like: index, commit, diff, stash, blame and log.\nUnfortunately popular git GUIs all fail on giant repositories or become unresponsive and unusable.\nGitUI provides you with the user experience and comfort of a git GUI but right in your terminal while being portable, fast, free and open source.\n\nDiscuss on Changelog News",
          "link": "https://github.com/extrawurst/gitui",
          "publishedOn": "2022-09-19T14:35:00.000Z",
          "wordCount": null,
          "title": "A fast terminal UI for Git",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1843",
          "author": null,
          "description": "This week on The Changelog we’re talking about Stable Diffusion, DALL-E, and the impact of AI generated art. We invited our good friend Simon Willison on the show today because he wrote a very thorough blog post titled, “Stable Diffusion is a really big deal.”\nYou may know Simon from his extensive contributions to open source software. Simon is a co-creator of the Django Web framework (which we don’t talk about at all on this show), he’s the creator of Datasette, a multi-tool for exploring and publishing data (which we do talk about on this show)…most of all Simon is a very insightful thinker, which he puts on display here on this episode. We talk from all the angles of this topic, the technical, the innovation, the future and possibilities, the ethical and the moral – we get into it all. …",
          "link": "https://changelog.com/podcast/506",
          "publishedOn": "2022-09-16T20:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 506: Stable Diffusion breaks the internet",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/506/the-changelog-506.mp3",
            "length": "74282049",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1839",
          "author": null,
          "description": "Austin Gil joins the show and KBall continues an old email correspondence about the JS community and growth. Then, the gang plays a round of TIL where Austin shares his learnings about the HTML capture attribute. Finally, Austin shares what it’s like to have a blog post blow up.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nDEX: Sort the Madness – Join our friends at Sentry for their upcoming developer experience conference called DEX: Sort the Madness. This event will be in-person in San Francisco AND virtual on September 28. This is a free conference by developers for developers where you’ll sort through the madness and look at ways to improve workflow productivity. Learn more and register\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nHasura – Create dynamic high-performance GraphQL & REST APIs from your database(s) in minutes with granular authorization and caching baked in. All without touching your underlying database. Go from data to API in minutes. Get started for free at hasura.io/jsparty\n\n    \nFeaturing\nAustin Gil – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nTIL: You can access a user’s camera with just HTML\nHN Link\nVideo Explainer\nObsidian\nObsidian Sample Plugin\nOODA Loop\nFunction Call podcast\nSubmit to Changelog News\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/243",
          "publishedOn": "2022-09-16T17:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 243: Smile! HTML can access your camera",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/243/js-party-243.mp3",
            "length": "64395571",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwby",
          "author": "Jerod Santo",
          "description": "So you got tired of AI just suggesting code edits, and now you want it to help you run code, too. Silly human, you have come to the right place. This will take five steps.\nThis gets an A+ for creativity. Fire up your shell, then launch Neovim. Then shell out with :VimShell to get back to where you started, but with Copilot suggestions.\nMy guess is the ergonomics of this are… bad. But a cool hack, regardless!\nDiscuss on Changelog News",
          "link": "https://github.com/maxwell-bland/copilot-in-the-terminal",
          "publishedOn": "2022-09-16T15:26:00.000Z",
          "wordCount": null,
          "title": "Hacking  GitHub Copilot in to the terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwZG",
          "author": "Jerod Santo",
          "description": "This tool calls itself the “best RSS search experience you can find” but really, are there other RSS search experiences out there? The results are a little underwhelming at the moment, but I’m sharing it because RSS and I’m sure it’ll get better with more eyes/feeds on it. 👀\nDiscuss on Changelog News",
          "link": "https://github.com/dato-ai/dato.rss",
          "publishedOn": "2022-09-16T14:38:00.000Z",
          "wordCount": null,
          "title": "A search engine based on RSS feeds",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X1Nk",
          "author": "Jerod Santo",
          "description": "Devon Zuegel draws a comparison that I would’ve never thought of:\nPirate crews developed a surprisingly similar approach to compensation in the 17th century. Just like many startups, they also balanced equity incentives with other mechanisms that would be familiar to a startup employee today, such as bonuses.\nThese surprising similarities offer an interesting frame through which we can reflect on why startup equity and bonuses are structured the way they are. We can learn a lot about the theory of compensation in modern companies by looking at how pirates designed incentives to organize and motivate their work.\nMaybe it’s time to stop hiring “frontend wizards” and start looking for “frontend pirates” instead, matey.\nDiscuss on Changelog News",
          "link": "https://devonzuegel.com/post/uncharted-waters-what-startups-can-learn-from-pirates-about-compensation",
          "publishedOn": "2022-09-16T13:48:00.000Z",
          "wordCount": null,
          "title": "What startups can learn from pirates about compensation",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1701",
          "author": null,
          "description": "Inbal Cohen, Product expert and Agile evangelist, joins Natalie & Angelica for a conversation about all things Agile. Inbal lays out some agile tips for Go devs, discusses if and how remote work changes things, describes some downsides of the methodology, and more.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nInbal Cohen – Twitter, LinkedIn\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/247",
          "publishedOn": "2022-09-15T16:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 247: Stay agile out there",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/247/go-time-247.mp3",
            "length": "59906758",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/5jrY",
          "author": "Jerod Santo",
          "description": "Dan Hollick nerds out on the history and anatomy of a QR code. This bit at the end is super cool:\nPerhaps the coolest thing about QR codes is that Denso Wave, the company that invented them, never exercised their patent and released the technology for free!\n\nDiscuss on Changelog News",
          "link": "https://typefully.com/DanHollick/qr-codes-T7tLlNi",
          "publishedOn": "2022-09-15T14:48:00.000Z",
          "wordCount": null,
          "title": "Ever wondered how a QR code works?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDoR",
          "author": "Alex Ellis",
          "description": "The title of this post is “Why I Love Go”, I saw it shared by Rob Pike (one of the founding team for Go). In the post David Yach talks about how productive interns can be with Go, writing substantial prototypes in a short period of time. That’s one of the reasons I like to use it for OSS container/networking projects and developer tools too.\nDiscuss on Changelog News",
          "link": "https://cloud.google.com/blog/products/application-modernization/why-david-yach-loves-go",
          "publishedOn": "2022-09-15T14:02:00.000Z",
          "wordCount": null,
          "title": "Why David Yach loves Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOLW",
          "author": "Jerod Santo",
          "description": "Jaun Diego covers some little known yet extremely useful APIs, such as the Page Visibility, Web Sharing, Broadcast ChanneI and Internationalization.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/09/javascript-api-guide/",
          "publishedOn": "2022-09-15T13:13:00.000Z",
          "wordCount": null,
          "title": "JavaScript APIs you (probably) don’t know about",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1695",
          "author": null,
          "description": "In today’s Kaizen episode, we talk about shipping Adam’s Christmas present: chapter support for all Changelog episodes that we now publish. This feature was hard because there are many subtle differences in how the ID3 spec is implemented. Of course, once the PR shipped, there were other issues to solve, including an upgrade the world kind of scenario. Since Lars Wikman did all the heavy ID3 lifting, he is here with us too.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of …",
          "link": "https://changelog.com/shipit/70",
          "publishedOn": "2022-09-14T18:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 70: Kaizen! Four PRs, one big feature",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/70/ship-it-70.mp3",
            "length": "64690999",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqLQ",
          "author": "Jerod Santo",
          "description": "This nifty little web app lets you tour the history of a file on GitHub. The coolest part about it is that you don’t have to download or install anything! Just change the github.com part of the URL with github.githistory.xyz and you’re in action!\n\nDiscuss on Changelog News",
          "link": "https://githistory.xyz/",
          "publishedOn": "2022-09-14T13:23:01.000Z",
          "wordCount": null,
          "title": "Quickly browse the history of files in any git repo",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1841",
          "author": null,
          "description": "The new stable diffusion model is everywhere! Of course you can use this model to quickly and easily create amazing, dream-like images to post on twitter, reddit, discord, etc., but this technology is also poised to be used in very pragmatic ways across industry. In this episode, Chris and Daniel take a deep dive into all things stable diffusion. They discuss the motivations for the work, the model architecture, and the differences between this model and other related releases (e.g., DALL·E 2).\n\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAnnouncement blog post\nStable diffusion paper\nBlog post about the model from Marc Päpper\nStable Diffusion on Hugging Face\nHugging Face Diffusers library\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/193",
          "publishedOn": "2022-09-13T22:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 193: Stable Diffusion",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/193/practical-ai-193.mp3",
            "length": "42687303",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/49Y3",
          "author": "Jerod Santo",
          "description": "This is cool because portability. But also because you can embed it as a library in your Go projects. It’s not identical to jq in practice, though. Here’s a long list of differences between the two.\nDiscuss on Changelog News",
          "link": "https://github.com/itchyny/gojq",
          "publishedOn": "2022-09-13T21:01:00.000Z",
          "wordCount": null,
          "title": "A pure Go implementation of jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM7L",
          "author": "Jerod Santo",
          "description": "This is a nice round-up of some new(ish) HTML and JavaScript features related to forms. Now that Safari 16 is out, good stuff like requestSubmit and showPicker are looking pretty green!\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/whats-new-with-forms-in-2022/",
          "publishedOn": "2022-09-13T20:12:00.000Z",
          "wordCount": null,
          "title": "What’s new with forms in 2022?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoAj",
          "author": "Jerod Santo",
          "description": "Hillel Wayne:\nI practice “weak TDD”, which just means “writing tests before code, in short feedback cycles”. This is sometimes derogatively referred to as “test-first”. Strong TDD follows a much stricter “red-green-refactor” cycle…\nTurns out I also practice “weak TDD” most of the time, but I didn’t know there was a (derogatory) term for it. In this post, Hillel lays out why he does weak TDD and why he doesn’t do strong TDD. Oh, and stick around to the end to learn why he thinks TDD hasn’t conquered the world…\nDiscuss on Changelog News",
          "link": "https://buttondown.email/hillelwayne/archive/i-have-complicated-feelings-about-tdd-8403/",
          "publishedOn": "2022-09-13T18:45:00.000Z",
          "wordCount": null,
          "title": "I have complicated feelings about TDD",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1A4",
          "author": "Jerod Santo",
          "description": "A lot of ink has been spilt over the years trying to elucidate the divide between junior and senior. Miłosz Piechocki makes the distinction this way:\nJunior Engineers care about writing Software. They value code quality, employ best practices, try to adopt cutting-edge technologies. They invest a lot of time into learning new technologies. To them, the ultimate goal is to create elegant, performant, maintainable software.\nSenior Engineers care about building Systems. To them, creating software is just one of the steps. First of all, they question whether the software needs to be built in the first place. They ask what problems would it solve and why it’s important to solve them. They inquire who will be using the software and on what scale. They think about where the software would run and how they’re going to monitor whether it’s working properly. They also decide how to measure whether the software is actually solving the problems it was supposed to solve.\nHe goes on to describe how hard it is to build Systems and lists activities that are part of that process.\nDiscuss on Changelog News",
          "link": "https://codewithstyle.info/software-vs-systems/",
          "publishedOn": "2022-09-13T15:03:00.000Z",
          "wordCount": null,
          "title": "What makes a senior engineer? Writing software vs building systems",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1840",
          "author": null,
          "description": "Jacob Kaplan-Moss writes up a hot take on software quality, Wilfred Hughes creates the diff tool he’s always wanted, Josh Collinsworth thinks React is only great at being popular, Jetpack’s Devbox project looks pretty cool & James Williams sets out to find the shortest URLs on the internet. Oh, and chapters are here!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\n📥 Subscribe to Changelog Weekly\nAll Things Open 2022\nQuality is Systemic\n\n🎧 Jacobian on The Changelog #479\nDifftastic, the Fantastic Diff\n\nDifftastic\nDo things, tell people\nThe self-fulfilling prophecy of React\nDevbox\n\nJoin our community!\n🎧 Subscribe to Ship It!\nShortest URLs on the Internet\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-12",
          "publishedOn": "2022-09-12T18:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Quality is systemic, React is a self-fulfilling prophecy, Difftastic, Devbox & the shortest URLs on the web",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-12/the-changelog-news-2022-09-12.mp3",
            "length": "9777366",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1AJ",
          "author": "Jerod Santo",
          "description": "11ty creator Zach Leatherman recently released a standalone HTML serializer for generating markup for Web Components. Here’s what Zach had to say about it on Twitter:\nThis is an early preview and I welcome feedback! I think it’s a great way to build standards-based HTML-first components without JavaScript framework overhead 🙌🏻\nDiscuss on Changelog News",
          "link": "https://github.com/11ty/webc",
          "publishedOn": "2022-09-12T13:32:01.000Z",
          "wordCount": null,
          "title": "WebC is for single file Web Components",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEOD",
          "author": "Jerod Santo",
          "description": "Jacob Kaplan-Moss with a hot take on software quality:\nSoftware quality is more the result of a system designed to produce quality, and not so much the result of individual performance. That is: a group of mediocre programmers working with a structure designed to produce quality will produce better software than a group of fantastic programmers working in a system designed with other goals.\nWhat does he mean by “a system designed for quality”? Read on to see for yourself..\nDiscuss on Changelog News",
          "link": "https://jacobian.org/2022/sep/9/quality-is-systemic/",
          "publishedOn": "2022-09-09T21:30:00.000Z",
          "wordCount": null,
          "title": "Quality is systemic",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1837",
          "author": null,
          "description": "This week we’re joined by Jason Bosco, co-founder and CEO of Typesense — the open source Algolia alternative and the easier to use ElasticSearch alternative. For years we’ve used Algolia as our search engine, so we come to this conversation with skin in the game and the scars to prove it. Jason shared how he and his co-founder got started on Typesense, why and how they are “all in” on open source, the options and the paths developers can take to add search to their project, how Typesense compares to ElasticSearch and Algolia, he walks us through getting started, the story of Typesense Cloud, and why they have resisted Venture Capital.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nFly.io – Deploy your apps a…",
          "link": "https://changelog.com/podcast/505",
          "publishedOn": "2022-09-09T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 505: Typesense is truly open source search",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/505/the-changelog-505.mp3",
            "length": "77232672",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Eq5Q",
          "author": "Ciprian Dorin Craciun",
          "description": "When it comes to static sites, there are a myriad of solutions for authoring and compiling, but talk about hosting these static sites, and we are still in the early 2000s. I discuss the challenges one faces when hosting, and even make a proposal to solve some of these.\nDiscuss on Changelog News",
          "link": "https://notes.volution.ro/v1/2022/09/notes/b08118d8/",
          "publishedOn": "2022-09-09T20:41:00.000Z",
          "wordCount": null,
          "title": "Static site hosting hurdles",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdAG",
          "author": "Jerod Santo",
          "description": "Based on the excellent Gradio library that we’ve featured on Practical AI.\n\nDiscuss on Changelog News",
          "link": "https://github.com/AUTOMATIC1111/stable-diffusion-webui",
          "publishedOn": "2022-09-09T19:50:00.000Z",
          "wordCount": null,
          "title": "A web UI for Stable Diffusion",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1823",
          "author": null,
          "description": "Jerod, KBall & Nick “Holla!” at React India, share what we’re excited about these days, and then take up a KBall topic that goes off the rails but manages to climb back on them, power through, and end up in a good place.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash …",
          "link": "https://changelog.com/jsparty/242",
          "publishedOn": "2022-09-09T19:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 242: Seth Godin is the new Mark Twain",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/242/js-party-242.mp3",
            "length": "55725077",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1802",
          "author": null,
          "description": "Egon Elbre and Roger Peppe join Mat for a conversation all about bloat (and how to avoid it). Expect talk of code bloat, binary bloat, feature bloat, and an even-more-bloated-than-usual unpopular opinion segment.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nEgon Elbre – Twitter, GitHub, LinkedIn\nRoger Peppe – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nCUE lang\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/246",
          "publishedOn": "2022-09-08T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 246: Avoiding bloat",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/246/go-time-246.mp3",
            "length": "61502972",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X19k",
          "author": "Adam Stacoviak",
          "description": "The ideas behind WikiHouse remind me of the conversation we had with Marcin Jakubowski from Open Source Ecology early last year (changelog.fm/428).\nSustainable should be the new normal. Think global, manufacture local. It’s all open source.\nEverything is on GitHub (from what I can tell).\nDiscuss on Changelog News",
          "link": "https://www.wikihouse.cc/",
          "publishedOn": "2022-09-08T15:51:02.000Z",
          "wordCount": null,
          "title": "Open source, modular, wood based, zero carbon housing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mldE",
          "author": "Adam Stacoviak",
          "description": "Josh Collinsworth (an unapologetic React non-fan) writes on his blog about the ubiquity of React:\nI don’t know what the future of front-end looks like. Nobody really does. But it’s a very safe bet that React will continue to be the thing for a very long time.\nIf you’re learning front-end development in the hopes of getting a job, or trying to level up your career, and React is a knowledge gap for you, it seems like the safest bet you could make. React isn’t going anywhere anytime soon. That said, however…\nBut why does React remain on top?\nBecause we don’t always value the strongest choice as much as we value consensus. (In fact, you could make an argument that consensus is the strongest choice, in many ways.)\nReact keeps getting picked…because React keeps getting picked.\nBut there’s a ton more to unpack. Josh got into the details on the best choice for the job, covering: Performance, learning curve, bundle size, scalability, community and support, financial backing, hireability, and developer experience.\nShould I spoil it for you? Nah. Read Josh’s words for the full story.\nDiscuss on Changelog News",
          "link": "https://joshcollinsworth.com/blog/self-fulfilling-prophecy-of-react",
          "publishedOn": "2022-09-08T15:13:39.000Z",
          "wordCount": null,
          "title": "\"React isn't great at anything except being popular\"",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqGl",
          "author": "Jerod Santo",
          "description": "This was my favorite moment from our episode with Chris Coyier. I asked him what’s interesting in the frontend world these days and Chris went off for almost five minutes. His enthusiasm is contagious!\n\nDiscuss on Changelog News",
          "link": "https://youtu.be/YHC8jEgpVfk",
          "publishedOn": "2022-09-08T14:47:00.000Z",
          "wordCount": null,
          "title": "These new features will change how we write CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1678",
          "author": null,
          "description": "Maybe it’s the Californian sun. Or perhaps it’s the time spent at Disney Studios, the home of the best stories. One thing is for sure: Taylor Dolezal is one of the happiest cloud native people that Gerhard knows.\nAs a former Lead SRE for Disney Studios, Taylor has significant hands-on experience running cloud native technologies in a large company. After a few years as a HashiCorp Developer Advocate, Taylor is now Head of End User Ecosystem at CNCF. In his current role, he is helping enable cloud native success for end-users like Boeing, Mercedes Benz & many others.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual da…",
          "link": "https://changelog.com/shipit/69",
          "publishedOn": "2022-09-08T14:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 69: The cloud native ecosystem",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/69/ship-it-69.mp3",
            "length": "73479460",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qp8M",
          "author": "Jerod Santo",
          "description": "Here’s Natasha Lekh from Apify describing the project:\nThis project really is a culmination of 4 years of work trying to make the best library for web scraping in production. Web scraping is a very dynamic environment and what works today might not work tomorrow, so we at Apify had to go through a lot of trial and error to figure out the most reliable and convenient ways of crawling the web and scraping data. We hope that we finally cracked it and that now many developers will enjoy working with our new library and it will make their scrapers more reliable and time to production faster.\nI like how it starts with simple HTTP-based scraping, but can switch to browser-based automation when a site has JavaScript rendering. I don’t love the built-in proxy rotation features. Not because they’re bad, per se, but because they make spammers lives easier…\nDiscuss on Changelog News",
          "link": "https://crawlee.dev",
          "publishedOn": "2022-09-08T13:22:00.000Z",
          "wordCount": null,
          "title": "Crawlee is a web scraping & browser automation library for Node.js",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jMY",
          "author": "Jerod Santo",
          "description": "I don’t know how practical this font is, but I do know how cool this font is…\n\nDiscuss on Changelog News",
          "link": "https://github.com/IdreesInc/Monocraft",
          "publishedOn": "2022-09-07T15:40:00.000Z",
          "wordCount": null,
          "title": "A programming font based on the typeface used in Minecraft",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOdW",
          "author": "Jerod Santo",
          "description": "The Preact team dropped a new state management solution on us:\nSignals are a way of expressing state that ensure apps stay fast regardless of how complex they get. Signals are based on reactive principles and provide excellent developer ergonomics, with a unique implementation optimized for Virtual DOM.\nAdding Signals to your Preact app only adds 1.6kB to your bundle size. So what’s the big idea?\nThe main idea behind signals is that instead of passing a value directly through the component tree, we pass a signal object containing the value (similar to a ref). When a signal’s value changes, the signal itself stays the same. As a result, signals can be updated without re-rendering the components they’ve been passed through, since components see the signal and not its value. This lets us skip all of the expensive work of rendering components and jump immediately to the specific components in the tree that actually access the signal’s value.\nDiscuss on Changelog News",
          "link": "https://preactjs.com/blog/introducing-signals/",
          "publishedOn": "2022-09-07T14:47:00.000Z",
          "wordCount": null,
          "title": "The Preact team introduces Signals",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pjdM",
          "author": "Jerod Santo",
          "description": "Julie Qiu, announcing Go’s new support for vulnerability management:\nGo provides tooling to analyze your codebase and surface known vulnerabilities. This tooling is backed by the Go vulnerability database, which is curated by the Go security team. Go’s tooling reduces noise in your results by only surfacing vulnerabilities in functions that your code is actually calling.\nThere’s a new govulncheck command you can/should install and run against your project. It surfaces only the vulnerabilities that actually affect you, which is awesome.\nGovulncheck is a standalone tool to allow frequent updates and rapid iteration while we gather feedback from users. In the long term, we plan to integrate the govulncheck tool into the main Go distribution.\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/vuln",
          "publishedOn": "2022-09-07T13:49:00.000Z",
          "wordCount": null,
          "title": "Vulnerability management for Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1834",
          "author": null,
          "description": "AI is increasingly being applied in creative and artistic ways, especially with recent tools integrating models like Stable Diffusion. This is making some artists mad. How should we be thinking about these trends more generally, and how can we as practitioners release and license models anticipating human impacts? We explore this along with other topics (like AI models detecting swimming pools 😊) in this fully connected episode.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAutomation and creativity\nGoodbye, humans: Call centers ‘could save $80b’ switching to AI\nDALL-E can now use AI to extend images as a human artist might\nAn AI-Generated Artwork Won First Place at a State Fair Fine Arts Competition, and Artists Are Pissed\nNation states and AI\nUndeclared pools in France uncovered by AI technology\nFrance reveals hidden swimming pools with AI, taxes them\nNvidia says U.S. government allows A.I. chip development in China\nForeign Affairs:  Spirals of Delusion - How AI Distorts Decision-Making and Makes Dictators More Dangerous\nResources\nOpen RAIL Licenses\nNormConf\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/192",
          "publishedOn": "2022-09-06T21:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 192: Licensing & automating creativity",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/192/practical-ai-192.mp3",
            "length": "43227790",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1835",
          "author": null,
          "description": "Martin Heinz thinks you should be using Python’s walrus operator, you probably believe some falsehoods about email, Carlos Fenollosa threw in the towel after self-hosting his email for 23 years & Leon is an open source personal assistant that can live on your server.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly!\nPython’s Walrus Operator\nEmail falsehoods\n\nThere’s only ONE way to validate\nNo more self-hosting\nLeon.ai\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-05",
          "publishedOn": "2022-09-06T21:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Python's :=, email falsehoods, no more self-hosting & Leon",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-05/the-changelog-news-2022-09-05.mp3",
            "length": "5348246",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/AXNj",
          "author": "Gerhard Lazu",
          "description": "If Nix seems too daunting, this might just be a great way to reap one of its benefits without getting lost in its complexity.\nDevbox is a command-line tool that lets you easily create isolated shells and containers. You start by defining the list of packages required by your development environment, and devbox uses that definition to create an isolated environment just for your application.\nDiscuss on Changelog News",
          "link": "https://github.com/jetpack-io/devbox",
          "publishedOn": "2022-09-06T16:00:00.000Z",
          "wordCount": null,
          "title": "Instant, easy, predictable shells and containers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW05",
          "author": "Austin Gil",
          "description": "It’s cool to see the how far HTML has come. Every once in a while I find something that seems super powerful, wrapped up in a simple implementation. This time it was the HTML capture attribute.\nDiscuss on Changelog News",
          "link": "https://austingil.com/html-capture-attribute/",
          "publishedOn": "2022-09-06T15:13:00.000Z",
          "wordCount": null,
          "title": "TIL: You can access a user’s camera with just HTML",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1Ao",
          "author": "Adam Stacoviak",
          "description": "In the world of messaging (today), you have behemoths like WhatsApp and iMessage, and they are “backed by some of the richest companies in the world.” And then there’s Signal. It’s run by a nonprofit and pretty much operates as the exact opposite — they are committed to end-to-end encryption, does not collect or store sensitive information, or backups of user data.\nThis post from Nitasha Tiku on The Washington Post gives a detailed backstory on Meredith Whittaker, former Google manager, and her arrival to Signal as President (and board member since 2020), as well as why Signal “hopes to support itself with small donations from millions of users.”\nThe only way to escape technology that makes money off your data is by paying for products that don’t, Whittaker says. An alternative to data collection only exists if the community of people who rely on it “kick in a little bit,” she said.\nSignal is one of the few successful tech products, like the Firefox browser, led by vociferous critics of Big Tech. The app offers end-to-end encryption on group text, voice and video chat, does not collect or store sensitive information and does not store backups of your data on its servers — a viable alternative to relentless data gathering at the center of tech industry critiques.\nDiscuss on Changelog News",
          "link": "https://www.washingtonpost.com/technology/2022/09/06/signal-meredith-whittaker/",
          "publishedOn": "2022-09-06T14:26:29.000Z",
          "wordCount": null,
          "title": "Signal hired one of Big Tech’s sharpest critics and wants your donations",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1826",
          "author": null,
          "description": "This week we’re sharing the most popular episode of Go Time from last year — Go Time #196. We believe this episode was the most popular because it’s all about building actually maintainable software and what goes into that. Kris Brandow is joined by Johnny Boursiquot, Ian Lopshire, and Sam Boyer. There’s lots of hot takes, disagreements, and unpopular opinions.\nThis is part two of a three part mini-series led by Kris on maintenance. Make sure you check out Go Time #195 and Go Time #202 to continue the series.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nInfluxData – All of the open source software InfluxData creates is either MIT-licensed or Apache2-licensed. These are very permissive licenses. But wh…",
          "link": "https://changelog.com/podcast/504",
          "publishedOn": "2022-09-02T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 504: Building actually maintainable software ♻️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/504/the-changelog-504.mp3",
            "length": "71870887",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1811",
          "author": null,
          "description": "Dr. Gleb Bahmutov returns to the party for a wide-ranging discussion on open source, end-to-end testing, Cypress, and more. Amal, Divya & Chris host.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trus…",
          "link": "https://changelog.com/jsparty/241",
          "publishedOn": "2022-09-02T16:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 241: The doctor is in (again)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/241/js-party-241.mp3",
            "length": "69056401",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Jgb2",
          "author": "Adam Stacoviak",
          "description": "Like many software engineers, Matt Bilyeu receives multiple emails from recruiters weekly. And, because he’s polite (and for other reasons) he tries to respond (politely) to all of them. But…\nIt would be ideal if I could automate sending these responses. Assuming I get four such emails per week and that it takes two minutes to read and respond to each one, automating this would save me about seven hours of administrative work per year.\nEnter the GPT-3 API and some code that gets run by a future cron job (now that he’s tested this on a handful of emails) and Matt auto-responds to al the emails, continues to be polite, while also saving (his) time. It’s AI Matt responding the way real Matt would.\nDiscuss on Changelog News",
          "link": "https://matthewbilyeu.com/blog/2022-09-01/responding-to-recruiter-emails-with-gpt-3",
          "publishedOn": "2022-09-02T16:36:08.000Z",
          "wordCount": null,
          "title": "Responding to recruiter emails with GPT-3",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qp0E",
          "author": "Jerod Santo",
          "description": "This course from the folks at web.dev targets beginners and advanced developers alike.\nYou’ll learn PWA fundamentals like the Web App Manifest, service workers, how to design with an app in mind, what’s different from a classic web app, how to use other tools to test and debug your PWA. After these fundamentals, you’ll learn about integration with the platform and operating system, how to enhance your PWA’s installation and usage experience, and how to offer an offline experience.\nDiscuss on Changelog News",
          "link": "https://web.dev/learn/pwa/",
          "publishedOn": "2022-09-02T15:34:00.000Z",
          "wordCount": null,
          "title": "A course that breaks down every aspect of modern PWA development",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDdR",
          "author": "Jerod Santo",
          "description": "It’s easy to fool ourselves into believing the world is normal, sensible, and without rare-but-undeniably-valid edge and corner cases. Maybe you’ve done this to yourself with email. I’m guilty.\nOne example, we do email-based authentication (no passwords!) because I believe(d) this particular falsehood:\nEmails will be received soon after they’re sent\nI wish it were always true! Thankfully, there’s a lot of things on the linked list that I don’t believe. Do you?\nDiscuss on Changelog News",
          "link": "https://beesbuzz.biz/code/439-Falsehoods-programmers-believe-about-email",
          "publishedOn": "2022-09-02T14:40:00.000Z",
          "wordCount": null,
          "title": "Falsehoods programmers believe about email",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/outreach-initiatives/google-org/our-commitment-on-using-ai-to-accelerate-progress-on-global-development-goals/",
          "author": null,
          "description": "I joined Google earlier this year to lead a new function: Technology & Society. Our aim is to help connect research, people and ideas across Google to shape the future of our technology innovations and their impact on society for the better. A key area of focus is AI, a field I have studied and immersed myself in over the years. I recently met with a team at the Google AI Center in Ghana that is using advanced technology to address an ancient problem: detecting locust outbreaks which threaten food security and livelihoods for millions of people. And in India and Bangladesh, our Crisis Response teams are using our machine-learning-based forecasting to provide over 360 million people with alerts about upcoming floods.\n\n\nEfforts like these make me optimistic about how AI can contribute to sol…",
          "link": "https://blog.google/outreach-initiatives/google-org/our-commitment-on-using-ai-to-accelerate-progress-on-global-development-goals/",
          "publishedOn": "2022-09-15T15:45:00.000Z",
          "wordCount": 1378,
          "title": "Our commitment on using AI to accelerate progress on global development goals"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=19536",
          "author": "Daniel Stenberg",
          "description": "Already when the first version of curl shipped in 1998, I had plans and ideas in the back of my head to turn it to a library at some point. I had already before worked on providing libraries with APIs for applications and I appreciated their powers. During the summer of 2000 I refactored the … Continue reading The first 300 setopts →",
          "link": "https://daniel.haxx.se/blog/2022/09/28/the-first-300-setopts/",
          "publishedOn": "2022-09-28T11:55:36.000Z",
          "wordCount": 1011,
          "title": "The first 300 setopts"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20284",
          "author": "Daniel Stenberg",
          "description": "Tldr; test and verify as much as possible also in the documentation. I’m a sloppy typist. When I write several words in a row, like for example when creating complete sentences for something like a blog post, one or two of the words end up slightly misspelled. Sure, many editors and systems have runtime spellchecks … Continue reading Taking curl documentation quality up one more notch →",
          "link": "https://daniel.haxx.se/blog/2022/09/22/taking-curl-documentation-quality-up-one-more-notch/",
          "publishedOn": "2022-09-22T07:27:14.000Z",
          "wordCount": 1821,
          "title": "Taking curl documentation quality up one more notch"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20050",
          "author": "Daniel Stenberg",
          "description": "The dash-dash-libcurl is the sometimes missed curl gem that you might want to know about and occasionally maybe even use. How do I convert There is a very common pattern in curl land: a user who is writing an application using language L first does something successfully with the curl command line tool and then … Continue reading convert a curl cmdline to libcurl source code →",
          "link": "https://daniel.haxx.se/blog/2022/09/12/convert-a-curl-cmdline-to-libcurl-source-code/",
          "publishedOn": "2022-09-12T06:42:48.000Z",
          "wordCount": 828,
          "title": "convert a curl cmdline to libcurl source code"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20184",
          "author": "Daniel Stenberg",
          "description": "The other day I sent out this tweet As it took off, got an amazing attention and I received many different comments and replies, I felt a need to elaborate a little. To add some meat to this. Is this string really a legitimate URL? What is a URL? How is it parsed? http://http://http://@http://http://?http://#http:// curl … Continue reading http://http://http://@http://http://?http://#http:// →",
          "link": "https://daniel.haxx.se/blog/2022/09/08/http-http-http-http-http-http-http/",
          "publishedOn": "2022-09-08T11:43:08.000Z",
          "wordCount": 1121,
          "title": "http://http://http://@http://http://?http://#http://"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20145",
          "author": "Daniel Stenberg",
          "description": "This is a tale of cookies, Internet code and a CVE. It goes back a long time so please take a seat, lean back and follow along. The scene is of course curl, the internet transfer tool and library I work on. 1998 In October 1998 we shipped curl 4.9. In 1998. Few people had … Continue reading A bug that was 23 years old or not →",
          "link": "https://daniel.haxx.se/blog/2022/09/05/a-bug-that-was-23-years-old-or-not/",
          "publishedOn": "2022-09-05T06:31:03.000Z",
          "wordCount": 2012,
          "title": "A bug that was 23 years old or not"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20025",
          "author": "Daniel Stenberg",
          "description": "Every human has a unique fingerprint. With only an impression of a person’s fingertip, it is possible to follow the lead back to the single specific individual wearing that unique pattern. TLS fingerprints The phrase TLS fingerprint is of course in this spirit. A pattern in a TLS handshake that allows an involved party to … Continue reading curl’s TLS fingerprint →",
          "link": "https://daniel.haxx.se/blog/2022/09/02/curls-tls-fingerprint/",
          "publishedOn": "2022-09-02T11:46:17.000Z",
          "wordCount": 1490,
          "title": "curl’s TLS fingerprint"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-10-01T12:22:12.675Z",
          "wordCount": 1488,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-09-21T12:25:03.166Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-09-20T12:26:13.738Z",
          "wordCount": 1356,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-09-16T12:21:13.565Z",
          "wordCount": 2037,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-09-15T12:25:53.281Z",
          "wordCount": 1274,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-09-15T12:25:53.255Z",
          "wordCount": 884,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-09-11T12:19:47.586Z",
          "wordCount": 818,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-09-10T12:19:12.238Z",
          "wordCount": 982,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-09-05T12:21:05.314Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-09-04T12:19:42.494Z",
          "wordCount": 1603,
          "title": "Data transfer in Manhattan using RocksDB"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47919",
          "author": "Schalk Neethling",
          "description": "In June 2021, we decided to start converting the source code for MDN web docs from HTML into a format that would be easier for us to work with. The goal was to get 100% of our manually-written documentation converted to Markdown, and we really had a mountain of source code to climb for this particular expedition.\nIn this post, we’ll describe why we decided to migrate to Markdown, and the steps you can take that will help us on our mission.\nThe post The 100% Markdown Expedition appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/09/the-100-percent-markdown-expedition/",
          "publishedOn": "2022-09-08T09:14:51.000Z",
          "wordCount": 2997,
          "title": "The 100% Markdown Expedition"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=67361",
          "author": "Shelley McKinley",
          "description": "Access to the open internet is essential to defending human rights, and developers have an important role in promoting freedom of expression and transparency. GitHub is committed to keeping Iranians connected to the global developer community.",
          "link": "https://github.blog/2022-09-29-github-supports-internet-freedom-and-global-availability-in-iran/",
          "publishedOn": "2022-09-29T19:11:29.000Z",
          "wordCount": 1014,
          "title": "GitHub supports internet freedom and global availability in Iran"
        },
        {
          "id": "https://github.blog/?p=67322",
          "author": "Klint Finley",
          "description": "Tech can be a tricky industry (to say the least). We talked with three tech professionals who share why they stay, what has helped them the most, and the power of switching things up.",
          "link": "https://github.blog/2022-09-29-after-the-offer-staying-in-tech-long-term/",
          "publishedOn": "2022-09-29T16:00:27.000Z",
          "wordCount": 2821,
          "title": "After the offer: staying in tech long-term"
        },
        {
          "id": "https://github.blog/?p=67292",
          "author": "Kevin Alwell",
          "description": "Learn best practices on how to roll out centrally managed, developer-centric application security with a third party CI/CD system like Jenkins or ADO.",
          "link": "https://github.blog/2022-09-28-best-practices-on-rolling-out-code-scanning-at-enterprise-scale/",
          "publishedOn": "2022-09-28T16:00:38.000Z",
          "wordCount": 1891,
          "title": "Best practices on rolling out code scanning at enterprise scale"
        },
        {
          "id": "https://github.blog/?p=67265",
          "author": "Ashley Bass",
          "description": "Three new Campus Experts are joining the fall 2022 batch of the MLH Fellowship to work with open source maintainers and get real-world experience.",
          "link": "https://github.blog/2022-09-23-meet-the-github-campus-experts-selected-for-the-fall-2022-mlh-fellowship-cohort-powered-by-github/",
          "publishedOn": "2022-09-23T16:56:19.000Z",
          "wordCount": 1476,
          "title": "Meet the GitHub Campus Experts selected for the fall 2022 MLH Fellowship Cohort, powered by GitHub"
        },
        {
          "id": "https://github.blog/?p=67240",
          "author": "Garrett Wood",
          "description": "We’re launching GitHub for Startups to give your startup the tools needed to go from idea to unicorn status on the world's largest developer platform.",
          "link": "https://github.blog/2022-09-22-github-for-startups-is-generally-available/",
          "publishedOn": "2022-09-22T16:00:13.000Z",
          "wordCount": 922,
          "title": "GitHub for Startups is generally available"
        },
        {
          "id": "https://github.blog/?p=67209",
          "author": "Alexis Wales",
          "description": "On September 16, GitHub Security learned that threat actors were targeting GitHub users with a phishing campaign by impersonating CircleCI to harvest user credentials and two-factor codes. While GitHub itself was not affected, the campaign has impacted many victim organizations.",
          "link": "https://github.blog/2022-09-21-security-alert-new-phishing-campaign-targets-github-users/",
          "publishedOn": "2022-09-21T21:49:50.000Z",
          "wordCount": 939,
          "title": "Security alert: new phishing campaign targets GitHub users"
        },
        {
          "id": "https://github.blog/?p=67194",
          "author": "Toya East",
          "description": "Students have the opportunity to connect with GitHub employees at GitHub Universe 2022 through Micro-Mentoring sessions hosted by GitHub Social Impact.",
          "link": "https://github.blog/2022-09-21-applications-for-micro-mentoring-at-github-universe-2022-are-now-live/",
          "publishedOn": "2022-09-21T16:00:36.000Z",
          "wordCount": 950,
          "title": "Applications for micro-mentoring at GitHub Universe 2022 are now live"
        },
        {
          "id": "https://github.blog/?p=67221",
          "author": "Robb Mapp",
          "description": "The ReadME Project & Podcast evolve with community expert voices and topics to stoke discussion about the culture and craft of software development.",
          "link": "https://github.blog/2022-09-21-the-readme-project-built-for-you/",
          "publishedOn": "2022-09-21T14:00:21.000Z",
          "wordCount": 951,
          "title": "The ReadME Project: Built for you!"
        },
        {
          "id": "https://github.blog/?p=67225",
          "author": "Shelley McKinley",
          "description": "As the home for developers, we understand the key role our communities play in steering digital transformation and maintaining societal infrastructure. That's why we choose to drive and support policies and initiatives like the Copenhagen Pledge on Tech for Democracy. We're committed to working with like-minded organizations, governments, and civil society to make digital technologies work for democracy and human rights, and we encourage you to join us in this pledge.",
          "link": "https://github.blog/2022-09-21-why-we-signed-the-copenhagen-pledge-on-tech-for-democracy/",
          "publishedOn": "2022-09-21T13:30:32.000Z",
          "wordCount": 838,
          "title": "Why we signed the Copenhagen Pledge on Tech for Democracy"
        },
        {
          "id": "https://github.blog/?p=67153",
          "author": "Chris Reddington",
          "description": "Go beyond knowing GitHub as the home of open source and explore how GitHub Enterprise can help you transform your software engineering organization and practices.",
          "link": "https://github.blog/2022-09-20-transform-your-software-engineering-practices-with-github-enterprise/",
          "publishedOn": "2022-09-20T18:00:31.000Z",
          "wordCount": 1707,
          "title": "Transform your software engineering practices with GitHub Enterprise"
        },
        {
          "id": "https://github.blog/?p=67102",
          "author": "Jon Evans",
          "description": "GitHub this month installed a massive steel vault, etched with striking AI-generated art, deep within an Arctic mountain, finalizing its Arctic Code Vault. This vault contains the 188 reels of hardened archival film which will preserve the 02/02/202 snapshot of every active public GitHub repository for 1,000 years. It also now includes a Tech Tree, a human-readable selection of works describing software, computers, and their foundational technologies, along with full-text copies of Wikipedia, Stack Overflow, and other data sources.",
          "link": "https://github.blog/2022-09-20-if-you-dont-make-it-beautiful-its-for-sure-doomed-putting-the-vault-in-githubs-arctic-code-vault/",
          "publishedOn": "2022-09-20T16:00:50.000Z",
          "wordCount": 1135,
          "title": "“If you don’t make it beautiful, it’s for sure doomed”: putting the Vault in GitHub’s Arctic Code Vault"
        },
        {
          "id": "https://github.blog/?p=67109",
          "author": "Ashley Bass",
          "description": "Three new Campus Experts are joining the fall 2022 batch of the MLH Fellowship to work with open source maintainers and get real-world experience.",
          "link": "https://github.blog/2022-09-19-meet-the-github-campus-experts-selected-for-the-fall-2022-mlh-fellowship-cohort-powered-by-github/",
          "publishedOn": "2022-09-19T19:15:58.000Z",
          "wordCount": 1429,
          "title": "Meet the GitHub Campus Experts selected for the fall 2022 MLH Fellowship Cohort, powered by GitHub"
        },
        {
          "id": "https://github.blog/?p=67147",
          "author": "Kedasha Kerr",
          "description": "Here are some actionable tips on how to ask your manager to send you to GitHub Universe this year—with a free template included!",
          "link": "https://github.blog/2022-09-19-5-steps-to-convince-your-boss-to-send-you-to-github-universe/",
          "publishedOn": "2022-09-19T18:02:39.000Z",
          "wordCount": 1063,
          "title": "5 steps to convince your boss to send you to GitHub Universe"
        },
        {
          "id": "https://github.blog/?p=67130",
          "author": "Erin Havens",
          "description": "Dependabot alerts can give you the ability to secure your project by keeping dependency-based vulnerabilities out of your code. Here are some tips to more efficiently prioritize and take action on your alerts, so you can get back to building.",
          "link": "https://github.blog/2022-09-19-5-tips-for-prioritizing-dependabot-alerts/",
          "publishedOn": "2022-09-19T16:28:44.000Z",
          "wordCount": 1758,
          "title": "5 tips for prioritizing Dependabot alerts"
        },
        {
          "id": "https://github.blog/?p=67084",
          "author": "Aiqiao Yan",
          "description": "The GitHub Actions team has done lots of work to improve the performance and resource consumption of Actions on GHES in the past year.",
          "link": "https://github.blog/2022-09-16-how-we-tripled-max-concurrent-jobs-to-boost-performance-of-github-actions/",
          "publishedOn": "2022-09-16T15:31:30.000Z",
          "wordCount": 1680,
          "title": "How we tripled max concurrent jobs to boost performance of GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=67059",
          "author": "Rizel Scarlett",
          "description": "Developers all over the world are using GitHub Copilot to help speed up their development and increase developer productivity. With GitHub Copilot available to developers everywhere, we’ve found some fun and useful examples of how developers can use GitHub Copilot for things you may not be thinking about.",
          "link": "https://github.blog/2022-09-14-8-things-you-didnt-know-you-could-do-with-github-copilot/",
          "publishedOn": "2022-09-14T16:00:43.000Z",
          "wordCount": 1871,
          "title": "8 things you didn’t know you could do with GitHub Copilot"
        },
        {
          "id": "https://github.blog/?p=67031",
          "author": "Taylor Blau",
          "description": "A tour of recent work to re-engineer Git’s garbage collection process to scale to our largest and most active repositories.",
          "link": "https://github.blog/2022-09-13-scaling-gits-garbage-collection/",
          "publishedOn": "2022-09-13T16:00:49.000Z",
          "wordCount": 5413,
          "title": "Scaling Git’s garbage collection"
        },
        {
          "id": "https://github.blog/?p=66996",
          "author": "Abby Cabunoc Mayes",
          "description": "We’re thrilled to be back at the Grace Hopper Celebration at Open Source Day, the largest celebration of women in open source. Stop by and say hi at one of our workshops.",
          "link": "https://github.blog/2022-09-13-join-github-at-the-grace-hopper-celebration-2022/",
          "publishedOn": "2022-09-13T13:30:56.000Z",
          "wordCount": 1059,
          "title": "Join GitHub at the Grace Hopper Celebration 2022"
        },
        {
          "id": "https://github.blog/?p=67018",
          "author": "Matthew Dyson",
          "description": "Calling all students and teachers!  With semester change coming soon, now is the time to start using the latest features within GitHub Education and Global Campus!",
          "link": "https://github.blog/2022-09-12-gear-up-and-unlock-the-newest-github-global-campus-features/",
          "publishedOn": "2022-09-12T19:17:17.000Z",
          "wordCount": 1468,
          "title": "Gear-up and unlock the newest GitHub Global Campus features"
        },
        {
          "id": "https://github.blog/?p=66930",
          "author": "Brittany O'Shea",
          "description": "We’re taking a look at two commonly-used security tools and detailing how they can help secure your projects.",
          "link": "https://github.blog/2022-09-09-sca-vs-sast-what-are-they-and-which-one-is-right-for-you/",
          "publishedOn": "2022-09-09T15:16:13.000Z",
          "wordCount": 1540,
          "title": "SCA vs SAST: what are they and which one is right for you?"
        },
        {
          "id": "https://github.blog/?p=66919",
          "author": "Elise Hollowed",
          "description": "After a year in technical preview, GitHub Copilot, an AI pair programmer, is now free for all teachers verified on GitHub Global Campus.",
          "link": "https://github.blog/2022-09-08-github-copilot-now-available-for-teachers/",
          "publishedOn": "2022-09-08T18:00:49.000Z",
          "wordCount": 1156,
          "title": "GitHub Copilot now available for teachers"
        },
        {
          "id": "https://github.blog/?p=66902",
          "author": "Mala Kumar",
          "description": "Read the new GitHub report on OSS in India, Kenya, Egypt, and Mexico. Available now in English, and in Spanish and Arabic later this year.",
          "link": "https://github.blog/2022-09-08-research-open-source-software-in-india-kenya-egypt-and-mexico/",
          "publishedOn": "2022-09-08T07:00:33.000Z",
          "wordCount": 1079,
          "title": "Research: open source software in India, Kenya, Egypt, and Mexico"
        },
        {
          "id": "https://github.blog/?p=66877",
          "author": "Jakub Oleksy",
          "description": "In August, we experienced one incident resulting in significant impact to Codespaces. We’re still investigating that incident and will include it in next month’s report. This report also sheds light into an incident that impacted Codespaces in July.",
          "link": "https://github.blog/2022-09-07-github-availability-report-august-2022/",
          "publishedOn": "2022-09-07T18:00:24.000Z",
          "wordCount": 1044,
          "title": "GitHub Availability Report: August 2022"
        },
        {
          "id": "https://github.blog/?p=66861",
          "author": "Eirini Kalliamvakou",
          "description": "When the GitHub Copilot Technical Preview launched just over one year ago, we wanted to know one thing: Is this tool helping developers? The GitHub Next team conducted research using a combination of surveys and experiments, which led us to expected and unexpected answers.",
          "link": "https://github.blog/2022-09-07-research-quantifying-github-copilots-impact-on-developer-productivity-and-happiness/",
          "publishedOn": "2022-09-07T16:00:28.000Z",
          "wordCount": 2016,
          "title": "Research: quantifying GitHub Copilot’s impact on developer productivity and happiness"
        },
        {
          "id": "https://github.blog/?p=66836",
          "author": "Andrea Griffiths",
          "description": "Live on September 15, 2022, with talks by industry experts in Spanish, Portuguese, and English, on topics including software development, security, technical project management, community, open source, professional development and best practices.",
          "link": "https://github.blog/2022-09-06-join-us-for-octogatosconf-2022/",
          "publishedOn": "2022-09-06T16:00:05.000Z",
          "wordCount": 1780,
          "title": "Join us for OctogatosConf 2022"
        },
        {
          "id": "https://github.blog/?p=66851",
          "author": "Ariel Deitcher",
          "description": "A software engineer’s personal journey to becoming an open source contributor.",
          "link": "https://github.blog/2022-09-06-contributing-to-open-source-at-github/",
          "publishedOn": "2022-09-06T13:30:26.000Z",
          "wordCount": 1650,
          "title": "Contributing to open source at GitHub"
        },
        {
          "id": "https://github.blog/?p=66830",
          "author": "Michelle Mannering",
          "description": "We’ve been gearing up to launch GitHub Universe 2022 and our community has been launching cool projects left right and center.  These projects include everything from world-changing technology to developer tooling, and weekend hobbies. Here are some of the open source projects that released major version updates this August. Read more about these projects in […]",
          "link": "https://github.blog/2022-09-02-release-radar-aug-2022/",
          "publishedOn": "2022-09-02T23:13:06.000Z",
          "wordCount": 1498,
          "title": "Release Radar · August 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66812",
          "author": "Derrick Stolee",
          "description": "This fifth and final part of our blog series exploring Git's internals shows several strategies for scaling your Git repositories that match related database sharding techniques.",
          "link": "https://github.blog/2022-09-02-gits-database-internals-v-scalability/",
          "publishedOn": "2022-09-02T13:05:05.000Z",
          "wordCount": 3778,
          "title": "Git’s database internals V: scalability"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19184",
          "author": "Ana Martinazzo - Sr. Machine Learning Engineer",
          "description": "A mini roadmap on when and how to build real-time machine learning systems\nThe post Real-time machine learning models in real life appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/real-time-machine-learning-models-in-real-life/",
          "publishedOn": "2022-09-23T15:14:59.000Z",
          "wordCount": 4420,
          "title": "Real-time machine learning models in real life"
        },
        {
          "id": "https://building.nubank.com.br/?p=19098",
          "author": "Beatriz Lima - Recruitment Analyst at Nubank",
          "description": "Nubank's Information Security Business Unit has over 120 professionals and a global impact. Check out how our team is organized to protect more than 60 million Nubank's LatAm customers:\nThe post What is it to have a career at Nubank’s Information Security Team (Infosec)? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/career-at-nubanks-information-security-team/",
          "publishedOn": "2022-09-19T20:30:09.000Z",
          "wordCount": 3624,
          "title": "What is it to have a career at Nubank’s Information Security Team (Infosec)?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19067",
          "author": "Nubank Editorial",
          "description": "Product Marketing Managers (PMM) are marketing professionals who act within product teams as a bridge between business, brand, and client development.\nThe post What is it like being a Product Marketing Manager at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/product-marketing-manager-at-nubank/",
          "publishedOn": "2022-09-16T17:37:43.000Z",
          "wordCount": 3506,
          "title": "What is it like being a Product Marketing Manager at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19042",
          "author": "Nubank Editorial",
          "description": "Today you’ll be introduced to Adrian Cockcroft, Nubank's first technical advisor. Dive into his legacy in the technology field and motivations to join the Nubank team!\nThe post Interview: meet Adrian Cockcroft, Nubank’s new Tech Advisor appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/interview-meet-adrian-cockcroft-nubanks-new-tech-advisor/",
          "publishedOn": "2022-09-12T18:35:00.000Z",
          "wordCount": 3553,
          "title": "Interview: meet Adrian Cockcroft, Nubank’s new Tech Advisor"
        },
        {
          "id": "https://building.nubank.com.br/?p=19027",
          "author": "Ana Carolina Tavares - Engineering Tech Manager at Nubank",
          "description": "The greatest wish for any woman in the tech field is to have the opportunity of working with other women on the team. Check out how is this experience at Nubank:\nThe post 9 reasons for women to build their career in the field of Engineering at Nubank appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/9-reasons-for-women-to-build-their-career-in-the-field-of-engineering-at-nubank/",
          "publishedOn": "2022-09-09T21:40:00.000Z",
          "wordCount": 3798,
          "title": "9 reasons for women to build their career in the field of Engineering at Nubank"
        },
        {
          "id": "https://building.nubank.com.br/?p=18897",
          "author": "Felipe Almeida - Machine Learning Engineer at Nubank",
          "description": "Practical tips to help you succeed in your next Data Science and/or Machine Learning interview\nThe post Acing the Data Science Interview: 8 Practical Tips with Examples appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-science-interview-pratical-tips/",
          "publishedOn": "2022-09-02T18:54:28.000Z",
          "wordCount": 4272,
          "title": "Acing the Data Science Interview: 8 Practical Tips with Examples"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/bounty/announcing-results-hack-us",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/bounty/announcing-results-hack-us",
          "publishedOn": "2022-09-29T13:00:00.000Z",
          "wordCount": 609,
          "title": "Announcing the Results of Hack U.S."
        },
        {
          "id": "https://hackerone.com/pentests/use-hackerones-enhanced-pentest-service-streamline-security-testing",
          "author": "Sean Ryan",
          "description": "New capabilities improve pentesting to increase attack resistance\nThe enhanced features drive robust security testing practices with the ability to",
          "link": "https://www.hackerone.com/pentests/use-hackerones-enhanced-pentest-service-streamline-security-testing",
          "publishedOn": "2022-09-27T23:00:00.000Z",
          "wordCount": 1084,
          "title": "Use Hackerone’s Enhanced Pentest as a Service to Streamline Security Testing"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/rise-internet-bug-bounty",
          "author": "jesse@hackerone.com",
          "description": "Are you a veteran hacker, someone who loves code review, or looking to get your first CVE? Then, I have something to share with you. Let's talk abou",
          "link": "https://www.hackerone.com/hackerone-community-blog/rise-internet-bug-bounty",
          "publishedOn": "2022-09-23T17:23:23.000Z",
          "wordCount": 997,
          "title": "Rise of Internet Bug Bounty"
        },
        {
          "id": "https://hackerone.com/application-security/introducing-unified-hackerone-scope-management-burp-suite-support",
          "author": "Tim Matthews",
          "description": "This post will start with the basics of defining scope and how ethical hackers and testers use it in their testing workflow. If you’re already famil",
          "link": "https://www.hackerone.com/application-security/introducing-unified-hackerone-scope-management-burp-suite-support",
          "publishedOn": "2022-09-15T22:00:00.000Z",
          "wordCount": 1668,
          "title": "Introducing Unified HackerOne Scope Management with Burp Suite Support"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/1abf249ba95f",
          "author": "Netflix Technology Blog",
          "description": "by Kostas Christidis",
          "link": "https://netflixtechblog.com/timestone-netflixs-high-throughput-low-latency-priority-queueing-system-with-built-in-support-1abf249ba95f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-09-28T15:40:35.000Z",
          "wordCount": 2309,
          "title": "Timestone: Netflix’s High-Throughput, Low-Latency Priority Queueing System with Built-in Support…"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-august-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-review-august-2022",
          "publishedOn": "2022-09-06T16:40:09.000Z",
          "wordCount": null,
          "title": "Portfolio Review: August 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc3b2ba7b-6100-466a-8f16-0f928f540cdd_1236x793.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}