{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2023/03/osv-and-vulnerability-life-cycle.html",
          "author": null,
          "description": "Posted by Oliver Chang and Andrew Pollock, Google Open Source Security Team \nIt is an interesting time for everyone concerned with open source vulnerabilities. The U.S. Executive Order on Improving the Nation's Cybersecurity requirements for vulnerability disclosure programs and assurances for software used by the US government will go into effect later this year. Finding and fixing security vulnerabilities has never been more important, yet with increasing interest in the area, the vulnerability management space has become fragmented—there are a lot of new tools and competing standards. \nIn 2021, we announced the launch of OSV, a database of open source vulnerabilities built partially from vulnerabilities found through Google’s OSS-Fuzz program. OSV has grown since then and now includes a…",
          "link": "http://security.googleblog.com/2023/03/osv-and-vulnerability-life-cycle.html",
          "publishedOn": "2023-03-08T17:04:00.004Z",
          "wordCount": 1670,
          "title": "OSV and the Vulnerability Life Cycle"
        },
        {
          "id": "http://security.googleblog.com/2023/03/thank-you-and-goodbye-to-chrome-cleanup.html",
          "author": null,
          "description": "Posted by Jasika Bawa, Chrome Security Team  \nStarting in Chrome 111 we will begin to turn down the Chrome Cleanup Tool, an application distributed to Chrome users on Windows to help find and remove unwanted software (UwS). \nOrigin story\n  \nThe Chrome Cleanup Tool was introduced in 2015 to help users recover from unexpected settings changes, and to detect and remove unwanted software. To date, it has performed more than 80 million cleanups, helping to pave the way for a cleaner, safer web. \nA changing landscape\n  \nIn recent years, several factors have led us to reevaluate the need for this application to keep Chrome users on Windows safe.  \nFirst, the user perspective – Chrome user complaints about UwS have continued to fall over the years, averaging out to around 3% of total complaints in…",
          "link": "http://security.googleblog.com/2023/03/thank-you-and-goodbye-to-chrome-cleanup.html",
          "publishedOn": "2023-03-08T16:59:00.000Z",
          "wordCount": 884,
          "title": "Thank you and goodbye to the Chrome Cleanup Tool"
        },
        {
          "id": "http://security.googleblog.com/2023/03/google-trust-services-now-offers-tls.html",
          "author": null,
          "description": "Andy Warner, Google Trust Services, and Carl Krauss, Product Manager, Google Domains\n\n\n\nWe’re excited to announce changes that make getting Google Trust Services TLS certificates easier for Google Domains customers. With this integration, all Google Domains customers will be able to acquire public certificates for their websites at no additional cost, whether the site runs on a Google service or uses another provider. Additionally, Google Domains is now making an API available to allow for DNS-01 challenges with Google Domains DNS servers to issue and renew certificates automatically.\n\n\n\n\n\nLike the existing Google Cloud integration, Automatic Certificate Management Environment (ACME) protocol is used to enable seamless automatic lifecycle management of TLS certificates. \n\n\n\n\n\nThese certifi…",
          "link": "http://security.googleblog.com/2023/03/google-trust-services-now-offers-tls.html",
          "publishedOn": "2023-03-02T17:26:00.006Z",
          "wordCount": 1262,
          "title": "Google Trust Services now offers TLS certificates for Google Domains customers"
        },
        {
          "id": "http://security.googleblog.com/2023/03/8-ways-to-secure-chrome-browser-for.html",
          "author": null,
          "description": "Posted by Kiran Nair, Product Manager, Chrome Browser \n   \n1. Bring Chrome under Cloud Management\n Your journey towards keeping your Google Workspace users and data safe, starts with bringing your Chrome browsers under Cloud Management at no additional cost. Chrome Browser Cloud Management is a single destination for applying Chrome Browser policies and security controls across Windows, Mac, Linux, iOS and Android. You also get deep visibility into your browser fleet including which browsers are out of date, which extensions your users are using and bringing insight to potential security blindspots in your enterprise. \nManaging Chrome from the cloud allows Google Workspace admins to enforce enterprise protections and policies to the whole browser on fully managed devices, which  no longer …",
          "link": "http://security.googleblog.com/2023/03/8-ways-to-secure-chrome-browser-for.html",
          "publishedOn": "2023-03-01T16:59:00.001Z",
          "wordCount": 1805,
          "title": "8 ways to secure Chrome browser for Google Workspace users"
        },
        {
          "id": "http://security.googleblog.com/2023/02/our-commitment-to-fighting-invalid.html",
          "author": null,
          "description": "Posted by Michael Spaulding, Senior Product Manager, Ad Traffic Quality\n\n\n\nConnected TV (CTV) has not only transformed the entertainment world, it has also created a vibrant new platform for digital advertising. However, as with any innovative space, there are challenges that arise, including the emergence of bad actors aiming to siphon money away from advertisers and publishers through fraudulent or invalid ad traffic. Invalid traffic is an evolving challenge that has the potential to affect the integrity and health of digital advertising on CTV. However, there are steps the industry can take to combat invalid traffic and foster a clean, trustworthy, and sustainable ecosystem.\n\n\n\n\n\n\nInformation sharing and following best practices\nEvery player across the digital advertising ecosystem has …",
          "link": "http://security.googleblog.com/2023/02/our-commitment-to-fighting-invalid.html",
          "publishedOn": "2023-02-28T14:00:00.001Z",
          "wordCount": 1207,
          "title": "Our commitment to fighting invalid traffic on Connected TV"
        },
        {
          "id": "http://security.googleblog.com/2023/02/moving-connected-device-security.html",
          "author": null,
          "description": "Posted by Eugene Liderman, Director of Mobile Security Strategy, Google \nAs Mobile World Congress approaches, we have the opportunity to have deep and meaningful conversations across the industry about the present and future of connected device security.  Ahead of the event, we wanted to take a moment to recognize and share additional details on the notable progress being made to form harmonized connected device security standards and certification initiatives that provide users with better transparency about how their sensitive data is protected.  \nSupporting the GSMA Working Party for Mobile Device Security Transparency\nWe’re pleased to support and participate in the recently announced GSMA working party, which will develop a first-of-its-kind smartphone security certification program. T…",
          "link": "http://security.googleblog.com/2023/02/moving-connected-device-security.html",
          "publishedOn": "2023-02-23T16:59:00.000Z",
          "wordCount": 1339,
          "title": "Moving Connected Device Security Standards Forward"
        },
        {
          "id": "http://security.googleblog.com/2023/02/vulnerability-reward-program-2022-year.html",
          "author": null,
          "description": "Posted by Sarah Jacobus, Vulnerability Rewards Team  \nIt has been another incredible year for the Vulnerability Reward Programs (VRPs) at Google! Working with security researchers throughout 2022, we have been able to identify and fix over 2,900  security issues and continue to make our products more secure for our users around the world.  \nWe are thrilled to see significant year over year growth for our VRPs, and have had yet another record breaking year for our programs! In 2022 we awarded over $12 million in bounty rewards – with researchers donating over $230,000 to a charity of their choice.  \nAs in past years, we are sharing our 2022 Year in Review statistics across all of our programs. We would like to give a special thank you to all of our dedicated researchers for their continued …",
          "link": "http://security.googleblog.com/2023/02/vulnerability-reward-program-2022-year.html",
          "publishedOn": "2023-02-22T16:59:00.001Z",
          "wordCount": 1806,
          "title": "Vulnerability Reward Program: 2022 Year in Review"
        },
        {
          "id": "http://security.googleblog.com/2023/02/hardening-firmware-across-android.html",
          "author": null,
          "description": "Posted by Roger Piqueras Jover, Ivan Lozano, Sudhi Herle, and Stephan Somogyi, Android Team \nA modern Android powered smartphone is a complex hardware device: Android OS runs on a multi-core CPU - also called an Application Processor (AP). And the AP is one of many such processors of a System On Chip (SoC). Other processors on the SoC perform various specialized tasks — such as security functions, image & video processing, and most importantly cellular communications. The processor performing cellular communications is often referred to as the baseband. For the purposes of this blog, we refer to the software that runs on all these other processors as “Firmware”.  \nSecuring the Android Platform requires going beyond the confines of the Application Processor (AP). Android’s defense-in-depth …",
          "link": "http://security.googleblog.com/2023/02/hardening-firmware-across-android.html",
          "publishedOn": "2023-02-21T17:29:00.000Z",
          "wordCount": 1564,
          "title": "Hardening Firmware Across the Android Ecosystem"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/6/2021",
          "author": null,
          "description": "Dan Abramov & Joe Savona from the React Team join Jerod & Nick for a wide-ranging discussion about React’s place in the frontend ecosystem. We cover everything from React competing with React, their responses to SPA fatigue and recent criticisms, to Server Components and the future of the framework.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir a…",
          "link": "https://changelog.com/jsparty/267",
          "publishedOn": "2023-03-17T16:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 267: The future of React",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/267/js-party-267.mp3",
            "length": "61832179",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/N1jr",
          "author": "Jerod Santo",
          "description": "Docker CMO, Tim Anglade:\nFor those of you catching up, we recently emailed accounts that are members of Free Team organizations, to let them know that they will lose features unless they move to one of our supported free or paid offerings. This impacted less than 2% of our users…\nThe Docker Free Team subscription was deprecated in part because it was poorly targeted. In particular, it didn’t serve the open source audience as well as our recently updated Docker-Sponsored Open Source program, the latter offering benefits that exceed those of the deprecated Free Team plan.\nWe’d also like to clarify that public images will only be removed from Docker Hub if their maintainer decides to delete them. We’re sorry that our initial communications failed to make this clear.\nJust to be clear: their apology is not about the change, it’s about how they communicated the change. There’s more details in the post about deleting public images, squatting names, etc, but that’s the gist.\nDiscuss on Changelog News",
          "link": "https://www.docker.com/blog/we-apologize-we-did-a-terrible-job-announcing-the-end-of-docker-free-teams/",
          "publishedOn": "2023-03-17T15:44:00.000Z",
          "wordCount": null,
          "title": "Docker apologizes for their Docker Free Teams announcement",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njar",
          "author": "Jerod Santo",
          "description": "TypeScript PM, Daniel Rosenwasser:\nThis release brings many new features, while aiming to make TypeScript smaller, simpler, and faster. We’ve implemented the new decorators standard, added functionality to better support ESM projects in Node and bundlers, provided new ways for library authors to control generic inference, expanded our JSDoc functionality, simplified configuration, and made many other improvements.\nDiscuss on Changelog News",
          "link": "https://devblogs.microsoft.com/typescript/announcing-typescript-5-0/",
          "publishedOn": "2023-03-17T14:52:01.000Z",
          "wordCount": null,
          "title": "Announcing TypeScript 5.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1kk",
          "author": "Jerod Santo",
          "description": "Congrats to Dan, Rachel and the entire React team for shipping a new docs site! Here’s their TLDR:\nThe new React site (react.dev) teaches modern React with function components and Hooks.\nWe’ve included diagrams, illustrations, challenges, and over 600 new interactive examples.\nThe previous React documentation site has now moved to legacy.reactjs.org.\nDiscuss on Changelog News",
          "link": "https://react.dev/blog/2023/03/16/introducing-react-dev",
          "publishedOn": "2023-03-17T14:02:00.000Z",
          "wordCount": null,
          "title": "Introducing react.dev",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/2025",
          "author": null,
          "description": "The panel discuss the parts of Go they never use. Do they avoid them because of pain in the past? Were they overused? Did they always end up getting refactoring out? Is there a preferred alternative?\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJon Calhoun – Twitter, GitHub, Website\nCarl Johnson – Mastodon, Twitter, GitHub, Website\n\nShow Notes:\n\n🎥 GothamGo 2018 - Things in Go I Never Use by Mat Ryer\nCarl’s ‘remove naked return’\nThe Merovius - Dynamic variables\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:58) - ICE BREAKERS\n(12:00) - Mat avoids new()\n(17:20) - Jon avoids full slice expressions\n(20:53) - Carl avoids bare returns\n(24:22) - A linter up in your kitchen\n(26:59) - Mat tries not to panic\n(30:52) - Jon avoids labels\n(35:13) - Templates, globals, init\n(38:40) - Prank Time (+ more bad ideas)\n(42:57) - Jon tells a story\n(44:20) - Useless uses of generics\n(47:41) - Jon doesn't use internal packages\n(51:17) - It's time for Unpopular Opinions!\n(51:43) - Mat's unpop\n(57:56) - Gotta Go!\n(59:04) - Next time on Go Time",
          "link": "https://changelog.com/gotime/269",
          "publishedOn": "2023-03-16T16:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 269: The bits of Go we avoid (and why)",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/269/go-time-269.mp3",
            "length": "58501595",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/rXPo",
          "author": "Jerod Santo",
          "description": "Alex Ellis:\nYesterday, Docker sent an email to any Docker Hub user who had created an “organisation”, telling them their account will be deleted including all images, if they do not upgrade to a paid team plan. The email contained a link to a tersely written PDF (since, silently edited) which was missing many important details which caused significant anxiety and additional work for open source maintainers.\nHe goes on to explain the problem in great details. Btw, Alex is no Docker hater. He has a long history of using and supporting the tech. He goes on to say:\nOpen Source has a funding problem, and Docker was born in Open Source. We the community were their king makers, and now that they’re turning over significant revenue, they are only too ready to forget their roots.\nThis decision seems myopic. There are other image hosting options, one of them even shares (inspired?) half of DockerHub’s name… Oh, and here’s our open invitation to the folks at Docker to come on the pod.\nDiscuss on Changelog News",
          "link": "https://blog.alexellis.io/docker-is-deleting-open-source-images/",
          "publishedOn": "2023-03-16T14:40:00.000Z",
          "wordCount": null,
          "title": "Docker is deleting open source orgs - what you need to know",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lmQ",
          "author": "Jerod Santo",
          "description": "This web-based tool has a lot of cool features: node search, embeddable widgets, downloadable images, dark mode & more. Jump straight to the online editor to try it out.\n\nDiscuss on Changelog News",
          "link": "https://github.com/AykutSarac/jsoncrack.com",
          "publishedOn": "2023-03-16T13:51:00.000Z",
          "wordCount": null,
          "title": "Explore, analyze & understand complex data structures with JSON Crack",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2029",
          "author": null,
          "description": "Neural search and chat-based search are all the rage right now. However, You.com has been innovating in these topics long before ChatGPT. In this episode, Bryan McCann from You.com shares insights related to our mental model of Large Language Model (LLM) interactions and practical tips related to integrating LLMs into production systems.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nBryan McCann – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\n\nYou.com\nOpen Platform for developers\nJoin the You.com Discord server\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:42) - Bryan Mccann\n(01:47) - What is You.com?\n(06:21) - What's different in these new algorithms\n(09:28) - How has the public view changed You.com?\n(11:53) - Will this change search engines?\n(15:19) - How will You.com enhance tooling?\n(17:41) - You and mutli-modality\n(21:17) - AI tools for the next generation\n(26:28) - Any wisdom worth sharing?\n(29:49) - Our future relationship with models\n(34:11) - Practical tips for practitioners\n(38:24) - How to get started on You.com\n(41:06) - Outro",
          "link": "https://changelog.com/practicalai/215",
          "publishedOn": "2023-03-15T19:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 215: AI search at You.com",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/215/practical-ai-215.mp3",
            "length": "40559116",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1989",
          "author": null,
          "description": "This week we’re talking with Nathan Sobo about his next big thing. Nathan is known for his work on the Atom editor while at GitHub. But his work wasn’t finished when he left, so…he started Zed, a high-performance multiplayer editor that’s engineered for performance. And today, Nathan talks us through all the details.\nDiscuss on Changelog News\nChangelog++ members get a bonus 14 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nPostman – Build APIs together — More than 20 million developers use Postman for building and using APIs. Postman simplifies each step of the API lifecycle and streamlines collaboration so you can create better APIs—faster.\n\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content de…",
          "link": "https://changelog.com/podcast/531",
          "publishedOn": "2023-03-15T14:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 531: Goodbye Atom. Hello Zed.",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/531/the-changelog-531.mp3",
            "length": "84367753",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/GWZ9",
          "author": "Jerod Santo",
          "description": "This site categorizes, displays & provides CSS font-family declarations for the system fonts on every modern OS. Why are system fonts cool? Because they’re the fastest fonts your website can use. No downloading, no layout shifts, no flashes — just instant renders.\nDiscuss on Changelog News",
          "link": "https://modernfontstacks.com/",
          "publishedOn": "2023-03-15T13:27:01.000Z",
          "wordCount": null,
          "title": "Modern Font Stacks",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEPN",
          "author": "Jerod Santo",
          "description": "Sualeh Asif from Control (an AI code editor):\nWe’ve been using GPT-4 for a few months internally, and we thought we’d highlight a few examples](https://github.com/anysphere/gpt-4-for-code) that have been both particularly impressive and really useful to us.\nHere it’s converting a Python dict of member functions to esoteric but correct-on-first-try C++ code 👇\n\nDiscuss on Changelog News",
          "link": "https://twitter.com/sualehasif996/status/1635755267739598848",
          "publishedOn": "2023-03-15T12:33:00.000Z",
          "wordCount": null,
          "title": "GPT-4 is phenomenal at code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3L0G",
          "author": "Jerod Santo",
          "description": "With Mountpoint for Amazon S3, your applications can access objects stored in Amazon S3 through file operations like open and read. Mountpoint for Amazon S3 automatically translates these operations into S3 object API calls, giving your applications access to the elastic storage and throughput of Amazon S3 through a file interface.\nEarly alpha. Written in Rust by the AWS team.\nDiscuss on Changelog News",
          "link": "https://github.com/awslabs/mountpoint-s3",
          "publishedOn": "2023-03-14T20:46:00.000Z",
          "wordCount": null,
          "title": "A high-throughput file client for mounting Amazon S3 buckets",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1Wjr",
          "author": "Jerod Santo",
          "description": "Justin Searls dives deep into whether AI tools like ChatGPT actually threaten knowledge worker jobs and provides helpful ideas around what to do about it.\nHaving spent months programming with GitHub Copilot, weeks talking to ChatGPT, and days searching via Bing Chat as an alternative to Google, the best description I’ve heard of AI’s capabilities is “fluent bullshit.” And after months of seeing friends “cheat” at their day jobs by having ChatGPT do their homework for them, I’ve come to a pretty grim, if obvious, realization:\nThe more excited someone is by the prospect of AI making their job easier, the more they should be worried.\nDiscuss on Changelog News",
          "link": "https://blog.testdouble.com/posts/2023-03-14-how-to-tell-if-ai-threatens-your-job/",
          "publishedOn": "2023-03-14T20:00:00.000Z",
          "wordCount": null,
          "title": "How to tell if AI threatens YOUR job (and 3 simple rules to keep it)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7Yda",
          "author": "Jerod Santo",
          "description": "Ned Batchelder:\nThis package provides one command, watch_gha_runs. It takes a GitHub repo URL and a branch name, and displays the status of the latest GitHub Action runs on that branch. If any of the runs are in progress, it will refresh the display each second with the current status.\nIf you like, the name can be pronounced, “Watching? Ha!”\n\nDiscuss on Changelog News",
          "link": "https://github.com/nedbat/watchgha",
          "publishedOn": "2023-03-14T19:14:00.000Z",
          "wordCount": null,
          "title": "Watchga watches GitHub Action runs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2lNm",
          "author": "Jerod Santo",
          "description": "You can think, plan, design & toil away on your project/product all you want, but until you have real people using it… you’re only guessing. Here are 4 things the creator of basement community learned after picking up their first batch of real users:\nsomeone is going to abuse your site\nyou need a performance monitoring system\nyour SQL queries need to be optimized\nyour users might have genius ideas\nDiscuss on Changelog News",
          "link": "https://basementcommunity.bearblog.dev/things-i-learned/",
          "publishedOn": "2023-03-14T18:26:00.000Z",
          "wordCount": null,
          "title": "4 things I learned after getting users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O5pm",
          "author": "Jerod Santo",
          "description": "Another win for the fediverse. Plugin developer Matthias Pfefferle (who is joining WordPress with the acquisition):\nWhen Matt announced that Tumblr wants to implement ActivityPub on Twitter, I asked why not WordPress, so I came in contact with Automattic and they offered me the opportunity to work full time on the plugin and other Open Web projects.\nThe plugin lets people follow your WordPress site on ActivityPub-supporting social networks. Today it has over 2k active installs, but what would that number look like if this plugin came bundled with new installs/upgrades?\nThere’s very little downside for WordPress site owners to one-click install that sucker…\nDiscuss on Changelog News",
          "link": "https://wptavern.com/automattic-acquires-activitypub-plugin-for-wordpress",
          "publishedOn": "2023-03-14T14:30:00.000Z",
          "wordCount": null,
          "title": "Automattic acquires ActivityPub plugin for WordPress",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1Jb",
          "author": "Jerod Santo",
          "description": "Jason Stiebs runs down all that you can accomplish in Elixir without a compilation step by running elixir my_script.exs, including the use of any hex package thanks to Mix.install/2.\nDiscuss on Changelog News",
          "link": "https://fly.io/phoenix-files/single-file-elixir-scripts/",
          "publishedOn": "2023-03-13T20:23:00.000Z",
          "wordCount": null,
          "title": "Single file Elixir scripts",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2028",
          "author": null,
          "description": "Dalai is the simplest way to run LLaMA on your local machine, simple web tools that just work without annoying you, Wik is a tool to view wikipedia pages from your terminal, Rspack is a fast, Rust-based web bundler, Doodle is a pure Kotlin UI framework, Marqo is tensor search for humans & iLLA is an open source alternative to Retool.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nDalai\n\nfacebookresearch/llama\nggerganov/llama.cpp\ninputoutput.dev\nWikipedia + terminal\nRspack\nDoodle\nMarqo\niLLA\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:02) - Dalai LLaMA\n(02:50) - InputOutput.dev\n(03:31) - Wik\n(04:16) - Rspack\n(05:21) - Doodle\n(05:46) - Marqo\n(06:02) - iLLA\n(06:27) - Outro",
          "link": "https://changelog.com/podcast/news-2023-03-13",
          "publishedOn": "2023-03-13T19:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Dalai, InputOutput.dev, Wik, Rspack, Doodle, Marqo & iLLA",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-03-13/the-changelog-news-2023-03-13.mp3",
            "length": "7141072",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlPw",
          "author": "Jerod Santo",
          "description": "A multi-tenant HTTP reverse tunnel solution through remote port forwarding from the SSH protocol.\nThis is intended for small teams that need to expose the local development environment to the public internet, and you need to bring your own domain name and SSO provider.\nIt gives stable subdomain for every user, and gated by your SSO through OIDC protocol.\nThink this as a bare-bone alternative to the ngrok’s $65/user/month enterprise tier. Try to put this behind a production system will blow up your SLA.\nFor individuals and production systems, just buy ngrok, it is still my favorite.\nDiscuss on Changelog News",
          "link": "https://github.com/pgrok/pgrok",
          "publishedOn": "2023-03-13T15:08:00.000Z",
          "wordCount": null,
          "title": "pgrok is a poor man's ngrok",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9PV",
          "author": "Jerod Santo",
          "description": "Quirks: every language has ’em, and the more you learn a language the more of ‘em you run across. Here’s a collection of quirks across a bunch of languages. I’m positive there’s many more that could be added…\n\nDiscuss on Changelog News",
          "link": "https://github.com/neemspees/tragic-methods",
          "publishedOn": "2023-03-13T14:21:00.000Z",
          "wordCount": null,
          "title": "Scripts depicting the strange quirks of programming languages",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/2027",
          "author": null,
          "description": "This week Adam is joined by Jori Lallo, Co-founder of Linear, to talk about creating magical software and building high-quality software teams.\nDiscuss on Changelog News\nChangelog++ members get a bonus 4 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nJori Lallo – Twitter, GitHub, LinkedIn, Website\nAdam Stacoviak – Mastodon, Twitter, GitHub, LinkedIn, Website\n\nShow Notes:\n\nlinear.app\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:33) - Start the show!\n(05:30) - What is Linear?\n(10:16) - Frustration leads to motivation\n(16:04) - An open API world\n(25:14) - Lessons learned\n(28:30) - How do you build Linear?\n(51:50) - What do you do here?\n(1:05:18) - Goals?\n(1:14:06) - What's on the horizon?\n(1:16:13) - Outro",
          "link": "https://changelog.com/founderstalk/94",
          "publishedOn": "2023-03-10T21:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 94: Creating magical software",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/founderstalk/94/founders-talk-94.mp3",
            "length": "111926078",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/2009",
          "author": null,
          "description": "Zach Leatherman returns to the show to discuss his progress over the last year since going full-time on Eleventy, including Eleventy 2.0, the release of WebC, and the state of static site generators.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out…",
          "link": "https://changelog.com/jsparty/266",
          "publishedOn": "2023-03-10T18:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 266: Celebrating Eleventy 2.0 🎉",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/266/js-party-266.mp3",
            "length": "55118763",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pjne",
          "author": "Jerod Santo",
          "description": "Jim Nielsen:\nI heard Paul Ford, a professional writer for Wired and other publications, say something on The Aboard Podcast, Episode 3 that resonated. Referring to a moment when lots of folks online were looking for the perfect writing environment, he said the software tool, workflow, environment, whatever, it didn’t matter. You could do it with pen and paper if you want.\nThe only technology that you need is deadlines.\nOoff. Yup, that resonates. That’s been the best piece of technology for making me productive too.\nSee also arbitrary deadlines are actually awesome by yours truly.\nDiscuss on Changelog News",
          "link": "https://blog.jim-nielsen.com/2023/deadlines-as-technology/",
          "publishedOn": "2023-03-10T17:42:00.000Z",
          "wordCount": null,
          "title": "Deadlines as technology",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqP4",
          "author": "Jerod Santo",
          "description": "You’re so vain, you probably think this cool new web app by Robert van Hoesel is about you… and it is! It’ll track your total followers, interactions & posts over time and provide an overview of your top posts as well.\n\nDiscuss on Changelog News",
          "link": "https://mastometrics.com/",
          "publishedOn": "2023-03-10T16:50:00.000Z",
          "wordCount": null,
          "title": "Track the growth of your Mastodon account with MastoMetrics",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1980",
          "author": null,
          "description": "In a world where most documentation sucks, large language models write better than humans, and people won’t be bothered to type full sentences with actual punctuation.\nTwo men… against all odds… join an award-worthy podcast… hosted by a coin-operated, singing code monkey (?)… to convince the developer world they’re doing it ALL wrong.\nGrab your code-generator and heat up that cold cup of coffee on your desk. Because this episode of Go Time is about to blow your docs off!\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn mor…",
          "link": "https://changelog.com/gotime/268",
          "publishedOn": "2023-03-10T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 268: This will blow your docs off",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/268/go-time-268.mp3",
            "length": "72506953",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJ1m",
          "author": "Jerod Santo",
          "description": "If you thought floppy disks were a relic of the past, think again. A surprising number of industries, from embroidery to aviation, still use floppies. Jacopo Prisco tells the story in Wired:\nThe floppy disk may never truly die out. “There are people in the world who are still busy finding and fixing up and maintaining phonograph players from 1910, so it’s really hard for me to believe that the floppy disk is just going to utterly disappear,”…\nDiscuss on Changelog News",
          "link": "https://www.wired.com/story/why-the-floppy-disk-just-wont-die/",
          "publishedOn": "2023-03-09T22:08:00.000Z",
          "wordCount": null,
          "title": "Why the floppy disk just won’t die",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2023",
          "author": null,
          "description": "This week Adam talks with Marcin Kurc about chasing the 9s. Marcin is the Co-founder and CEO of Nobl9 where they build tools for managing service level objectives, aka SLOs. We also talk about service level agreements (SLAs), service level indicators (SLIs), error budgets, and monitoring, and how it all comes together to help teams align on goals, improve customer satisfaction, manage risks, increase transparency, and of course, a favorite around here…continuous improvement. Kaizen! This is an awesome deep dive into the world of chasing those 9s, and how teams are levering SLOs to earn the trust of their customers as well showcase transparency.\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSquare –…",
          "link": "https://changelog.com/podcast/530",
          "publishedOn": "2023-03-09T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 530: Chasing the 9s",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/530/the-changelog-530.mp3",
            "length": "52759121",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMA2",
          "author": "Jerod Santo",
          "description": "You know how collaborating with Google Sheets, Airtable & friends is super easy because anybody with a web browser and the correct permissions can get in on it? With Mathesar, you can enable that kind of access to any Postgres database!\nSuper powerful? I think so. Super risky?! Likely, especially if a lot of your data-related logic is in app code. Worth it? That’s up to you to decide…\n\nDiscuss on Changelog News",
          "link": "https://mathesar.org/",
          "publishedOn": "2023-03-09T14:27:00.000Z",
          "wordCount": null,
          "title": "Mathesar slaps a web-based spreadsheet UI on your Postgres database",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Zo6m",
          "author": "Jerod Santo",
          "description": "I’m a big fan of Elixir, asdf & TUIs so this one’s a no-brainer share for me. The linked blog post by Mitchell Hanberg goes into the details:\nWhile I find lazyasdf to be an amazing achievement for myself, it isn’t super interesting on its own. Let’s dive into the specifics of how I was able to build and distribute a TUI application with Elixir.\nSource code here.\n\nDiscuss on Changelog News",
          "link": "https://www.mitchellhanberg.com/introducing-lazyasdf-a-tui-for-the-asdf-version-manager/",
          "publishedOn": "2023-03-08T16:50:00.000Z",
          "wordCount": null,
          "title": "Introducing lazyasdf: an Elixir-based TUI for the asdf version manager",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1pe",
          "author": "Jerod Santo",
          "description": "No, not running the rendered assets of a WordPress install in the browser. That wouldn’t be noteworthy. This is running the entire WordPress kit and caboodle inside your browser, thanks to WebAssembly.\nTry it for yourself right here. Feel free to play with it: log in with admin / admin, add a comment, etc.\nDiscuss on Changelog News",
          "link": "https://wasmlabs.dev/articles/wordpress-in-the-browser/",
          "publishedOn": "2023-03-08T16:01:00.000Z",
          "wordCount": null,
          "title": "Running WordPress in the browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7Rb",
          "author": "Jerod Santo",
          "description": "The plugin is open source on GitHub. Photoshop is not 😉\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=VL_gbQai79E",
          "publishedOn": "2023-03-08T15:08:00.000Z",
          "wordCount": null,
          "title": "Demoing an open source Stable Diffusion plugin for Photoshop",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2024",
          "author": null,
          "description": "We’ve all experienced pain moving from local development, to testing, and then on to production. This cycle can be long and tedious, especially as AI models and datasets are integrated. Modal is trying to make this loop of development as seamless as possible for AI practitioners, and their platform is pretty incredible!\nErik from Modal joins us in this episode to help us understand how we can run or deploy machine learning models, massively parallel compute jobs, task queues, web apps, and much more, without our own infrastructure.\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nErik Bernhardsson – Twitter, GitHub, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\n\nModal\nEpisode 142 discussing Erik’s “building a data team” article\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:42) - Erik Bernhardsson\n(02:29) - What got Modal started\n(08:55) - What makes Modal different?\n(12:13) - Pros and cons of this workflow\n(15:36) - What it's like in my experience\n(21:37) - Most unexpected uses for Modal\n(23:57) - The classic Modal workflow\n(31:04) - Tips for migrating into Modal\n(34:35) - How will Modal grow?\n(37:56) - Will you take Modal to the edge?\n(40:03) - Wrap up\n(43:24) - Outro",
          "link": "https://changelog.com/practicalai/214",
          "publishedOn": "2023-03-07T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 214: End-to-end cloud compute for AI/ML",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/214/practical-ai-214.mp3",
            "length": "42775353",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/QpWN",
          "author": "Jerod Santo",
          "description": "A cool microsite by Henri Parviainen that helps you design some scrollbars by pointing-and-clicking then copy/paste the requisite CSS code to recreate in your app.\nDiscuss on Changelog News",
          "link": "https://scrollbar.app/",
          "publishedOn": "2023-03-07T19:45:00.000Z",
          "wordCount": null,
          "title": "Scrollbar.app – a simple online tool for designing scrollbars",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8lEL",
          "author": "Jerod Santo",
          "description": "Service Weaver is a programming framework for writing, deploying, and managing distributed applications in Go. With Service Weaver, you write your application like it is a traditional, single-process Go executable that runs on your local machine. Then, you deploy it to the Cloud, and the framework breaks it down into a set of connected microservices and integrates it with the cloud provider (e.g., monitoring, tracing, logging).\nDiscuss on Changelog News",
          "link": "https://serviceweaver.dev/",
          "publishedOn": "2023-03-07T15:49:00.000Z",
          "wordCount": null,
          "title": "Service Weaver is a programming framework for writing & deploying cloud apps",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Zr",
          "author": "Jerod Santo",
          "description": "Hired CEO, Josh Brenner:\nWe create this report every year to help talent professionals and software engineers understand the hiring climate, as well as what’s top of mind for employers and engineers.\nHere’s some of their key findings:\nAttracted to the field by new challenges and continuous learning, software engineers remain optimistic about the future.\nLayoffs (from May to December 2022) had the greatest impact on salaries and interview interest for junior and non-traditional engineers.\nDespite high-profile calls for return-to-office (RTO), demand for remote engineering talent remains high. Remote roles command higher salaries than local roles, especially in smaller markets.\nThe most in-demand coding skills and software engineering roles shifted this year.\nThere’s a lot to digest here. Worth a read, especially if you’re on the market.\nDiscuss on Changelog News",
          "link": "https://pages.hired.email/rs/289-SIY-439/images/Hired_2023 State of Software Engineers.pdf",
          "publishedOn": "2023-03-07T14:59:00.000Z",
          "wordCount": null,
          "title": "Hired’s 2023 State of Software Engineers report",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDwY",
          "author": "Martin Heinz",
          "description": "There’s a lot of “magic” that happens behind the scenes to make whole Kubernetes work. One of those is resource management and resource allocation done by Linux cgroups.\nIn this article we will take a deep dive into what cgroups are, how Kubernetes uses them to manage Node resources, and how we can take advantage of them beyond setting resource requests and limits on Pods.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/91",
          "publishedOn": "2023-03-06T22:27:00.000Z",
          "wordCount": null,
          "title": "A deep dive into resource management in Kubernetes",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njRr",
          "author": "Jerod Santo",
          "description": "Thomas Ricouard:\nThis is the first article in what I hope will be a long series of stories about the making of the Ice Cubes app. This article will focus on what the app is, the general story behind it, and an overview of the codebase.\nI’ve been using Ice Cubes (source code, App Store) for all Mastodon stuff on my phone since it was first released, and I really like it. I didn’t know it was open source at the time, but even better: its author is writing all about the making of it. Looking forward to this series!\nDiscuss on Changelog News",
          "link": "https://scribe.rip/the-making-of-ice-cubes-an-open-source-swiftui-mastodon-client-45ebea5cf6b6",
          "publishedOn": "2023-03-06T21:37:00.000Z",
          "wordCount": null,
          "title": "The making of Ice Cubes, an open source, SwiftUI Mastodon client",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2022",
          "author": null,
          "description": "Reorx lists awesome apps & tools using the new ChatGPT API, Ernie Smith ranks self-hosted app alternatives, Very Good Ventures brings Dart to the server, Daniel Stenberg tells curl’s NuGet story & Hacker Stations showcases tech workspace setups from all over the world.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nChatGPT’s new API\n\nOpenAI announcement post\nWhisper.cpp\nSelf-Host All the Things?\nDart Frog: A Frontend Language Moves to the Backend\n\nDart Frog website\nThe curl nuget story\nHacker Stations\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:56) - New OpenAI APIs\n(03:00) - Self-hosted alts ranked\n(03:53) - Dart Frog\n(04:50) - Curl's NuGet story\n(06:08) - Hacker Stations\n(06:29) - Outro (Joshua Bloch quote)",
          "link": "https://changelog.com/podcast/news-2023-03-06",
          "publishedOn": "2023-03-06T20:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: New OpenAI APIs, self-hosting all the things, the Dart Frog project, curl's NuGet story & Hacker Stations",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-03-06/the-changelog-news-2023-03-06.mp3",
            "length": "7069810",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbVa",
          "author": "Jerod Santo",
          "description": "Bryan Braun:\nDo you longingly reminisce about the days when flying toasters graced your screen? Do words like “Confetti Factory” and “Daredevil Dan” make your heart skip a beat?\nIf so, then never fear—CSS is here! Using modern CSS techniques like animations and transforms, we can imitate several of your favorite After Dark™ screensavers.\nThe animations were made with CSS alone. No animated gifs or JavaScript.\n\nDiscuss on Changelog News",
          "link": "https://www.bryanbraun.com/after-dark-css/",
          "publishedOn": "2023-03-06T13:48:00.000Z",
          "wordCount": null,
          "title": "Flying toasters (and other old screensavers) in CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1976",
          "author": null,
          "description": "KBall and Nick interview one of the leaders of the Tauri project about this next generation app bundling toolkit: the security, size, and performance features that make it special (and dare we say, better than Electron?), and what’s coming next.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code CHANGELOG and get the team plan free for three months.\n\nKBall Coaching – Free exploratory coaching sessions from JS Party co-host KBall! Click here to get started\n\n\nFeaturing:\n\nDaniel Thompson – GitHub, LinkedIn\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\n\nShow Notes:\n\nTauri\nTauri isolation\nTauri Discord\nAwesome Tauri\nPadloc\nGalata.app\nRecut\ncurses\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:21) - Sponsor: Sentry\n(02:17) - It's party time, y'all\n(03:12) - Welcoming Daniel\n(07:57) - Bringing Rust to a JS Party\n(10:34) - If you've never worked in Rust before\n(13:13) - Rust + TypeScript\n(19:57) - Sponsor: KBall Coaching\n(21:13) - What makes Tauri special\n(28:02) - Tauri security\n(33:43) - Tauri performance\n(38:26) - Tauri power\n(41:56) - Getting started\n(46:43) - Getting involved\n(49:47) - Cool Tauri apps\n(52:13) - What's coming next\n(53:55) - Wrapping up\n(55:10) - Outro",
          "link": "https://changelog.com/jsparty/265",
          "publishedOn": "2023-03-03T17:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 265: Tauri brings Rust to the JS Party",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/265/js-party-265.mp3",
            "length": "54369983",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Pp47",
          "author": "Jerod Santo",
          "description": "Corey Quinn:\nCountless volumes have been written about the various benefits of serverless, a task made even easier by it being such a squishy, nebulous term that’s come to mean basically whatever the author wants it to mean. This has been a boon for AWS’s product teams, who’ve gone from creating services that are clearly serverless such as DynamoDB, Route 53, IAM, and others to instead slapping the “serverless” moniker on things that are clearly not very serverless at all, like OpenSearch and Aurora.\nDiscuss on Changelog News",
          "link": "https://www.lastweekinaws.com/blog/aws-is-asleep-at-the-lambda-wheel/",
          "publishedOn": "2023-03-03T16:01:00.000Z",
          "wordCount": null,
          "title": "AWS is asleep at the Lambda wheel",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AXm4",
          "author": "Jerod Santo",
          "description": "Andy Jiang and Deno’s content team are really speaking my language lately:\nSites take time to build these days. A large Next.js 11 site will take several minutes to build. This is wasted time in the development cycle. Build tools like Vite or Turbopack highlight their ability to get this number down.\nBut the deeper question hasn’t been considered:\nWhy do we even need a build step?\nDiscuss on Changelog News",
          "link": "https://deno.com/blog/you-dont-need-a-build-step",
          "publishedOn": "2023-03-03T15:14:00.000Z",
          "wordCount": null,
          "title": "You don't need a build step",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWO9",
          "author": "Jerod Santo",
          "description": "MRSK deploys web apps anywhere from bare metal to cloud VMs using Docker with zero downtime. It uses the dynamic reverse-proxy Traefik to hold requests while the new application container is started and the old one is stopped. It works seamlessly across multiple hosts, using SSHKit to execute commands. It was built for Rails applications, but works with any type of web app that can be containerized with Docker.\nWatch the screencast or check out the code & docs.\nDiscuss on Changelog News",
          "link": "https://mrsk.dev",
          "publishedOn": "2023-03-02T22:24:00.000Z",
          "wordCount": null,
          "title": "MRSK – deploy web apps anywhere",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eERN",
          "author": "Jerod Santo",
          "description": "Fabien Sanglard’s advice to writers:\nBy starting with a markup based generator, you rob yourselves of the opportunity to learn the core technology running the whole internet. Instead you will learn to use a layer built on top of it with little to no re-usable knowledge. Inevitably, you will want to do something the framework did not forecast and will come up with convoluted ways to do it anyway.\nAdditionally, depending on how long you will write and how often you do it, setting up a generator may be counterproductive.\nThe best way to avoid the YAGNI trap is to start as simple as possible and only add tech when you’re absolutely sure the ROI is higher than the TCO.\nDiscuss on Changelog News",
          "link": "https://fabiensanglard.net/html/index.html",
          "publishedOn": "2023-03-02T17:09:00.000Z",
          "wordCount": null,
          "title": "All you may need is HTML",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1957",
          "author": null,
          "description": "This is our 9th Kaizen with Adam & Jerod. We start today’s conversation with the most important thing: embracing change. For Gerhard, this means putting Ship It on hold after this episode. It also means making more time to experiment, maybe try a few of those small bets that we recently talked about with Daniel. Kaizen will continue, we are thinking on the Changelog. Stick around to hear the rest.\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and d…",
          "link": "https://changelog.com/shipit/90",
          "publishedOn": "2023-03-02T16:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 90: Kaizen! Embracing change 🌟",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/90/ship-it-90.mp3",
            "length": "73771674",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1997",
          "author": null,
          "description": "This week we’re joined by Brigit Murtaugh, Product Manager on the Visual Studio Code team at Microsoft, and we’re talking about Development Containers and the Dev Container spec. Ever since we talked with Cory Wilkerson about Coding in the cloud with Codespaces we’ve wanted to get the Changelog.com codebase setup with a dev environment in the cloud to more easily support contributions. After getting a drive-by contribution from Chris Eggert to add a Dev Container spec to our codebase, we got curious and reached out to Brigit and asked her to come on the show to give us all the details.\nDiscuss on Changelog News\nChangelog++ members get a bonus 9 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nPostman – Build APIs together — More than 20 million developers use Post…",
          "link": "https://changelog.com/podcast/529",
          "publishedOn": "2023-03-01T22:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 529: You’re just a devcontainer.json away",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/529/the-changelog-529.mp3",
            "length": "67828411",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7YLa",
          "author": "Jerod Santo",
          "description": "Evan Hahn, describing what he calls the “lone developer problem”:\nA lot of software is built by one person. It might be an entire product built by a lone developer or a significant piece of a system.\nWhen this happens, I’ve observed that code written by a single developer is usually hard for others to work with. This code must’ve made sense to the author, who I think is very smart, but it doesn’t make any sense to me!\nAll this time, I just thought it was my code that was hard for others to work with! Turns out I’m not alone…\nDiscuss on Changelog News",
          "link": "https://evanhahn.com/the-lone-developer-problem/",
          "publishedOn": "2023-03-01T20:01:00.000Z",
          "wordCount": null,
          "title": "The lone developer problem",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X1ML",
          "author": "Travis Turner",
          "description": "The UI of the open source OKLCH Color Picker & Converter was created with community education in mind as the driving design principle. Beyond being a handy tool, there was a secondary goal: speeding up familiarity and adoption of OKLCH and perceptual color spaces.\nTo that end, this article explains how the underlying reality of the color space itself guided the UI design.\n\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/oklch-a-color-picker-made-to-help-think-perceptively",
          "publishedOn": "2023-03-01T19:09:00.000Z",
          "wordCount": null,
          "title": "OK, OKLCH: a color picker made to help think perceptively",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlMR",
          "author": "Abdulfatai Popoola",
          "description": "The common trope that feedback is a gift is a misnomer: we love giving and receiving gifts but recoil from delivering and accepting feedback. Some truths are hard to hear and discuss, so the gift-giving metaphor falls short.\nWhat if I told you there was a way to overcome that sinking feeling associated with delivering feedback? Yes, delivering great actionable feedback is a learnable skill that improves with deliberate practice. Read my post to learn some useful techniques.\nDiscuss on Changelog News",
          "link": "https://abdulapopoola.com/2023/02/06/10x-your-feedback-game-choose-kindness-over-niceness/",
          "publishedOn": "2023-02-28T22:44:00.000Z",
          "wordCount": null,
          "title": "10x your feedback game by choosing kindness over niceness",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2018",
          "author": null,
          "description": "With the recent proliferation of generative AI models (from OpenAI, co:here, Anthropic, etc.), practitioners are racing to come up with best practices around prompting, grounding, and control of outputs.\nChris and Daniel take a deep dive into the kinds of behavior we are seeing with this latest wave of models (both good and bad) and what leads to that behavior. They also dig into some prompting and integration tips.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — De…",
          "link": "https://changelog.com/practicalai/213",
          "publishedOn": "2023-02-28T21:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 213: Success (and failure) in prompting",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/213/practical-ai-213.mp3",
            "length": "42319011",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/gwMA",
          "author": "Petros Amoiridis",
          "description": "I was a programmer for 12 years. I then switched to support and people management for 12 years. I now want to go back to programming for the rest of my career. I started working at Zed Industries on January the 17th, helping build the Zed editor and be a Rust programmer wannabe. End of June is going to be the judgment day. Will I remain part of Zed?\nThat’s right. I have a six month contract with the company my ex-GitHub colleague founded. They are trusting me to become productive in Rust within 6 months. With no prior experience in Rust, this feels like a Herculean feat. The interesting part is that I abandoned a high-paying job to do this. And by the end of the six month contract, Zed Industries and I may decide to part ways and still be friends.\nAnd I am blogging about my experience so far. It’s a mix of personal learnings and small technical bits and pieces sprinkled here and there. But it’s mostly about my personal experience.\nDiscuss on Changelog News",
          "link": "https://petros.blog/series-being-a-programmer-again/",
          "publishedOn": "2023-02-28T16:55:00.000Z",
          "wordCount": null,
          "title": "Being a programmer again",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwRg",
          "author": "Jerod Santo",
          "description": "On first glance, making a first person game without an engine or a graphics API seems like an almost impossible task. In this post I’ll show you how to do that using an algorithm called ray casting.\nMy goal here is to show how something that looks complicated can be broken down into simple pieces, and if I’ve done my job right, it should feel like you’ve discovered how the game works.\n\nDiscuss on Changelog News",
          "link": "https://grantshandy.github.io/posts/raycasting/",
          "publishedOn": "2023-02-28T16:05:00.000Z",
          "wordCount": null,
          "title": "Write a first person game in 2kb with Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2016",
          "author": null,
          "description": "Sahn Lam details Stack Overflow’s monolith/on-prem architecture, Hillel Wayne asks the Lobsters community for killer libraries, Linux 6.2 is ready to run on M1 Macs thanks to Asahi Linux, Johan Halse writes up what to expect from your web framework & Eli Bendersky on using GoatCounter for blog analytics.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nStack Overflow’s monolith\nLobsters’ killer libraries\nLinux is ready to run on modern Macs\nWhat to expect from your framework\n\nDon’t sleep on Ruby on Rails\nHistory of React criticism\nThe Market for Lemons\nThe case for frameworks\nUsing GoatCounter for blog analytics\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:16) - Stack Overflow's architecture\n(01:16) - Lobsters' killer libraries\n(02:46) - Linux is ready for M1 Macs\n(03:58) - What to expect from your framework\n(05:34) - GoatCounter web analytics\n(06:49) - Outro",
          "link": "https://changelog.com/podcast/news-2023-02-27",
          "publishedOn": "2023-02-27T22:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Stack Overflow's architecture, Lobsters' killer libraries, Linux is ready for modern Macs, what to expect from your framework & GoatCounter web analytics",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-02-27/the-changelog-news-2023-02-27.mp3",
            "length": "7311553",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X1lq",
          "author": "Jerod Santo",
          "description": "Ben Hoyt shares his experience switching two of his side projects from on an EC2 instance to Fly.io:\nIt took me about an hour to figure out the basics of Fly.io and move the simpler project, and a couple of evenings to move the more complex one. Fly.io handles the annoying reverse proxy and SSL stuff, deployment is as simple as fly deploy, and there’s a nice dashboard on Fly.io to show me what’s going on…\nI’m only a few weeks into using Fly.io to host my side projects, but I’m very happy with their product so far. I was quite happy to delete the 500 lines of Ansible scripts, systemd unit files, and Caddy config files.\nIt also made me smile to finally stop the EC2 instance and bump my AWS bill down from $9 per month to about 10 cents per month (I still use S3 for user-uploaded images and for backups). I have nothing against EC2 and would use it again for certain things, but for small web applications, Fly.io seems like a great fit.\nDiscuss on Changelog News",
          "link": "https://benhoyt.com/writings/flyio/",
          "publishedOn": "2023-02-27T15:51:00.000Z",
          "wordCount": null,
          "title": "From Go on EC2 to Fly.io: +fun, −$9/mo",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlow",
          "author": "Jerod Santo",
          "description": "Akshay Khot:\nAlthough Hotwire (an approach to building web apps without much JS by sending HTML instead of JSON over the wire.) is closely tied to Ruby on Rails, you might be surprised to know that you don’t really need Rails to learn, play, and experiment with Hotwire. In this article, I will show you how a simple static website can use Turbo Drive and Frames to make it more dynamic and responsive.\nWe’ve been using the predecessor to Hotwire’s Turbo Drive on this very website (an Elixir app) for 7 (!) years now, so I’m convinced there are valid uses of Hotwire outside of its usual Rails context.\nDiscuss on Changelog News",
          "link": "https://www.akshaykhot.com/using-hotwire-without-rails/",
          "publishedOn": "2023-02-27T15:00:00.000Z",
          "wordCount": null,
          "title": "You don't need Rails to start using Hotwire",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1996",
          "author": null,
          "description": "This week Evan Prodromou is back to take us deeper into the Fediverse. As many of us reconsider our relationship with Twitter, Mastodon has been by-and-large the target of migration. They helped to popularize the idea of a federated universe of community-owned, decentralized, social networks. And, at the heart of it all is ActivityPub. ActivityPub is a decentralized social networking protocol published by the W3C. It is co-authored by Evan as well as; Christine Lemmer-Webber, Jessica Tallon, Erin Shepherd, and Amy Guy. Today, Evan shares the details behind this protocol and where the Fediverse might be heading.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nPostman – Build APIs together — More than…",
          "link": "https://changelog.com/podcast/528",
          "publishedOn": "2023-02-24T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 528: Into the Fediverse",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/528/the-changelog-528.mp3",
            "length": "75214671",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/D1Ad",
          "author": "Jerod Santo",
          "description": "Take any plaintext, encrypt it & generate a PDF with a QR code that’s easy to scan back in.\nUses the Age format.\nDiscuss on Changelog News",
          "link": "https://github.com/matiaskorhonen/paper-age",
          "publishedOn": "2023-02-24T20:34:00.000Z",
          "wordCount": null,
          "title": "PaperAge – easy and secure paper backups of (smallish) secrets",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rbP",
          "author": "Jerod Santo",
          "description": "The rough math goes like this: We spent $3.2m on cloud in 2022. Just under a million of that was on storing 8 petabytes of files in S3, fully replicated across several regions. So that leaves ~$2.3m on everything else: app servers, cache servers, database servers, search servers, the works. That’s the part of the budget we intend to bring to zero in 2023. Then we’ll worry about exiting the 8PB from S3 in 2024.\nDavid spoke at length on this decision when he was on Ship It! late last year.\nDiscuss on Changelog News",
          "link": "https://world.hey.com/dhh/we-stand-to-save-7m-over-five-years-from-our-cloud-exit-53996caa",
          "publishedOn": "2023-02-24T19:46:00.000Z",
          "wordCount": null,
          "title": "We stand to save $7m over five years from our cloud exit",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1971",
          "author": null,
          "description": "Una & Adam from The CSS Podcast defend their Frontend Feud title against challengers David & Shaw from the keyframers. Let’s get it on!\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code CHANGELOG and get the team plan free for three months.\n\nLolo Code – If you’re familiar with building severless apps, think of Lolo Code as your backend with a visual editor that lets you think and build at the same time. All this without having to provision or manage servers. Use the visual editor to build your app, connect nodes, and add any npm libraries you need. You can even write your own integrations. This makes Lolo Code very Zapier-ish, but for devs. Try it free today with no credit card required at lolo.co/jsparty\n\nKBall Coaching – Free exploratory coaching sessions from JS Party co-host KBall! Click here to get started\n\n\nFeaturing:\n\nUna Kravets – Twitter, GitHub, Website\nAdam Argyle – Twitter, GitHub, Website\nDavid Khourshid – Twitter, GitHub, Website\nShaw – Mastodon, Twitter, GitHub\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nThe CSS Podcast\nthe keyframers\nMore dev game shows!\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:55) - It's feud time, y'all!\n(02:42) - Welcoming our contestants\n(03:42) - Larry the intern's interview questions\n(04:38) - How the game works\n(06:07) - Round 1: Future JS runtime\n(13:07) - Round 2: Big tech job\n(19:35) - Sponsor: Lolo Code\n(21:31) - Round 3: Coding monitors\n(25:01) - Round 4: Can't code without\n(33:58) - Round 5: Primary web browser\n(37:28) - Sponsor: KBall Coaching\n(38:45) - Round 6: Why write software\n(45:15) - End Game\n(46:54) - Interviewing the champs\n(48:40) - Wrapping up (merch!)\n(49:47) - Outro (more dev game shows!)",
          "link": "https://changelog.com/jsparty/264",
          "publishedOn": "2023-02-24T19:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 264: Frontend Feud: CSS Podcast vs @keyframers",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/264/js-party-264.mp3",
            "length": "49584239",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V1ae",
          "author": "Jerod Santo",
          "description": "Owncast (an open source live video & web chat server) underwent a redesign lately and its creator, Gabe Kangas, has been writing about that process and the choices he made along the way.\nThis post discusses the before and after of migrating to React. Covering Gabe’s thoughts from the developer experience, contributor recruiting pipeline & productivity standpoints.\nDiscuss on Changelog News",
          "link": "https://gabekangas.com/blog/2023/02/owncast-v0.1.0-retrospective-frontend-web-rewrite/",
          "publishedOn": "2023-02-23T14:40:00.000Z",
          "wordCount": null,
          "title": "Is React still the right choice for Owncast in 2023?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqa4",
          "author": "Jerod Santo",
          "description": "Tyler Cipriani:\nDespite their best efforts, all weather apps will eventually lie.\nWeather is often hyper-local…\nSo, in 2013, I set up a Davis Vantage Vue integrated sensor suite (ISS) and mounted it on a pole attached to my garage.\nThe heart of his system is WeeWX, a free and open source weather station software written in Python. Ten years later, he’s learned some things, but he’s still using his homegrown weather monitoring.\nDiscuss on Changelog News",
          "link": "https://tylercipriani.com/blog/2023/02/19/weather-station/",
          "publishedOn": "2023-02-23T13:53:00.000Z",
          "wordCount": null,
          "title": "Monitoring my weather at home 🌩️",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bJam",
          "author": "Jerod Santo",
          "description": "Yury Molodtsov:\nRunning your own blog in 2023 is still needlessly complicated, especially if you have any kind of taste. Why have one in the first place?\nSocial apps and networks are obviously the easiest options, but they’re geared toward vastly different things, and I just don’t trust their longevity. Having your own platform enables flexibility and portability, so your content can be kept online practically forever.\nThis!\nThere are many options out there, ranging from WordPress and Ghost to static blogs to managed online platforms and Micro.blog. How do you choose between them?\nWhat follows is a survey of some of the popular tools and what Yury thinks about them. My advice is this: don’t worry too much about tooling. That’s the easy part. Writing’s the hard part. We often bike shed the easy parts to avoid the hard part. Yuri seems to agree:\nHaving the right tool certainly helps, but at the end of the day, what matters is what you write there. Focus more on the content and just ensure the process of writing and posting is simple enough.\nDiscuss on Changelog News",
          "link": "https://molodtsov.me/2023/02/how-to-start-your-blog-in-2023/",
          "publishedOn": "2023-02-22T19:25:00.000Z",
          "wordCount": null,
          "title": "How to start your blog in 2023",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1aZ",
          "author": "Jerod Santo",
          "description": "Recent guest Justin Searls announces his new thing:\nStandard Ruby (a Ruby style guide with linter & automatic code fixer) now ships with its own built-in language server, which enables it to offer lightning-fast linting and formatting for supported editors. This new extension leverages that language server to deliver a much faster UX than most other Ruby extensions available for VS Code.\nI don’t know how many of our readers live at the intersection of VS Code and Ruby… but if you do, this should be great news for you. 😉\nDiscuss on Changelog News",
          "link": "https://blog.testdouble.com/posts/2023-02-16-its-official-the-standard-ruby-vscode-extension/",
          "publishedOn": "2023-02-22T16:18:00.000Z",
          "wordCount": null,
          "title": "The Standard Ruby VS Code extension",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2015",
          "author": null,
          "description": "We’re super excited to welcome Jay Alammar to the show. Jay is a well-known AI educator, applied NLP practitioner at co:here, and author of the popular blog, “The Illustrated Transformer.” In this episode, he shares his ideas on creating applied NLP solutions, working with large language models, and creating educational resources for state-of-the-art AI.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n\nFeaturing:\n\nJay Alammar – Twitter, GitHub, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\n\nJay’s popular blog (with posts including “The Illustrated Transformer”)\nco:here\nTopically sandbox - topic modeling\nco:here’s prompt engineering guide\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:42) - Jay Alammar\n(03:33) - Jay's origin story\n(08:49) - Tips for educational content creators\n(12:26) - Applied NLP\n(16:34) - Are data scientists becoming software engineers?\n(21:47) - When should I be using these tools?\n(25:55) - co:here\n(28:39) - How is this landscaoe changing?\n(32:41) - Multi-modality: How do I use this?\n(35:56) - Jay, what do you want to explore?\n(37:42) - Outro",
          "link": "https://changelog.com/practicalai/212",
          "publishedOn": "2023-02-22T15:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 212: Applied NLP solutions & AI education",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/212/practical-ai-212.mp3",
            "length": "37153313",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMN2",
          "author": "Jerod Santo",
          "description": "My opinionated list of four approaches to building websites and web applications. Publicly hosted on the internet, serving HTML, CSS, JavaScript, images, etc over HTTP.\nThere are more than four ways to build a web app, but the ones Tom covers in-depth in this post are:\nHugo Static Sites + Progressive Web Apps\nCloudflare Workers\nLinux Server Singleton\nContainers on Platform as a Service (PaaS)\nDiscuss on Changelog News",
          "link": "https://tomhummel.com/posts/four-web-apps/",
          "publishedOn": "2023-02-21T15:22:00.000Z",
          "wordCount": null,
          "title": "Four ways to build web apps",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2014",
          "author": null,
          "description": "Simon Willison rounds up the goings on around Microsoft’s new GPT-powered Bing search, The Vue/Vite team build a nimble web client for Mastodon, Will Larson writes about writing an engineering strategy, Denis Pushkarev seeks support to maintain core-js & I share a lightning round of cool tools I’ve found and used recently. ⚡️\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nBing: “I will not harm you unless you harm me first”\nA nimble Mastodon web client\nWriting an engineering strategy\nSo, what’s next for core-js?\nLightning round ⚡️\n\nObsidian\nMLML\nSloth\nAI Commits\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:01) - Sidney Bing\n(03:07) - Elk for Mastodon\n(04:43) - Writing an engineering strategy\n(06:04) - What's next for core-js\n(06:50) - Lightning round!\n(07:00) - Obsidian\n(07:17) - MJML\n(07:30) - Sloth\n(07:46) - AI Commits\n(08:05) - Outro",
          "link": "https://changelog.com/podcast/news-2023-02-20",
          "publishedOn": "2023-02-20T20:50:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Sidney Bing, Elk for Mastodon, writing an engineering strategy, what's next for core-js & cool tool lightning round",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-02-20/the-changelog-news-2023-02-20.mp3",
            "length": "8655936",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JgA0",
          "author": "Jerod Santo",
          "description": "Andy Bell has been obsessed with one particular CSS snippet for years now. In this post, he shares it with us and shows us how he’s recently improved it further by using Custom Properties.\nDiscuss on Changelog News",
          "link": "https://andy-bell.co.uk/my-favourite-3-lines-of-css/",
          "publishedOn": "2023-02-20T16:17:00.000Z",
          "wordCount": null,
          "title": "My favourite 3 lines of CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/QpaN",
          "author": "Jerod Santo",
          "description": "Antoine Vastel:\nThe new headless Chrome has been released in November 2022. For the moment, it hasn’t become the standard headless mode. It’s still hidden behind a –headless=new flag. However, it will soon become the standard headless mode, and this is going to change a lot of things when it comes to bot detection, particularly detection based on browser fingerprint.\nAntoine is the head of research at DataDome, a bot detection company, so he knows what he’s talking about here. The good news is you can still detect the new headless Chrome, but it will be more tricky. The other good news is that fingerprinting is just one of many tools in the bot detector’s belt. Others include request behavior, reputation scores, proxy detection & TLS fingerprinting.\nDiscuss on Changelog News",
          "link": "https://antoinevastel.com/bot detection/2023/02/19/new-headless-chrome.html",
          "publishedOn": "2023-02-20T15:22:00.000Z",
          "wordCount": null,
          "title": "The new headless Chrome makes fingerprint-based bot detection harder",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/091release/",
          "author": null,
          "description": "New driving model, DMoji, micd, and more!",
          "link": "https://blog.comma.ai/091release/",
          "publishedOn": "2023-02-28T00:00:00.000Z",
          "wordCount": 959,
          "title": "openpilot 0.9.1"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/products/pixel/health-ai-better-sleep/",
          "author": null,
          "description": "Learn how features like Sleep Profiles, Smart Wake and cough and snore detection are powered by AI to help you get better sleep.",
          "link": "https://blog.google/products/pixel/health-ai-better-sleep/",
          "publishedOn": "2023-03-15T16:00:00.000Z",
          "wordCount": 1883,
          "title": "6 ways Google AI is helping you sleep better"
        },
        {
          "id": "https://blog.google/technology/health/ai-llm-medpalm-research-thecheckup/",
          "author": null,
          "description": "At The Check Up, we shared updates on our medical LLM research, partnerships and new ways AI can help with disease detection.",
          "link": "https://blog.google/technology/health/ai-llm-medpalm-research-thecheckup/",
          "publishedOn": "2023-03-14T15:00:00.000Z",
          "wordCount": 1604,
          "title": "Our latest health AI research updates"
        },
        {
          "id": "https://blog.google/technology/ai/ai-developers-google-cloud-workspace/",
          "author": null,
          "description": "Introducing new generative AI capabilities in Google Cloud and Google Workspace, plus PaLM API and MakerSuite for developers.",
          "link": "https://blog.google/technology/ai/ai-developers-google-cloud-workspace/",
          "publishedOn": "2023-03-14T13:00:00.000Z",
          "wordCount": 1624,
          "title": "The next generation of AI for developers and Google Workspace"
        },
        {
          "id": "https://blog.google/outreach-initiatives/entrepreneurs/how-4-black-founders-fund-recipients-are-building-with-ai/",
          "author": null,
          "description": "Meet Google for Startups Black Founders Fund recipients from Africa, Brazil, Europe and the United States using Google AI technology to help people and society.",
          "link": "https://blog.google/outreach-initiatives/entrepreneurs/how-4-black-founders-fund-recipients-are-building-with-ai/",
          "publishedOn": "2023-02-27T16:00:00.000Z",
          "wordCount": 1452,
          "title": "How 4 Black Founders Fund recipients are building with AI"
        },
        {
          "id": "https://blog.google/inside-google/message-ceo/our-progress-toward-quantum-error-correction/",
          "author": null,
          "description": "For the first time ever, our Quantum AI researchers have experimentally demonstrated it’s possible to reduce errors by increasing the number of qubits.",
          "link": "https://blog.google/inside-google/message-ceo/our-progress-toward-quantum-error-correction/",
          "publishedOn": "2023-02-22T16:00:00.000Z",
          "wordCount": 1374,
          "title": "Our progress toward quantum error correction"
        },
        {
          "id": "https://blog.google/products/pixel/7-ways-ai-is-already-making-your-pixel-more-helpful/",
          "author": null,
          "description": "Whether you’re using your Pixel to translate a foreign language, edit photos or take a phone call in a noisy area — AI is making everyday moments easier.",
          "link": "https://blog.google/products/pixel/7-ways-ai-is-already-making-your-pixel-more-helpful/",
          "publishedOn": "2023-02-20T15:00:00.000Z",
          "wordCount": 1257,
          "title": "7 ways AI is already making your Pixel more helpful"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=22030",
          "author": "Daniel Stenberg",
          "description": "Exactly one month since the previous release, we are happy to give you curl 8.0.0 released on curl’s official 25th birthday. This a major version number bump but without any ground-breaking changes or fireworks. We decided it was about time to reset the minor number down to more a manageable level and doing it exactly … Continue reading curl 8.0.0 is here →",
          "link": "https://daniel.haxx.se/blog/2023/03/20/curl-8-0-0-is-here/",
          "publishedOn": "2023-03-20T07:15:13.000Z",
          "wordCount": 1444,
          "title": "curl 8.0.0 is here"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21514",
          "author": "Daniel Stenberg",
          "description": "Time flies when you are having fun. Today is curl‘s 25th birthday. The curl project started out very humbly as a small renamed URL transfer tool that almost nobody knew about for the first few years. It scratched a personal itch of mine, Me back then I made that first curl release and I’ve packaged … Continue reading twenty-five years of curl →",
          "link": "https://daniel.haxx.se/blog/2023/03/20/twenty-five-years-of-curl/",
          "publishedOn": "2023-03-19T23:05:15.000Z",
          "wordCount": 3996,
          "title": "twenty-five years of curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=22090",
          "author": "Daniel Stenberg",
          "description": "Over in our podcast Fossified, we did an entire episode dedicated to curl’s 25th birthday. Enjoy!",
          "link": "https://daniel.haxx.se/blog/2023/03/19/fossified-curl-25-years/",
          "publishedOn": "2023-03-19T15:49:59.000Z",
          "wordCount": 270,
          "title": "Fossified: curl 25 years"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21645",
          "author": "Daniel Stenberg",
          "description": "curl turns 25 years old and what better way to celebrate this than to join fellow curl friends, developers and fans online on the exact birthday? At 17:00 UTC March 20, 2023. We run a Zoom birthday party open for everyone to join. Consider muting yourself when you join, but feel encouraged to leave the … Continue reading curl 25 years online celebration →",
          "link": "https://daniel.haxx.se/blog/2023/03/10/curl-25-years-online-celebration/",
          "publishedOn": "2023-03-10T09:15:16.000Z",
          "wordCount": 429,
          "title": "curl 25 years online celebration"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21858",
          "author": "Daniel Stenberg",
          "description": "When a security vulnerability has been found and confirmed in curl, we request a CVE Id for the issue. This is a global unique identifier for this specific problem. We request the ID from our CVE Numbering Authority (CNA), Hackerone, which once we make the issue public will publish all details about it to MITRE, … Continue reading NVD makes up vulnerability severity levels →",
          "link": "https://daniel.haxx.se/blog/2023/03/06/nvd-makes-up-vulnerability-severity-levels/",
          "publishedOn": "2023-03-06T08:37:52.000Z",
          "wordCount": 1330,
          "title": "NVD makes up vulnerability severity levels"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21801",
          "author": "Daniel Stenberg",
          "description": "My home office was featured over at Hacker Stations where I also detailed stuff in my workplace and offer a few more photos. I have been working exclusively from home for nine years straight now.",
          "link": "https://daniel.haxx.se/blog/2023/03/03/my-hacker-station/",
          "publishedOn": "2023-03-03T12:50:08.000Z",
          "wordCount": 287,
          "title": "My hacker station"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21844",
          "author": "Daniel Stenberg",
          "description": "Recently there has been an interesting debate in the Open Source world where people have objected to being called “Suppliers” as in Supply Chain Security when you are but an Open Source developer offering your code to the world for free and at no cost but also without any warranties. That is not a supplier, … Continue reading The curl nuget story →",
          "link": "https://daniel.haxx.se/blog/2023/03/02/the-curl-nuget-story/",
          "publishedOn": "2023-03-02T07:52:43.000Z",
          "wordCount": 2208,
          "title": "The curl nuget story"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21845",
          "author": "Daniel Stenberg",
          "description": "Henrik, Johan, Magnus and I are all Swedish “FOSS people” and friends since many years back. We like open source. We work with Open Source. We have contributed to Open Source since a long time back. We also have slightly different backgrounds and areas of expertise so we don’t all just totally overlap. We decided … Continue reading Fossified pilot episode →",
          "link": "https://daniel.haxx.se/blog/2023/03/01/fossified-pilot-episode/",
          "publishedOn": "2023-03-01T15:50:41.000Z",
          "wordCount": 410,
          "title": "Fossified pilot episode"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21484",
          "author": "Daniel Stenberg",
          "description": "I attended FOSDEM 2023 and over the two days of conference I gave away well over a thousand curl stickers. Every last curl sticker I had in my possession. What does a curl maintainer do when he runs out of curl stickers? He restocks. Getting stickers Right now, the only way to get your hands … Continue reading Restocked on stickers →",
          "link": "https://daniel.haxx.se/blog/2023/02/23/restocked-on-stickers/",
          "publishedOn": "2023-02-23T21:53:52.000Z",
          "wordCount": 360,
          "title": "Restocked on stickers"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20835",
          "author": "Daniel Stenberg",
          "description": "My desktop computer is my trusted work machine that I do the majority of all my (curl) development on. When the 15th computer I’ve owned through the times was ten years old the time was ripe to bump things up a notch. Requirements I don’t do games (as in: never) and I don’t do any … Continue reading My 2023 dev machine →",
          "link": "https://daniel.haxx.se/blog/2023/02/20/my-2023-dev-machine/",
          "publishedOn": "2023-02-20T21:57:50.000Z",
          "wordCount": 1100,
          "title": "My 2023 dev machine"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21768",
          "author": "Daniel Stenberg",
          "description": "Things did not work out the way we had planned. The 7.88.0 release that was supposed to be the last curl version 7 release contained a nasty bug that made us decide that we better ship an update once that is fixed. This is the update. The second final version 7 release. Release presentation Numbers … Continue reading 7.88.1 the second final one →",
          "link": "https://daniel.haxx.se/blog/2023/02/20/7-88-1-the-second-final-one/",
          "publishedOn": "2023-02-20T07:41:56.000Z",
          "wordCount": 649,
          "title": "7.88.1 the second final one"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2023-03-20T12:18:07.496Z",
          "wordCount": 890,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2023-03-19T12:16:07.378Z",
          "wordCount": 1710,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "publishedOn": "2023-03-13T12:18:36.222Z",
          "wordCount": 991,
          "title": "How Twitter uses rasdaemon for hardware reliability"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2023-03-12T12:15:44.764Z",
          "wordCount": 1488,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "author": null,
          "description": "As any team and its infrastructure grows, the risk of an unplanned service outage and potential data loss will grow.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "publishedOn": "2023-03-12T12:15:43.671Z",
          "wordCount": 1108,
          "title": "The data platform cluster operator service for Hadoop cluster management"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/twitters-blobstore-hardware-lifecycle-monitoring-and-reporting-service",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/twitters-blobstore-hardware-lifecycle-monitoring-and-reporting-service",
          "publishedOn": "2023-02-24T12:18:01.699Z",
          "wordCount": 1723,
          "title": "Twitter’s Blobstore Hardware Lifecycle Monitoring and Reporting Service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/kerberizing-hadoop-clusters-at-twitter",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/kerberizing-hadoop-clusters-at-twitter",
          "publishedOn": "2023-02-24T12:18:01.672Z",
          "wordCount": 3407,
          "title": "Kerberizing Hadoop Clusters at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-we-scaled-reads-on-the-twitter-users-database",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-we-scaled-reads-on-the-twitter-users-database",
          "publishedOn": "2023-02-24T12:18:01.657Z",
          "wordCount": 907,
          "title": "How we scaled Reads On the Twitter Users Database"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2023-02-23T12:19:05.440Z",
          "wordCount": 2263,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2023-02-22T12:18:22.538Z",
          "wordCount": 1352,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/constraint-management-for-cluster-operation-safety-and-reliability-at-twitter",
          "author": null,
          "description": "As any team and its infrastructure grows, the risk of an unplanned service outage and potential data loss will grow.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/constraint-management-for-cluster-operation-safety-and-reliability-at-twitter",
          "publishedOn": "2023-02-20T12:18:01.615Z",
          "wordCount": 1985,
          "title": "Constraint Management for cluster operation safety and reliability at Twitter"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2023/03/multiple-internet-to-baseband-remote-rce.html",
          "author": null,
          "description": ".lst-kix_iavizzpdbbty-5>li{counter-increment:lst-ctn-kix_iavizzpdbbty-5}ol.lst-kix_iavizzpdbbty-0{list-style-type:none}ol.lst-kix_iavizzpdbbty-4.start{counter-reset:lst-ctn-kix_iavizzpdbbty-4 0}ol.lst-kix_iavizzpdbbty-2{list-style-type:none}ol.lst-kix_iavizzpdbbty-1{list-style-type:none}ol.lst-kix_iavizzpdbbty-0.start{counter-reset:lst-ctn-kix_iavizzpdbbty-0 0}.lst-kix_pidqkndckybh-1>li:before{content:\"\\0025cb  \"}.lst-kix_pidqkndckybh-2>li:before{content:\"\\0025a0  \"}ol.lst-kix_iavizzpdbbty-7.start{counter-reset:lst-ctn-kix_iavizzpdbbty-7 0}.lst-kix_tkumn87s07hu-6>li:before{content:\"\\0025cf  \"}.lst-kix_pidqkndckybh-0>li:before{content:\"\\0025cf  \"}.lst-kix_tkumn87s07hu-5>li:before{content:\"\\0025a0  \"}.lst-kix_tkumn87s07hu-4>li:before{content:\"\\0025cb  \"}.lst-kix_tkumn87s07hu-3>li:before{cont…",
          "link": "https://googleprojectzero.blogspot.com/2023/03/multiple-internet-to-baseband-remote-rce.html",
          "publishedOn": "2023-03-16T18:07:00.012Z",
          "wordCount": 1071,
          "title": "Multiple Internet to Baseband Remote Code Execution Vulnerabilities in Exynos Modems"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47990",
          "author": "Melissa Thermidor",
          "description": "We want entrepreneurs and builders to join us in creating a future where AI is developed through this responsible lens. That’s why we are relaunching our Mozilla Builders program with the Responsible AI Challenge.\nThe post Mozilla Launches Responsible AI Challenge appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2023/03/mozilla-launches-responsible-ai-challenge/",
          "publishedOn": "2023-03-14T20:42:38.000Z",
          "wordCount": 464,
          "title": "Mozilla Launches Responsible AI Challenge"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=70805",
          "author": "Mike Linksvayer",
          "description": "We’re looking forward to working with policymakers to improve cybersecurity and support developers.",
          "link": "https://github.blog/2023-03-17-partnering-with-eu-policymakers-to-ensure-the-cyber-resilience-act-works-for-developers/",
          "publishedOn": "2023-03-17T15:35:42.000Z",
          "wordCount": 1134,
          "title": "Partnering with EU policymakers to ensure the Cyber Resilience Act works for developers"
        },
        {
          "id": "https://github.blog/?p=70777",
          "author": "Lee Reilly",
          "description": "We are delighted to host the Godot 4.0 Release Party at GitHub HQ on Wednesday, March 22 from 6:30 pm to 9:30 pm. And you're invited!",
          "link": "https://github.blog/2023-03-16-godot-4-0-release-party/",
          "publishedOn": "2023-03-16T19:14:31.000Z",
          "wordCount": 652,
          "title": "Godot 4.0 Release Party 🎉"
        },
        {
          "id": "https://github.blog/?p=70744",
          "author": "Mario Rodriguez",
          "description": "Hear from Grafana’s Armand Grillet about how his team uses GitHub Projects.",
          "link": "https://github.blog/2023-03-15-how-the-grafana-alerting-team-scales-their-issue-management-with-github-projects/",
          "publishedOn": "2023-03-15T21:18:11.000Z",
          "wordCount": 2015,
          "title": "How the Grafana Alerting team scales their issue management with GitHub Projects"
        },
        {
          "id": "https://github.blog/?p=70731",
          "author": "Ed Summers",
          "description": "Learn how developers with disabilities are pushing the boundaries of accessibility with ingenuity, open source, and generative AI on The ReadME Project.",
          "link": "https://github.blog/2023-03-14-github-celebrates-the-ingenuity-of-developers-with-disabilities-in-new-video-series/",
          "publishedOn": "2023-03-14T18:32:00.000Z",
          "wordCount": 880,
          "title": "GitHub celebrates the ingenuity of developers with disabilities in new video series"
        },
        {
          "id": "https://github.blog/?p=70710",
          "author": "Taylor Blau",
          "description": "The first Git release of the year is here! Take a look at some of our highlights on what's new in Git 2.40.",
          "link": "https://github.blog/2023-03-13-highlights-from-git-2-40/",
          "publishedOn": "2023-03-13T17:57:15.000Z",
          "wordCount": 1482,
          "title": "Highlights from Git 2.40"
        },
        {
          "id": "https://github.blog/?p=70679",
          "author": "Zack Koppert",
          "description": "We are open sourcing our own OSPO policies, tools, and guides to help other OSPOs get started.",
          "link": "https://github.blog/2023-03-13-an-open-source-project-to-empower-ospos-everywhere/",
          "publishedOn": "2023-03-13T17:00:34.000Z",
          "wordCount": 707,
          "title": "An open source project to empower OSPOs everywhere"
        },
        {
          "id": "https://github.blog/?p=70686",
          "author": "Mala Kumar",
          "description": "The Social Impact, Tech for Social Good team is launching a new Open Source Community Manager Program to support digital public goods. This is part of their new Activating Developers initiative.",
          "link": "https://github.blog/2023-03-13-introducing-activating-developers-and-the-new-digital-public-goods-open-source-community-manager-program/",
          "publishedOn": "2023-03-13T16:00:49.000Z",
          "wordCount": 937,
          "title": "Introducing Activating Developers and the new Digital Public Goods Open Source Community Manager Program"
        },
        {
          "id": "https://github.blog/?p=70661",
          "author": "Alexander De Michieli",
          "description": "Learn about using GitHub Advanced Security alerts with vulnerability management tools. Check out the integrations and learn about how to get started.",
          "link": "https://github.blog/2023-03-10-introducing-github-vulnerability-management-integrations-for-security-professionals/",
          "publishedOn": "2023-03-10T18:00:59.000Z",
          "wordCount": 1075,
          "title": "Introducing GitHub vulnerability management integrations for security professionals"
        },
        {
          "id": "https://github.blog/?p=70657",
          "author": "Shelley McKinley",
          "description": "Developers are at the heart of our online world and at the forefront of creating solutions for global challenges, working to make the software that underpins our digital infrastructure more secure, reliable, and safe.",
          "link": "https://github.blog/2023-03-10-dont-leave-developers-behind-in-the-section-230-debate/",
          "publishedOn": "2023-03-10T17:00:57.000Z",
          "wordCount": 1496,
          "title": "Don’t leave developers behind in the Section 230 debate"
        },
        {
          "id": "https://github.blog/?p=70642",
          "author": "Chris Reddington",
          "description": "In a world where software and hardware is ubiquitous, GitHub can help enable secure development for mission-critical embedded systems.",
          "link": "https://github.blog/2023-03-09-how-github-accelerates-development-for-embedded-systems/",
          "publishedOn": "2023-03-09T18:00:44.000Z",
          "wordCount": 2397,
          "title": "How GitHub accelerates development for embedded systems"
        },
        {
          "id": "https://github.blog/?p=70566",
          "author": "Laura Paine",
          "description": "On March 13, we will officially begin rolling out our initiative to require all developers who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023. Read on to learn about what the process entails and how you can help secure the software supply chain with 2FA.",
          "link": "https://github.blog/2023-03-09-raising-the-bar-for-software-security-github-2fa-begins-march-13/",
          "publishedOn": "2023-03-09T17:00:21.000Z",
          "wordCount": 1767,
          "title": "Raising the bar for software security: GitHub 2FA begins March 13"
        },
        {
          "id": "https://github.blog/?p=70600",
          "author": "Peter Bengtsson",
          "description": "GitHub Docs recently changed its site-search to Elasticsearch. Here’s how it was implemented.",
          "link": "https://github.blog/2023-03-09-how-github-docs-new-search-works/",
          "publishedOn": "2023-03-09T16:00:47.000Z",
          "wordCount": 2823,
          "title": "How GitHub Docs’ new search works"
        },
        {
          "id": "https://github.blog/?p=70408",
          "author": "Walker Chabbott",
          "description": "Multi-repository variant analysis lets you scale security research across thousands of repositories, giving you a powerful tool to find and respond to newly discovered vulnerabilities.",
          "link": "https://github.blog/2023-03-09-multi-repository-variant-analysis-a-powerful-new-way-to-perform-security-research-across-github/",
          "publishedOn": "2023-03-09T15:00:27.000Z",
          "wordCount": 1475,
          "title": "Multi-repository variant analysis: a powerful new way to perform security research across GitHub"
        },
        {
          "id": "https://github.blog/?p=70612",
          "author": "Jose Palafox",
          "description": "Learn how teams can leverage the power of GitHub Advanced Security’s code scanning and GitHub Actions to integrate the right security testing tools at the right time.",
          "link": "https://github.blog/2023-03-08-application-security-orchestration-with-github-advanced-security/",
          "publishedOn": "2023-03-08T20:36:34.000Z",
          "wordCount": 2203,
          "title": "Application security orchestration with GitHub Advanced Security"
        },
        {
          "id": "https://github.blog/?p=70587",
          "author": "Jeimy Ruiz",
          "description": "Join us virtually on March 28-31 for GitHub Galaxy, a global enterprise event focused on improving efficiency, security, and developer productivity.",
          "link": "https://github.blog/2023-03-08-github-galaxy-2023-your-guide-to-building-a-more-flexible-and-productive-software-development-cycle/",
          "publishedOn": "2023-03-08T16:36:21.000Z",
          "wordCount": 1203,
          "title": "GitHub Galaxy 2023: your guide to building a more flexible and productive software development cycle"
        },
        {
          "id": "https://github.blog/?p=70573",
          "author": "David Jarzebowski",
          "description": "With updates to GitHub Actions, repositories, and GitHub Advanced Security, this new version of GitHub Enterprise Server is focused on bringing the best developer experience to companies.",
          "link": "https://github.blog/2023-03-07-github-enterprise-server-3-8-is-now-generally-available/",
          "publishedOn": "2023-03-07T22:51:24.000Z",
          "wordCount": 1428,
          "title": "GitHub Enterprise Server 3.8 is now generally available"
        },
        {
          "id": "https://github.blog/?p=70552",
          "author": "Alfredo Cerezo Luna",
          "description": "Commit an update to a pull request, or start a new branch to squash a bug at any time, wherever you are using the GitHub Mobile apps.",
          "link": "https://github.blog/2023-03-07-file-editing-on-github-mobile-keeps-leveling-up/",
          "publishedOn": "2023-03-07T16:00:38.000Z",
          "wordCount": 956,
          "title": "File editing on GitHub Mobile keeps leveling up"
        },
        {
          "id": "https://github.blog/?p=70452",
          "author": "Arkodyuti Saha",
          "description": "Empowering the next generation of students in tech with real-world industry experience.",
          "link": "https://github.blog/2023-03-06-unleash-your-potential-with-github-octernships-a-path-to-a-thriving-tech-career/",
          "publishedOn": "2023-03-07T04:30:31.000Z",
          "wordCount": 841,
          "title": "Unleash your potential with GitHub Octernships: a path to a thriving tech career"
        },
        {
          "id": "https://github.blog/?p=70517",
          "author": "Kedasha Kerr",
          "description": "GitHub Codespaces enables you to start coding faster when coupled with dev containers. Learn how to automate a portion of your development environment by adding a dev container to an open source project using GitHub Codespaces.",
          "link": "https://github.blog/2023-03-06-how-to-automate-your-dev-environment-with-dev-containers-and-github-codespaces/",
          "publishedOn": "2023-03-06T17:27:47.000Z",
          "wordCount": 1799,
          "title": "How to automate your dev environment with dev containers and GitHub Codespaces"
        },
        {
          "id": "https://github.blog/?p=70478",
          "author": "Michelle Mannering",
          "description": "Our community—along with ourselves—took a much needed break over the festive season. Now everyone is back into the full swing of work, and the open source community is showing us it’s all hands on deck. We had dozens of submissions for the February Release Radar—a testament to the amount of code being shipped by the […]",
          "link": "https://github.blog/2023-03-05-release-radar-feb-2023/",
          "publishedOn": "2023-03-05T23:50:43.000Z",
          "wordCount": 1711,
          "title": "Release Radar · February 2023 Edition"
        },
        {
          "id": "https://github.blog/?p=70457",
          "author": "Alvaro Munoz",
          "description": "The GitHub Security Lab audited DataHub, an open source metadata platform, and discovered several vulnerabilities in the platform's authentication and authorization modules. These vulnerabilities could have enabled an attacker to bypass authentication and gain access to sensitive data stored on the platform.",
          "link": "https://github.blog/2023-03-03-github-security-lab-audited-datahub-heres-what-they-found/",
          "publishedOn": "2023-03-03T19:53:01.000Z",
          "wordCount": 5507,
          "title": "GitHub Security Lab audited DataHub: Here’s what they found"
        },
        {
          "id": "https://github.blog/?p=70493",
          "author": "Rebecca Hovemeyer",
          "description": "GitHub Desktop helps you feel confident in your Git and GitHub workflows.",
          "link": "https://github.blog/2023-03-03-github-desktop-3-2-preview-your-pull-request/",
          "publishedOn": "2023-03-03T18:59:24.000Z",
          "wordCount": 981,
          "title": "GitHub Desktop 3.2: Preview your pull request"
        },
        {
          "id": "https://github.blog/?p=70426",
          "author": "Lee Reilly",
          "description": "SCALE is the largest community-run open-source and free software conference in North America. It takes place next week in Pasadena, CA from March 9-12, 2023 and we’ll be there!",
          "link": "https://github.blog/2023-03-03-see-you-at-scale/",
          "publishedOn": "2023-03-03T11:30:26.000Z",
          "wordCount": 1053,
          "title": "See you at SCALE! 🐧"
        },
        {
          "id": "https://github.blog/?p=70321",
          "author": "Rizel Scarlett",
          "description": "A deep dive into why more people are using Python than ever, its key use cases, and why it’s still so popular 30-plus years after it was first released.",
          "link": "https://github.blog/2023-03-02-why-python-keeps-growing-explained/",
          "publishedOn": "2023-03-02T19:11:10.000Z",
          "wordCount": 2245,
          "title": "Why Python keeps growing, explained"
        },
        {
          "id": "https://github.blog/?p=70391",
          "author": "Jakub Oleksy",
          "description": "In February, we experienced three incidents that resulted in degraded performance across GitHub services. This report also sheds light into a January incident that resulted in degraded performance for GitHub Packages and GitHub Pages and another January incident that impacted Git users.",
          "link": "https://github.blog/2023-03-01-github-availability-report-february-2023/",
          "publishedOn": "2023-03-01T21:35:48.000Z",
          "wordCount": 1163,
          "title": "GitHub Availability Report: February 2023"
        },
        {
          "id": "https://github.blog/?p=70330",
          "author": "Dawit Gebregziabher",
          "description": "We’re excited to announce the general availability of GitHub Actions Importer. GitHub Actions Importer helps you plan, forecast, and automate migrations from Azure DevOps, CircleCI, GitLab, Jenkins, and Travis CI to GitHub Actions. This product is an extension of the official GitHub CLI and is available for free to any GitHub user starting today. Migrating […]",
          "link": "https://github.blog/2023-03-01-github-actions-importer-is-now-generally-available/",
          "publishedOn": "2023-03-01T17:00:18.000Z",
          "wordCount": 905,
          "title": "GitHub Actions Importer is now generally available"
        },
        {
          "id": "https://github.blog/?p=70364",
          "author": "Stephen Glass",
          "description": "Speed up your GitHub Actions jobs on macOS with all new, faster GitHub-hosted macOS runners for x64.",
          "link": "https://github.blog/2023-03-01-github-actions-introducing-faster-github-hosted-x64-macos-runners/",
          "publishedOn": "2023-03-01T16:00:04.000Z",
          "wordCount": 839,
          "title": "GitHub Actions: Introducing faster GitHub-hosted x64 macOS runners"
        },
        {
          "id": "https://github.blog/?p=70349",
          "author": "Mark Paulsen",
          "description": "Explore how using GitHub and HashiCorp together enables enterprises to develop and ship to their customers faster and more secure with consistent workflows and actions.",
          "link": "https://github.blog/2023-02-28-how-to-build-a-consistent-workflow-for-development-and-operations-teams/",
          "publishedOn": "2023-02-28T19:00:19.000Z",
          "wordCount": 2628,
          "title": "How to build a consistent workflow for development and operations teams"
        },
        {
          "id": "https://github.blog/?p=70332",
          "author": "Rizel Scarlett",
          "description": "Unlock the full potential of GitHub Codespaces with these 10 tips and tricks! From generating AI images to running self-guided coding workshops, discover how to optimize your software development workflow with this powerful tool.",
          "link": "https://github.blog/2023-02-28-10-things-you-didnt-know-you-could-do-with-github-codespaces/",
          "publishedOn": "2023-02-28T18:00:50.000Z",
          "wordCount": 2403,
          "title": "10 things you didn’t know you could do with GitHub Codespaces"
        },
        {
          "id": "https://github.blog/?p=70324",
          "author": "Zain Malik",
          "description": "Secret scanning alerts are now generally available for all public repositories. Admins can now turn on the alert experience with one click.",
          "link": "https://github.blog/2023-02-28-secret-scanning-alerts-are-now-available-and-free-for-all-public-repositories/",
          "publishedOn": "2023-02-28T17:00:16.000Z",
          "wordCount": 921,
          "title": "Secret scanning alerts are now available (and free) for all public repositories"
        },
        {
          "id": "https://github.blog/?p=70311",
          "author": "Mark Paulsen",
          "description": "Learn how to enable developer productivity and collaboration while staying secure and compliant. Stay compliant without slowing down your business. From security to CI/CD, automate every step of your software workflow—so your developers can stay focused on what matters most: building.",
          "link": "https://github.blog/2023-02-24-3-ways-to-meet-compliance-needs-without-slowing-down-agility/",
          "publishedOn": "2023-02-24T19:00:37.000Z",
          "wordCount": 3060,
          "title": "3 ways to meet compliance needs without slowing down agility"
        },
        {
          "id": "https://github.blog/?p=70275",
          "author": "Mike Linksvayer",
          "description": "Policymakers around the world are developing policies that impact how software gets built and who gets to build it, see the latest now.",
          "link": "https://github.blog/2023-02-23-measuring-government-policy-on-open-source-with-a-new-dataset/",
          "publishedOn": "2023-02-23T21:25:07.000Z",
          "wordCount": 1006,
          "title": "Measuring government policy on open source with a new dataset"
        },
        {
          "id": "https://github.blog/?p=70183",
          "author": "Man Yue Mo",
          "description": "CVE-2022-25664, a vulnerability in the Qualcomm Adreno GPU, can be used to leak large amounts of information to a malicious Android application. Learn more about how the vulnerability can be used to leak information in both the user space and kernel space level of pages, and how the GitHub Security Lab used the kernel space information leak to construct a KASLR bypass.",
          "link": "https://github.blog/2023-02-23-the-code-that-wasnt-there-reading-memory-on-an-android-device-by-accident/",
          "publishedOn": "2023-02-23T17:00:00.000Z",
          "wordCount": 5566,
          "title": "The code that wasn’t there: Reading memory on an Android device by accident"
        },
        {
          "id": "https://github.blog/?p=70222",
          "author": "Rizel Scarlett",
          "description": "When you’re new to coding, it’s easy to get stuck completing endless tutorials. You can apply what you’ve learned (and learn even more) through GitHub Codespaces. The best part is you don’t need a powerful computer to get started.",
          "link": "https://github.blog/2023-02-22-a-beginners-guide-to-learning-to-code-with-github-codespaces/",
          "publishedOn": "2023-02-22T23:30:17.000Z",
          "wordCount": 1645,
          "title": "A beginner’s guide to learning to code with GitHub Codespaces"
        },
        {
          "id": "https://github.blog/?p=70208",
          "author": "Colin Dembovsky",
          "description": "GitHub Copilot boosts developer productivity, but using it responsibly still requires good developer and DevSecOps practices.",
          "link": "https://github.blog/2023-02-22-responsible-ai-pair-programming-with-github-copilot/",
          "publishedOn": "2023-02-22T16:24:13.000Z",
          "wordCount": 1813,
          "title": "Responsible AI pair programming with GitHub Copilot"
        },
        {
          "id": "https://github.blog/?p=70195",
          "author": "Matt Cooper",
          "description": "A look at what happened on January 30, what measures we’re putting in place to prevent surprises, and how we’ll handle future changes.",
          "link": "https://github.blog/2023-02-21-update-on-the-future-stability-of-source-code-archives-and-hashes/",
          "publishedOn": "2023-02-21T17:00:45.000Z",
          "wordCount": 1223,
          "title": "Update on the future stability of source code archives and hashes"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=20508",
          "author": "BU Team",
          "description": "A look into the Nu's BrandBook Tool—the interactive platform of Nubank global brand guidelines, built for a new moment of brand maturity.\nThe post A Nu way of guidance: Meet the Nu Brand System appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-brand-system/",
          "publishedOn": "2023-03-17T15:11:51.000Z",
          "wordCount": 4155,
          "title": "A Nu way of guidance: Meet the Nu Brand System"
        },
        {
          "id": "https://building.nubank.com.br/?p=20486",
          "author": "BU Team",
          "description": "Here are some of the lessons we learned along the way.\nThe post How we have been running a Data Science Journal Club at Nubank since 2019 appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-science-journal-club/",
          "publishedOn": "2023-03-16T22:51:56.000Z",
          "wordCount": 4887,
          "title": "How we have been running a Data Science Journal Club at Nubank since 2019"
        },
        {
          "id": "https://building.nubank.com.br/?p=20442",
          "author": "Nubank Editorial",
          "description": "This information is from a survey conducted by the Data Hackers community, in partnership with the American consulting firm Bain & Company.\nThe post Nubank is ranked the best company to work with Data in Latin America appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/best-company-to-work-with-data/",
          "publishedOn": "2023-03-08T17:48:50.000Z",
          "wordCount": 2890,
          "title": "Nubank is ranked the best company to work with Data in Latin America"
        },
        {
          "id": "https://building.nubank.com.br/?p=20417",
          "author": "Nubank Editorial",
          "description": "Clojure is the core programming language of Nubank's digital solutions, and we celebrate its anniversary with an exclusive webseries interviewing its creators. Check it out. \nThe post Clojure turns 15: Nubank’s webseries explores the origins and future of this programming language appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/clojure-15-nubanks-special-webseries/",
          "publishedOn": "2023-03-07T13:48:44.000Z",
          "wordCount": 2932,
          "title": "Clojure turns 15: Nubank’s webseries explores the origins and future of this programming language"
        },
        {
          "id": "https://building.nubank.com.br/?p=20413",
          "author": "Iain Kennedy, Senior Director and Product Chapter Lead at Nu",
          "description": "A quick guide to the principles for product innovation in tough times\nThe post Building products customers love at Nubank appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/building-products-at-nubank/",
          "publishedOn": "2023-03-03T19:59:34.000Z",
          "wordCount": 3634,
          "title": "Building products customers love at Nubank"
        },
        {
          "id": "https://building.nubank.com.br/?p=20372",
          "author": "Nanda Lopes",
          "description": "How we brought our product team closer to our customers to start the relationship we want to have with them.\nThe post A new look at personas: how UX combined with Data can help in the product funnel appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/a-new-look-at-personas/",
          "publishedOn": "2023-02-24T22:52:04.000Z",
          "wordCount": 4349,
          "title": "A new look at personas: how UX combined with Data can help in the product funnel"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/hackers-secure-wildly-popular-video-game-h1-407",
          "author": "jesse@hackerone.com",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/hackers-secure-wildly-popular-video-game-h1-407",
          "publishedOn": "2023-03-17T15:06:04.000Z",
          "wordCount": 622,
          "title": "Hackers Secure Wildly Popular Video Game at H1-407"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/level-your-bug-bounty-effectiveness-part-ii-operational-areas-continuously",
          "author": "Will Kapcio",
          "description": "",
          "link": "https://www.hackerone.com/vulnerability-management/level-your-bug-bounty-effectiveness-part-ii-operational-areas-continuously",
          "publishedOn": "2023-03-14T16:00:00.000Z",
          "wordCount": 1623,
          "title": "Level Up Your Bug Bounty Effectiveness, Part II: Operational Areas to Continuously Improve"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/welcome-hackerone-ambassador-world-cup-2023",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/welcome-hackerone-ambassador-world-cup-2023",
          "publishedOn": "2023-03-14T15:31:51.000Z",
          "wordCount": 1026,
          "title": "Welcome to the HackerOne Ambassador World Cup 2023!"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-samux",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-samux",
          "publishedOn": "2023-03-09T05:44:21.000Z",
          "wordCount": 1430,
          "title": "Ambassador Spotlight: samux"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/get-invited-how-live-hacking-event-invites-have-changed",
          "author": "jesse@hackerone.com",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/get-invited-how-live-hacking-event-invites-have-changed",
          "publishedOn": "2023-02-28T17:48:35.000Z",
          "wordCount": 1870,
          "title": "Get Invited: How Live Hacking Event Invites Have Changed"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hackerone-was-proud-sponsor-bug-hunt",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/hackerone-was-proud-sponsor-bug-hunt",
          "publishedOn": "2023-02-24T20:55:20.000Z",
          "wordCount": 1054,
          "title": "HackerOne was Proud to Sponsor Bug Hunt!"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/level-your-bug-bounty-effectiveness-3-keys-launch-successful-program",
          "author": "Will Kapcio",
          "description": "",
          "link": "https://www.hackerone.com/vulnerability-management/level-your-bug-bounty-effectiveness-3-keys-launch-successful-program",
          "publishedOn": "2023-02-23T17:00:00.000Z",
          "wordCount": 1570,
          "title": "Level Up Your Bug Bounty Effectiveness: 3 Keys to Launch a Successful Program"
        },
        {
          "id": "https://hackerone.com/ethical-hacker/what-does-belgiums-new-legal-framework-hacking-mean-me",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/ethical-hacker/what-does-belgiums-new-legal-framework-hacking-mean-me",
          "publishedOn": "2023-02-23T14:00:00.000Z",
          "wordCount": 1228,
          "title": "What Does Belgium’s New Legal Framework On Hacking Mean For Me?"
        },
        {
          "id": "https://hackerone.com/customer-stories/robinhood-goes-long-bug-bounty-qa-ian-carroll-and-ashwarya",
          "author": "Kyle Tansley",
          "description": "Seven years of bug bounty, 21-hour average time to bounty, 130 hackers thanked, and hackers on both sides of the program: Robinhood’s Ian Carroll joins HackerOne to discuss his hacker-focused approach to bug bounty, and Robinhood’s top hacker @ashwarya chimes in with his experience.",
          "link": "https://www.hackerone.com/customer-stories/robinhood-goes-long-bug-bounty-qa-ian-carroll-and-ashwarya",
          "publishedOn": "2023-02-22T20:00:00.000Z",
          "wordCount": 2602,
          "title": "Robinhood Goes Long on Bug Bounty: Q&A with Ian Carroll and @ashwarya"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/9bef9962dcb7",
          "author": "Netflix Technology Blog",
          "description": "The media understanding platform serves as an abstraction layer between Machine Learning (ML) algos and various applications.",
          "link": "https://netflixtechblog.com/building-a-media-understanding-platform-for-ml-innovations-9bef9962dcb7?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-03-14T15:48:28.000Z",
          "wordCount": 2808,
          "title": "Building a Media Understanding Platform for ML Innovations"
        },
        {
          "id": "https://medium.com/p/99332231e541",
          "author": "Netflix Technology Blog",
          "description": "By Burak Bacioglu, Meenakshi Jindal",
          "link": "https://netflixtechblog.com/elasticsearch-indexing-strategy-in-asset-management-platform-amp-99332231e541?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-03-10T22:59:11.000Z",
          "wordCount": 2318,
          "title": "Elasticsearch Indexing Strategy in Asset Management Platform (AMP)"
        },
        {
          "id": "https://medium.com/p/46fe225c35c9",
          "author": "Netflix Technology Blog",
          "description": "By Meenakshi Jindal",
          "link": "https://netflixtechblog.com/data-reprocessing-pipeline-in-asset-management-platform-netflix-46fe225c35c9?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-03-10T22:58:47.000Z",
          "wordCount": 1703,
          "title": "Data Reprocessing Pipeline in Asset Management Platform @Netflix"
        },
        {
          "id": "https://medium.com/p/43139ae05382",
          "author": "Netflix Technology Blog",
          "description": "By Benson Ma, ZZ Zimmerman\nWith contributions from Alok Ahuja, Shravan Heroor, Michael Krasnow, Todor Minchev, Inder Singh",
          "link": "https://netflixtechblog.com/nts-reliable-device-testing-at-scale-43139ae05382?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-03-09T17:38:02.000Z",
          "wordCount": 7277,
          "title": "NTS: Reliable Device Testing at Scale"
        },
        {
          "id": "https://medium.com/p/3c5c638740a8",
          "author": "Netflix Technology Blog",
          "description": "by Varun Sekhri, Meenakshi Jindal, Burak Bacioglu",
          "link": "https://netflixtechblog.com/data-ingestion-pipeline-with-operation-management-3c5c638740a8?source=rss----2615bd06b42e---4",
          "publishedOn": "2023-03-07T20:39:08.000Z",
          "wordCount": 1453,
          "title": "Data ingestion pipeline with Operation Management"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}