{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/01/reducing-security-risks-in-open-source.html",
          "author": null,
          "description": "Posted by Laurent Simon and Azeem Shaikh, Google Open Source Security Team (GOSST) \n\n\n\nSince our July announcement of Scorecards V2, the Scorecards project—an automated security tool to flag risky supply chain practices in open source projects—has grown steadily to over 40 unique contributors and 18 implemented security checks. Today we are proud to announce the V4 release of Scorecards, with larger scaling, a new security check, and a new Scorecards GitHub Action for easier security automation.\nThe Scorecards Action is released in partnership with GitHub and is available from GitHub's Marketplace. The Action makes using Scorecards easier than ever: it runs automatically on repository changes to alert developers about risky supply-chain practices. Maintainers can view the alerts on GitHub's code scanning dashboard, which is available for free to public repositories on GitHub.com and via GitHub Advanced Security for private repositories. \nAdditionally, we have scaled our weekly Scorecards scans to over one million GitHub repositories, and have partnered with the Open Source Insights website for easy user access to the data. \nFor more details about the release, including the new Dangerous-Workflow security check, visit the OpenSSF's official blog post here.",
          "link": "http://security.googleblog.com/2022/01/reducing-security-risks-in-open-source.html",
          "publishedOn": "2022-01-19T15:00:00.014Z",
          "wordCount": 580,
          "title": "Reducing Security Risks in Open Source Software at Scale: Scorecards Launches V4"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/1/1550",
          "author": null,
          "description": "This week Paul Copplestone, CEO of Supabase joined us to catch us up on the next big thing happening in the world of Postgres. Supabase might be best known as “the open source Firebase alternative,” a tagline they might be reluctant to maintain. But from Adam’s perspective, he’s never been more excited about what they’re bringing to market for Postgres fans. In the last year, Supabase has gone from 0 to more than 80,000 databases on their platform — and they’re still in beta…and it’s open source. Hopefully today’s show sheds some light on why everyone is talking about Supabase.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From…",
          "link": "https://changelog.com/podcast/476",
          "publishedOn": "2022-01-25T03:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 476: Supabase is all in on Postgres",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/476/the-changelog-476.mp3",
            "length": "72972200",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/6O6d",
          "author": "Jerod Santo",
          "description": "Wesley Aptekar-Cassels has been using NixOS on his main laptop for ~3 years and he’s ready to talk about it:\nI don’t think that NixOS is the future, but I do absolutely think that the ideas in it are, so I want to write about what I think it gets right and what it gets wrong, in the hopes that other projects can take note. As such, this post will not assume knowledge of NixOS — if you’ve used NixOS significantly, there probably isn’t anything new in here for you.\nDiscuss on Changelog News",
          "link": "https://blog.wesleyac.com/posts/the-curse-of-nixos",
          "publishedOn": "2022-01-24T19:15:00.000Z",
          "wordCount": null,
          "title": "The curse of NixOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03EQ",
          "author": "Jerod Santo",
          "description": "This is just one of Charm’s various open source CLI projects.\n\nDiscuss on Changelog News",
          "link": "https://github.com/charmbracelet/soft-serve",
          "publishedOn": "2022-01-24T16:35:00.000Z",
          "wordCount": null,
          "title": "Soft Serve – a tasty, self-hostable git server for the command line🍦",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lbPY",
          "author": "Jerod Santo",
          "description": "This repo links to dozens of courses for each of 23 categories of computing. It’s just an astounding amount of freely accessible education.\nDiscuss on Changelog News",
          "link": "https://github.com/Developer-Y/cs-video-courses",
          "publishedOn": "2022-01-24T15:49:00.000Z",
          "wordCount": null,
          "title": "A list of CS courses with video lectures 📽",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pknV",
          "author": "Jerod Santo",
          "description": "It’s not very often that I get Windows FOMO, but DevToys is doing it for me. It provides a sweet GUI for 14 tools including a JSON/Yaml converter, a JWT decoder, a text comparer, and a hash generator.\n\nDiscuss on Changelog News",
          "link": "https://devtoys.app/",
          "publishedOn": "2022-01-24T14:27:00.000Z",
          "wordCount": null,
          "title": "DevToys – an offline Swiss Army knife for developers",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1506",
          "author": null,
          "description": "Cloudflare has a lot more to offer than merely DDoS protection and CDN services. On this episode, Jon Kuperman joins Amal & Jerod to talk through many of their cool new things like Workers, KV, Durable Objects, and R2 Storage. Thanks to listener Matt Mannucci for requesting this episode!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nJon Kuperman – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nWorkers\nWorkers Chat Demo\nArgo Smart Routing\nR2 announcement\nDurable Objects\nKV",
          "link": "https://changelog.com/jsparty/209",
          "publishedOn": "2022-01-21T17:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 209: What Cloudflare is up to",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/209/js-party-209.mp3",
            "length": "64169717",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Z3De",
          "author": "Jerod Santo",
          "description": "If you landed here hoping this project isn’t serious… fear not. It’s just for fun, but it really works!\nHave you ever thought to yourself: Why don’t we have an immersive 3D sandbox user interface to manage workloads on my favorite container orchestrator? No? Well here it is anyway.\nPigs are pods. Cows are ReplicaSets. Chickens are services. You get the drift.\n\nDiscuss on Changelog News",
          "link": "https://github.com/erjadi/kubecraftadmin",
          "publishedOn": "2022-01-21T15:54:00.000Z",
          "wordCount": null,
          "title": "Minecraft as a k8s admin tool",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJmm",
          "author": "Jerod Santo",
          "description": "Jesse O’Brien from Test Double wants us to stop using the term “Tech Debt”\nThere’s loads of reasons why unmaintainable code ends up running in the systems our products are built on, but none of these fit the definition of debt.\nInstead, I propose we drop the term Tech Debt and start talking about maintenance tasks. Maintenance is what we’re really talking about. When parts on our car or bicycle suffers wear from driving them around, we don’t talk to our mechanic about “mechanical debt”. (Go back and re-read that sentence, but replace things with “software” and “programmers”). We talk about maintenance.\nThis post starts as mostly a semantic debate, and I’m not convinced by his arguments there. I think the debt metaphor is useful when you’re talking about trading quality for speed. That’s what you do when you take on debt: you trade higher cost at a future date (principle + interest) to gain access to the money today (speed).\nThat being said, I really like where Jesse ends this piece talking about software maintenance and methods of going about it. Lots of actionable advice there and I’m 100% onboard with talking about software maintenance early and often. One of the first things I consider when somebody approaches me with a feature idea is ask myself: what will this cost to maintain?\nDiscuss on Changelog News",
          "link": "https://blog.testdouble.com/posts/2022-01-20-stop-paying-debts-start-maintaining-code/",
          "publishedOn": "2022-01-21T15:08:00.000Z",
          "wordCount": null,
          "title": "Stop paying tech debts, start maintaining code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykPR",
          "author": "Jerod Santo",
          "description": "Andrew Kutz:\nAfter spending some time playing with them, I began to appreciate how generics in Go have been designed and implemented with the same elegance and simplicity as Go itself. I hope you will agree, and to that end, this repository is a hands-on approach to learning all about generics in Go.\nDiscuss on Changelog News",
          "link": "https://github.com/akutz/go-generics-the-hard-way",
          "publishedOn": "2022-01-21T14:18:00.000Z",
          "wordCount": null,
          "title": "A hands-on approach to getting started with Go generics",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1523",
          "author": null,
          "description": "Gerhard loves simple ideas executed well, which is why he is excited to be speaking today with Ildar Iskhakov & Matvey Kukuy about their startup Amixr, a.k.a. Grafana OnCall.\nIldar & Matvey started with a simple idea and a simple stack - Django, Celery, RabbitMQ & MySQL - all running on Kubernetes. Because they kept their main thing their main thing, and kept improving it every day for a couple of years, now your on-call can be simple too.\nThis is another Big Tent philosophy story with a Black Swan moment towards the end.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMongoDB – An integrated suite of cloud database and services — They have a FREE forever tier, so you can prove to yourself and to your team that t…",
          "link": "https://changelog.com/shipit/36",
          "publishedOn": "2022-01-20T22:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 36: Keep on-call simple",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/36/ship-it-36.mp3",
            "length": "55905687",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Q5lM",
          "author": "Jerod Santo",
          "description": "Eleventy creator, Zach Leatherman:\nThis project would not be possible without our lovely community. Thank you to everyone that built something with Eleventy (×476 authors on our web site!), wrote a blog post about Eleventy, contributed code to core or plugins, documentation, asked questions, answered questions, braved The Leaderboards, participated on Discord, filed issues, attended (or organized!) a meetup, said a kind word on Twitter ❤️.\nCongrats to Zach and the entire Eleventy community on the big 1.0! 🎉\nDiscuss on Changelog News",
          "link": "https://www.zachleat.com/web/eleventy-one-point-oh/",
          "publishedOn": "2022-01-20T17:52:00.000Z",
          "wordCount": null,
          "title": "Eleventy v1.0.0, the stable release",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1399",
          "author": null,
          "description": "Alexey Palazhchenko joins Natalie to discuss the implications of GitHub’s Copilot on code generation. Go’s design lends itself nicely to computer generated authoring: thanks to go fmt, there’s already only one Go style. This means AI-generated code will be consistent and seamless. Its focus on simplicity & readability make it tailor made for this new approach to software creation. Where might this take us?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGitLab – The DevOps platform that empowers organizations to maximize the overall return on software development by delivering software faster, more efficiently, while strengthening security and compliance. Identify and address blockers immediately, focus on delivering value — not maintaining integrations, automate security and compliance. Get started with their free tier (no credit card required). Learn more at about.gitlab.com/solutions/devops-platform\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nAlexey Palazhchenko – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nFerretDB\nOpenAI Codex\nGitHub Copilot",
          "link": "https://changelog.com/gotime/213",
          "publishedOn": "2022-01-20T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 213: AI-driven development in Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/213/go-time-213.mp3",
            "length": "48030812",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8Ow8",
          "author": "Jerod Santo",
          "description": "Imagine this: you’ve been paged to investigate a production incident, and after some digging, you identify the commit with the breaking code. You decide to revert the change:\ngit revert 1a2b3c\nUnfortunately, in doing so, a new bug is introduced! As it turns out, hidden in that old “broken” commit was some code that another part of the app depended upon, and when you reverted those lines, it left the site once again in a broken state. 🙃 Oh dear.\nHow can situations like this be avoided? To answer this question, we first need to examine how these types of commits come to be.\nIf you’ve never heard of or used git reset… this article is a must-read.\nDiscuss on Changelog News",
          "link": "https://render.com/blog/git-organized-a-better-git-flow",
          "publishedOn": "2022-01-20T14:41:00.000Z",
          "wordCount": null,
          "title": "Git organized: a better git flow",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlPy",
          "author": "Jerod Santo",
          "description": "Arnold Galovics’ follow-up to his excellent monoliths are your friend post from late last year.\nStarting a greenfield project with microservices is easy. The promises are wonderful but often they are far from reality. This time I’ll share my experience on the truth about microservices when starting a project from scratch.\nDiscuss on Changelog News",
          "link": "https://arnoldgalovics.com/truth-about-microservices/",
          "publishedOn": "2022-01-19T19:54:00.000Z",
          "wordCount": null,
          "title": "The truth about starting with microservices",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9Oma",
          "author": "Jerod Santo",
          "description": "Jakob Greenfeld:\nI recently discovered a simple step-by-step process that significantly increased my personal productivity and made me happier along the way.\nIt costs $0 and no, it’s not some note-taking or to-do list system.\nThe steps are:\ndevelop meta-awareness of your state of mind.\npattern-match to identify your mind’s most common modes.\nlearn to pick activities that match each mode.\nBut that probably won’t hit home until you read through his explanation of each step.\nDiscuss on Changelog News",
          "link": "https://jakobgreenfeld.com/personal-productivity",
          "publishedOn": "2022-01-19T16:19:00.000Z",
          "wordCount": null,
          "title": "Effortless personal productivity (or how I learned to love my monkey mind)",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1560",
          "author": null,
          "description": "You might know about MLPerf, a benchmark from MLCommons that measures how fast systems can train models to a target quality metric. However, MLCommons is working on so much more! David Kanter joins us in this episode to discuss two new speech datasets that are democratizing machine learning for speech via data scale and language/speaker diversity.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nThe Brave Browser – Browse the web up to 8x faster than Chrome and Safari, block ads and trackers by default, and reward your favorite creators with the built-in Basic Attention Token. Download Brave for free and give tipping a try right here on changelog.com.\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nDavid Kanter – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nPress Release about MLCommons datasets: MLCommons™ Association Unveils Open Datasets and Tools to Drive Democratization of Machine Learning\nNeurIPS Papers:\n\nPeople’s Speech Dataset\nMultilingual Spoken Words Corpus (MSWC)\nGradient article: New Datasets to Democratize Speech Recognition Technology\nBlog posts for more insight:\n\nPeople’s Speech\nMultilingual Spoken Words Corpus (MSWC)\nDownloads:\n\nPeople’s Speech\nMultilingual Spoken Words Corpus",
          "link": "https://changelog.com/practicalai/164",
          "publishedOn": "2022-01-19T15:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 164: Democratizing ML for speech",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/164/practical-ai-164.mp3",
            "length": "43280267",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1544",
          "author": null,
          "description": "This week Matt Ahrens joins Adam to talk about ZFS. Matt co-founded the ZFS project at Sun Microsystems in 2001. And 20 years later Adam picked up ZFS for use in his home lab and loved it. So, he reached out to Matt and invited him on the show. They cover the origins of the file system, its journey from proprietary to open source, architecture choices like copy-on-write, the ins and outs creating and managing ZFS, RAID-Z and RAID-Z expansion, and Matt even shares plans for ZFS in the cloud with ZFS object store.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s bu…",
          "link": "https://changelog.com/podcast/475",
          "publishedOn": "2022-01-18T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 475: Making the ZFS file system",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/475/the-changelog-475.mp3",
            "length": "87137250",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eZPO",
          "author": "Jerod Santo",
          "description": "This is an excellent explanation of the difference between these styles of programming and why declarative is all the rage these days.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=E7Fbf7R3x6I",
          "publishedOn": "2022-01-18T20:15:00.000Z",
          "wordCount": null,
          "title": "Imperative vs declarative programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RR50",
          "author": "Jerod Santo",
          "description": "This post by Shayon Mukherjee is in response to the recently logged post by Mike Coutermarsh in praise of MySQL for infra folks:\nThis is not a MySQL vs PostgreSQL post. This is just a small summary of what I have come to appreciate about PostgreSQL as an Infrastructure Engineer.\nAlways good to keep in mind whenever comparing technologies: trade-offs abound and certain people in certain situations will value certain things about different technologies differently. That’s for certain. 😉\nDiscuss on Changelog News",
          "link": "https://www.shayon.dev/post/2022/17/why-i-enjoy-postgresql-infrastructure-engineers-perspective/",
          "publishedOn": "2022-01-18T19:19:00.000Z",
          "wordCount": null,
          "title": "Why I enjoy PostgreSQL (an infra engineer's perspective)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2P2",
          "author": "Martin Heinz",
          "description": "If you’re using GitHub as your version control system of choice then GitHub Apps can be incredibly useful for many tasks including building CI/CD, managing repositories, querying statistical data and much more. In this article we will walk through the process of building such an app in Go including setting up the GitHub integration, authenticating with GitHub, listening to webhooks, querying GitHub API and more.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/65",
          "publishedOn": "2022-01-18T16:26:00.000Z",
          "wordCount": null,
          "title": "Building GitHub Apps with Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73dp",
          "author": "Adam Stacoviak",
          "description": "From Mike Coutermarsh:\nFor years I’ve been noticing this pattern of infrastructure engineers I really respect preferring MySQL and product engineers preferring Postgres. It took quite a while for me to understand it. Especially coming from my background as a product engineer. Infrastructure engineers generally…\nRead on to hear why (from Mike’s perspective).\nDiscuss on Changelog News",
          "link": "https://mikecoutermarsh.com/why-infrastructure-engineers-prefer-mysql/",
          "publishedOn": "2022-01-18T15:40:43.000Z",
          "wordCount": null,
          "title": "Why infrastructure engineers prefer MySQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2pE",
          "author": "Jerod Santo",
          "description": "Daniel Stenberg lays out how he thinks we can view the world of software and open source in light of supply chain security, maintainer sustainability, and the like:\nInside the pyramid there is a hierarchy where things using software are build on top of others, in layers. The higher up you go, the more you stand on the shoulders of open source components below you.\nAt the very bottom of the pyramid are the foundational components. Operating systems and libraries. The stuff virtually everything runs or depends upon. The components you really don’t want to have serious security vulnerabilities.\n\nDiscuss on Changelog News",
          "link": "https://daniel.haxx.se/blog/2022/01/17/enforcing-the-pyramid-of-open-source/",
          "publishedOn": "2022-01-17T21:20:00.000Z",
          "wordCount": null,
          "title": "Enforcing the pyramid of open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13jw",
          "author": "Jerod Santo",
          "description": "Jim Hall used grep and some fancy regular expressions to get a leg up on Wordle, the word game that keeps you guessing… but only once per day. Some people may think of Jim’s technique as cheating. I wouldn’t necessarily disagree.\nBut it’s a lot better than View Source-ing to get at the answer, which you can also do in a pinch. 😉\n(Also there’s zero point to Wordle other than having fun, so it’s really only cheating if your answer-finding-method is less fun than you’d have otherwise. Even then, you’re only cheating yourself.)\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/22/1/word-game-linux-command-line",
          "publishedOn": "2022-01-17T18:24:00.000Z",
          "wordCount": null,
          "title": "Solving Wordle with help from the Linux command line",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73X6",
          "author": "Jerod Santo",
          "description": "This is an excellent machine learning primer where you scroll the page and the author(s) walk you through the process of creating a model to distinguish homes in New York from homes in San Francisco.\nDiscuss on Changelog News",
          "link": "http://www.r2d3.us/visual-intro-to-machine-learning-part-1/",
          "publishedOn": "2022-01-17T15:57:00.000Z",
          "wordCount": null,
          "title": "A visual introduction to machine learning",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/DzJ1",
          "author": "Jerod Santo",
          "description": "Eight people have stepped up to take over maintenance of the suddenly abandoned JS library that generates fake data. These transitions are tricky to make smoothly. Props to the new team on being very careful and thoughtful each step along the way, especially when it comes to funding the project. Here’s a nice note from the new team:\nWe’re excited to give new life to this idea and project.\nThis project can have a fresh start and it will become even cooler.\nWe felt we needed to do a public announcement because of all of the attention the project received in the media and from the community.\nWe believe that we have acted in the way that is best for the community.\nDiscuss on Changelog News",
          "link": "https://fakerjs.dev/update.html",
          "publishedOn": "2022-01-17T15:11:00.000Z",
          "wordCount": null,
          "title": "Faker.js is now a community maintained project",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1533",
          "author": null,
          "description": "This week Adam is joined by Sam Lambert, CEO of PlanetScale. Now that PlanetScale is in general availability, Adam had to get Sam on the show to talk about the behind the scenes of building this database platform, how this is the last database you’ll ever need and what that means for developers, why serverless, its open source underpinnings with Vitess, and a preview of what’s to come.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days…",
          "link": "https://changelog.com/founderstalk/85",
          "publishedOn": "2022-01-14T20:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 85: Making the last database you’ll ever need",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/founderstalk/85/founders-talk-85.mp3",
            "length": "82788990",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lbeY",
          "author": "Jerod Santo",
          "description": "Funny how stuff like this plays out sometimes:\nMy cog tool has been having a resurgence of late: a number of people are discovering it’s useful to run a little bit of Python code inside otherwise static files.\nHe goes on to list out a bunch of tweets from people finding it useful for various tasks and even got to talk about the project on podcast.__init__. Cool tool, cool story.\nDiscuss on Changelog News",
          "link": "https://nedbatchelder.com/blog/202201/cog_resurgence.html",
          "publishedOn": "2022-01-14T18:19:00.000Z",
          "wordCount": null,
          "title": "Ned Batchelder's cog tool is an overnight success 17 years in the making",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1547",
          "author": null,
          "description": "Swyx is the known for learning in public, and he joins the party to teach Ali and Nick about what he’s been working on with Temporal IO, what it is, and why he’s excited about it. We also talk about his role as Director of Developer Experience, including what developer experience is, how to do it, and what goals to set.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/changelog\n\n    \nRaygun – Never…",
          "link": "https://changelog.com/jsparty/208",
          "publishedOn": "2022-01-14T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 208: Temporal is like React for the backend",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/208/js-party-208.mp3",
            "length": "55707311",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MdV2",
          "author": "Jerod Santo",
          "description": "This post covers 5 cases where the author uses the JSON data type for column definitions:\nDumping request data for later processing\nSupporting extra fields\nSome one-to-many relationships\nKey-value use cases\nSimpler EAV design\nCraig Kerstiens has also weighed in on this topic for us.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/01/08/when-to-use-json-data-type-in-database-schema-design/",
          "publishedOn": "2022-01-14T16:07:01.000Z",
          "wordCount": null,
          "title": "When to use JSON data type in database schema design?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQD3",
          "author": "Jerod Santo",
          "description": "Edit the font in your browser and download the result. Cool! Made possible by SVG and OpenType.js.\nDiscuss on Changelog News",
          "link": "https://brutalita.com/",
          "publishedOn": "2022-01-14T15:19:00.000Z",
          "wordCount": null,
          "title": "Brutalita is an experimental grid-based font & editor",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Lpy5",
          "author": "Jerod Santo",
          "description": "System76’s COSMIC desktop environment is still in early development, but here’s an early preview that might pique your interest. Love that launcher. 🤩\n\nDiscuss on Changelog News",
          "link": "https://blog.edfloreshz.dev/articles/linux/system76/rust-based-desktop-environment/",
          "publishedOn": "2022-01-14T14:25:00.000Z",
          "wordCount": null,
          "title": "Exploring System76's new Rust based desktop environment",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1521",
          "author": null,
          "description": "Today Gerhard shares the entire story behind his lost packets. He is talking with Drew Marshall, director at Trunk Networks and No One Internet, a Cloud Services Provider & ISP based in Sussex, UK.\nGerhard’s Vodafone ISP gateway was losing packets, and recording some of the previous episodes used to be challenging as his internet connection would cut out up to 10 seconds at a time, multiple times per recording session. He was convinced that his Unifi Dream Machine Pro was not the issue. Drew helped Gerhard realise that it actually was. Not only has Gerhard’s DNS latency improved by 3x, but he can now fail-over between two WAN connections. And because nothing beats a real-world experiment, you can guess what is coming in this episode 😉\nYou will find latency & packet loss graphs, speed test…",
          "link": "https://changelog.com/shipit/35",
          "publishedOn": "2022-01-14T12:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 35: How I found my lost network packets",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/35/ship-it-35.mp3",
            "length": "57604289",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/VJpm",
          "author": "Jerod Santo",
          "description": "It’s like having Alfred all up in your browser.\nManage tabs, bookmarks, your browser history, perform all sorts of actions with a simple command interface.\n\nDiscuss on Changelog News",
          "link": "https://github.com/alyssaxuu/omni",
          "publishedOn": "2022-01-13T18:17:00.000Z",
          "wordCount": null,
          "title": "Omni helps you use Chrome like a pro",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1530",
          "author": null,
          "description": "Our final installment from GopherCon 2021 is an awesome panel conversation led by Natalie & Angelica with guests Linus Lee, Daniela Patruzalek, and Sebastian Spank. All three of these gophers are using Go in cool and interesting ways outside of traditional work projects.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nGitLab – The DevOps platform that empowers organizations to maximize the overall return on s…",
          "link": "https://changelog.com/gotime/212",
          "publishedOn": "2022-01-13T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 212: Go beyond work",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/212/go-time-212.mp3",
            "length": "42892827",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8OE8",
          "author": "Jerod Santo",
          "description": "I love articles like this one because I was ready to disagree with it going in, but it was so well-reasoned and articulate that I ended up agreeing with most everything the author proposes.\nDiscuss on Changelog News",
          "link": "https://stackoverflow.blog/2022/01/03/favor-real-dependencies-for-unit-testing/",
          "publishedOn": "2022-01-12T16:47:00.000Z",
          "wordCount": null,
          "title": "Favor real dependencies for unit testing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Lpyn",
          "author": "Jerod Santo",
          "description": "Any debugging story that includes the phrase, “My Mom’s verbal JIRA ticket was right” has a lot of promise. This one by Jim Nielsen delivers the goods. Here’s the culprit:\nIn my brain, I always thought of Safari and Chrome as “modern” browsers. But even Chrome, an “evergreen” browser, failed because it wasn‘t on an “evergreen” operating system (or hardware).\nand his takeaway:\nThe real-life impact of our technical decisions really hit home to me once again: my Mom had trouble volunteering and participating in her local community because somebody shipped the optional chaining operator in their production JavaScript.\nBe thoughtful out there.\nDiscuss on Changelog News",
          "link": "https://blog.jim-nielsen.com/2022/a-web-for-all/",
          "publishedOn": "2022-01-12T14:52:00.000Z",
          "wordCount": null,
          "title": "The optional chaining operator, “modern” browsers, and my mom",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bNM9",
          "author": "Gavin Henderson",
          "description": "At Ace Centre we have just launched an application that uses your webcam to detect when a user blinks. The application then triggers a switch press. This allows users who can’t access a physical switch or eye tracking to communicate using their chosen communication software.\nWe are really excited about the real world impact EyeCommander is already having and we would love to have more people contributing to the open source codebase\nEyeCommander is an Electron app with a React frontend. It uses Mediapipe, which is a collection of pretrained ML models for landmark detection in videos, provided by Google. It is cross platform so you can get up and running on whatever platform you use.\n\nDiscuss on Changelog News",
          "link": "https://github.com/AceCentre/eyecommander",
          "publishedOn": "2022-01-11T19:29:00.000Z",
          "wordCount": null,
          "title": "EyeCommander helps you communicate by blinking",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1554",
          "author": null,
          "description": "We have all seen how AI models fail, sometimes in spectacular ways. Yaron Singer joins us in this episode to discuss model vulnerabilities and automatic prevention of bad outcomes. By separating concerns and creating a “firewall” around your AI models, it’s possible to secure your AI workflows and prevent model failure.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMe, Myself, and AI – A podcast on artificial intelligence and business produced by MIT Sloan Management Review and Boston Consulting Group. Each episode, Sam Ransbotham and Sheervin Khodabandeh talk to AI leaders from organizations like Nasdaq, Spotify, Starbucks, and IKEA. Me, Myself, and AI is available wherever you get your podcasts. Just search Me, Myself, and AI.\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFeaturing\nYaron Singer – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nRobust Intelligence\nRobust Intelligence Blog",
          "link": "https://changelog.com/practicalai/163",
          "publishedOn": "2022-01-11T18:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 163: Eliminate AI failures",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/163/practical-ai-163.mp3",
            "length": "40246713",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/VJpj",
          "author": "Jerod Santo",
          "description": "Your first thought when reading that headline might’ve been _WebAssembly. Mine was! But no, that is not how Browsix does its thing:\nBrowsix is a framework that bridges the considerable gap between conventional operating systems and the browser, enabling unmodified programs expecting a Unix-like environment to run directly in the browser. Browsix does this by mapping low-level Unix primitives, like processes and system calls, onto existing browser APIs, like Web Workers and postMessage.\nThey have examples of this tech enabling a terminal in the browser, a Latex editor, and even a client/server-based meme generator written in JS and Go.\nDiscuss on Changelog News",
          "link": "https://browsix.org/",
          "publishedOn": "2022-01-11T15:31:00.000Z",
          "wordCount": null,
          "title": "Browsix – Unix in a browser tab",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5Wk",
          "author": "Jerod Santo",
          "description": "Lee Robinson from Vercel/Next.js:\nRust is now replacing parts of the JavaScript web ecosystem like minification (Terser), transpilation (Babel), formatting (Prettier), bundling (webpack), linting (ESLint) and more. Let’s take a deep dive into why this trend is gaining popularity and wider adoption.\nWe just discussed this topic (and some apprehension about it) on JS Party last week. Definitely a trned worth brushing up on, if you haven’t already.\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/the-case-for-rust-as-the-future-of-javascript-infrastructure/",
          "publishedOn": "2022-01-10T19:54:00.000Z",
          "wordCount": null,
          "title": "The case for Rust as the future of JavaScript infrastructure",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1526",
          "author": null,
          "description": "Paul Orlando joins Jerod to talk through some unintended consequences that occur when systems operate at scale. We discuss Goodhart’s Law, The Cobra Effect, how to design incentive systems, dependency management decisions, the risks of autonomous vehicles, and much more along the way.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped data produced by sensors, applications, and infrastructure. Learn about the wide range of use cases of InfluxDB at influxdata.com/changelog\n\n    \nSquare – Develop on the platform that sellers trust. There is a mas…",
          "link": "https://changelog.com/podcast/474",
          "publishedOn": "2022-01-10T17:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 474: Complex systems & second-order effects",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/474/the-changelog-474.mp3",
            "length": "67538320",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8OEM",
          "author": "Jerod Santo",
          "description": "Fireship with a brief (3:48) rundown of the most recent instance of a popular open source library maintainer removing their code from public repositories in response to corporate (ab)use of their free labor:\nYesterday, a popular open-source package, Faker.js, was abruptly taken down from GitHub. Its readme simply said “What really happened to Aaron Swartz?”. Let’s take a look at why Open Source Software can be a bad deal for many independent developers.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=R6S-b_k-ZKY",
          "publishedOn": "2022-01-10T15:20:00.000Z",
          "wordCount": null,
          "title": "What really happened to Faker.js?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5Z0",
          "author": "Jerod Santo",
          "description": "Reshape… automatically handles complex migrations that would normally require downtime or manual multi-step changes. During a migration, Reshape ensures both the old and new schema are available at the same time, allowing you to gradually roll out your application.\nDesigned for Postgres 12+ and experimental for now. Do not use in production until it shapes up.\nDiscuss on Changelog News",
          "link": "https://github.com/fabianlindfors/reshape",
          "publishedOn": "2022-01-10T14:31:00.000Z",
          "wordCount": null,
          "title": "An easy-to-use, zero-downtime schema migration tool for Postgres",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1525",
          "author": null,
          "description": "It’s our 3rd annual New Year’s party! We welcome a new panelist, review our (failed) resolutions from last year, discuss what’s trending in the web world, and even set some new (failed) resolutions for this year.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nDivya – Twitter, GitHub, LinkedIn, Website\nChristopher Hiller – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNotes and Links\nYou Will Be Able to Draw By the End of this Book",
          "link": "https://changelog.com/jsparty/207",
          "publishedOn": "2022-01-07T17:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 207: New Year's Party! 🍾",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/207/js-party-207.mp3",
            "length": "51903030",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9Ojl",
          "author": "Jerod Santo",
          "description": "Chip Huyen:\nIn the last year, I’ve talked to ~30 companies in different industries about their challenges with real-time machine learning. I’ve also worked with quite a few to find the solutions. This post outlines the solutions for (1) online prediction and (2) continual learning, with step-by-step use cases, considerations, and technologies required for each level.\nDiscuss on Changelog News",
          "link": "https://huyenchip.com//2022/01/02/real-time-machine-learning-challenges-and-solutions.html",
          "publishedOn": "2022-01-07T14:59:00.000Z",
          "wordCount": null,
          "title": "Real-time machine learning: challenges and solutions",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1532",
          "author": null,
          "description": "Our award winning ready survey game show is back, this time live from GopherCon 2021!\nGo Time panelists Natalie & Jon join forces with Go Team members Steve Francia, Katie Hockman, Julie Qui, and Rob Findley to battle it out and see who can better guess what the GopherCon gophers had to say!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFireHydrant – The reliability platform for teams of all sizes. With FireHydrant, teams achieve reliability at scale by enabling speed and consistency from a service deployment to an unexpected outage. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nGitLab – The DevOps platform that empowers organizations to maximize the overall return on software development by delivering software faster, more efficiently, while strengthening security and compliance. Identify and address blockers immediately, focus on delivering value — not maintaining integrations, automate security and compliance. Get started with their free tier (no credit card required). Learn more at about.gitlab.com/solutions/devops-platform\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nSteve Francia – Twitter, GitHub\nKatie Hockman – Twitter, GitHub\nJulie Qiu – Twitter, GitHub\nRob Findley – \nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\nWatch the session from GopherCon 2021",
          "link": "https://changelog.com/gotime/211",
          "publishedOn": "2022-01-06T19:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 211: Gophers Say! GopherCon Edition",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/211/go-time-211.mp3",
            "length": "52876634",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eZRw",
          "author": "Jerod Santo",
          "description": "B. Cameron Gain on The New Stack:\nDespite an ample amount of documentation and demos made available by Grafana Labs and community members, Grafana can be a challenge to set up (although those that do get its dashboards working generally sing its praises). Many manual configurations and steps are required when installing the different dashboard options. Once installed, many users can be overwhelmed with the number of logs and other data to process for monitoring and observability.\nGrafana sure does produce pretty (useful) dashboards 👇, but I do find it overwhelming at times.\n\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/will-grafana-become-easier-to-use-in-2022/",
          "publishedOn": "2022-01-06T16:18:00.000Z",
          "wordCount": null,
          "title": "Will Grafana become easier to use in 2022?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2aG",
          "author": "Jerod Santo",
          "description": "Martin Heinz on the tools/techniques for finding bottlenecks in your Python code. And fixing them, fast.\nThe first rule of optimization is to not do it. If you really have to though, then optimize where appropriate. Use the above profiling tools to find bottlenecks, so you don’t waste time optimizing some inconsequential piece of code. It’s also useful to create a reproducible benchmark for the piece of code you’re trying to optimize, so that you can measure the actual improvement.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/64",
          "publishedOn": "2022-01-06T15:21:00.000Z",
          "wordCount": null,
          "title": "Profiling and analyzing performance of Python programs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRMP",
          "author": "Jerod Santo",
          "description": "Luis Artola:\nI built my own laptop over the holiday break and it’s a developer’s dream come true. I took a chance and ordered a Framework Laptop DIY Edition. I’m so glad I did. The Framework is an excellent platform to customize and build a very capable and stable Linux machine for development. Here’s what I love about it and things that could be better.\n\nDiscuss on Changelog News",
          "link": "https://luisartola.com/framework-laptop-with-ubuntu-review/",
          "publishedOn": "2022-01-06T14:30:00.000Z",
          "wordCount": null,
          "title": "Reviewing the Framework laptop with Ubuntu",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1511",
          "author": null,
          "description": "In our first 2022 episode, Alexis Richardson, co-founder and CEO of Weaveworks, is talking to Gerhard about going fully remote, what a great team looks like, and GitOps. While you may have heard of GitOps, now is a good time to check out opengitops.dev.\nThe most interesting part of today’s conversation is the missing cloud native App Store. While Apple revolutionised the world with the App Store and the iPhone, we don’t yet have something similar for cloud native apps. You may be thinking “But what about OperatorHub?”, or all the Helm registries out there? The registry fragmentation, operator deprecations and lack of curation are not what people have in mind when they think App Store. But there is more to it, so let’s hear how Alexis thinks about this.\nDiscuss on Changelog News\nJoin Change…",
          "link": "https://changelog.com/shipit/34",
          "publishedOn": "2022-01-05T23:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 34: Where is the cloud native App Store?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/34/ship-it-34.mp3",
            "length": "44950994",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNad",
          "author": "Konrad",
          "description": "Back in the olden days, I would just put a mysqldump > dump.sql in a crontab and called it a day. When I started to host more and more stuff with docker, I first just migrated that approach to docker and put it all in a container. That still required me to mess around with config files. Once I started to host postgres containers it all got even more complicated. Thus, I needed a new solution.\nI built this tool to make backups easy: Simply point it to a host running docker containers and it will automatically inspect and find all mysql/mariadb and postgres containers and do backups of them on a schedule. No configuration required, it “just works”.\nDiscuss on Changelog News",
          "link": "https://kolaente.dev/konrad/docker-db-backup",
          "publishedOn": "2022-01-05T21:30:00.000Z",
          "wordCount": null,
          "title": "Simple, zero-fuss docker database backups",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P5ao",
          "author": "Finnian Anderson",
          "description": "There’s lots of info out there about building a simple app with Turbo, but there’s very limited content about architecting apps, scaling or building anything that’s not simply a blog.\nIn this post, I go into details about building a real production app with Hotwire and what we learnt as a team, plus some of the things we don’t like and the problems we bumped into.\nDiscuss on Changelog News",
          "link": "https://finnian.io/blog/hotwire-in-the-real-world/",
          "publishedOn": "2022-01-05T20:43:00.000Z",
          "wordCount": null,
          "title": "Hotwire in the real world",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3MO",
          "author": "Alex Strick van Linschoten",
          "description": "ZenML is an extensible MLOps framework to create production-ready machine learning pipelines. Built for data scientists, it has a simple, flexible syntax, is cloud and tool agnostic, and has interfaces/abstractions that are catered towards ML workflows.\nThe code base was recently completely rewritten with better abstractions and to set us up for our ongoing growth and inclusion of more integrations with tools that data scientists love to use.\nDiscuss on Changelog News",
          "link": "https://github.com/zenml-io/zenml",
          "publishedOn": "2022-01-05T16:43:00.000Z",
          "wordCount": null,
          "title": "ZenML helps data scientists work across the full stack",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1552",
          "author": null,
          "description": "In the second of the “AI in Africa” spotlight episodes, we welcome guests from Radiant Earth to talk about machine learning for earth observation. They give us a glimpse into their amazing data and tooling for working with satellite imagery, and they talk about use cases including crop identification and tropical storm wind speed estimation.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMe, Myself, and AI – A podcast on artificial intelligence and business produced by MIT Sloan Management Review and Boston Consulting Group. Each episode, Sam Ransbotham and Sheervin Khodabandeh talk to AI leaders from organizations like Nasdaq, Spotify, Starbucks, and IKEA. Me, Myself, and AI is available wherever you get your podcasts. Just search Me, Myself, and AI.\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFeaturing\nHamed Alemohammad – Twitter\nAbba Barde – Twitter, LinkedIn\nJoyce Nabende – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nRadiant Earth\nML for Earth Observation online course\n“Spot the crop” challenge\nOpen for Good Alliance",
          "link": "https://changelog.com/practicalai/162",
          "publishedOn": "2022-01-05T14:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 162: 🌍 AI in Africa - Radiant Earth",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/162/practical-ai-162.mp3",
            "length": "42189444",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/DzAp",
          "author": "Jerod Santo",
          "description": "This project provides a tiny .emacs file to set up Emacs quickly. This document provides a detailed description of how to set it up and get started with Emacs.\nFurther this project also provides a tiny convenience command named em to start Emacs server and edit files using Emacs server. This helps in using Emacs efficiently.\n\nDiscuss on Changelog News",
          "link": "https://github.com/susam/emfy",
          "publishedOn": "2022-01-04T17:26:00.000Z",
          "wordCount": null,
          "title": "A dark/sleek Emacs setup for general purpose editing and programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2Ve",
          "author": "Jerod Santo",
          "description": "Previously, we compiled a Go program into a WebAssembly and then converted it into C++ files to make it run on Nintendo Switch. Now, I have succeeded in compiling a Go program into a native binary for Nintendo Switch, and also running a game there. I replaced system calls with C function calls using the -overlay option.\n\nDiscuss on Changelog News",
          "link": "https://ebiten.org/blog/native_compiling_for_nintendo_switch.html",
          "publishedOn": "2022-01-04T16:39:00.000Z",
          "wordCount": null,
          "title": "Compiling a Go program into a native binary for Nintendo Switch™",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13A6",
          "author": "Adam Stacoviak",
          "description": "Oliver Brotchie developed this CSS fingerprinting technique that requires no Javascript or Cookies to function and avoids anti-tracking methods such as NoScript, VPNs or browser extensions.\nCSS Fingerprinting is a technique of tracking and gathering information on site visitors. This method exploits the nature of CSS to track various characteristics about the visitor’s browser and device, which can later be used to either identify or track said visitor.\nRight now, at current spec, this method doesn’t scale, but with the next upcoming draft of the CSS specification, CSS Values 4, it will become far more scalable and precise.\nDiscuss on Changelog News",
          "link": "https://csstracking.dev/",
          "publishedOn": "2022-01-04T15:51:44.000Z",
          "wordCount": null,
          "title": "CSS fingerprinting",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gdzW",
          "author": "Jerod Santo",
          "description": "If you ever get into an “oh snap!” situation where you think you just lost days of work, checkout a dura branch and recover.\nWithout dura, you use Ctrl-Z in your editor to get back to a good state. That’s so 2021. Computers crash and Ctrl-Z only works on files independently. Dura snapshots changes across the entire repository as-you-go, so you can revert to “4 hours ago” instead of “hit Ctrl-Z like 40 times or whatever”. Finally, some sanity.\nThis sounds a lot like how Fossil works out of the box, except maybe even more paranoid because Fossil will propagate every commit whereas Dura propagates all changes even before they’re committed.\nDiscuss on Changelog News",
          "link": "https://github.com/tkellogg/dura",
          "publishedOn": "2022-01-04T15:25:00.000Z",
          "wordCount": null,
          "title": "Dura is a background process that watches your Git repos",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X6aZ",
          "author": "Jerod Santo",
          "description": "I’ve been an iStat Menus user for years, but I only use the network and CPU widgets today. In fact, with my new MacBook Pro Max, the CPU monitor is pretty useless at this point. It rarely ever makes a blip!\nThis looks like a fine open source alternative. I’ll give it a try and report back.\n\nDiscuss on Changelog News",
          "link": "https://github.com/exelban/stats",
          "publishedOn": "2022-01-03T20:48:00.000Z",
          "wordCount": null,
          "title": "A macOS system monitor in your menu bar",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1551",
          "author": null,
          "description": "Here’s a little bonus episode before we get back to your regularly scheduled Go Time. We’re calling it the funny bits. It’s a compilation of times we cracked up making the show for y’all. If you dig it, holler at Jerod. If you don’t, email Mat Ryer.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nKat Zień – Twitter, GitHub, Website\nL Körbes – Twitter, GitHub, Website\nDaniel Martí – Twitter, GitHub, LinkedIn, Website\nRoberto Clapis – Twitter, GitHub\nCarl Johnson – Twitter, GitHub, Website\nAndré Eriksson – Twitter, GitHub, Website\nCarolyn Van Slyck – Twitter, GitHub, Website\nKatie Hockman – Twitter, GitHub\nJay Conrod – Twitter, GitHub, Website\nTeiva Harsanyi – Twitter, GitHub, Website\nsam boyer – Twitter, GitHub\nCarlisia Thompson – Twitter, GitHub, LinkedIn\nIan Lopshire – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nMark Bates – Twitter, GitHub, Website\nAngelica Hill – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\n#161: Go Panic!\n#166: Indecent (language) Proposals: Part 1\n#168: Indecent (language) Proposals: Part 2\n#171: go:embed\n#173: Releasing with (and without) GoReleaser\n#180: Are frameworks getting an Encore?\n#184: All about Porter\n#187: Fuzzing in the standard library\n#190: How to make mistakes in Go\n#196: Building actually maintainable software\n#200: Gophers Say What?!\n#202: Maintaining ourselves",
          "link": "https://changelog.com/gotime/funny-bits-2021",
          "publishedOn": "2022-01-03T18:30:00.000Z",
          "wordCount": null,
          "title": "Go Time The funny bits from 2021",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/funny-bits-2021/go-time-funny-bits-2021.mp3",
            "length": "27148733",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/d3a8",
          "author": "Jerod Santo",
          "description": "RSS-Bridge is a PHP project capable of generating RSS and Atom feeds for websites that don’t have one. It can be used on webservers or as a stand-alone application in CLI mode.\nI made a very poor-man’s version of this as my first ever Sinatra app way back in the day. It’s cool to see that vision live on, but it sucks that tools like this have to exist. It seems that the author agrees with me on that:\nWe want to share with friends, using open protocols: RSS, Atom, XMPP, whatever. Because no one wants to have your service with your applications using your API force-feeding them. Friends must be free to choose whatever software and service they want.\nWe are rebuilding bridges you have willfully destroyed.\nDiscuss on Changelog News",
          "link": "https://github.com/RSS-Bridge/rss-bridge",
          "publishedOn": "2022-01-03T16:07:00.000Z",
          "wordCount": null,
          "title": "The RSS feed for websites missing it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6OAq",
          "author": "Jerod Santo",
          "description": "OpenDrop is a command-line tool that allows sharing files between devices directly over Wi-Fi. Its unique feature is that it is protocol-compatible with Apple AirDrop which allows to share files with Apple devices running iOS and macOS.\nSuper cool, but with a disclaimer: this is the result of reverse engineering the transfer protocol, so the odds of it being flakey (especially as Apple ships OS updates) are high. It’d be rad if Apple would publish an AirDrop-compatible specification for the community to rally around.\nYou know, like they did with FaceTime. 😉\nDiscuss on Changelog News",
          "link": "https://github.com/seemoo-lab/opendrop",
          "publishedOn": "2022-01-03T15:19:00.000Z",
          "wordCount": null,
          "title": "AirDrop files directly from your CLI with OpenDrop",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/health/advancing-genomics-better-understand-and-treat-disease/",
          "author": null,
          "description": "Genome sequencing can help us better understand, diagnose and treat disease. For example, healthcare providers are increasingly using genome sequencing to diagnose rare genetic diseases, such as elevated risk for breast cancer or pulmonary arterial hypertension, which are estimated to affect roughly 8% of the population.\nAt Google Health, we’re applying our technology and expertise to the field of genomics. Here are recent research and industry developments we’ve made to help quickly identify genetic disease and foster the equity of genomic tests across ancestries. This includes an exciting new partnership with Pacific Biosciences to further advance genomic technologies in research and the clinic.\n\n\nHelping identify life-threatening disease when minutes matter\nGenetic diseases can cause cr…",
          "link": "https://blog.google/technology/health/advancing-genomics-better-understand-and-treat-disease/",
          "publishedOn": "2022-01-13T17:00:00.000Z",
          "wordCount": 1371,
          "title": "Advancing genomics to better understand and treat disease"
        },
        {
          "id": "https://blog.google/around-the-globe/google-africa/how-abigail-annkah-using-ai-improve-maps-africa/",
          "author": null,
          "description": "As a university student, Abigail Annkah fell in love with mathematics, which soon led to her interest in artificial intelligence. After graduating from the African Institute for Mathematical Sciences, Abigail made it through the competitive process to become an AI resident at Google Research, Accra. After her residency, Google offered her a job and she’s now a research software engineer working on several high-profile projects.\nAs Google grows its presence in Accra, we spoke to Abigail about the mapping project that motivates her, starting a new job while becoming a mother and the importance of inspiring young girls to enter STEM careers.\n\nHow did your science background lead you to Google?\nI did my undergraduate degree in Bachelor of Science Statistics at the University of Ghana, finishin…",
          "link": "https://blog.google/around-the-globe/google-africa/how-abigail-annkah-using-ai-improve-maps-africa/",
          "publishedOn": "2022-01-06T12:00:00.000Z",
          "wordCount": 1625,
          "title": "How Abigail Annkah is using AI to improve maps in Africa"
        },
        {
          "id": "https://blog.google/technology/research/2021-year-review-google-quantum-ai/",
          "author": null,
          "description": "Google’s Quantum AI team has had a productive 2021. Despite ongoing global challenges, we’ve made significant progress in our effort to build a fully error-corrected quantum computer, working towards our next hardware milestone of building an error-corrected quantum bit (qubit) prototype. At the same time, we have continued our commitment to realizing the potential of quantum computers in various applications. That's why we published results in top journals, collaborated with researchers across academia and industry, and expanded our team to bring on new talent and expertise.\n\n\n\nAn update on hardware\n\n\nThe Quantum AI team is determined to build an error-corrected quantum computer within the next decade, and to simultaneously use what we learn along the way to deliver helpful—and even trans…",
          "link": "https://blog.google/technology/research/2021-year-review-google-quantum-ai/",
          "publishedOn": "2021-12-30T18:00:00.000Z",
          "wordCount": 2075,
          "title": "2021 Year in Review: Google Quantum AI"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=18206",
          "author": "Daniel Stenberg",
          "description": "On Friday January 21, 2022 I received this email. I tweeted about it and it took off like crazy. The email comes from a fortune-500 multi-billion dollar company that apparently might be using a product that contains my code, or maybe they have customers who do. Who knows? My guess is that they do this … Continue reading LogJ4 Security Inquiry – Response Required →",
          "link": "https://daniel.haxx.se/blog/2022/01/24/logj4-security-inquiry-response-required/",
          "publishedOn": "2022-01-24T14:45:57.000Z",
          "wordCount": 1901,
          "title": "LogJ4 Security Inquiry – Response Required"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18034",
          "author": "Daniel Stenberg",
          "description": "The well-known log4j security vulnerability of December 2021 triggered a lot of renewed discussions around software supply chain security, and sometimes it has also been said to be an Open Source related issue. This was not the first software component to have a serious security flaw, and it will not be the last. What can … Continue reading Enforcing the pyramid of Open Source →",
          "link": "https://daniel.haxx.se/blog/2022/01/17/enforcing-the-pyramid-of-open-source/",
          "publishedOn": "2022-01-17T08:00:42.000Z",
          "wordCount": 2478,
          "title": "Enforcing the pyramid of Open Source"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18104",
          "author": "Daniel Stenberg",
          "description": "I have had my share of adventures with URL parsers and their differences in the past. The current state of my research on the topic of (failed) URL interoperability remains available in this GitHub document. Use one and only one There is still no common or standard URL syntax format in sight. A string that … Continue reading Don’t mix URL parsers →",
          "link": "https://daniel.haxx.se/blog/2022/01/10/dont-mix-url-parsers/",
          "publishedOn": "2022-01-10T15:07:10.000Z",
          "wordCount": 1511,
          "title": "Don’t mix URL parsers"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18119",
          "author": "Daniel Stenberg",
          "description": "There has been eight weeks since 7.80.0. Release presentation Numbers the 205th release1 change56 days (total: 8,636)121 bug-fixes (total: 7,518)189 commits (total: 28,055)0 new public libcurl function (total: 86)1 new curl_easy_setopt() option (total: 295)1 new curl command line option (total: 244)53 contributors, 25 new (total: 2,558)32 authors, 14 new (total: 990)0 security fixes (total: 111)0 … Continue reading curl 7.81.0 – more percent →",
          "link": "https://daniel.haxx.se/blog/2022/01/05/curl-7-81-0-more-percent/",
          "publishedOn": "2022-01-05T08:03:22.000Z",
          "wordCount": 1540,
          "title": "curl 7.81.0 – more percent"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-01-21T12:13:58.073Z",
          "wordCount": 830,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-01-21T12:13:58.060Z",
          "wordCount": 806,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2022-01-17T12:15:21.266Z",
          "wordCount": 2822,
          "title": "How we built Twitter’s highly reliable ads pacing service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-01-15T12:14:22.581Z",
          "wordCount": 1677,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2022-01-15T12:14:22.112Z",
          "wordCount": 2618,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "author": null,
          "description": "This blog post shares optimization findings to speed up Transformer-based models’ CPU inference and improve computational demand in Google Cloud.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "publishedOn": "2022-01-14T12:14:46.174Z",
          "wordCount": 2672,
          "title": "Speeding up Transformer CPU inference in Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "author": null,
          "description": "Sharing learnings from the first algorithmic bias bounty challenge",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "publishedOn": "2022-01-13T12:15:15.401Z",
          "wordCount": 1450,
          "title": "Sharing learnings from the first algorithmic bias bounty challenge"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "author": null,
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2022-01-13T12:15:15.391Z",
          "wordCount": 2393,
          "title": "Logging at Twitter: Updated"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "author": null,
          "description": "How we apply machine learning techniques at Twitter to forecast SQL query resource utilization during the development and maintenance of our large-scale SQL system.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "publishedOn": "2022-01-13T12:15:15.371Z",
          "wordCount": 1920,
          "title": "Forecasting SQL query resource usage with machine learning"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "author": null,
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2022-01-13T12:15:15.359Z",
          "wordCount": 1289,
          "title": "Applying flame graphs outside of performance analysis"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/processing-billions-of-events-in-real-time-at-twitter-",
          "author": null,
          "description": "How we process large scale data in real time at Twitter while reducing latency and improving accuracy.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/processing-billions-of-events-in-real-time-at-twitter-",
          "publishedOn": "2022-01-13T12:15:15.253Z",
          "wordCount": 1899,
          "title": "Processing billions of events in real time at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-rolled-out-security-keys-at-twitter",
          "author": null,
          "description": "In this blog, we share how we’ve accelerated efforts to increase the use of security keys to prevent phishing attacks at Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-rolled-out-security-keys-at-twitter",
          "publishedOn": "2022-01-13T12:15:15.208Z",
          "wordCount": 1616,
          "title": "How we rolled out security keys at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2021-12-31T12:28:15.540Z",
          "wordCount": 2841,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/01/zooming-in-on-zero-click-exploits.html",
          "author": null,
          "description": "ul.lst-kix_ef7dug197aaw-4{list-style-type:none}ul.lst-kix_ef7dug197aaw-3{list-style-type:none}.lst-kix_ef7dug197aaw-0>li:before{content:\"-  \"}ul.lst-kix_ef7dug197aaw-2{list-style-type:none}ul.lst-kix_ef7dug197aaw-1{list-style-type:none}.lst-kix_ef7dug197aaw-1>li:before{content:\"-  \"}ul.lst-kix_ef7dug197aaw-8{list-style-type:none}ul.lst-kix_ef7dug197aaw-7{list-style-type:none}ul.lst-kix_ef7dug197aaw-6{list-style-type:none}ul.lst-kix_ef7dug197aaw-5{list-style-type:none}ul.lst-kix_ef7dug197aaw-0{list-style-type:none}.lst-kix_ef7dug197aaw-7>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-6>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-8>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-5>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-3>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-2>li:before{content…",
          "link": "https://googleprojectzero.blogspot.com/2022/01/zooming-in-on-zero-click-exploits.html",
          "publishedOn": "2022-01-18T17:28:00.000Z",
          "wordCount": 4892,
          "title": "Zooming in on Zero-click Exploits"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47555",
          "author": "Francesca Minelli",
          "description": "If you’ve ever built anything with web technologies, you’re probably familiar with MDN Web Docs. With about 13,000 pages documenting how to use programming languages such as HTML, CSS and JavaScript, the site has about 8,000 people using it at any given moment. MDN relies on contributors to help maintain its ever-expanding and up to date documentation. We reached out to 4 long-time community contributors to talk about how and why they started contributing, why they kept going, and ask what advice they have for new contributors.\nThe post Contributing to MDN: Meet the Contributors appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/01/contributing-to-mdn-meet-the-contributors/",
          "publishedOn": "2022-01-18T16:07:59.000Z",
          "wordCount": 2488,
          "title": "Contributing to MDN: Meet the Contributors"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47506",
          "author": "Xavier Harding",
          "description": "Sara Soueidan is an independent Web UI and design engineer, author, speaker, and trainer from Lebanon. When Sara isn’t offering keynote speeches at conferences (she’s done so a dozen times) she’s writing books like “Codrops CSS Reference” and “Smashing Book 5.” Currently, she’s working on a new course, \"Practical Accessibility,\" meant to teach devs and designers ways to make their products accessible. In 2015, Sara was voted Developer of the Year in the net awards, and shortlisted for the Outstanding Contribution of the Year award. She also won an O’Reilly Web Platform Award for “exceptional leadership, creativity, and collaboration in the development of JavaScript, HTML, CSS, and the supporting Web ecosystem.”\nWe chatted with Sara about front-end web development, the importance of design and her appreciation of birds.\nThe post Hacks Decoded: Sara Soueidan, Award-Winning UI Design Engineer and Author appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/12/hacks-decoded-sara-soueidan-award-winning-ui-design-engineer-and-author/",
          "publishedOn": "2021-12-30T15:13:51.000Z",
          "wordCount": 3597,
          "title": "Hacks Decoded: Sara Soueidan, Award-Winning UI Design Engineer and Author"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=62535",
          "author": "Taylor Blau",
          "description": "The open source Git project just released Git 2.35. Here's GitHub's look at some of the most interesting features and changes introduced since last time.",
          "link": "https://github.blog/2022-01-24-highlights-from-git-2-35/",
          "publishedOn": "2022-01-24T20:00:43.000Z",
          "wordCount": 2563,
          "title": "Highlights from Git 2.35"
        },
        {
          "id": "https://github.blog/?p=62405",
          "author": "Michelle Mannering",
          "description": "Many of us were wrapping up projects, emails, events, and getting ready for Christmas. While we were all busy getting ready for the festive season, our community was still hard at work shipping open source",
          "link": "https://github.blog/2022-01-21-release-radar-dec-2021/",
          "publishedOn": "2022-01-21T23:00:29.000Z",
          "wordCount": 1209,
          "title": "Release Radar · December 2021 Edition"
        },
        {
          "id": "https://github.blog/?p=62495",
          "author": "Peter Cihon",
          "description": "When digital infrastructure is overlooked by governments, it isn't just a missed opportunity: policies may inadvertently endanger open source collaboration.",
          "link": "https://github.blog/2022-01-20-open-source-creates-value-but-how-do-you-measure-it/",
          "publishedOn": "2022-01-20T16:58:28.000Z",
          "wordCount": 1576,
          "title": "Open source creates value, but how do you measure it?"
        },
        {
          "id": "https://github.blog/?p=62472",
          "author": "Jose Palafox",
          "description": "We’re excited to announce the V4 release of the OpenSSF’s Scorecard project in partnership with Google.",
          "link": "https://github.blog/2022-01-19-reducing-security-risk-oss-actions-opensff-scorecards-v4/",
          "publishedOn": "2022-01-19T15:00:02.000Z",
          "wordCount": 644,
          "title": "Reducing security risk in open source software with GitHub Actions and OpenSSF Scorecards V4"
        },
        {
          "id": "https://github.blog/?p=62454",
          "author": "Nicole Numrich",
          "description": "With the successful liftoff of the James Webb Space Telescope, we ask our very own Arfon Smith about the history of open source and space science.",
          "link": "https://github.blog/2022-01-18-how-open-source-is-supporting-nasas-new-eyes-in-space/",
          "publishedOn": "2022-01-18T17:41:41.000Z",
          "wordCount": 1727,
          "title": "How open source is supporting NASA’s new eyes in space"
        },
        {
          "id": "https://github.blog/?p=62289",
          "author": "Lee Reilly",
          "description": "Here are the top games created in our annual game jam as rated and reviewed by the developers that made them. Game On! 🤘🏻",
          "link": "https://github.blog/2022-01-13-top-entries-from-game-off-2021/",
          "publishedOn": "2022-01-13T20:23:31.000Z",
          "wordCount": 1948,
          "title": "Top-rated entries from Game Off 2021"
        },
        {
          "id": "https://github.blog/?p=62257",
          "author": "Evi Liu",
          "description": "From answering questions about a new release to fielding feature requests, here’s how five open source communities use GitHub Discussions.",
          "link": "https://github.blog/2022-01-13-how-five-open-source-communities-are-using-github-discussions/",
          "publishedOn": "2022-01-13T17:14:21.000Z",
          "wordCount": 1250,
          "title": "How five open source communities are using GitHub Discussions"
        },
        {
          "id": "https://github.blog/?p=62411",
          "author": "Mike Hanley",
          "description": "My colleague Stormy Peters and I are proud to represent GitHub at the White House’s Open Source Software Security Summit to share how securing open source begins by empowering developers.",
          "link": "https://github.blog/2022-01-13-open-source-software-security-summit-securing-the-worlds-code-together/",
          "publishedOn": "2022-01-13T10:00:24.000Z",
          "wordCount": 894,
          "title": "The Open Source Software Security Summit: securing the world’s code together"
        },
        {
          "id": "https://github.blog/?p=62370",
          "author": "Taehun Kim",
          "description": "Learn how the GitHub Mobile Team automates their release process with GitHub Actions.",
          "link": "https://github.blog/2022-01-12-how-we-ship-github-mobile-every-week/",
          "publishedOn": "2022-01-12T17:56:11.000Z",
          "wordCount": 1641,
          "title": "How we ship GitHub Mobile every week"
        },
        {
          "id": "https://github.blog/?p=62275",
          "author": "Scott Sanders",
          "description": "In December, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2022-01-05-github-availability-report-december-2021/",
          "publishedOn": "2022-01-05T21:34:45.000Z",
          "wordCount": 238,
          "title": "GitHub Availability Report: December 2021"
        },
        {
          "id": "https://github.blog/?p=62222",
          "author": "Xavier René-Corail",
          "description": "The GitHub Security Lab’s CodeQL bounty program fuels GitHub Advanced Security with queries written by the open source community.",
          "link": "https://github.blog/2022-01-05-how-the-community-powers-github-advanced-security-with-codeql-queries/",
          "publishedOn": "2022-01-05T18:18:04.000Z",
          "wordCount": 1244,
          "title": "How the community powers GitHub Advanced Security with CodeQL queries"
        },
        {
          "id": "https://github.blog/?p=62241",
          "author": "Becca Crockett",
          "description": "As the year winds down, we're highlighting some of the incredible work from GitHub’s engineers, product teams, and security researchers.",
          "link": "https://github.blog/2021-12-28-githubs-top-10-blog-posts-of-2021/",
          "publishedOn": "2021-12-28T17:00:37.000Z",
          "wordCount": 544,
          "title": "GitHub’s top 10 blog posts of 2021"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18048",
          "author": "Nubank Editorial",
          "description": "To reinforce Nubank's commitment to caring for the environment, the positive social impact on people's lives, and the best corporate governance practices, today we launched a manifesto video. Watch now.\nThe post Nu Impacto Manifesto: Nubank’s commitment to the adoption of ESG practices appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-impacto-manifesto/",
          "publishedOn": "2022-01-24T21:24:11.000Z",
          "wordCount": 3127,
          "title": "Nu Impacto Manifesto: Nubank’s commitment to the adoption of ESG practices"
        },
        {
          "id": "https://building.nubank.com.br/?p=18035",
          "author": "Nubank Editorial",
          "description": "The largest voluntary initiative of its kind in the world brings together companies willing to make a difference to change corporate sustainability indicators. Understand Nubank's participation.\nThe post Nubank joins the UN Global Compact appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-joins-the-un-global-compact/",
          "publishedOn": "2022-01-17T21:56:57.000Z",
          "wordCount": 3067,
          "title": "Nubank joins the UN Global Compact"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/vulnerability-management/hackerone-global-top-10-hacker-expertise-industry-data-and-date",
          "author": "HackerOne",
          "description": "Many security teams use the OWASP Top 10 as a guideline to understand where they should focus their security strategies and cyberattack prevention efforts. The OWASP Top 10 originated in 2003 and has become a benchmark for compliance, education, and vendor tools.",
          "link": "https://www.hackerone.com/vulnerability-management/hackerone-global-top-10-hacker-expertise-industry-data-and-date",
          "publishedOn": "2022-01-14T21:55:11.000Z",
          "wordCount": 1414,
          "title": "The HackerOne Global Top 10—Hacker Expertise, Industry Data, and Up-to-Date Vulnerabilities"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/log4shell-attack-evolution",
          "author": "HackerOne",
          "description": "HackerOne has unique visibility into the global response to Log4Shell, seeing in real time how organizations responded and remediated. Last week HackerOne’s CISO Chris Evans and Co-founder Jobert Abma shared findings from our platform.",
          "link": "https://www.hackerone.com/vulnerability-management/log4shell-attack-evolution",
          "publishedOn": "2022-01-06T23:52:54.000Z",
          "wordCount": 1185,
          "title": "Log4Shell: Attack Evolution"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/eab2602b86fe",
          "author": "Netflix Technology Blog",
          "description": "How the Netflix TVUI team implemented a robust strategy to quickly and easily detect performance anomalies before they a",
          "link": "https://netflixtechblog.com/fixing-performance-regressions-before-they-happen-eab2602b86fe?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-24T21:49:43.000Z",
          "wordCount": 2865,
          "title": "Fixing Performance Regressions Before they Happen"
        },
        {
          "id": "https://medium.com/p/5bcc52d853d1",
          "author": "Netflix Technology Blog",
          "description": "By Vikram Srivastava and Marcelo Mayworm",
          "link": "https://netflixtechblog.com/auto-diagnosis-and-remediation-in-netflix-data-platform-5bcc52d853d1?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-14T04:23:22.000Z",
          "wordCount": 1352,
          "title": "Auto-Diagnosis and Remediation in Netflix Data Platform"
        },
        {
          "id": "https://medium.com/p/f67923f8e985",
          "author": "Netflix Technology Blog",
          "description": "Martin Tingley with Wenjing Zheng, Simon Ejdemyr, Stephanie Lane, Colin McFarland, Andy Rhines, Sophia Liu, Mihir Tendulkar, Kevin…",
          "link": "https://netflixtechblog.com/experimentation-is-a-major-focus-of-data-science-across-netflix-f67923f8e985?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-11T16:09:13.000Z",
          "wordCount": 4795,
          "title": "Experimentation is a major focus of Data Science across Netflix"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/2022-false-start-for-us-equities",
          "author": "Market Radar",
          "description": "Lot of pain for U.S. stocks, but there are bright spots elsewhere",
          "link": "https://marketradar.substack.com/p/2022-false-start-for-us-equities",
          "publishedOn": "2022-01-21T16:15:52.000Z",
          "wordCount": null,
          "title": "2022: False start for U.S. equities",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F506491cb-7491-45f8-8b9d-f5c27d2e06f1_310x313.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/the-balanced-portfolio",
          "author": "Market Radar",
          "description": "A detailed presentation of an ETF Portfolio",
          "link": "https://marketradar.substack.com/p/the-balanced-portfolio",
          "publishedOn": "2022-01-18T16:35:51.000Z",
          "wordCount": null,
          "title": "The Balanced Portfolio",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4f8bf5f7-1bff-49ed-ac16-62a9a8da805f_528x400.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/introduction-of-two-sample-portfolios",
          "author": "Market Radar",
          "description": "Two portfolios to inspire your investments",
          "link": "https://marketradar.substack.com/p/introduction-of-two-sample-portfolios",
          "publishedOn": "2022-01-14T17:26:45.000Z",
          "wordCount": null,
          "title": "Introduction of two sample portfolios: Balanced and Pure Stocks",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2d500335-e407-48c5-a603-5a8b7cb28c75_2640x1815.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/value-rotation-is-here-again",
          "author": "Market Radar",
          "description": "Rising yields created panic among investors",
          "link": "https://marketradar.substack.com/p/value-rotation-is-here-again",
          "publishedOn": "2022-01-11T19:34:40.000Z",
          "wordCount": null,
          "title": "Value rotation is here again",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F46d7adf7-5b8a-48b5-b7dc-01e5b370d497_315x316.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/2021-is-over-equity-rally-is-not",
          "author": "Market Radar",
          "description": "Hello guys, I hope you are all fine and having good time. I have been out of office for Christmas holidays, but here I am again to show you my current point of view on markets. In case you haven’t subscribed yet, you can do it now. Just use the button below.",
          "link": "https://marketradar.substack.com/p/2021-is-over-equity-rally-is-not",
          "publishedOn": "2021-12-30T15:30:33.000Z",
          "wordCount": null,
          "title": "2021 is over, equity rally is not",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7b38432c-a706-4af3-a811-96d84a893236_1256x830.jpeg",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}