{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/05/io-2022-android-13-security-and-privacy.html",
          "author": null,
          "description": "Posted by Eugene Liderman and Sara N-Marandi, Android Security and Privacy Team\n\nEvery year at I/O we share the latest on privacy and security features on Android. But we know some users like to go a level deeper in understanding how we’re making the latest release safer, and more private, while continuing to offer a seamless experience. So let’s dig into the tools we’re building to better secure your data, enhance your privacy and increase trust in the apps and experiences on your devices.  \nLow latency, frictionless security\nRegardless of whether a smartphone is used for consumer or enterprise purposes, attestation is a key underpinning to ensure the integrity of the device and apps running on the device. Fundamentally, key attestation lets a developer bind a secret or designate data to …",
          "link": "http://security.googleblog.com/2022/05/io-2022-android-13-security-and-privacy.html",
          "publishedOn": "2022-05-11T19:05:00.047Z",
          "wordCount": 2108,
          "title": "I/O 2022: Android 13 security and privacy (and more!)"
        },
        {
          "id": "http://security.googleblog.com/2022/05/taking-on-next-generation-of-phishing.html",
          "author": null,
          "description": "Posted by Daniel Margolis, Software Engineer, Google Account Security Team \nEvery year, security technologies improve: browsers get better, encryption becomes ubiquitous on the Web, authentication becomes stronger. But phishing persistently remains a threat (as shown by a recent phishing attack on the U.S. Department of Labor) because users retain the ability to log into their online accounts, often with a simple password, from anywhere in the world. It’s why today at I/O we announced new ways we’re reducing the risks of phishing by: scaling phishing protections to Google Docs, Sheets and Slides, continuing to auto enroll people in 2-Step Verification and more. This blog will deep dive into the method of phishing and how it has evolved today. \nAs phishing adoption has grown, multi-factor a…",
          "link": "http://security.googleblog.com/2022/05/taking-on-next-generation-of-phishing.html",
          "publishedOn": "2022-05-11T18:00:00.004Z",
          "wordCount": 1886,
          "title": "Taking on the Next Generation of Phishing Scams"
        },
        {
          "id": "http://security.googleblog.com/2022/04/the-package-analysis-project-scalable.html",
          "author": null,
          "description": "Posted by Caleb Brown, Open Source Security Team \n\n\nDespite open source software’s essential role in all software built today, it’s far too easy for bad actors to circulate malicious packages that attack the systems and users running that software. Unlike mobile app stores that can scan for and reject malicious contributions, package repositories have limited resources to review the thousands of daily updates and must maintain an open model where anyone can freely contribute. As a result, malicious packages like ua-parser-js, and node-ipc are regularly uploaded to popular repositories despite their best efforts, with sometimes devastating consequences for users. \nGoogle, a member of the Open Source Security Foundation (OpenSSF), is proud to support the OpenSSF’s Package Analysis project, w…",
          "link": "http://security.googleblog.com/2022/04/the-package-analysis-project-scalable.html",
          "publishedOn": "2022-04-28T16:05:00.008Z",
          "wordCount": 1291,
          "title": "The Package Analysis Project: Scalable detection of malicious open source packages"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-we-fought-bad-apps-and-developers.html",
          "author": null,
          "description": "Posted by Steve Kafka and Khawaja Shams, Android Security and Privacy Team \nProviding a safe experience to billions of users continues to be one of the highest priorities for Google Play. Last year we introduced multiple privacy focused features, enhanced our protections against bad apps and developers, and improved SDK data safety. In addition, Google Play Protect continues to scan billions of installed apps each day across billions of devices to keep people safe from malware and unwanted software.  \n  \nWe continue to enhance our machine learning systems and review processes, and in 2021 we blocked 1.2 million policy violating apps from being published on Google Play, preventing billions of harmful installations. We also continued in our efforts to combat malicious and spammy developers, …",
          "link": "http://security.googleblog.com/2022/04/how-we-fought-bad-apps-and-developers.html",
          "publishedOn": "2022-04-27T16:01:00.000Z",
          "wordCount": 1021,
          "title": "How we fought bad apps and developers in 2021"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-to-slsa-part-3-putting-it-all.html",
          "author": null,
          "description": "Posted by Tom Hennen, software engineer, BCID & GOSST \n\n\nIn our last two posts (1,2) we introduced a fictional example of Squirrel, Oppy, and Acme learning to SLSA and covered the basics and details of how they’d use SLSA for their organizations. Today we’ll close out the series by exploring how each organization pulls together the various solutions into a heterogeneous supply chain. \nAs a reminder, Acme is trying to produce a container image that contains three artifacts:\n\nThe Squirrel package ‘foo’\nThe Oppy package ‘baz’\nA custom executable, ‘bar’, written by Acme employees.\nThe process starts with ‘foo’ package authors triggering a build using GitHub Actions. This results in a new version of ‘foo’ (an artifact with hash ‘abc’) being pushed to the Squirrel repo along with its SLSA proven…",
          "link": "http://security.googleblog.com/2022/04/how-to-slsa-part-3-putting-it-all.html",
          "publishedOn": "2022-04-14T17:28:00.008Z",
          "wordCount": 1091,
          "title": "How to SLSA Part 3 - Putting it all together"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/2/1643",
          "author": null,
          "description": "Another entry in the maintenance series! Throughout the series we’ve discussed building versus buying, building actually maintainable software, maintaining ourselves, open source maintenance, legacy code, and most recently Go project structure. In this 7th installment of the series, we continue narrowing our focus by talking about what to do when projects get big and messy.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.io\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFlatfile – Data import is broken. We fixed it. Flatfile’s powerful out-of-the-box solution takes the data import burden off your shoulders, freeing you to solve bigger business problems and build products that people love.\n\n    \nFeaturing\nsam boyer – Twitter, GitHub\nIan Lopshire – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/229",
          "publishedOn": "2022-05-12T16:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 229: What to do when projects get big and messy",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/229/go-time-229.mp3",
            "length": "64746658",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/3YNw",
          "author": "Jerod Santo",
          "description": "Good for them (and us)! But what does that mean in practice?\nOver the next few months, we’ll be completing the OpenJS Foundation’s incubation program checklist, including transferring the Jest domain, repo, website, and other assets to OpenJS. We’ll also be updating the code of conduct and contributor license agreement.\nAdditionally, as part of this move, we will be publishing a project charter and creating new governance policies that will document the process for gaining commit access, as well as our leadership selection process.\nNext up: React?! A guy can dream…\nDiscuss on Changelog News",
          "link": "https://engineering.fb.com/2022/05/11/open-source/jest-openjs-foundation/",
          "publishedOn": "2022-05-12T14:45:00.000Z",
          "wordCount": null,
          "title": "Meta is transferring Jest to the OpenJS Foundation",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73wz",
          "author": "Jerod Santo",
          "description": "A searchable, templated catalog of popular terminal commands curated from across the internet.\nPretty sweet resource from our friends at Warp. Contribute your own commands on GitHub.\nDiscuss on Changelog News",
          "link": "https://www.commands.dev/",
          "publishedOn": "2022-05-12T13:49:00.000Z",
          "wordCount": null,
          "title": "Commands.dev - find commands at the speed of thought",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X6Le",
          "author": "Jerod Santo",
          "description": "Check your site against this to determine your accessibility compliance with the WCAG.\nDiscuss on Changelog News",
          "link": "https://www.a11yproject.com/checklist/",
          "publishedOn": "2022-05-11T16:20:00.000Z",
          "wordCount": null,
          "title": "The a11y project checklist",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1630",
          "author": null,
          "description": "Today we talk to Priyanka Sharma (E.D. at the Cloud Native Computing Foundation) about all things KubeCon Europe 2022. We start with Gerhard’s favourite subject - Priyanka’s Happy Hour - and then we switch focus to the conference.\nFor many, this will be the first in-person KubeCon since 2019. As for Gerhard, he is not sure that he remember how airports work. If he succeeds, he looks forward to meeting some of you in Valencia. If not, send help.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn co…",
          "link": "https://changelog.com/shipit/52",
          "publishedOn": "2022-05-11T15:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 52: Priyanka's Happy Hour (KubeCon EU 2022)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/52/ship-it-52.mp3",
            "length": "38526010",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/maeP",
          "author": "Jerod Santo",
          "description": "I love when software engineers share their career/life choices and the reasoning behind them so others can benefit from their perspective, like this one on bucket filling:\nSomebody once described balance to me as three buckets filled with water. One for career, a second for physical health, and a third for social and family life. At any point, one bucket might be running low. But as long as the overall water level is high enough, things should be fine.\nScott’s choice to join a startup seems odd given his reason for leaving Google, but:\nSo: am I happier? Undoubtedly yes.\nI work more hours. I’m more likely to be working in the evening or on the weekend now. But what I do makes a difference that I can see. Progress feels 10x faster.\nMost surprising is that I have more energy. It’s easier to find motivation to get back in the gym. I have more energy in social situations.\nWorking more hours sounds like tipping the work/life balance in the wrong direction, but excitement about your work certainly changes the calculus. He’s happier now, so that’s great!\nDiscuss on Changelog News",
          "link": "https://www.scottkennedy.us/balance.html",
          "publishedOn": "2022-05-11T14:54:00.000Z",
          "wordCount": null,
          "title": "Why I left Google: work-life balance",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/wk8R",
          "author": "Jerod Santo",
          "description": "Currently supports SQLite and CSV. MySQL and Postgres are on the roadmap. Built with Bubble Tea.\n\nDiscuss on Changelog News",
          "link": "https://github.com/mathaou/termdbms",
          "publishedOn": "2022-05-11T14:07:00.000Z",
          "wordCount": null,
          "title": "A TUI for viewing and editing database files",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/d3ga",
          "author": "Jerod Santo",
          "description": "Good news, everyone! Jan Schaumann merged Futurama with your (least) favorite programming languages. Amy Wong is… Ruby?!\nObject-oriented, cute, really popular, and a bit naive. Had a bit of Fry grafted onto herself for a while. Also had a thing with Bender. And Zapp. Easy going, but doesn’t do well in difficult situations, falls over easily.\nBender is Shell. Fry is Perl. If you care at all for his reasoning, you’ve already clicked through!\nDiscuss on Changelog News",
          "link": "https://www.netmeister.org/blog/futurama.html",
          "publishedOn": "2022-05-11T13:20:00.000Z",
          "wordCount": null,
          "title": "If programming languages were Futurama characters",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1581",
          "author": null,
          "description": "This week Sid Sijbrandij Co-founder and CEO of GitLab is back talking with Adam about all the details of their massive IPO last October 2021. To set the stage, this episode was recorded on Feb 1, 2022. During the show Adam mentioned they IPO’d at a $13B market cap, but they actually ended their opening day at approximately $15B. That’s a massive win for open source, GitLab, Sid, and the rest of the team. For loyal listeners you know we’ve had Sid on this show before, so of course we had to get him back on the show post-IPO to get all the details of this new journey.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not j…",
          "link": "https://changelog.com/founderstalk/89",
          "publishedOn": "2022-05-10T20:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 89: Leading GitLab to IPO",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/89/founders-talk-89.mp3",
            "length": "67996611",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pkPL",
          "author": "Jerod Santo",
          "description": "Josh Stella:\nFor those who haven’t used Emacs, it’s something you’ll likely hate, but may love. It’s sort of a Rube Goldberg machine the size of a house that, at first glance, performs all the functions of a toaster. That hardly sounds like an endorsement, but the key phrase is “at first glance.” Once you grok Emacs, you realize that it’s a thermonuclear toaster that can also serve as the engine for… well, just about anything you want to do with text.\nDiscuss on Changelog News",
          "link": "https://www.fugue.co/blog/2015-11-11-guide-to-emacs.html",
          "publishedOn": "2022-05-10T15:51:00.000Z",
          "wordCount": null,
          "title": "A CEO's guide to Emacs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/j57b",
          "author": "Jerod Santo",
          "description": "Interesting findings by Melanie S. Brucks and Jonathan Levav:\nAccording to new research one important skill is impacted by the restrictions of video calls: creativity. But why is idea generation negatively affected? And could other skills actually benefit from virtual communication?\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=_SK4mcTid10",
          "publishedOn": "2022-05-10T15:01:00.000Z",
          "wordCount": null,
          "title": "Why video calls are bad for brainstorming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3jk",
          "author": "Jerod Santo",
          "description": "Big news from our friends at Hugging Face:\nHugging Face is now the fastest growing community & most used platform for machine learning! With 100,000 pre-trained models & 10,000 datasets hosted on the platform for NLP, computer vision, speech, time-series, biology, reinforcement learning, chemistry and more, the Hugging Face Hub has become the Home of Machine Learning to create, collaborate, and deploy state-of-the-art models.\nWhat will they spend the money on? Good stuff:\nThanks to the new funding, we’ll be doubling down on research, open-source, products and responsible democratization of AI.\nDiscuss on Changelog News",
          "link": "https://huggingface.co/blog/series-c",
          "publishedOn": "2022-05-09T16:45:00.000Z",
          "wordCount": null,
          "title": "Hugging Face raised $100 million for open/collaborative machine learning",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJWQ",
          "author": "Jerod Santo",
          "description": "Lots of cool stuff for Markdown authors in April’s VS Code release. Namely:\ndrag and drop files into the editor to create a Markdown link\nfind all references to header|links|files|urls inside of Markdown\nrename headers|links inside Markdown (and propagate the changes)\nrename Markdown files (and propagate to all references)\nThe Dendron team is excited because their primary vault hosts over 400k lines of Markdown 🤯\nVS Code, and IDEs more broadly, help developers manage large code bases by making available tools to leverage and manipulate the syntax of programming languages. By shifting some of this tooling to markdown, can we do the same for large Markdown repositories?\nDiscuss on Changelog News",
          "link": "https://blog.dendron.so/notes/upyp4ow9fkpwvu50n8wsvnp/",
          "publishedOn": "2022-05-09T15:52:00.000Z",
          "wordCount": null,
          "title": "VS Code's major Markdown tooling upgrade",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/maR3",
          "author": "Jerod Santo",
          "description": "Gui Heurich on one of the legends of the Ruby community, _why the lucky stiff.\nThrough the things that he built, the way he performed, and the books that he wrote, _why makes us think about code and also about ourselves. It makes us think about ourselves as programmers. In a sense, _why was the meta-programmer, the one that generates other programmers by promoting reflexivity.\nDiscuss on Changelog News",
          "link": "http://code-anth.xyz/posts/3",
          "publishedOn": "2022-05-09T15:01:00.000Z",
          "wordCount": null,
          "title": "Chunky Bacon",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykQo",
          "author": "Jerod Santo",
          "description": "I’ve long been fascinated by literate programming (the art of writing code as if it was a novel), but it’s been awhile since I’ve seen a good example of in practice. Here’s a good one:\nI wanted to showcase the BDD-inspired low-tech solution I came up with via a toy project, demonstrating a small but significant programming task, broken down as series of design-implementation cycles.\nWordle is a perfect target: it’s a small codebase, with a half dozen features to string together into a useable game.\nThis story has five chapters and a satisfying conclusion:\nThis project was my first foray into literate programming at this scale, an attempt to bring together all the good ideas of TDD, modern Python development, Gherkin usage for requirements traceability purposes (without overly zealous extremes of Cucumber automation). All these ideas were until now scattered, implemented each without the others in different places, and this project fuses them into something I hope is more valuable than the sum of its parts.\nDiscuss on Changelog News",
          "link": "https://jiby.tech/project/literate_wordle/wordle.html",
          "publishedOn": "2022-05-09T14:10:00.000Z",
          "wordCount": null,
          "title": "Literate programming Wordle",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1615",
          "author": null,
          "description": "We’re talking with Woody Zuill today about all things Mob Programming. Woody leads Mob Programming workshops, he’s a speaker on agile related topics, and coaches and guides orgs interested in creating an environment where people can do their best work. We talk through it all and we even get some amazing advice from Woody’s dad. We define what Mob Programming is and why it’s so effective. Is it a rigid process or can teams flex to make it work for them? How to introduce mob programming to a team. What kind of groundwork is necessary? And of course, are mob programming’s virtues diminished by remote teams in virtual-only settings?\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the plat…",
          "link": "https://changelog.com/podcast/488",
          "publishedOn": "2022-05-06T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 488: Mob programming deep dive",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/488/the-changelog-488.mp3",
            "length": "84161420",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNwO",
          "author": "Jerod Santo",
          "description": "Duplicates taking up tons of space on your home NAS? fclones quickly identifies duplicates, even when there’s 10s of thousands that you’re scanning over the network:\nfclones treats your data seriously. You can inspect and modify the list of duplicate files before removing them. There is also a –dry-run option that can tell you exactly what changes on the file system would be made.\nAlso check out the algorithm used to detect duplicates.\nDiscuss on Changelog News",
          "link": "https://github.com/pkolaczk/fclones",
          "publishedOn": "2022-05-06T18:04:00.000Z",
          "wordCount": null,
          "title": "fclones – an efficient duplicate file finder and remover",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1635",
          "author": null,
          "description": "Let the debate begin (again)! This time we’re arguing whether or not single-page apps were a big mistake. This premise was inspired by Chris Ferdinandi’s SPAs were a mistake post.\nDivya & Nick represent Team Yep and KBall goes solo on Team Nope. Jerod, as per our usual arrangement, is on Team Winner.\nDiscuss on Changelog News\nChangelog++ members get a bonus 6 minutes at the end of this episode and zero ads. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFeaturing\nJerod Santo – Twitter, GitHub\nDivya – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSPAs were a mistake\nHolla! RemixConf May 24-25\nPrevious YepNope debates:\nShould websites work without JS?\nIs modern JS tooling too complicated?\nShould we rebrand JavaScript?\nAre web apps fundamentally different than web sites?\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/224",
          "publishedOn": "2022-05-06T16:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 224: Were SPAs a big mistake?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/224/js-party-224.mp3",
            "length": "54382759",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/q0ae",
          "author": "Jerod Santo",
          "description": "Andraž Bajt:\nBasic premise is: browsers are great at navigating pages, let’s leverage that by serving users directly with HTML. This already gives you half-decent pages but you can go further and sprinkle on some sugar. A bit of JS. Instead of reinventing the world in JS let’s try to really use what modern browsers provide natively and then push just a bit forward.\nIs the pendulum starting to swing away from SPAs/client-side rendering and back toward MPAs/server-side rendering? Will we ever find balance somewhere in the middle?\nDiscuss on Changelog News",
          "link": "https://edofic.com/posts/2022-01-28-low-js/",
          "publishedOn": "2022-05-06T14:10:00.000Z",
          "wordCount": null,
          "title": "How i fell in love with low-js",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1602",
          "author": null,
          "description": "Can Go help you write faster PHP apps? In this episode, we explore the unusual pairing of Go and PHP that led to the RoadRunner project, a high-performance PHP application server, load-balancer, and process manager that is all written in Go.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.io\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFlatfile – Data import is broken. We fixed it. Flatfile’s powerful out-of-the-box solution takes the data import burden off your shoulders, freeing you to solve bigger business problems and build products that people love.\n\n    \nFeaturing\nValery Piashchynski – Twitter, GitHub\nAnton Titov – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nRoadRunner website\nRoadRunner on GitHub\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/228",
          "publishedOn": "2022-05-05T22:10:00.000Z",
          "wordCount": null,
          "title": "Go Time 228: Go and PHP sitting in a tree...",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/228/go-time-228.mp3",
            "length": "54436352",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ykQe",
          "author": "Jerod Santo",
          "description": "Mike Hanley on GitHub’s blog:\nThe software supply chain starts with the developer. Developer accounts are frequent targets for social engineering and account takeover, and protecting developers from these types of attacks is the first and most critical step toward securing the supply chain…\nToday, as part of a platform-wide effort to secure the software ecosystem through improving account security, we’re announcing that GitHub will require all users who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023.\nThis is a big step in the right direction and their new(ish) 2FA for GitHub Mobile feature helps make the burden not as cumbersome as it might be otherwise.\nDiscuss on Changelog News",
          "link": "https://github.blog/2022-05-04-software-security-starts-with-the-developer-securing-developer-accounts-with-2fa/",
          "publishedOn": "2022-05-05T20:03:00.000Z",
          "wordCount": null,
          "title": "GitHub will require 2FA by the end of 2023",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zgnn",
          "author": "Jerod Santo",
          "description": "Some years back I applied to join IBM’s grad scheme, there was a peculiar stage to the process I’ve not seen elsewhere. It was during the onsite day, where a batch of 20 or so applicants were put through various tests in an IBM office. They called it the “group test”; around 8 of us were led to a room and asked to solve a puzzle together.\nYou can probably see where this story is headed… (see also)\nDiscuss on Changelog News",
          "link": "https://johnpublic.mataroa.blog/blog/the-asshole-test/",
          "publishedOn": "2022-05-05T16:43:00.000Z",
          "wordCount": null,
          "title": "IBM's jerk test",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8Od6",
          "author": "Jerod Santo",
          "description": "Let’s say you’re on the go and you land on a particularly impressive website. You’d love to peak underneath the covers, but getting at the developer tools on a phone is a pain.\nInstead: bookmark this site, copy/paste the URL, and voilá! 💁‍♀️\nDiscuss on Changelog News",
          "link": "https://neatnik.net/view-source/",
          "publishedOn": "2022-05-05T15:56:00.000Z",
          "wordCount": null,
          "title": "A tool to quickly \"view source\" from your mobile phone",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1645",
          "author": null,
          "description": "This week Peer Richelsen, Co-Founder and Co-CEO of Cal.com, joins the show to talk about building the “Stripe for Time” — with a grand mission to connect a billion people by 2031 through calendar scheduling. Cal has grown from an open-source side project to one of the fastest-growing commercial open source companies. We get into all the details — what it means to be an open source Calendly alternative, how they quantify connecting a Billion people by 2031, where there’s room for innovation in the scheduling space, and why being community first is part of their secret sauce.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nWorkOS – A platform that gives developers a set of building blocks for quickly addin…",
          "link": "https://changelog.com/founderstalk/88",
          "publishedOn": "2022-05-05T15:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 88: Making an open source Stripe for time",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/88/founders-talk-88.mp3",
            "length": "83886982",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/P5Qr",
          "author": "Jerod Santo",
          "description": "Bonnie I-Man Ng:\nI was working on bioinformatics a few years ago and was amazed by those single-word bash commands which are much faster than my dull scripts, time saved through learning command-line shortcuts and scripting.\nRecent years I am working on cloud computing and I keep recording those useful commands here. Not all of them is oneliner, but I put effort on making them brief and swift. I am mainly using Ubuntu, Amazon Linux, RedHat, Linux Mint, Mac and CentOS, sorry if the commands don’t work on your system.\nDiscuss on Changelog News",
          "link": "https://github.com/onceupon/Bash-Oneliner",
          "publishedOn": "2022-05-04T17:15:00.000Z",
          "wordCount": null,
          "title": "A collection of handy bash one-liners",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1629",
          "author": null,
          "description": "Today we talk to Mark Ericksen about all the things that we could be doing on the new platform - this is a follow-up to episode 50.\nMark specialises in Elixir, he hosts the Thinking Elixir podcast, and he also helps make Fly.io the best place to run Phoenix apps, such as changelog.com. In the interest of holding our new platform right, we thought that it would be a great idea to talk to someone that does this all day, every day, for many years now.\nWe touch up on how to run database migrations safely, and how to upgrade our application config to the latest Phoenix version. We also talked about some of the more advanced platform features that we may want to start leveraging, like the multi-region PostgreSQL.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode becaus…",
          "link": "https://changelog.com/shipit/51",
          "publishedOn": "2022-05-04T15:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 51: From Kubernetes to PaaS - now what?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/51/ship-it-51.mp3",
            "length": "56565033",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/3Yp6",
          "author": "Jerod Santo",
          "description": "The coolest thing about this story is that the entire endeavor was apparently prompted by a random developer tweet! If you’ve ever wondered what all goes in to opening the source of historic software products like this one:\nThis code was restored from the Microsoft corporate archives and cleared for release.\nDeveloper names and aliases were removed, with the exception of current employees who worked on the original release who consented to keeping their names in place\nThe archive consisted of several CDs, some of which were for alternate builds or products, and have been excluded\nThe code does not build with today’s engineering tools, and is released as-is.\n\nDiscuss on Changelog News",
          "link": "https://github.com/microsoft/Microsoft-3D-Movie-Maker",
          "publishedOn": "2022-05-04T14:40:00.000Z",
          "wordCount": null,
          "title": "Party like it's 1995! Microsoft 3D Movie Maker is open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7368",
          "author": "Jerod Santo",
          "description": "An in-progress list of things you might feel like saying attached to things you should probably say instead. For instance, you’re thinking, “Do your job!” But it’s probably more beneficial to say:\nIt is my understanding that you are the appropriate person to contact in regards to this. But If there’s is someone better equipped for this let me know.\nYou can also flip the list to translate what you are being told by someone from what they actually mean.\nDiscuss on Changelog News",
          "link": "https://howtoprofessionallysay.akashrajpurohit.com/",
          "publishedOn": "2022-05-04T13:53:00.000Z",
          "wordCount": null,
          "title": "A guide for your daily \"professional\" interactions",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JL2r",
          "author": "Dmitry Tsepelev",
          "description": "Most Ruby engineers know the difference between symbols and strings from a usage perspective. So, in this article I look at them from a different angle.\nYou’ll learn about a cool compiler optimization called “string interning”, which is used in many languages. Also, you will understand what happens when (almost any) interpreter runs your code, take a look at the AST and take a peak at the symbols interpretation at the low level.\nDiscuss on Changelog News",
          "link": "https://dmitrytsepelev.dev/why-has-ruby-symbols",
          "publishedOn": "2022-05-03T21:32:00.000Z",
          "wordCount": null,
          "title": "Why Ruby has symbols",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/DzRr",
          "author": "Jerod Santo",
          "description": "GitLab’s Sid Sijbrandij shares 12 strategies managers can use to support their team and prevent burnout. One of his standout strategies that I doubt rarely gets put into use is reduce the number of hours worked by agreeing to reduce effort\nDiscuss on Changelog News",
          "link": "https://about.gitlab.com/blog/2022/05/03/preventing-burnout-a-managers-toolkit/",
          "publishedOn": "2022-05-03T20:43:00.000Z",
          "wordCount": null,
          "title": "Preventing burnout: a manager's toolkit",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1642",
          "author": null,
          "description": "AI is discovering new drugs. Sound like science fiction? Not at Absci! Sean and Joshua join us to discuss their AI-driven pipeline for drug discovery. We discuss the tech along with how it might change how we think about healthcare at the most fundamental level.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n    \nFeaturing\nSean McClain – Twitter, LinkedIn\nJoshua Meier – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nView Absci’s AI Lead Scientist Joshua Meier’s presentation at NVIDIA GTC 2022\nLearn more about Absci’s machine learning breakthroughs presented at GTC\nLearn more about Absci AI Research (AAIR) Lab\nView career opportunities at Absci\nAbsci AI drug discovery technology\nWatch the Truist AI Symposium Podcast to get help demystifying the use of AI in drug discovery\nAbsci website\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/177",
          "publishedOn": "2022-05-03T17:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 177: Learning the language of life",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/177/practical-ai-177.mp3",
            "length": "46787692",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/gdDl",
          "author": "Jerod Santo",
          "description": "Train and deploy industry-standard or completely custom machine learning models, directly powered by your business data, into your production stack, with an open source Postgres extension.\nIs there anything Postgres can’t do?! 😉\nDiscuss on Changelog News",
          "link": "https://postgresml.org/",
          "publishedOn": "2022-05-03T15:00:00.000Z",
          "wordCount": null,
          "title": "An end-to-end machine learning solution for Postgres",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/wknG",
          "author": "Jerod Santo",
          "description": "Josh Comeau writing for Smashing Mag:\nDevelopers often reach for UI frameworks like Bootstrap or Material UI, hoping that they’ll save a bunch of time and quickly build a professional-looking app. Unfortunately, things rarely work out this way. Let’s talk about it.\nStick around for the rebuttals section, too.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/05/you-dont-need-ui-framework/",
          "publishedOn": "2022-05-03T14:14:00.000Z",
          "wordCount": null,
          "title": "You don't need a UI framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Gb5W",
          "author": "Samrose",
          "description": "As it gets easier and easier to deploy to the cloud, and with increased concern about data sovereignty, regional architectures are becoming more common. This article gives you an overview of how we easily maintain our regional services on AWS at Apptrail.\nDiscuss on Changelog News",
          "link": "https://apptrail.com/blog/2022/03/09/regional-cloud-architecture",
          "publishedOn": "2022-05-02T17:21:00.000Z",
          "wordCount": null,
          "title": "How we build a fully regional cloud architecture on AWS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/53lr",
          "author": "Jerod Santo",
          "description": "OpenAI’s new SOTA text-to-image neural network is producing some “insane results”. The linked repo is an open source implementation of the same technique.\n\nDiscuss on Changelog News",
          "link": "https://github.com/lucidrains/DALLE2-pytorch",
          "publishedOn": "2022-05-02T16:33:00.000Z",
          "wordCount": null,
          "title": "OpenAI's DALL-E 2 implemented in Pytorch",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pkAg",
          "author": "Chris Krycho",
          "description": "Since TypeScript doesn’t follow SemVer itself, TS libraries which do want to follow SemVer need both high-level guidance about how to do that and detailed analysis of the corner cases to watch out for as well as ways to mitigate breaking changes from TS.\nThis doc is a (beta!) specification of SemVer for managing changes to TypeScript types, including when the TS compiler makes breaking changes in its type-checking and type emit across a “minor” release.\nDiscuss on Changelog News",
          "link": "https://www.semver-ts.org",
          "publishedOn": "2022-05-02T15:43:00.000Z",
          "wordCount": null,
          "title": "Semantic Versioning for TypeScript Types",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9OEm",
          "author": "Shekhar Gulati",
          "description": "In this post, I will talk about important factors you should consider when architecting systems that are powered by third-party systems. The factors I detail are:\ndeployment model\ntechnology coherence\nNFRs and SLAs\nInfrastructure and hardware needs\nAPI style and documentation\nIdempotent APIs\nGetting data out of the third party provider\nCommunity\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/02/16/factors-to-consider-when-architecting-systems-on-top-of-third-party-systems/",
          "publishedOn": "2022-04-29T21:39:00.000Z",
          "wordCount": null,
          "title": "Factors to consider when architecting systems that uses third-party systems",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQeG",
          "author": "Jerod Santo",
          "description": "Spacedrive helps you organize your files across many devices in one place. Here’s the motivation:\nMany of us have multiple cloud accounts, drives that aren’t backed up and data at risk of loss. We depend on cloud services like Google Photos and iCloud, but are locked in with limited capacity and almost zero interoperability between services and operating systems. Photo albums shouldn’t be stuck in a device ecosystem, or harvested for advertising data. They should be OS agnostic, permanent and personally owned. Data we create is our legacy, that will long outlive us—open source technology is the only way to ensure we retain absolute control over the data that defines our lives, at unlimited scale.\n\nDiscuss on Changelog News",
          "link": "https://github.com/spacedriveapp/spacedrive",
          "publishedOn": "2022-04-29T20:53:00.000Z",
          "wordCount": null,
          "title": "A cross-platform file explorer powered by a virtual distributed filesystem",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3W1",
          "author": "Jerod Santo",
          "description": "This is alpha software, but it seems pretty low risk to give it a try.\nWireit works with npm run, it doesn’t replace it. To configure an NPM script for Wireit, move the command into a new wireit section of your package.json, and replace the original script with the wireit command.\nNow when you run npm run build, Wireit upgrades the script to be smarter and more efficient.\nDiscuss on Changelog News",
          "link": "https://github.com/google/wireit",
          "publishedOn": "2022-04-29T18:23:00.000Z",
          "wordCount": null,
          "title": "Wireit upgrades your npm scripts to make them smarter and more efficient",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1639",
          "author": null,
          "description": "Nick rewrote our JS Danger game board app from Dojo to React for his talk at React Global Online Summit about componentizing application state with React and XState.\nOn this episode Jerod, KBall, and Feross chat with Nick about the entire process and what he learned along the way. Oh, we also play an epic round of Pro Tip Time!\nDiscuss on Changelog News\nChangelog++ members get a bonus 8 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nJerod Santo – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nFeross Aboukhadijeh – Twitter, GitHub, Website\nNotes and Links\nNick’s talk at React Global Online Summit\nOur Quiz Game repo on GitHub\nJS Party #191 on XState\nDon’t check in broken code\nConventional Comments\nEverything Everywhere All at Once\nElon Musk is buying Twitter. I’m buying JavaScript.\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/223",
          "publishedOn": "2022-04-29T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 223: Nick's big rewrite",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/223/js-party-223.mp3",
            "length": "49274899",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/q0Pe",
          "author": "Jerod Santo",
          "description": "This post by Chris de la Iglesia starts off very down on blockchains, but ends up not so down after all:\nWe are entering a new world with a new focus on giving users control over their data, their identity, and their systems. We are building distributed filesystems, distributed identity, and yes, blockchains. I think oftentimes we end up seeing only the blockchain technology due to the headlines and the financial investment, but distributed systems as a whole are taking off in a big, big way.\nDiscuss on Changelog News",
          "link": "https://cmdli.dev/blog/blockchain/",
          "publishedOn": "2022-04-29T13:59:00.000Z",
          "wordCount": null,
          "title": "Let's talk about blockchains",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1612",
          "author": null,
          "description": "Matan Peled from Technion University joins Natalie & Mat to discuss his PhD research on meta programming and static analyzers. How does Go’s measure up? What would Matan’s look like if he built one? All that and more!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity f…",
          "link": "https://changelog.com/gotime/227",
          "publishedOn": "2022-04-28T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 227: Analyzing static analysis",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/227/go-time-227.mp3",
            "length": "56470660",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Q5Yy",
          "author": "Jerod Santo",
          "description": "The second jq alternative we’ve discovered this week! (first here)\njq is hard to use. There are alternatives like fq and zq, but they still make you learn a new programming language. Im tired of learning new programming languages.\ngq is not optimized for speed, flexibility or beauty. gq is optimized for minimal learning/quick usage. gq understands that you don’t use it constantly, you use it once a month and then forget about it. So when you come back to it, gq will be easy to relearn. Just use the builtin library just like you would any other go project and you’re done. No unfamiliar syntax or operations, or surprising limits. Thats it.\nI don’t know if Go is a great fit for this use-case, but if you already know it well… makes sense.\nDiscuss on Changelog News",
          "link": "https://github.com/hherman1/gq",
          "publishedOn": "2022-04-28T14:03:00.000Z",
          "wordCount": null,
          "title": "jq but using Go instead",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zgyn",
          "author": "Jerod Santo",
          "description": "I used scare quotes around “whole life” because those are his words and surely there’s a lot more to life than things you can quantify, but still: this is interesting\nBack in 2019, I started collecting all kinds of metrics about my life. Every single day for the last 2.5 years I tracked over 100 different data types - ranging from fitness & nutrition to social life, computer usage and weather.\nThis data produces 44 graphs that are all shared publicly on the website.\n\nDiscuss on Changelog News",
          "link": "https://howisfelix.today/",
          "publishedOn": "2022-04-28T13:13:00.000Z",
          "wordCount": null,
          "title": "Felix Krause put his \"whole life\" into a single database",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1628",
          "author": null,
          "description": "This is our 5th Kaizen where we talk about the next improvement to changelog.com: we are now running on fly.io and our PostgreSQL is managed. This is a migration that many were curious about, including Simey de Klerk, the person that requested this episode.\nAfter migrating all our media files to AWS S3 (check episode 40), we thought that this part was going to be easy. Plan met reality. Pull request 407 has all the details.\nWe want to emphasise the type of partner relationships that we seek at Changelog & why they are important to us, as well as to our listeners. Honeycomb & Fly embody the principles that we care about, and Gerhard thinks that we are currently missing a Kubernetes partner.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ad…",
          "link": "https://changelog.com/shipit/50",
          "publishedOn": "2022-04-27T16:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 50: Kaizen! We are flying ✈️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/50/ship-it-50.mp3",
            "length": "65607074",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/YNYP",
          "author": "Jerod Santo",
          "description": "If you’ve found the (excellent) jq tool for working with JSON a bit unwieldy… check out zq and see if you like its API any better. I wouldn’t put too much weight on the faster aspect, though:\nWe will cover zq’s performance in a future article, but to cut to the chase here, zq is almost always at least a bit faster than jq when processing JSON inputs\nAlmost always at least a bit faster is not something you’re likely to notice in practice.\nDiscuss on Changelog News",
          "link": "https://www.brimdata.io/blog/introducing-zq/",
          "publishedOn": "2022-04-27T15:20:00.000Z",
          "wordCount": null,
          "title": "Introducing zq: an easier (and faster) alternative to jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/o9Y8",
          "author": "Jerod Santo",
          "description": "A solid rant by Terence Eden, who has to use macOS for work but would rather not:\nI know you’re going to be tempted to reply with “you’re using it wrong” - but I’m not. This is how I like to use my computer. And it is clear that the MacBook isn’t my computer - it is Apple’s. (OK, OK! It belongs to my employer!)\nSome of his grievances like window snapping and moving/removing UI elements can be alleviated with 3rd-party solutions, but he’s not wrong that the operating system doesn’t provide these features.\nDiscuss on Changelog News",
          "link": "https://shkspr.mobi/blog/2020/04/things-i-cant-do-on-macos-which-i-can-do-on-ubuntu/",
          "publishedOn": "2022-04-27T14:28:00.000Z",
          "wordCount": null,
          "title": "Things I can’t do on macOS which I can do on Ubuntu",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MdM6",
          "author": "Jerod Santo",
          "description": "Mihai Parparita:\nIt’s a golden age of emulation. Between increasing CPU power, WebAssembly, and retrocomputing being so popular The New York Times is covering it, it’s never been easier to relive your 80s / 90s / 2000s nostalgia. Projects like v86 make it easy to run your chosen old operating system in the browser. My heritage being of the classic Mac line, I was curious what the easiest to use emulation option was in the modern era…\nHere’s a video demo of what resulted: a full-featured classic 68K Mac in your browser.\nDiscuss on Changelog News",
          "link": "https://blog.persistent.info/2022/03/blog-post.html",
          "publishedOn": "2022-04-27T13:41:00.000Z",
          "wordCount": null,
          "title": "Infinite Mac: an instant-booting Quadra in your browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1627",
          "author": null,
          "description": "Today we’re talking with Zach Lloyd, founder of Warp — the terminal being re-imagined for the 21st century and beyond. Warp is a blazingly fast, rust-based terminal that’s being designed from the ground up to work like a modern app. We get into all the details — why now is the right time to re-invent the terminal, where they got started, the business they aim to build around Warp, what it’s going to take to gain adoption and grow, but more importantly — what’s Warp like today to get developers excited and give it a try.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry …",
          "link": "https://changelog.com/podcast/487",
          "publishedOn": "2022-04-26T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 487: Warp wants to be the terminal of the future",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/487/the-changelog-487.mp3",
            "length": "71844559",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1640",
          "author": null,
          "description": "We all hear a lot about MLOps these days, but where does MLOps end and DevOps begin? Our friend Luis from OctoML joins us in this episode to discuss treating AI/ML models as regular software components (once they are trained and ready for deployment). We get into topics including optimization on various kinds of hardware and deployment of models at the edge.\nDiscuss on Changelog News\nChangelog++ members get a bonus 0 minutes at the end of this episode and zero ads. Join today!\nSponsors\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nLuis Ceze – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nOctoML\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/176",
          "publishedOn": "2022-04-26T14:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 176: MLOps is NOT Real",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/176/practical-ai-176.mp3",
            "length": "44741317",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/RRYM",
          "author": "Jerod Santo",
          "description": "Eric Jang was recently on the job market (finally landing at [Halodi Robotics])(https://halodi.com/) and in this post he shares his process and view of the job market today. He also has some insights on where it’s headed. In brief:\nIn the future, every successful tech company will use their data moats to build some variant of an Artificial General Intelligence.\nDiscuss on Changelog News",
          "link": "https://evjang.com/2022/04/25/rome.html",
          "publishedOn": "2022-04-26T13:20:01.000Z",
          "wordCount": null,
          "title": "The machine learning job market in 2022",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3Yj6",
          "author": "Jerod Santo",
          "description": "And if you like Alpine, there’s a companion collection of snippets that you can copy/paste into your project.\nDiscuss on Changelog News",
          "link": "https://www.hyperui.dev/",
          "publishedOn": "2022-04-26T12:35:00.000Z",
          "wordCount": null,
          "title": "A collection of free Tailwind CSS components",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2YN",
          "author": "Jerod Santo",
          "description": "A nice little web-based tool to help you quickly/visually grok some JSON data you’re working with. I tested it on some game data from an old JS Danger episode, and it handled it pretty well.\n\nDiscuss on Changelog News",
          "link": "https://jsonvisio.com/",
          "publishedOn": "2022-04-25T15:14:00.000Z",
          "wordCount": null,
          "title": "Visualize your JSON with interactive graphs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13Ln",
          "author": "Jerod Santo",
          "description": "Still in beta, but Fleet has a lot of promise. It boasts compile times up to 5x faster than cargo. Here’s how:\nFleet works by optimizing your builds using existing tooling available in the Rust ecosystem, including seamlessly integrating sccache, lld, zld, ramdisks (for those using WSL or HDD’s) et al.\nDiscuss on Changelog News",
          "link": "https://github.com/dimensionhq/fleet",
          "publishedOn": "2022-04-25T14:26:00.000Z",
          "wordCount": null,
          "title": "A blazing fast build tool for Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1608",
          "author": null,
          "description": "Frank Krueger joined us to talk about solving hard problems. Earlier this year he wrote a blog post titled “Practical Guide to Solving Hard Problems,” and a lot of what he had to say really resonated with us. The premise is simple — if you have to write some code that you’re just not sure how to write…what do you do? What are the practical steps that you can take when you’re feeling stumped? Today’s show goes deep on that subject…practical ways to solve hard problems and ship your best work.\nFrank has his own podcast called Merge Conflict — check it out at mergeconflict.fm.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry.…",
          "link": "https://changelog.com/podcast/486",
          "publishedOn": "2022-04-22T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 486: Practical ways to solve hard problems",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/486/the-changelog-486.mp3",
            "length": "72806695",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1634",
          "author": null,
          "description": "Daniel Rosenwasser and Ryan Cavanaugh from the TypeScript team at Microsoft join Nick and Boneskull to catch us up on the latest happening with the TypeScript project, including what’s exciting in the new 4.7 beta release. Then, we dive deep into the new, TC-39 stage 1 Type Annotations proposal, what it is, and what it means for the future of a not really typed JavaScript!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFeaturing\nDaniel Rosenwasser – Twitter, GitHub\nRyan Cavanaugh – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\nTypeScript 4.7 beta announcement\nType Annotations proposal (Stage 1)\nType checking JavaScript files\nUnderstanding the TypeScript compiler\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/222",
          "publishedOn": "2022-04-22T16:10:00.000Z",
          "wordCount": null,
          "title": "JS Party 222: The Type Annotations proposal",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/222/js-party-222.mp3",
            "length": "64545467",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/wkzG",
          "author": "Jerod Santo",
          "description": "Let’s be honest: The current generation of robotic lawn mowers sucks. Basically all of these bots drive in a random direction until they hit the border of the lawn, rotate for a randomized duration and repeat. I think we can do better!\nTherefore, we have disassembled the cheapest off-the-shelf robotic mower we could find (YardForce Classic 500) and were surprised that the hardware itself is actually quite decent.\nThe bot itself is surprisingly high quality and doesn’t need to be changed at all. We just need some better software in there.\nHere’s an overview video that explains the entire idea.\nDiscuss on Changelog News",
          "link": "https://github.com/ClemensElflein/OpenMower",
          "publishedOn": "2022-04-22T14:52:00.000Z",
          "wordCount": null,
          "title": "OpenMower – a DIY smart mowing robot for everyone",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6OlQ",
          "author": "Jerod Santo",
          "description": "Nice to see some efforts around standardizing MLOps. Here’s their high-level selling points:\n📦 Docker containers without the pain\n🤬️ No more CUDA hell\n✅ Define the inputs and outputs for your model with standard Python\n🎁Automatic HTTP prediction server\n🥞 Automatic queue worker\n☁️ Cloud storage\n🚀 Ready for production\nDiscuss on Changelog News",
          "link": "https://github.com/replicate/cog",
          "publishedOn": "2022-04-22T14:06:00.000Z",
          "wordCount": null,
          "title": "Containers for machine learning",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1618",
          "author": null,
          "description": "Björn Rabenstein & Bartlomiej Płotka join Mat & Johnny to discuss observability, monitoring and instrumentation for gophers.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFlatfile – Data import is broken. We fixed it. Flatfile’s powerful out-of-the-box solution takes the data import burden off your shoulders, freeing you to solve bigger business problems and build products that people love.\n\n    \nFeaturing\nBjörn Rabenstein – GitHub\nBartlomiej Płotka – Twitter, GitHub, LinkedIn, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nPrometheus\nGo’s client library for Prometheus\nBjörn’s talk at Gophercon UK\nOpen Telemetry\nGrafana’s Big Tent\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/226",
          "publishedOn": "2022-04-21T19:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 226: Instrumentation for gophers",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/226/go-time-226.mp3",
            "length": "57972390",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNj7",
          "author": "Martin Heinz",
          "description": "With the recent events relating to Google Analytics platform, it’s becoming very clear that the time has come for many of us to migrate from Google Analytics to different platforms.\nIn this article we will go over both the “Why?”, so that you can make an informed decision whether you need to migrate of not, as well as the “How?” of migrating from Google Analytics - that is, quickly and easily taking your data and moving to different analytics platform without too much hassle.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/71",
          "publishedOn": "2022-04-21T14:39:00.000Z",
          "wordCount": null,
          "title": "Why and how you should leave Google Analytics",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03Ng",
          "author": "Jerod Santo",
          "description": "From the engineering team at Bloomberg:\nIt can track memory allocations in Python code, in native extension modules, and in the Python interpreter itself. It can generate several different types of reports to help you analyze the captured memory usage data. While commonly used as a CLI tool, it can also be used as a library to perform more fine-grained profiling tasks.\nIt has a lot of nice outputs so you can grok what’s going on.\n\nDiscuss on Changelog News",
          "link": "https://bloomberg.github.io/memray/",
          "publishedOn": "2022-04-21T13:51:00.000Z",
          "wordCount": null,
          "title": "Memray is a memory profiler for Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1591",
          "author": null,
          "description": "Alex Sims, a Senior Software Engineer at James & James, an eCommerce fulfilment company, reached out to us about the Kaizen story of the third-party logistics (3PL) platform that he has been involved with for several years now.\nThe system delivered 16 millions of orders in 10 years, and 4.5 million in the last year alone. All the numbers are going up, and there is only so much that a single PHP monolith deployed as VM images can handle. So how do you even start thinking about the architectural improvements, and inspire everyone involved to move towards better?\nWe encourage you to look at the architectural diagrams in the show notes, especially the 10 year roadmap, and ask Alex for a blog post follow-up. While today’s episode was a good conversation starter, there is a lot that we did not h…",
          "link": "https://changelog.com/shipit/49",
          "publishedOn": "2022-04-20T16:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 49: Improving an eCommerce fulfillment platform",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/49/ship-it-49.mp3",
            "length": "60460430",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W3Y1",
          "author": "Jerod Santo",
          "description": "Brave is rolling out a new feature called De-AMP, which allows Brave users to bypass Google-hosted AMP pages, and instead visit the content’s publisher directly. AMP harms users’ privacy, security and internet experience, and just as bad, AMP helps Google further monopolize and control the direction of the Web.\nThe Brave team is really doubling down on privacy and security. I don’t think that strategy would’ve won users a few years ago, but in 2022 and beyond…\nDiscuss on Changelog News",
          "link": "https://brave.com/privacy-updates/18-de-amp/",
          "publishedOn": "2022-04-20T14:51:00.000Z",
          "wordCount": null,
          "title": "Brave amps up privacy by cutting out AMP",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4EpE",
          "author": "Jerod Santo",
          "description": "Curious how OpenAI’s new DALL-E 2 manages to generate impressive artwork from short natural language prompts? This article breaks down the steps then focuses in on how it does the image generation step.\n\nDiscuss on Changelog News",
          "link": "https://www.assemblyai.com/blog/how-dall-e-2-actually-works/",
          "publishedOn": "2022-04-20T13:58:00.000Z",
          "wordCount": null,
          "title": "How DALL-E 2 actually works",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5Py",
          "author": "Jerod Santo",
          "description": "This guide by Josh Comeau is Josh doing what Josh does so well: taking complex/arcane/technical topics and making them approachable & fun for his audience.\nIt takes years of practice to become a terminal guru, but here’s the good news: we can take a shortcut. We don’t really need to know 98% of the stuff you can do with a terminal. If we focus on the most-important critical fundamentals, we should be able to become comfortable with the command line in a remarkably short amount of time. ✨\nThat’s what this blog post is all about.\nDiscuss on Changelog News",
          "link": "https://www.joshwcomeau.com/javascript/terminal-for-js-devs/",
          "publishedOn": "2022-04-19T20:25:00.000Z",
          "wordCount": null,
          "title": "The frontend developer's guide to the terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1638",
          "author": null,
          "description": "In the fourth “AI in Africa” spotlight episode, we welcome Leonida Mutuku and Godliver Owomugisha, two experts in applying advanced technology in agriculture. We had a great discussion about ending poverty, hunger, and inequality in Africa via AI innovation. The discussion touches on open data, relevant models, ethics, and more.\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 1 minutes at the end of this episode and zero ads. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nLeo Mutuku – Twitter, GitHub, LinkedIn, Website\nGodliver Owomugisha – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nJoyce Nabende – Twitter\nNotes and Links\nGodliver’s Google Scholar page\nGodliver’s academic homepage\nLocal Development Research Institute (LDRI)\nCropSpec\nOpen for Good Alliance\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/175",
          "publishedOn": "2022-04-19T19:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 175: 🌍 AI in Africa - Agriculture",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/175/practical-ai-175.mp3",
            "length": "49776049",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1631",
          "author": null,
          "description": "We’ve been using Parker Selbert’s Oban library for years and he even helped us hold it right by improving our open source implementation!\nSo, Jerod invited him Backstage to discuss the library, how we’re using it, Parker’s plan to make it financially sustainable, his “freedom number” of Oban Pro subscribers, and a bunch of other random stuff along the way. Let’s go!\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 0 minutes at the end of this episode and zero ads. Join today!\nFeaturing\nParker Selbert – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nGet Oban Web+Pro\nParker’s Oban PR on our repo\nWe discuss on Ship It! #20 (Kaizen!)\nPlausible Analytics is also open source\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/23",
          "publishedOn": "2022-04-19T14:30:00.000Z",
          "wordCount": null,
          "title": "Backstage 23: The Oban Pro",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/23/backstage-23.mp3",
            "length": "57394711",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Lp33",
          "author": "Jerod Santo",
          "description": "I thought Ali and Jen had some excellent advice in this segment of our JS Party episode on web dev for beginners, so I’m re-sharing it here in hopes that you might share it with people you know who may be stuck in the early phases of their web development path.\nI also like what I had to say (imagine that!)\nOne thing that is true about software development in general… is that it’s actually really hard. And we need to just say that. Because you’re gonna hit bumps. You’re gonna hit walls. And some people will power through those walls and other people won’t, and that’s just the way life is…\nBut I think having something real that you want to exist… having a real project that you want to see into the world helps you get through those moments.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=czO431qQY60",
          "publishedOn": "2022-04-19T13:39:00.000Z",
          "wordCount": null,
          "title": "Want to learn web development? build something real!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJzN",
          "author": "Jerod Santo",
          "description": "Supabase CTO Ant Wilson walks through the pros & cons of open sourcing your startup and why he believes the answer to the question in the headline is (probably) “yes”\nOpen-sourcing Supabase ended up surprising us in many ways. Many people imagine that maintaining your business in public might be burdensome - but the opposite is true. There are many unexpected upsides that have made building Supabase - the product and the company - easier.\nWhile some of this advice comes from our lens as a Dev Tools or PaaS company, most of it will apply to any software company.\nDiscuss on Changelog News",
          "link": "https://supabase.com/blog/2022/03/25/should-i-open-source-my-company",
          "publishedOn": "2022-04-18T17:15:00.000Z",
          "wordCount": null,
          "title": "Should I open source my company?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykaE",
          "author": "Jerod Santo",
          "description": "Sounds like Jacob Kaplan-Moss isn’t the only hiring manager who’s keen on the reverse code review:\nWhen hiring developers, there are many things we are looking for, but over the years I have found that raw coding ability is easily the most important quality to look for.   I can quickly train a person to have knowledge in some domain, but I’ve never seen raw coding ability come from anything other than personal commitment to extensive and deep practice.   Because of this, I have found that some methods work better than others to discover talent.\n… instead of writing code, consider instead having the candidate read existing code and talk about what it does and how it works. This offers some powerful advantages:\nThe advantages in brief:\nReading probes the most fundamental skills\nReading code is way more efficient than writing.\nReading puts candidates at ease compared to writing code.\nClick through for the details and how to put this in to practice.\nDiscuss on Changelog News",
          "link": "https://freakingrectangle.wordpress.com/2022/04/15/how-to-freaking-hire-great-developers/",
          "publishedOn": "2022-04-18T15:31:00.000Z",
          "wordCount": null,
          "title": "How to freaking find great developers by having them read code",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1619",
          "author": null,
          "description": "Rasmus Porsager created Postgres.js –the fastest full-featured PostgreSQL client for Node.js and Deno. Today he joins Jerod for a deep-dive on Postgres, why he created this open source library, and how you can use it to build pg-backed JavScript applications.\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code JSPARTY and get the team plan free for three months.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nRasmus Porsager – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nJSNation\nReact Summit\npostgres.js on GitHub\npostgres-shift\nHashQL\nHashQL Todos Sample\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/221",
          "publishedOn": "2022-04-15T19:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 221: Postgres.js",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/221/js-party-221.mp3",
            "length": "48473246",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8ObE",
          "author": "Jerod Santo",
          "description": "Lexical is an extensible JavaScript web text-editor framework with an emphasis on reliability, accessibility and performance. Lexical aims to provide a best-in-class developer experience, so you can easily prototype and build features with confidence. Combined with a highly extensible architecture, Lexical allows developers to create unique text editing experiences that scale in size and functionality.\nIt has solid React integration because Facebook, but Lexical has no dependencies and can be used and extended independent of any library or framework.\nDiscuss on Changelog News",
          "link": "https://lexical.dev/",
          "publishedOn": "2022-04-15T14:15:00.000Z",
          "wordCount": null,
          "title": "Lexical – an extensible web text editor framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5ea",
          "author": "Jerod Santo",
          "description": "A tragic tale, but one worth sharing because we can all learn from their mistake:\nDue to an unfortunate sequence of events, I accidentally made the project’s repository private for a moment. And GitHub cascade-deleted our community that took 10 years to build.\nWhoops! This reminds me of the time I thought it’d be cute to set JSPartyFM’s Twitter birth date to the day our first episode shipped, which immediately resulted in the account being suspended for being too young.\nSounds like GitHub isn’t up for restoring their stars, so if you were following HTTPie before, you’ll want to head over there and give ’em a re-star.\nDiscuss on Changelog News",
          "link": "https://httpie.io/blog/stardust",
          "publishedOn": "2022-04-15T13:27:01.000Z",
          "wordCount": null,
          "title": "How HTTPie lost 54k GitHub stars",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1622",
          "author": null,
          "description": "We often have code that’s similar between projects and we find ourselves copying that code around. In this episode we discuss what to do with this common code, how to organize it, and what code qualifies as this common code.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “Go Time” to receive an extra 5,000 video minutes.\n\n    \nFeaturing\nIan Lopshire – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nThoughts on how to structure Go code\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/225",
          "publishedOn": "2022-04-14T18:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 225: Go code organization best practices",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/225/go-time-225.mp3",
            "length": "58777387",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2512",
          "author": "Kelsey Hightower",
          "description": "What you’re about to read is a fancified excerpt from Ship It! #44. You should read the original transcript or listen to the entire conversation for more context. To set the stage, this is Kelsey’s response to Gerhard asking what the biggest takeaway should be from their conversation.\nThe reason we find ourselves as practitioners (as an industry as a whole) constantly migrating between different platforms, journeys, and digital transformations…\nWe do this because I don’t think we ever understood the fundamentals.\nThe fundamentals are very clear. If you’re thinking about application delivery, for example, we know what the fundamentals are.\nIdeally, we’re versioning the source code we write, and using tools that enable us to build and package applications in a reproducible way. 15 years ago …",
          "link": "https://changelog.com/posts/automation-is-the-serialization-of-understanding",
          "publishedOn": "2022-04-14T17:05:22.000Z",
          "wordCount": null,
          "title": "Automation is the serialization of understanding",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P5AE",
          "author": "Jerod Santo",
          "description": "Gergely Orosz did an excellent job detailing the ins & outs of Atlassian’s epic outage:\nHundreds of companies have no access to JIRA, Confluence and OpsGenie. What can engineering teams learn from the poor handling of this outage?\nThe TL;DR on the cause of the outage is a script that was supposed to “mark for deletion” some records also had “permanently delete” functionality and was run against a wrong list of IDs, improperly deleting 400 of their customers. Oh, and their backup restore process is really good at doing all customers, but not a subset. Ruh roh!\nLots to learn here, and Gergely puts a fine point on the biggest takeaways. A must-read!\nDiscuss on Changelog News",
          "link": "https://newsletter.pragmaticengineer.com/p/scoop-atlassian",
          "publishedOn": "2022-04-14T15:12:00.000Z",
          "wordCount": null,
          "title": "Inside the longest Atlassian outage of all time",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Aade",
          "author": "Jerod Santo",
          "description": "Adam Chalmers:\nOver the last few weeks I built my own DNS client. Mostly because I thought dig was kinda clunky. Partly because I wanted to learn more about DNS. So here’s how I built it, and how you can build your own too. It’s a great weekend project, and I learned a lot from finishing it.\nDNS is simple enough that you can grok it quickly, but still complex enough that Adam learned a ton along the way: reading RFCs, network sockets, Bitvec, and more.\nDiscuss on Changelog News",
          "link": "https://blog.adamchalmers.com/making-a-dns-client/",
          "publishedOn": "2022-04-14T14:26:00.000Z",
          "wordCount": null,
          "title": "What I learned from making a DNS client in Rust",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/commabody/",
          "author": null,
          "description": "At comma, our mission is:",
          "link": "https://blog.comma.ai/commabody/",
          "publishedOn": "2022-05-04T00:00:00.000Z",
          "wordCount": 947,
          "title": "Launching the comma body"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/products/search/monk-skin-tone-scale/",
          "author": null,
          "description": "Seeing yourself reflected in the world around you — in real life, media or online — is so important. And we know that challenges with image-based technologies and representation on the web have historically left people of color feeling overlooked and misrepresented. Last year, we announced Real Tone for Pixel, which is just one example of our efforts to improve representation of diverse skin tones across Google products.\nToday, we're introducing a next step in our commitment to image equity and improving representation across our products. In partnership with Harvard professor and sociologist Dr. Ellis Monk, we’re releasing a new skin tone scale designed to be more inclusive of the spectrum of skin tones we see in our society. Dr. Monk has been studying how skin tone and colorism affect pe…",
          "link": "https://blog.google/products/search/monk-skin-tone-scale/",
          "publishedOn": "2022-05-11T17:32:00.000Z",
          "wordCount": 1807,
          "title": "Improving skin tone representation across Google"
        },
        {
          "id": "https://blog.google/technology/developers/io-2022-keynote/",
          "author": null,
          "description": "[TL;DR]\nNearly 24 years ago, Google started with two graduate students, one product, and a big mission: to organize the world’s information and make it universally accessible and useful. In the decades since, we’ve been developing our technology to deliver on that mission.\nThe progress we've made is because of our years of investment in advanced technologies, from AI to the technical infrastructure that powers it all. And once a year — on my favorite day of the year :) — we share an update on how it’s going at Google I/O.\nToday, I talked about how we’re advancing two fundamental aspects of our mission — knowledge and computing — to create products that are built to help. It’s exciting to build these products; it’s even more exciting to see what people do with them.\nThank you to everyone wh…",
          "link": "https://blog.google/technology/developers/io-2022-keynote/",
          "publishedOn": "2022-05-11T17:00:00.000Z",
          "wordCount": 5272,
          "title": "Google I/O 2022: Advancing knowledge and computing"
        },
        {
          "id": "https://blog.google/technology/ai/understanding-the-world-through-language/",
          "author": null,
          "description": "Language is at the heart of how people communicate with each other. It’s also proving to be powerful in advancing AI and building helpful experiences for people worldwide.\n\n\nFrom the beginning, we set out to connect words in your search to words on a page so we could make the web’s information more accessible and useful. Over 20 years later, as the web changes, and the ways people consume information expand from text to images to videos and more — the one constant is that language remains a surprisingly powerful tool for understanding information.\n\n\nIn recent years, we’ve seen an incredible acceleration in the field of natural language understanding. While our systems still don’t understand language the way people do, they’re increasingly able to spot patterns in information, identify comp…",
          "link": "https://blog.google/technology/ai/understanding-the-world-through-language/",
          "publishedOn": "2022-05-11T16:00:00.000Z",
          "wordCount": 1752,
          "title": "Understanding the world through language"
        },
        {
          "id": "https://blog.google/products/maps/three-maps-updates-io-2022/",
          "author": null,
          "description": "Google Maps helps over one billion people navigate and explore. And over the past few years, our investments in AI have supercharged the ability to bring you the most helpful information about the real world, including when a business is open and how crowded your bus is. Today at Google I/O, we announced new ways the latest advancements in AI are transforming Google Maps — helping you explore with an all-new immersive view of the world, find the most fuel-efficient route, and use the magic of Live View in your favorite third-party apps.\nA more immersive, intuitive map\nGoogle Maps first launched to help people navigate to their destinations. Since then, it’s evolved to become much more — it’s a handy companion when you need to find the perfect restaurant or get information about a local bus…",
          "link": "https://blog.google/products/maps/three-maps-updates-io-2022/",
          "publishedOn": "2022-05-11T15:17:00.000Z",
          "wordCount": 1503,
          "title": "Immersive view coming soon to Maps — plus more updates"
        },
        {
          "id": "https://blog.google/products/translate/24-new-languages/",
          "author": null,
          "description": "For years, Google Translate has helped break down language barriers and connect communities all over the world. And we want to make this possible for even more people — especially those whose languages aren’t represented in most technology. So today we’ve added 24 languages to Translate, now supporting a total of 133 used around the globe.\nOver 300 million people speak these newly added languages — like Mizo, used by around 800,000 people in the far northeast of India, and Lingala, used by over 45 million people across Central Africa. As part of this update, Indigenous languages of the Americas (Quechua, Guarani and Aymara) and an English dialect (Sierra Leonean Krio) have also been added to Translate for the first time.\n\n\n\n\nTranslate's mission translated into some of our newly added langu…",
          "link": "https://blog.google/products/translate/24-new-languages/",
          "publishedOn": "2022-05-11T15:16:00.000Z",
          "wordCount": 1234,
          "title": "Google Translate learns 24 new languages"
        },
        {
          "id": "https://blog.google/technology/research/ai-monk-scale-skin-tone-story/",
          "author": null,
          "description": "Today at I/O we released the Monk Skin Tone (MST) Scale in partnership with Harvard professor and sociologist Dr. Ellis Monk. The MST Scale, developed by Dr. Monk, is a 10-shade scale designed to be more inclusive of the spectrum of skin tones in our society. We’ll be incorporating the MST Scale into various Google products over the coming months, and we are openly releasing the scale so that anyone can use it for research and product development.\nThe MST Scale is an important next step in a collective effort to improve skin tone inclusivity in technology. For Google, it will help us make progress in our commitment to image equity and improving representation across our products. And in releasing the MST Scale for all to use, we hope to make it easier for others to do the same, so we can l…",
          "link": "https://blog.google/technology/research/ai-monk-scale-skin-tone-story/",
          "publishedOn": "2022-05-11T09:32:00.000Z",
          "wordCount": 3067,
          "title": "A closer look at the research to help AI see more skin tones"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=18998",
          "author": "Daniel Stenberg",
          "description": "Trailing dots on host names in URLs is the gift that keeps on giving. Let me take you through a dwindling story of how the dot is handled differently in different places through the stack of an Internet client. The evil trailing dot. DNS When a given host name is to be resolved to an … Continue reading A tale of a trailing dot →",
          "link": "https://daniel.haxx.se/blog/2022/05/12/a-tale-of-a-trailing-dot/",
          "publishedOn": "2022-05-12T06:40:59.000Z",
          "wordCount": 2048,
          "title": "A tale of a trailing dot"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19090",
          "author": "Daniel Stenberg",
          "description": "Welcome to this patch release of curl, shipped only 14 days since the previous version. We decided to cut the release cycle short because of the several security vulnerabilities that were pointed out. See below for details. There are no new features added in this release. It burns. Mostly in our egos. Release video Numbers … Continue reading curl 7.83.1 it burns →",
          "link": "https://daniel.haxx.se/blog/2022/05/11/curl-7-83-1-it-burns/",
          "publishedOn": "2022-05-11T06:30:26.000Z",
          "wordCount": 756,
          "title": "curl 7.83.1 it burns"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18940",
          "author": "Daniel Stenberg",
          "description": "Three Open Source hackers were invited to this meeting with the CSRB and I was one of them. The board with this name is part of CISA, a US government effort that received a presidential order to work on “Improving the Nation’s Cybersecurity“. Where “the Nation” here is the US. I’m not in the US … Continue reading Meeting the Cyber Safety Review Board →",
          "link": "https://daniel.haxx.se/blog/2022/05/05/meeting-the-cyber-safety-review-board/",
          "publishedOn": "2022-05-05T14:00:23.000Z",
          "wordCount": 1097,
          "title": "Meeting the Cyber Safety Review Board"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19074",
          "author": "Daniel Stenberg",
          "description": "The first mention of QUIC on this blog was back when I posted about the HTTP workshop of July 2015. Today, this blog is readable over the protocol QUIC subsequently would turn into. (Strictly speaking, it turned into QUIC + HTTP/3 but let’s not be too literal now.) The other day Fastly announced that all … Continue reading now on HTTP/3 →",
          "link": "https://daniel.haxx.se/blog/2022/05/02/now-on-http-3/",
          "publishedOn": "2022-05-02T21:41:19.000Z",
          "wordCount": 374,
          "title": "now on HTTP/3"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19048",
          "author": "Daniel Stenberg",
          "description": "Vodafone UK has taken it on themselves to make the world better by marking this website (daniel.haxx.se) “adult content”. I suppose in order to protect the children. It was first reported to me on May 2, with this screenshot from a Vodafone customer: And later followed up with some more details from another user in … Continue reading Considered “18+” →",
          "link": "https://daniel.haxx.se/blog/2022/05/02/considered-18/",
          "publishedOn": "2022-05-02T09:07:39.000Z",
          "wordCount": 592,
          "title": "Considered “18+”"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18936",
          "author": "Daniel Stenberg",
          "description": "– Everything I know and learned about running and maintaining Open Source projects for three decades. For several years now, I have had a blog post series in mind to describe something about what people could expect to happen in Open Source projects. I had a few already half-started blog post drafts for some sub … Continue reading Uncurled →",
          "link": "https://daniel.haxx.se/blog/2022/04/30/uncurled/",
          "publishedOn": "2022-04-30T10:18:05.000Z",
          "wordCount": 1124,
          "title": "Uncurled"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18986",
          "author": "Daniel Stenberg",
          "description": "Welcome to the third curl release of the year. Release presentation Numbers the 207th release6 changes53 days (total: 8,804)125 bug-fixes (total: 7,816)185 commits (total: 28,507)2 new public libcurl function (total: 88)0 new curl_easy_setopt() option (total: 295)2 new curl command line option (total: 247)60 contributors, 29 new (total: 2,626)35 authors, 13 new (total: 1,027)4 security fixes … Continue reading curl 7.83.0 headers bonanza →",
          "link": "https://daniel.haxx.se/blog/2022/04/27/curl-7-83-0-headers-bonanza/",
          "publishedOn": "2022-04-27T06:28:39.000Z",
          "wordCount": 1157,
          "title": "curl 7.83.0 headers bonanza"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18954",
          "author": "Daniel Stenberg",
          "description": "On June 6 2022, we will gather a bunch of curl aficionados in the Firehouse at the Fort Mason Centre in San Francisco, USA. All details can be found here. We will add more info and details as we get closer to the event. curl up is the annual curl developers and users “conference” where … Continue reading curl up 2022 San Francisco →",
          "link": "https://daniel.haxx.se/blog/2022/04/20/curl-up-2022-san-francisco/",
          "publishedOn": "2022-04-20T21:49:21.000Z",
          "wordCount": 615,
          "title": "curl up 2022 San Francisco"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-05-09T12:24:22.807Z",
          "wordCount": 984,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2022-05-04T12:20:59.542Z",
          "wordCount": 2822,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-05-04T12:20:59.498Z",
          "wordCount": 1326,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-05-02T12:23:30.300Z",
          "wordCount": 1603,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-04-24T12:16:00.079Z",
          "wordCount": 808,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-04-24T12:15:59.702Z",
          "wordCount": 791,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2022-04-20T12:23:27.828Z",
          "wordCount": 2812,
          "title": "How we built Twitter’s highly reliable ads pacing service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-04-18T12:17:57.657Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2022-04-17T12:15:44.137Z",
          "wordCount": 2606,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-04-17T12:15:43.376Z",
          "wordCount": 1663,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-04-14T12:18:31.019Z",
          "wordCount": 2038,
          "title": "Next generation data insights using natural language queries"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/05/release-of-technical-report-into-amd.html",
          "author": null,
          "description": "ol{margin:0;padding:0}table td,table th{padding:0}.RmvCPDuePa-c3{padding-top:0pt;padding-bottom:0pt;line-height:1.5;orphans:2;widows:2;text-align:left;height:11pt}.RmvCPDuePa-c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:\"Arial\";font-style:normal}.RmvCPDuePa-c7{padding-top:0pt;padding-bottom:0pt;line-height:1.5;orphans:2;widows:2;text-align:left}.RmvCPDuePa-c2{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:left}.RmvCPDuePa-c6{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;text-decoration:underline}.RmvCPDuePa-c4{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.RmvCPDuePa-c1{color:inherit;text-decoration:inherit}.RmvCPDuePa-c5{border:1px solid black;margin:5px}.title…",
          "link": "https://googleprojectzero.blogspot.com/2022/05/release-of-technical-report-into-amd.html",
          "publishedOn": "2022-05-10T19:00:00.000Z",
          "wordCount": 698,
          "title": "Release of Technical Report into the AMD Security Processor"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_qhs0t3wlsx02-8>li{counter-increment:lst-ctn-kix_qhs0t3wlsx02-8}ol.lst-kix_h2vtkcla8l9d-2.start{counter-reset:lst-ctn-kix_h2vtkcla8l9d-2 0}ul.lst-kix_9i24fh2252ug-1{list-style-type:none}.lst-kix_h2vtkcla8l9d-3>li{counter-increment:lst-ctn-kix_h2vtkcla8l9d-3}ul.lst-kix_9i24fh2252ug-0{list-style-type:none}ul.lst-kix_9i24fh2252ug-3{list-style-type:none}ul.lst-kix_9i24fh2252ug-2{list-style-type:none}ul.lst-kix_9i24fh2252ug-5{list-style-type:none}ul.lst-kix_9i24fh2252ug-4{list-style-type:none}ul.lst-kix_9i24fh2252ug-7{list-style-type:none}.lst-kix_czzguda5pqu4-1>li{counter-increment:lst-ctn-kix_czzguda5pqu4-1}ul.lst-kix_9i24fh2252ug-6{list-style-type:none}.lst-kix_jdourvkzhmg1-7>li{counter-increment…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "publishedOn": "2022-04-19T16:06:00.000Z",
          "wordCount": 6268,
          "title": "The More You Know, The More You Know You Don’t Know"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.BGLtzooHlW-c13{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.BGLtzooHlW-c3{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:Consolas,\"Courier New\";font-style:normal}.BGLtzooHlW-c10{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-fa…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "publishedOn": "2022-04-14T15:58:00.000Z",
          "wordCount": 8658,
          "title": "CVE-2021-1782, an iOS in-the-wild vulnerability in vouchers"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47829",
          "author": "Gian-Carlo Pascutto",
          "description": "Firefox uses a multi-process model for additional security and stability while browsing: Web Content (such as HTML/CSS and Javascript) is rendered in separate processes that are isolated from the rest of the operating system and managed by a privileged parent process. This way, the amount of control gained by an attacker that exploits a bug in a content process is limited. In this article, we would like to dive a bit further into the latest major milestone we have reached: Win32k Lockdown, which greatly reduces the capabilities of the content process when running on Windows.\nThe post Improved Process Isolation in Firefox 100 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/05/improved-process-isolation-in-firefox-100/",
          "publishedOn": "2022-05-12T15:09:10.000Z",
          "wordCount": 2255,
          "title": "Improved Process Isolation in Firefox 100"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47798",
          "author": "Melissa Thermidor",
          "description": "The latest Common Voice dataset, released today, has achieved a major milestone: More than 20,000 hours of open-source speech data that anyone, anywhere can use. The dataset has nearly doubled in the past year. Mozilla’s Common Voice seeks to change the language technology ecosystem by supporting communities to collect voice data for the creation of voice-enabled applications for their own languages. \nThe post Common Voice dataset tops 20,000 hours appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/common-voice-dataset-tops-20000-hours/",
          "publishedOn": "2022-04-28T15:23:57.000Z",
          "wordCount": 587,
          "title": "Common Voice dataset tops 20,000 hours"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47805",
          "author": "Hermina",
          "description": "Almost a month ago, we announced MDN Plus, a new premium service on MDN that allows users to customize their experience on the website.\nWe are very glad to announce today that it is now possible for MDN users around the globe to create an MDN Plus free account, no matter where they are.\nThe post MDN Plus now available in more markets appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/mdn-plus-now-available-in-more-markets/",
          "publishedOn": "2022-04-28T10:05:35.000Z",
          "wordCount": 349,
          "title": "MDN Plus now available in more markets"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47784",
          "author": "Hermina",
          "description": "On March 1st, 2022, MDN Web Docs released a new design and a new brand identity. Overall, the community responded to the redesign enthusiastically and we received many positive messages and kudos. We also received valuable feedback on some of the things we didn’t get quite right, like the browser compatibility table changes as well as some accessibility and readability issues.\nThe post Adopting users’ design feedback appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/adopting-users-design-feedback/",
          "publishedOn": "2022-04-21T15:04:05.000Z",
          "wordCount": 1178,
          "title": "Adopting users’ design feedback"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=64901",
          "author": "Lara Croft",
          "description": "This year, thousands of students from around the world came together and redefined the world we live in, how we learn, and how we move forward. We are honored to be part of the experience and eager to celebrate this milestone. So on June 11 we celebrate the Class of 2022 and welcome them to […]",
          "link": "https://github.blog/2022-05-11-graduation-is-here-celebrate-the-class-of-2022-and-join-github-on-june-11/",
          "publishedOn": "2022-05-11T18:00:20.000Z",
          "wordCount": 596,
          "title": "Graduation is here! Celebrate the Class of 2022, and join GitHub on June 11 🎓"
        },
        {
          "id": "https://github.blog/?p=64908",
          "author": "Rizel Scarlett",
          "description": "Introduction Open Sauced, GitHub’s Explore page, Hacktoberfest, and First Timers Only help folks discover open source projects. This monthly series–Open Source Monthly—will add to these efforts by helping: First-time contributors find the right project to contribute to Corporations and individuals find a new project to sponsor Open source maintainers gain more consistent contributors and sponsors […]",
          "link": "https://github.blog/2022-05-11-open-source-monthly-may-2022-edition/",
          "publishedOn": "2022-05-11T15:00:36.000Z",
          "wordCount": 1055,
          "title": "Open Source Monthly – May 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=64931",
          "author": "Myles Borins",
          "description": "Late last year, in response to an unprecedented series of account takeovers resulting from the compromise of developer accounts without 2FA enabled, we committed to a variety of enhancements to the npm registry to make two-factor authentication (2FA) adoption easier for developers. Today, we are launching a public beta for a significantly improved 2FA experience […]",
          "link": "https://github.blog/2022-05-10-enhanced-2fa-experience-for-your-npm-account/",
          "publishedOn": "2022-05-10T16:00:41.000Z",
          "wordCount": 404,
          "title": "Enhanced 2FA experience for your npm account"
        },
        {
          "id": "https://github.blog/?p=64780",
          "author": "Konrad Pabjan",
          "description": "You can now output and group custom Markdown content on the Actions run summary page.",
          "link": "https://github.blog/2022-05-09-supercharging-github-actions-with-job-summaries/",
          "publishedOn": "2022-05-09T16:00:53.000Z",
          "wordCount": 792,
          "title": "Supercharging GitHub Actions with Job Summaries"
        },
        {
          "id": "https://github.blog/?p=64752",
          "author": "Eric Rosado",
          "description": "Teachers, it is now your turn to join GitHub Global Campus with our student community! Get access to exclusive benefits, programs, and the Power of Codespaces at no cost in GitHub Classroom!",
          "link": "https://github.blog/2022-05-09-prepare-for-next-semester-with-github-global-campus-and-codespaces/",
          "publishedOn": "2022-05-09T15:00:00.000Z",
          "wordCount": 1309,
          "title": "Prepare for next semester with GitHub Global Campus and Codespaces"
        },
        {
          "id": "https://github.blog/?p=64815",
          "author": "Joseph Katsioloudes",
          "description": "We're taking a look at some of the most common security vulnerabilities and detailing how developers can best protect themselves.",
          "link": "https://github.blog/2022-05-06-todays-most-common-security-vulnerabilities-explained/",
          "publishedOn": "2022-05-06T15:52:42.000Z",
          "wordCount": 1405,
          "title": "Today’s most common security vulnerabilities explained"
        },
        {
          "id": "https://github.blog/?p=64485",
          "author": "Lee Reilly",
          "description": "20 of our favorite games plus source code from the latest Ludum Dare competition.",
          "link": "https://github.blog/2022-05-05-ludum-dare-50/",
          "publishedOn": "2022-05-05T20:37:07.000Z",
          "wordCount": 1144,
          "title": "20 of our favorite games + source code from Ludum Dare 50"
        },
        {
          "id": "https://github.blog/?p=63643",
          "author": "Klint Finley",
          "description": "Teaching is a great way to not only help others but to better learn a topic yourself.",
          "link": "https://github.blog/2022-05-05-the-readme-project-qa-what-you-need-to-know-about-teaching-technical-skills/",
          "publishedOn": "2022-05-05T17:00:25.000Z",
          "wordCount": 1638,
          "title": "The ReadME Project Q&A: What you need to know about teaching technical skills"
        },
        {
          "id": "https://github.blog/?p=64750",
          "author": "Jakub Oleksy",
          "description": "In April, we experienced two distinct incidents resulting in significant impact and degraded state of availability for Codespaces and GitHub Packages.",
          "link": "https://github.blog/2022-05-04-github-availability-report-april-2022/",
          "publishedOn": "2022-05-04T22:01:17.000Z",
          "wordCount": 960,
          "title": "GitHub Availability Report: April 2022"
        },
        {
          "id": "https://github.blog/?p=64715",
          "author": "Mike Hanley",
          "description": "GitHub will require all users who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023.",
          "link": "https://github.blog/2022-05-04-software-security-starts-with-the-developer-securing-developer-accounts-with-2fa/",
          "publishedOn": "2022-05-04T15:04:37.000Z",
          "wordCount": 1362,
          "title": "Software security starts with the developer: Securing developer accounts with 2FA"
        },
        {
          "id": "https://github.blog/?p=64670",
          "author": "Lessley Dennington",
          "description": "This is the second and final post in a series describing friendly forks and alternative strategies for managing them.",
          "link": "https://github.blog/2022-05-02-friend-zone-strategies-friendly-fork-management/",
          "publishedOn": "2022-05-02T16:26:29.000Z",
          "wordCount": 2382,
          "title": "Being friendly: Strategies for friendly fork management"
        },
        {
          "id": "https://github.blog/?p=64639",
          "author": "Patrick Thomson",
          "description": "Thanks to the efforts of the Elixir community, GitHub supports code navigation for Elixir repositories. Read how favorite language can add this support too!",
          "link": "https://github.blog/2022-04-29-bringing-code-navigation-to-communities/",
          "publishedOn": "2022-04-29T15:00:02.000Z",
          "wordCount": 787,
          "title": "Bringing code navigation to communities"
        },
        {
          "id": "https://github.blog/?p=64550",
          "author": "Justin Hutchings",
          "description": "These days software is subject to an ever-changing threat landscape. Check out the many ways you can keep your projects secure on GitHub today.",
          "link": "https://github.blog/2022-04-28-best-practices-to-keep-your-projects-secure-on-github/",
          "publishedOn": "2022-04-28T15:55:56.000Z",
          "wordCount": 958,
          "title": "Best practices to keep your projects secure on GitHub"
        },
        {
          "id": "https://github.blog/?p=64509",
          "author": "Sergio Padrino",
          "description": "GitHub Desktop 3.0 brings better integration with your GitHub Pull Requests. You can now receive real time notifications and review the status of your check runs for your pull request.",
          "link": "https://github.blog/2022-04-26-github-desktop-3-0-brings-better-integration-for-your-pull-requests/",
          "publishedOn": "2022-04-26T16:00:26.000Z",
          "wordCount": 1086,
          "title": "GitHub Desktop 3.0 brings better integration for your pull requests"
        },
        {
          "id": "https://github.blog/?p=64330",
          "author": "Lessley Dennington",
          "description": "This is the first post in a two-part series describing friendly forks and alternative strategies for managing them. Stay tuned for part two coming in May!",
          "link": "https://github.blog/2022-04-25-the-friend-zone-friendly-forks-101/",
          "publishedOn": "2022-04-25T17:29:10.000Z",
          "wordCount": 1614,
          "title": "The friend zone: friendly forks 101"
        },
        {
          "id": "https://github.blog/?p=64307",
          "author": "Lee Reilly",
          "description": "The ZX Spectrum, one of the best-selling microcomputers of all time, celebrates its 40 years anniversary today. Read more about how the community is still active - creating new content, archiving old content, and hacking on all sorts of hardware.",
          "link": "https://github.blog/2022-04-23-zx-spectrum-40-year-anniversary/",
          "publishedOn": "2022-04-23T07:01:13.000Z",
          "wordCount": 1595,
          "title": "Celebrating 40 years of ZX Spectrum ❤️ 💛 💚 💙"
        },
        {
          "id": "https://github.blog/?p=64375",
          "author": "Madison Oliver",
          "description": "Do you worry that a CVE will hurt the reputation of your project? In reality, CVEs are a tracking number, and nothing more. Here's how we think of them at GitHub.",
          "link": "https://github.blog/2022-04-22-removing-the-stigma-of-a-cve/",
          "publishedOn": "2022-04-22T16:30:31.000Z",
          "wordCount": 1717,
          "title": "Removing the stigma of a CVE"
        },
        {
          "id": "https://github.blog/?p=64240",
          "author": "Brian Douglas",
          "description": "From plug-and-play automations to protected branches, here are simple ways any developer can build more secure software on GitHub—all with a free account.",
          "link": "https://github.blog/2022-04-22-5-simple-things-every-developer-can-do-to-ship-more-secure-code/",
          "publishedOn": "2022-04-22T14:59:28.000Z",
          "wordCount": 2042,
          "title": "5 simple things every developer can do to ship more secure code"
        },
        {
          "id": "https://github.blog/?p=64370",
          "author": "Jeimy Ruiz",
          "description": "We’re kicking off InFocus, a global virtual event focused on accelerating, securing, and improving the way software development teams work.",
          "link": "https://github.blog/2022-04-21-guide-to-github-infocus-2022/",
          "publishedOn": "2022-04-21T21:14:55.000Z",
          "wordCount": 865,
          "title": "Your guide to GitHub InFocus: Improving the way software development teams work in 2022"
        },
        {
          "id": "https://github.blog/?p=63926",
          "author": "Carlos Martín Nieto",
          "description": "The history of pre-receive hooks, how we discovered that the performance was problematic, and how we went about safely replacing them.",
          "link": "https://github.blog/2022-04-21-improving-git-push-times-through-faster-server-side-hooks/",
          "publishedOn": "2022-04-21T16:30:04.000Z",
          "wordCount": 1361,
          "title": "Improving Git push times through faster server side hooks"
        },
        {
          "id": "https://github.blog/?p=64296",
          "author": "Daniel Adams",
          "description": "Organization profiles can now display custom content visible only to members of the organization. A new Member view can be tailored to show an alternative README and pinned private repositories.",
          "link": "https://github.blog/2022-04-20-organization-profiles-leading-the-way/",
          "publishedOn": "2022-04-20T18:38:24.000Z",
          "wordCount": 673,
          "title": "Organization profiles leading the way"
        },
        {
          "id": "https://github.blog/?p=64268",
          "author": "Gabe Dominguez",
          "description": "We’re releasing exciting improvements that will streamline your Codespaces experience when working with multi-repository projects and monorepos.",
          "link": "https://github.blog/2022-04-20-codespaces-multi-repository-monorepo-scenarios/",
          "publishedOn": "2022-04-20T16:00:57.000Z",
          "wordCount": 1022,
          "title": "Codespaces for multi-repository and monorepo scenarios"
        },
        {
          "id": "https://github.blog/?p=64193",
          "author": "Andrew Eisenberg",
          "description": "Introducing CodeQL packs to help you codify and share your knowledge of vulnerabilities.",
          "link": "https://github.blog/2022-04-19-sharing-security-expertise-through-codeql-packs-part-i/",
          "publishedOn": "2022-04-19T17:00:02.000Z",
          "wordCount": 2115,
          "title": "Sharing security expertise through CodeQL packs (Part I)"
        },
        {
          "id": "https://github.blog/?p=64204",
          "author": "Taylor Blau",
          "description": "Another new release of Git is here! Take a look at some of our highlights on what's new in Git 2.36.",
          "link": "https://github.blog/2022-04-18-highlights-from-git-2-36/",
          "publishedOn": "2022-04-18T16:44:50.000Z",
          "wordCount": 3484,
          "title": "Highlights from Git 2.36"
        },
        {
          "id": "https://github.blog/?p=64202",
          "author": "Mike Hanley",
          "description": "On April 12, GitHub Security began an investigation that uncovered evidence that an attacker abused stolen OAuth user tokens issued to two third-party OAuth integrators, Heroku and Travis-CI, to download data from dozens of organizations, including npm. Read on to learn more about the impact to GitHub, npm, and our users.",
          "link": "https://github.blog/2022-04-15-security-alert-stolen-oauth-user-tokens/",
          "publishedOn": "2022-04-15T22:35:02.000Z",
          "wordCount": 1107,
          "title": "Security alert: Attack campaign involving stolen OAuth user tokens issued to two third-party integrators"
        },
        {
          "id": "https://github.blog/?p=64103",
          "author": "Erin Havens",
          "description": "Today, we're shipping a new feature for Dependabot alerts which helps you better understand how you're affected by a vulnerability.",
          "link": "https://github.blog/2022-04-14-dependabot-alerts-now-surface-if-code-is-calling-vulnerability/",
          "publishedOn": "2022-04-14T16:30:11.000Z",
          "wordCount": 775,
          "title": "Dependabot alerts now surface if your code is calling a vulnerability"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18264",
          "author": "Felipe Almeida - Machine Learning Engineer",
          "description": "Nubank's take on how these two roles interact and how each plays a key part in a successful team.\nThe post Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-scientist-machine-learning-engineer-roles-how-are-they-different-how-are-they-alike/",
          "publishedOn": "2022-04-26T22:05:36.000Z",
          "wordCount": 4965,
          "title": "Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18264",
          "author": "Felipe Almeida - Machine Learning Engineer",
          "description": "Nubank's take on how these two roles interact and how each plays a key part in a successful team.\nThe post Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-scientist-x-machine-learning-engineer-roles-how-are-they-different-how-are-they-alike/",
          "publishedOn": "2022-04-26T22:05:36.000Z",
          "wordCount": 4965,
          "title": "Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18287",
          "author": "Matt Swann - Chief Technology Officer at Nubank",
          "description": "New tools will soon create more value based on transactional data intelligence, supporting innovative companies to generate insights about customer patterns and journeys for their benefit.\nThe post Artificial intelligence applied to financial services appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/matt-swann-artificial-intelligence-applied-to-finanacial-services/",
          "publishedOn": "2022-04-19T19:45:50.000Z",
          "wordCount": 3660,
          "title": "Artificial intelligence applied to financial services"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/company-news/what-attack-resistance-management",
          "author": "Tim Matthews",
          "description": "A Security Survey on How to Close Your Organization's Attack Resistance Gap",
          "link": "https://www.hackerone.com/company-news/what-attack-resistance-management",
          "publishedOn": "2022-05-10T16:00:00.000Z",
          "wordCount": 1791,
          "title": "What is Attack Resistance Management?"
        },
        {
          "id": "https://hackerone.com/company-news/why-hackerone-acquired-pull-request-and-what-it-means-our-customers",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/company-news/why-hackerone-acquired-pull-request-and-what-it-means-our-customers",
          "publishedOn": "2022-05-03T18:59:59.000Z",
          "wordCount": 1044,
          "title": "Why HackerOne Acquired Pull Request and What It Means to Our Customers"
        },
        {
          "id": "https://hackerone.com/vulnerability-disclosure/announcing-results-12-month-dib-vdp-pilot",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/vulnerability-disclosure/announcing-results-12-month-dib-vdp-pilot",
          "publishedOn": "2022-05-02T16:00:00.000Z",
          "wordCount": 632,
          "title": "Announcing the Results of the 12-month DIB-VDP Pilot"
        },
        {
          "id": "https://hackerone.com/customer-stories/how-wix-improves-their-security-posture-ethical-hackers",
          "author": "HackerOne",
          "description": "Reducing risk is fundamental to Wix’s approach to cybersecurity, and as the threat landscape evolves, they turn to HackerOne Bounty to protect their security posture. Since 2018, Wix has invited tens of thousands of ethical hackers worldwide to ensure new and existing features are secure. We recently met with two Wix security team members to learn how they leverage ethical hackers to detect risks before they become threats and how vulnerability insights help strengthen their security posture.",
          "link": "https://www.hackerone.com/customer-stories/how-wix-improves-their-security-posture-ethical-hackers",
          "publishedOn": "2022-04-21T14:00:00.000Z",
          "wordCount": 1958,
          "title": "How Wix Improves Their Security Posture with Ethical Hackers"
        },
        {
          "id": "https://hackerone.com/company-news/announcing-hackerone-2022-attack-resistance-report-security-survey-how-close-your",
          "author": "HackerOne",
          "description": "Today, HackerOne published The 2022 Attack Resistance Report: A HackerOne Security Survey. Our research revealed an increasing gap—the attack resistance gap—between what organizations can defend and what they need to defend. The gap is the result of four components prevalent across organizations.",
          "link": "https://www.hackerone.com/company-news/announcing-hackerone-2022-attack-resistance-report-security-survey-how-close-your",
          "publishedOn": "2022-04-19T23:40:49.000Z",
          "wordCount": 908,
          "title": "Announcing the HackerOne 2022 Attack Resistance Report: A Security Survey—How to Close Your Organization's Attack Resistance Gap"
        },
        {
          "id": "https://hackerone.com/customer-stories/how-ethical-hackers-help-watson-address-digital-risk",
          "author": "HackerOne",
          "description": "We recently met with A.S. Watson’s Chief Information Security Officer (CISO), Feliks Voskoboynik, to learn how ethical hackers have helped with digital transformation and enabled his team to harden their attack surface. Read on to learn Feliks’ advice on including a bug bounty program as part of a security strategy, the lessons ethical hackers have provided, and what best practices he can share with other CISOs.",
          "link": "https://www.hackerone.com/customer-stories/how-ethical-hackers-help-watson-address-digital-risk",
          "publishedOn": "2022-04-19T16:00:00.000Z",
          "wordCount": 1637,
          "title": "How Ethical Hackers Help A.S. Watson Address Digital Risk"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/5941d3231762",
          "author": "Netflix Technology Blog",
          "description": "by Vivek Kaushal",
          "link": "https://netflixtechblog.com/evolution-of-ml-fact-store-5941d3231762?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-04-26T20:44:04.000Z",
          "wordCount": 2761,
          "title": "Evolution of ML Fact Store"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-4",
          "author": "Market Radar",
          "description": "A mix of charts on stocks and indices",
          "link": "https://marketradar.substack.com/p/charts-to-watch-4",
          "publishedOn": "2022-05-04T13:00:40.000Z",
          "wordCount": null,
          "title": "Charts to watch #4",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fb0eceaf1-e03f-41d9-b1d5-c20632d6db44_1532x743.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/pure-stock-portfolio-a-stock-to-sell",
          "author": "Market Radar",
          "description": "A very bad earning report made me change the idea on the company",
          "link": "https://marketradar.substack.com/p/pure-stock-portfolio-a-stock-to-sell",
          "publishedOn": "2022-04-28T13:45:17.000Z",
          "wordCount": null,
          "title": "Pure Stock Portfolio: a stock to sell",
          "itunes": {},
          "enclosure": {
            "url": "https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/407bfb28-506f-41f6-958b-53dbefad58b8_828x823.jpeg",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/earnings-are-positive-surprises-over",
          "author": "Market Radar",
          "description": "We have entered one of the most difficult earning seasons ever",
          "link": "https://marketradar.substack.com/p/earnings-are-positive-surprises-over",
          "publishedOn": "2022-04-21T14:00:39.000Z",
          "wordCount": null,
          "title": "Earnings: are positive surprises over?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F83341bb7-1be7-4bbb-a7f2-925c69ef451b_828x335.jpeg",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/portfolio-rebalancing-april-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-rebalancing-april-2022",
          "publishedOn": "2022-04-14T10:11:36.000Z",
          "wordCount": null,
          "title": "Portfolio Rebalancing: April 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff56c4bfc-6f9f-4aec-b078-4c13027bacd1_1009x677.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}