{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Kim Lewandowski, Azeem Shaikh, Laurent Simon, Google Open Source Security Team\n\n\nContributors to the Scorecards project, an automated security tool that produces a “risk score” for open source projects, have accomplished a lot since our launch last fall. Today, in collaboration  with the Open Source Security Foundation community, we are announcing Scorecards v2. We have added new security checks, scaled up the number of projects being scored, and made this data easily accessible for analysis.\n\nWit…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/aIycN3fXCO4/measuring-security-risks-in-open-source.html",
          "publishedOn": "2021-07-01T13:00:00.001Z",
          "wordCount": 2028,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Measuring Security Risks in Open Source Software: Scorecards Launches V2"
        },
        {
          "description": "Posted by Oliver Chang, Google Open Source Security team and Russ Cox, Go team&nbsp;\nIn recent months, Google has launched several efforts to strengthen open-source security on multiple fronts. One important focus is improving how we identify and respond to known security vulnerabilities without doing extensive manual work. It is essential to have a precise common data format to triage and remediate security vulnerabilities, particularly when communicating about risks to affected dependencies—it enables eas…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/s8eHYMtsmLg/announcing-unified-vulnerability-schema.html",
          "publishedOn": "2021-06-24T13:00:00.002Z",
          "wordCount": 5190,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing a unified vulnerability schema for open source"
        },
        {
          "description": "Posted by Kristoffer Janke, Information Security Engineer\n\nAre you ready for no sleep, no chill and a lot of hacking? Our annual Google CTF is back!\n\nThe competition kicks off on Saturday July 17 00:00:01 AM UTC  and runs through Sunday July 18 23:59:59 UTC. Teams can register at http://goo.gle/ctf. \n\nJust like last year, the top 16 teams will qualify for our Hackceler8 speed run and the chance to take home a total of $30,301.70 in prize money.\n\n\n\nAs we reminisce on last years event, we’d be remiss if we di…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/bBP3hKokMb4/get-ready-for-2021-google-ctf.html",
          "publishedOn": "2021-06-18T13:11:00.004Z",
          "wordCount": 640,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Get ready for the 2021 Google CTF"
        },
        {
          "description": "Posted Kim Lewandowski, Google Open Source Security Team &amp; Mark Lodato, Binary Authorization for Borg Team&nbsp;\n\nSupply chain integrity attacks—unauthorized modifications to software packages—have been on the rise in the past two years, and are proving to be common and reliable attack vectors that affect all consumers of software. The software development and deployment supply chain is quite complicated, with numerous threats along the source ➞ build ➞ publish workflow. While point solutions do exist f…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/hZ31glCO8Qg/introducing-slsa-end-to-end-framework.html",
          "publishedOn": "2021-06-16T15:36:00.029Z",
          "wordCount": 4482,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing SLSA, an End-to-End Framework for Supply Chain Integrity"
        },
        {
          "description": "Posted by Joel Galenson and Matthew Maurer, Android Team \nOne of the main challenges of evaluating Rust for use within the Android platform was ensuring we could provide sufficient interoperability with our existing codebase. If Rust is to meet its goals of improving security, stability, and quality Android-wide, we need to be able to use Rust anywhere in the codebase that native code is required. To accomplish this, we need to provide the majority of functionality platform developers use. As we discussed p…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/C0H0OlKgVRY/rustc-interop-in-android-platform.html",
          "publishedOn": "2021-06-08T17:00:00.002Z",
          "wordCount": 2688,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Rust/C++ interop in the Android Platform"
        },
        {
          "description": "Posted by Dan Lorenc, Priya Wadhwa, Open Source Security Team\n\nIf you've been paying attention to the news at all lately, you've probably noticed that software supply chain attacks are rapidly becoming a big problem. Whether you're trying to prevent these attacks, responding to an ongoing one or recovering from one, you understand that knowing what is happening in your CI/CD pipeline is critical. \nFortunately, the Kubernetes-native Tekton project –  an open-source framework for creating CI/CD systems – was …",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/2ZJ7vsPEBZU/verifiable-supply-chain-metadata-for.html",
          "publishedOn": "2021-06-08T16:02:00.006Z",
          "wordCount": 2641,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Verifiable Supply Chain Metadata for Tekton"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "By George Pirocanac\n\n\n\n\nA familiar question every software developer and team grapples with is, “How much testing is enough to qualify a software release?” A lot depends on the type of software, its purpose, and its target audience. One would expect a far more rigorous approach to testing commercial search engne than a simple smartphone flashlight application. Yet no matter what the application, the question of how much testing is sufficient can be hard to answer in definitive terms. A better approach is to…",
          "link": "http://feedproxy.google.com/~r/blogspot/RLXA/~3/dnjDixzItKU/how-much-testing-is-enough.html",
          "publishedOn": "2021-06-15T15:04:00.000Z",
          "wordCount": 2633,
          "sourceHref": "http://googletesting.blogspot.com/atom.xml",
          "sourceTitle": "Google Testing Blog",
          "title": "How Much Testing is Enough?"
        }
      ]
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "Commit groups sounds interesting to me. Anyone reading this familiar with Git innards? Is this doable?\nYou know the “group” facility of vector graphics programs? You draw a couple of shapes, you group them together, and then you can apply transformations to the entire group at once, operating on it as if it were an atomic thing. But when need arises, you can “ungroup” it and look deeper.\nI’d love to see that same idea applied to Git commits. In Git, a commit group might just be a named and annotated range o…",
          "link": "http://blog.danieljanus.pl/2021/07/01/commit-groups/",
          "publishedOn": "2021-07-05T20:14:34.000Z",
          "wordCount": 1900,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Things I wish Git had: Commit groups"
        },
        {
          "description": "This week we’re sharing one of the most popular episodes from our new podcast Ship It. Ship It launched in May and now has 8 episodes in the feed to enjoy…it’s hosted by Gerhard Lazu, our SRE here at Changelog.\nIn this episode Gerhard talks with Dave Farley, co-author of Continuous Delivery and the inventor of the Deployment Pipeline. Today, most of us ship code the way we do because 25 years ago, Dave cared enough to drive the change that we now call CI/CD. He is one of the great software engineers: opinio…",
          "link": "https://changelog.com/podcast/447",
          "publishedOn": "2021-07-02T23:00:00.000Z",
          "wordCount": 558,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 447: The foundations of Continuous Delivery"
        },
        {
          "description": "Cakebrew is a Mac App (GUI) that lets you do most of the useful tasks you need in Homebrew. Including updating and finding problems with brew doctor!\nInstalls via Homebrew too - brew install --cask cakebrew\n\nDiscuss on Changelog News",
          "link": "https://www.cakebrew.com/",
          "publishedOn": "2021-07-02T16:18:52.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Cakebrew - macOS app for Homebrew"
        },
        {
          "description": "Nick Reese joins the party to tell us all about Elder.js, his opinionated static site generator and web framework built with SEO in mind. Elder.js was purpose-built with large, content-heavy websites in mind and already serves in many production capacities. We discuss imposter syndrome, the startup/product mindset, Svelte’s virtues, and much more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platfo…",
          "link": "https://changelog.com/jsparty/182",
          "publishedOn": "2021-07-02T16:00:00.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 182: The Elder.js Guide to the Galaxy"
        },
        {
          "description": "Every line of code written comes at a price: maintenance. To avoid paying for a lot of code, we build reusable software. The problem with code re-use is that it gets in the way of changing your mind later on.\nDeleting code is fun! Let’s all write code that’s easy to delete. But how?\nTo write code that’s easy to delete: repeat yourself to avoid creating dependencies, but don’t repeat yourself to manage them. Layer your code too: build simple-to-use APIs out of simpler-to-implement but clumsy-to-use parts. Sp…",
          "link": "https://programmingisterrible.com/post/139222674273/how-to-write-disposable-code-in-large-systems",
          "publishedOn": "2021-07-02T14:34:00.000Z",
          "wordCount": 3537,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Write code that is easy to delete, not easy to extend"
        },
        {
          "description": "Solid… does not use a Virtual DOM. Instead it opts to compile its templates down to real DOM nodes and wrap updates in fine grained reactions. This way when your state updates only the code that depends on it runs.\nSolid takes a lot of cues from React, but sets itself apart in that it doesn’t use a Virtual DOM. Here’s what Michel Weststrate had to say about it on Twitter:\nNot a revolution, but really solid (pun) evolution; clean component model, really efficient run-time model, deeply embedded reactivity. D…",
          "link": "https://github.com/solidjs/solid",
          "publishedOn": "2021-07-02T13:46:00.000Z",
          "wordCount": 1310,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Solid – a declarative JavaScript library for creating user interfaces"
        },
        {
          "description": "This repository is a collection of various materials and tools that I use every day in my work. It contains a lot of useful information gathered in one piece. It is an invaluable source of knowledge for me that I often look back on.\nThis repo is meant to only contain the good stuff, but holy cow there’s a LOT of stuff in here.\nDiscuss on Changelog News",
          "link": "https://github.com/trimstray/the-book-of-secret-knowledge",
          "publishedOn": "2021-07-01T18:04:00.000Z",
          "wordCount": 22115,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Book of Secret Knowledge 📘"
        },
        {
          "description": "Learning Go with code pop quizzes is a fun way to zoom in on different language features. People are looking forward to pop quizzes on Twitter and in conferences, and they also learn from that. Let’s chat about pop quizzes!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database on the planet. Build and scale fast with CockroachCl…",
          "link": "https://changelog.com/gotime/186",
          "publishedOn": "2021-07-01T16:10:00.000Z",
          "wordCount": 448,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 186: Pop quiz time! 😱"
        },
        {
          "description": "Responsive design is evolving. Una Kravets:\nToday, when using the term: “responsive design”, you are most likely thinking about using media queries to change layout when resizing a design from mobile size, to tablet size, through to desktop size.\nBut soon, this perception of responsive design may be considered as outdated as using tables for page layout.\n“Responsive” used to mean a web design would respond based on the size of the device accessing it. In the not-so-distant future, it will mean a web design …",
          "link": "https://web.dev/new-responsive/",
          "publishedOn": "2021-07-01T14:57:00.000Z",
          "wordCount": 2304,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Web design in a component-driven world"
        },
        {
          "description": "Take a tour of Python’s functools module and learn how to use its higher-order functions to implement caching, overloading, creating decorators and in general how to make your code a bit more functional.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/52",
          "publishedOn": "2021-07-01T14:09:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The power of higher-order functions in Python"
        },
        {
          "description": "Why Cloud Native? What are the guiding principles that you should keep in mind as you are choosing a project from the Cloud Native Landscape? How do you build &amp; ship an app in a Cloud Native way? Katie Gamanji, Ecosystem Advocate @ CNCF and former cloud engineer for American Express, Condé Nast and Microsoft, joins Gerhard to cover these topics in the context of the Cloud Native Fundamentals course that she developed. 15,000 students have already enrolled, and the initial feedback has been great. Tune i…",
          "link": "https://changelog.com/shipit/8",
          "publishedOn": "2021-07-01T11:00:00.000Z",
          "wordCount": 516,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 8: Cloud Native fundamentals"
        },
        {
          "description": "Erik Kennedy with a checklist of his most important UX tips for creating usable signup and login forms. He covers everything from field autofocus to letting people optionally see the password they’re typing. ✅\nDiscuss on Changelog News",
          "link": "https://learnui.design/blog/tips-signup-login-ux.html",
          "publishedOn": "2021-06-30T15:04:00.000Z",
          "wordCount": 1571,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Tips for better UX on your signup/login forms"
        },
        {
          "description": "A while ago I did a blog post about using fzf in Vim, so this is a nice complementary post on how to use fzf in the terminal. It should be super useful to folks who dwell inside the command-line on a day-to-day basis.\nDiscuss on Changelog News",
          "link": "https://pragmaticpineapple.com/four-useful-fzf-tricks-for-your-terminal/",
          "publishedOn": "2021-06-30T14:15:00.000Z",
          "wordCount": 1258,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Useful fzf tricks for your terminal"
        },
        {
          "description": "GAN Theft Auto is a Generative Adversarial Network that recreates the Grand Theft Auto 5 environment. It is created using a GameGAN fork based on NVIDIA’s GameGAN research.\nSource code here.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=udPY5rQVoW0",
          "publishedOn": "2021-06-29T14:11:00.000Z",
          "wordCount": 23,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Playing a neural network's version of GTA V"
        },
        {
          "description": "Sad but true: Git is simply too hard. One thing driving said truth is that undoing things often requires jumping through obscure hoops. Here’s what Waleed Khan has to say on the matter:\nWell, it’s not that it’s too easy to lose your data — but rather, that it’s too difficult to recover it. For each operation you want to recover from, there’s a different “magic” incantation to undo it. All the data is still there in principle, but it’s not accessible to many in practice.\nHere’s my theory: novice and intermed…",
          "link": "https://blog.waleedkhan.name/git-undo/",
          "publishedOn": "2021-06-29T13:24:00.000Z",
          "wordCount": 487,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Git undo: we can do better"
        },
        {
          "description": "Dr. Axel Rauschmayer gives us a feel for one of the most exciting new APIs in JavaScript-land.\nThe Temporal date time API is accessible via the global variable Temporal. It is a pleasure to use:\nAll objects are immutable. Changing them produces new values, similarly to how strings work in JS.\nThere is support for time zones and non-Gregorian calendars.\nThere are several specialized classes for Temporal values (date time values with time zones, date time values without time zones, date values without time zo…",
          "link": "https://2ality.com/2021/06/temporal-api.html",
          "publishedOn": "2021-06-28T19:05:00.000Z",
          "wordCount": 3474,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Temporal: getting started with JavaScript’s new date time API"
        },
        {
          "description": "A perspective on incidents that makes a lot of sense actually, and captures the “Why?” perfectly. My highlights: Incidents involve more people than we think. Tooling just makes it really hard for them to help. We have more incidents than we realise. We just don’t hear about them. Your whole team, on the same team. Practice makes perfect.\nDiscuss on Changelog News",
          "link": "https://incident.io/blog/incidents-are-for-everyone",
          "publishedOn": "2021-06-28T17:08:00.000Z",
          "wordCount": 1530,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Incidents are for everyone"
        },
        {
          "description": "Brave Search has some similarities to DDG (which has been my default for a couple years now), but it’s different in that it builds its own index vs relying on Bing and Yandex. Brave’s principles:\nPrivacy: no tracking or profiling of users.\nUser-first: the user comes first, not the advertising and data industries.\nIndependence: Brave has its own search index for answering common queries privately without reliance on other providers.\nChoice: soon, options for ad-free paid search and ad-supported search.\nTrans…",
          "link": "https://brave.com/brave-search-beta/",
          "publishedOn": "2021-06-28T16:18:00.000Z",
          "wordCount": 1462,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Brave adds a privacy-focused search engine (beta)"
        },
        {
          "description": "Contributing to open-source projects can be intimidating – and PostgreSQL is no exception. As a long-time PostgreSQL contributor, Aleks shares his hard-earned tips to help you make your first contribution, or start contributing more.\nDiscuss on Changelog News",
          "link": "https://blog.timescale.com/blog/how-and-why-to-become-a-postgresql-contributor/",
          "publishedOn": "2021-06-28T15:24:00.000Z",
          "wordCount": 3238,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How (and why) to become a PostgreSQL contributor"
        },
        {
          "description": "This week we chat with Angie Jones about all things testing. We’ll cover unit testing, visual testing, end-to-end testing, and more!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance issues across your tech stack down to the line of code. Get started with a free 14-day trial, h…",
          "link": "https://changelog.com/jsparty/181",
          "publishedOn": "2021-06-25T15:45:00.000Z",
          "wordCount": 435,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 181: Testing testing 1 2 3"
        },
        {
          "description": "Sometimes you start a thing and lose interest. Or maybe it brings in some cash, but not what you’d hoped. Rather than let it languish and eventually die, sell your thing on Tiny Acquisitions.\nSometimes you want to start a thing, but don’t have a good idea. Or maybe you’ve tried a few times, but nothing that generated income. Rather than start from scratch with an unproven idea, buy a thing on Tiny Acquisitions.\nDiscuss on Changelog News",
          "link": "https://tinyacquisitions.com/home",
          "publishedOn": "2021-06-25T15:12:00.000Z",
          "wordCount": 6,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A place to buy and sell tiny projects worth less than $5k"
        },
        {
          "description": "Andrej Karpathy, Sr. Director of AI at Tesla:\nWe are going to create, digitally sign, and broadcast a Bitcoin transaction in pure Python, from scratch, and with zero dependencies. In the process we’re going to learn quite a bit about how Bitcoin represents value. Let’s get it.\nThis post is a technical deep-dive. At the end he posted a reader exercise which was to steal some bitcoins his wallet. The challenge, of course, was completed within 45 minutes of publishing. 😁\nDiscuss on Changelog News",
          "link": "https://karpathy.github.io/2021/06/21/blockchain/",
          "publishedOn": "2021-06-25T14:23:00.000Z",
          "wordCount": 12598,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A from-scratch tour of bitcoin in Python"
        },
        {
          "description": "Kathy Korevec has been putting a lot of thought into documentation as part of her work at GitHub:\nWouldn’t it be great if the docs knew that you were writing a Python app on a Windows machine and that you preferred watching videos instead of reading through text? I want you to find the answer to your questions in the docs, easily and efficiently. When you’re stuck on a problem and you turn to the docs, there’s a moment of magic as you find the solution, try it out and it works. In that moment you become unb…",
          "link": "https://kathykorevec.medium.com/building-a-better-place-for-docs-197f92765409",
          "publishedOn": "2021-06-25T13:36:00.000Z",
          "wordCount": 2714,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Maybe it’s time we re-think docs"
        },
        {
          "description": "We discuss how Test Driven Development (TDD) can help you write better code, and build better software. Packed with tips and tricks, gotchas and best practices, the panel explore the subject and share their real-world experiences.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database on the planet. Build and scale fast with Cock…",
          "link": "https://changelog.com/gotime/185",
          "publishedOn": "2021-06-24T16:15:00.000Z",
          "wordCount": 400,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 185: Giving TDD a Go"
        },
        {
          "description": "Karsten Silz for InfoQ:\nEight years in the making with 28,000 commits, 7400 pull requests, and 4100 closed issues, Scala 3.0 has been released, delivering a “complete overhaul of the Scala language” with new features, updates to the syntax and type systems, and new tools for meta-programming.\nHoly wow that must’ve been quite the undertaking. Our Scala coverage is embarrassingly scant. Maybe it’s time for an episode of The Changelog on the subject? Who would be the ideal guest(s) for such a conversation?\nDis…",
          "link": "https://www.infoq.com/news/2021/06/scala-3-overhaul/",
          "publishedOn": "2021-06-24T14:56:00.000Z",
          "wordCount": 3586,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Scala 3 overhauls language for better developer experience"
        },
        {
          "description": "Chip Huyen has been on both sides of  ML-related interviews and has a lot of expertise on the process:\nIf you’ve picked up this book because you’re interested in working with one of the key emerging technologies of the 2020s but not sure where to start, you’re in the right place. Whether you want to become an ML engineer, a platform engineer, a research scientist, or you want to do ML but don’t yet know the differences among those titles, I hope that this book will give you some useful pointers.\nDiscuss on …",
          "link": "https://huyenchip.com/ml-interviews-book/",
          "publishedOn": "2021-06-24T13:54:00.000Z",
          "wordCount": 1065,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A free book on how to survive the machine learning interview process"
        },
        {
          "description": "The New Stack has a solid summary of what’s new in Grafana 8. Shiny! ✨\n\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/grafana-8-0-rethinks-alerts-and-visualizations/",
          "publishedOn": "2021-06-23T18:39:00.000Z",
          "wordCount": 1433,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Grafana 8.0 rethinks alerts and visualizations"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Lars Wikman (independent Elixir/BEAM software consultant) why sometimes a monolith running on a single host with continuous backups and a built-in self-restore capability is everything that a small team of developers needs. That’s right, no Kubernetes or microservices. After 2 years of running changelog.com, a Phoenix monolith, on Kubernetes, what do I think? Join our discuss and find out!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to …",
          "link": "https://changelog.com/shipit/7",
          "publishedOn": "2021-06-23T16:00:00.000Z",
          "wordCount": 465,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 7: Why Kubernetes?"
        },
        {
          "description": "Benny Powers is NOT pleased with what he believes is missing from the latest React release:\nFor five years now, there’s been a concerted, multilateral push to bring React into line with every other major framework on custom elements, enshrined in the HTML and DOM specs for years now. Much effort was spent both in public and behind the scenes to encourage the React core team to implement real support for the standards.\nBut then the PRs were closed, or ignored without public comment. And the issues languished…",
          "link": "https://dev.to/bennypowers/what-s-not-new-in-react-18-45c7",
          "publishedOn": "2021-06-23T15:10:00.000Z",
          "wordCount": 2571,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What's NOT new in React 18"
        },
        {
          "description": "In this article, I’d like to explore a couple of implementations of sorting algorithms. However, I’d like to do so driven by unit tests. The examples are written in Go, but don’t worry if you never worked with Go before. The emphasis here is on the journey and the joy of building solutions guided by tests!\nDiscuss on Changelog News",
          "link": "https://alabeduarte.com/test-driven-algorithms/sorting/",
          "publishedOn": "2021-06-23T14:24:00.000Z",
          "wordCount": 3167,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Let's test-drive some sorting algorithms"
        },
        {
          "description": "A deep-dive on what conditional HTTP requests are, reviewing the main pieces of the RFC, explaining the semantics of validators and preconditions, then showing examples how you can implement conditional HTTP GETs in your web app.\nDiscuss on Changelog News",
          "link": "https://ieftimov.com/post/conditional-http-get-fastest-requests-need-no-response-body/",
          "publishedOn": "2021-06-23T13:38:00.000Z",
          "wordCount": 3789,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Conditional HTTP GET: The fastest requests need no response body"
        },
        {
          "description": "This talk by Brittany Storoz from JSConf EU 2018 is sooo good! If you’ve ever wondered why we call bugs bugs, why we throw and catch exceptions, or why we use foo and bar as placeholder variables, give it a 👀\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=2KTK2qD4-gs",
          "publishedOn": "2021-06-22T18:39:00.000Z",
          "wordCount": 23,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The etymology of programming jargon"
        },
        {
          "description": "Pinecone is the first vector database for machine learning.  Edo Liberty explains to Chris how vector similarity search works, and its advantages over traditional database approaches for machine learning.  It enables one to search through billions of vector embeddings for similar matches, in milliseconds, and Pinecone is a managed service that puts this capability at the fingertips of machine learning practitioners.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and…",
          "link": "https://changelog.com/practicalai/139",
          "publishedOn": "2021-06-22T16:00:00.000Z",
          "wordCount": 409,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 139: Vector databases for machine learning"
        },
        {
          "description": "This project is no longer actively developed, but it looks like an excellent resource for anyone who is interested in compilers. Ruby is an easy language to grok, so it should make for (relatively) easy reading!\nRhizome is a paedagogical just-in-time compiler (JIT) for Ruby, implemented in pure Ruby. It’s not really designed to be used. It’s designed to show you how JITs work and why perhaps a JIT for Ruby should be written in Ruby. It’s also designed to try to go beyond the trivial aspects of a simple temp…",
          "link": "https://github.com/chrisseaton/rhizome",
          "publishedOn": "2021-06-22T14:52:00.000Z",
          "wordCount": 812,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A pure-Ruby JIT compiler for Ruby (read it, don't use it!)"
        },
        {
          "description": "The general idea is to leverage cache-friendly ways of organizing data in structures of arrays (SoA) otherwise known “columnar” storage in database design. This, in turn allows us to iterate and filter over columns very efficiently. On top of that, this package also adds bitmap indexing to the columnar storage, allowing to build filter queries using binary and, and not, or and xor (see kelindar/bitmap with SIMD support).\nDiscuss on Changelog News",
          "link": "https://github.com/kelindar/column",
          "publishedOn": "2021-06-22T13:50:00.000Z",
          "wordCount": 3819,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A high-performance, columnar, in-memory storage engine for Go"
        },
        {
          "description": "AugLy is a great library to utilize for augmenting your data in model training, or to evaluate the robustness gaps of your model! We designed AugLy to include many specific data augmentations that users perform in real life on internet platforms like Facebook’s – for example making an image into a meme, overlaying text/emojis on images/videos, reposting a screenshot from social media. While AugLy contains more generic data augmentations as well, it will be particularly useful to you if you’re working on a p…",
          "link": "https://github.com/facebookresearch/AugLy",
          "publishedOn": "2021-06-21T20:50:00.000Z",
          "wordCount": 1204,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A data augmentations library for audio, image, text, and video"
        },
        {
          "description": "On this episode we’re talking with our good friend Mat Ryer whom you may know from the Go Time podcast. Mat created an awesome open source tool for putting just about anything in your Mac’s toolbar. It was originally written in Objective-C, but it just got a big rewrite in Go and abig  rename from BitBar to xbar.\nIf you don’t use a Mac don’t hit skip on this episode quite yet! There are lessons to be learned for anyone interested in hacking on tools to make your life better. Plus, with this rewrite Mat has …",
          "link": "https://changelog.com/podcast/446",
          "publishedOn": "2021-06-21T20:00:00.000Z",
          "wordCount": 512,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 446: xbar puts anything in your macOS menu bar"
        },
        {
          "description": "You sigh. Maybe the compilation didn’t work? You recompile and run it again. Nope. Still the same problem. You stare out the window.\nThis post is about ways of getting unstuck on a problem when you do not (yet) have all the relevant knowledge. It focuses on the problem with the ego when being a more seasoned programmer and the difficulty on admitting that you don’t know (yet).\nFrom there we go through the steps on being unstuck and making that ego more inflated and annoying.\nDiscuss on Changelog News",
          "link": "https://www.iamjonas.me/2021/06/getting-unstuck.html",
          "publishedOn": "2021-06-21T15:23:00.000Z",
          "wordCount": 1804,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Getting unstuck"
        },
        {
          "description": "Super Mario World Widescreen is your beloved Mario World SNES game but in the 16:9 resolution. This is possible by expanding the horizontal resolution by 96 pixels, increasing resolution from 256x224 to 352x224. Since the original SNES does not have this resolution, the emulator focused into high definition mods bsnes-hd must be used.\nI love how open source hackers give classic games like this new life by applying their skill and ingenuity to a property they love. I wonder if having it in widescreen changes…",
          "link": "https://github.com/VitorVilela7/wide-snes",
          "publishedOn": "2021-06-21T14:37:00.000Z",
          "wordCount": 1003,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Super Mario World modded to be 16:9"
        },
        {
          "description": "This week we’re talking with Pia Mancini about the latest updates to the mission of Open Collective. Earlier this year Open Collective announced “Funds for Open Source.” The idea is simple, make it easy for companies to invest in open source, and they will. Also, since recording this episode, Pia and the team at Open Collective along with Gitcoin announced fundoss.org as part of Maintainer Week announcements. And right now, they have a matching fund of $75,000 dollars funding open source that you can suppor…",
          "link": "https://changelog.com/podcast/445",
          "publishedOn": "2021-06-18T21:00:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 445: Funds for open source"
        },
        {
          "description": "Yulia Startsev from Mozilla’s SpiderMonkey team joins Jerod &amp; Feross to talk compilers, going back to get your Master’s, making decisions as a group, process of shepherding a feature through TC39, how Firefox actually works, and LavaMoats. Yes, LavaMoats.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find…",
          "link": "https://changelog.com/jsparty/180",
          "publishedOn": "2021-06-18T16:00:00.000Z",
          "wordCount": 422,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 180: Of spiders and monkeys"
        },
        {
          "description": "This animated “children’s” book is spectacularly good. It centers around a growing community of otters, their struggles to communicate efficiently, and one little otter named Nixie’s great idea that changed the forest forever.\nPut, put, put your events\n\nDiscuss on Changelog News",
          "link": "https://www.gentlydownthe.stream/",
          "publishedOn": "2021-06-18T14:27:00.000Z",
          "wordCount": 94,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An illustrated guide to Apache Kafka"
        },
        {
          "description": "DenoDB has a fully-typed API (which is great for editor integration) and supports a whole host of backends: MySQL/Maria, SQLite, Postgres, and MongoDB.\nBroad database support is great for library adoption, but as a user I’d prefer something that leans in to a specific ecosystem, which usually lets you squeeze more out of it.\nRegardless of that, it’s great to see the Deno community building foundational tools like this.\nDiscuss on Changelog News",
          "link": "https://github.com/eveningkid/denodb",
          "publishedOn": "2021-06-18T13:40:00.000Z",
          "wordCount": 893,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno gets an ORM"
        },
        {
          "description": "What you will see next is a highly subjective, non-exhaustive unordered list of principles that, if you follow, I can guarantee will lead you to become a bad developer…\nIf your goal, fellow reader, is to become a good developer instead, don’t worry. Remember that via negativa is way more powerful than via positiva. That means that knowing what not to do is safer and easier to figure out than exactly what to do. So pay attention to the following topics and decide which type of developer you want to be.\nI (di…",
          "link": "https://rafaelquintanilha.com/how-to-become-a-bad-developer/",
          "publishedOn": "2021-06-17T18:30:00.000Z",
          "wordCount": 1355,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to become a bad developer"
        },
        {
          "description": "A bad CLI can easily discourage users from interacting with it. Building successful CLIs requires attention to detail and empathy for the user in order to create a good user experience. It is very easy to get wrong.\nIn this guide I have compiled a list of best practices across areas of focus which aim to optimize for an ideal user experience when interacting with a CLI application.\nDiscuss on Changelog News",
          "link": "https://github.com/lirantal/nodejs-cli-apps-best-practices",
          "publishedOn": "2021-06-17T17:39:00.000Z",
          "wordCount": 6140,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The largest Node.js CLI Apps best practices list ✨"
        },
        {
          "description": "Porter lets you package your application artifacts, client tools, configuration and deployment logic together as a versioned bundle that you can distribute, and then install with a single command. Written entirely in Go, we speak to one of the creators about running an open source project, the importance of documentation, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any…",
          "link": "https://changelog.com/gotime/184",
          "publishedOn": "2021-06-17T16:00:00.000Z",
          "wordCount": 414,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 184: All about Porter"
        },
        {
          "description": "Yejun Su is using Numerical Elixir’s new Livebook project for more than just Numerical Things.\nBefore Livebook, I write code in IEx, which is a REPL. It has some helpers to ease the way to explore code, but in my opinion, Livebook exceeds in two factors:\nCode history\nexport ERL_AFLAGS=&quot;-kernel shell_history enabled&quot; in the shell profile file. You can also search the IEx code history with Ctrl-r and apply it. But as Livebook is essentially a notebook, you can see all texts and evaluation results wi…",
          "link": "https://goofansu.medium.com/livebook-driven-development-50f82e66fbff",
          "publishedOn": "2021-06-17T14:50:00.000Z",
          "wordCount": 784,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Livebook-driven development"
        },
        {
          "description": "Utopia is an integrated design and development environment for React. It uses React code as the source of truth, and lets you make real time changes to components by editing it and using a suite of design tools. It’s early software, but you can try it today, look at an example project, or read about it on our blog!\n\nDiscuss on Changelog News",
          "link": "https://github.com/concrete-utopia/utopia",
          "publishedOn": "2021-06-17T13:42:00.000Z",
          "wordCount": 2465,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An integrated design and development environment for React"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Ian Miell, author of Docker in Practice as well as Learn Git, Bash, and Terraform the Hard Way. They talk about being comfortable with the uncomfortable, focusing on the tech while keeping a holistic view of the business. Following the money is key. Ian explains this concept really well, and Gerhard feels fairly confident you will be better off if you pay attention. Let us know in the comments!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get close…",
          "link": "https://changelog.com/shipit/6",
          "publishedOn": "2021-06-17T11:00:00.000Z",
          "wordCount": 475,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 6: Follow the money"
        },
        {
          "description": "Matthew Gerstman:\nI’ve been tasked with leading frontend. As a result, I’ve been teaching a whole lot of people about the web.\nKnowing where we came from can help us figure out where we should go. It’s also a mountain of technical debt, and we’re collectively building on top of it.\nForgive me if I skip the wonderful stories of Macromedia Flash, Java in the browser, or whatever other detour you can think of. While those were important to development of the web, most of us will never run into them again.\nThe …",
          "link": "https://www.matthewgerstman.com/tech/history-of-the-web/",
          "publishedOn": "2021-06-16T15:52:00.000Z",
          "wordCount": 3550,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "History of the web: part 1"
        },
        {
          "description": "You’ve probably seen many of these commands hit Changelog News over the years, but now you can see them all again in one hand-curated place. Who knows, maybe one or two will be new to you. I hadn’t heard of curlie previously, which looks like a nice merging of cur and httpie.\nDiscuss on Changelog News",
          "link": "https://github.com/ibraheemdev/modern-unix",
          "publishedOn": "2021-06-16T13:34:00.000Z",
          "wordCount": 727,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Modern alternatives to Unix commands"
        },
        {
          "description": "Prestige rivals rich HTTP clients such as Postman and Insomnia by being… less rich. BUT. All you have to do is fire it up in your browser and type out some plain text. So straight forward!\n\nDiscuss on Changelog News",
          "link": "https://prestigemad.com/",
          "publishedOn": "2021-06-15T18:40:00.000Z",
          "wordCount": 38,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A text-based HTTP client in your browser"
        },
        {
          "description": "A quick list of 23 skills for varying levels of seniority, from senior, to staff, and beyond. My favorites from the list are How to listen to other engineers’ ideas without feeling threatened (#10) and How to pick your battles (#18) .\nEveryone else’s favorite, according to the top highlight,  is How to get someone promoted (#19).\nDiscuss on Changelog News",
          "link": "https://skamille.medium.com/an-incomplete-list-of-skills-senior-engineers-need-beyond-coding-8ed4a521b29f",
          "publishedOn": "2021-06-15T15:56:00.000Z",
          "wordCount": 649,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An incomplete list of skills senior engineers need, beyond coding"
        },
        {
          "description": "William Falcon wants AI practitioners to spend more time on model development, and less time on engineering. PyTorch Lightning is a lightweight PyTorch wrapper for high-performance AI research that lets you train on multiple-GPUs, TPUs, CPUs and even in 16-bit precision without changing your code! In this episode, we dig deep into Lightning, how it works, and what it is enabling. William also discusses the Grid AI platform (built on top of PyTorch Lightning). This platform lets you seamlessly train 100s of …",
          "link": "https://changelog.com/practicalai/138",
          "publishedOn": "2021-06-15T14:45:00.000Z",
          "wordCount": 549,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 138: Multi-GPU training is hard (without PyTorch Lightning)"
        },
        {
          "description": "When it comes to scaling, we might need to think about:\ndata storage, if we store more and more data and it becomes expensive or slow working with them\nfast INSERTs and UPDATES for write-heavy workloads\nmaking SELECT queries faster because of their complexity or because they need to query huge amounts of data\nconcurrency if we have many clients interacting with the database\nIn this article, I will present some basic ideas and starting points on scaling traditional SQL databases.\nDiscuss on Changelog News",
          "link": "https://stribny.name/blog/2020/07/scaling-relational-sql-databases/",
          "publishedOn": "2021-06-14T17:07:00.000Z",
          "wordCount": 2487,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Scaling relational SQL databases"
        },
        {
          "description": "WWDC21 wasn’t the most exciting Apple keynote ever (especially for those of us hoping for some new hardware), but there were a lot of software things announced. Apple continues to iterate on Swift, and the new 5.5 beta has some really cool stuff in it. InfoQ has the rundown on its two flagship improvements.\nDiscuss on Changelog News",
          "link": "https://www.infoq.com/news/2021/06/swift-async-await-actors/",
          "publishedOn": "2021-06-14T14:19:00.000Z",
          "wordCount": 3439,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Swift 5.5 brings async/await and actor support"
        },
        {
          "description": "Don Watkins:\nMark Van Doren said, “the art of teaching is the art of assisting discovery.” I saw that play out in this classroom using open source tools. More students need opportunities like this to help them gain a quality education. The Raspberry Pi 400 is a great form factor for teaching and learning.\nSuch a cool program that’d be easy to reproduce in your local library.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/21/6/teach-python-raspberry-pi",
          "publishedOn": "2021-06-14T13:24:00.000Z",
          "wordCount": 1401,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How I teach Python on the Raspberry Pi 400 at the public library"
        },
        {
          "description": "Tanner joins Nick to talk about his projects, react-query and react table, and discuss scratching your own itch in a maintainable way with open source.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are …",
          "link": "https://changelog.com/jsparty/179",
          "publishedOn": "2021-06-11T17:30:00.000Z",
          "wordCount": 390,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 179: Building on the TanStack"
        },
        {
          "description": "OldOS is a testament to the days of yesteryear, showcasing what iOS once was ten years ago. The ethos of the app is to merge the technologies of today with a pixel-perfect recreation of the user experience of the past. The vast majority of apps in OldOS are fully functional — meaning they seamlessly integrate with the data on your phone to deliver a live, emulator-esque experience. What does this mean? Well, you can play your music in iPod, get directions in Maps, surf the web in Safari, view the current we…",
          "link": "https://github.com/zzanehip/The-OldOS-Project",
          "publishedOn": "2021-06-11T15:17:00.000Z",
          "wordCount": 1022,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Recreating a fully functional version of iOS 4 in SwiftUI"
        },
        {
          "description": "This bold statement starts a long Twitter thread by Brantly Millegan:\n“Sign-In w/ Ethereum” is the future of login for every app on the Internet, crypto-related or not. Not just an idea, it’s already the norm for web3 &amp; will spread.\nThis idea was the most interesting/exciting thing for me that came out of our NFT talk with Mikeal Rogers. Could cryptocurrency be the carrot that attracts the masses to obtain a public/private key pair and be financially incentivized to secure it? If so, this makes for a fa…",
          "link": "https://twitter.com/brantlymillegan/status/1402388133086367751",
          "publishedOn": "2021-06-11T14:26:00.000Z",
          "wordCount": 196,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "\"The Ethereum community has accidentally solved a major problem of the Internet: Single Sign-On\""
        },
        {
          "description": "This episode was recorded live from GopherCon Europe 2021!\nNatalie &amp; Mat host three amazing devs who gave talks that showcase using Go in unusual ways: Dr. Joakim Kennedy is tracking Go in malware, Mathilde Raynal is building quantum-resistant cryptography algorithms, and Preslav Rachev is creating digital art.\nWe hear from our speakers how they got into Go, how they made the choice to use Go for their unusual use case, and how it compares to other languages for their specific needs.\nWe also chat about …",
          "link": "https://changelog.com/gotime/183",
          "publishedOn": "2021-06-10T15:45:00.000Z",
          "wordCount": 475,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 183: Using Go in unusual ways"
        },
        {
          "description": "When it comes to open source, we came for the code, but we stayed for the people. Some of the best, brightest, &amp; kindest people we’ve met over our years doing The Changelog are maintainers of open source software.\nWe’ve been working (alongside others) to support, encourage, and shine our spotlight on these amazing people for awhile now, so it was exciting to hear that our friends at GitHub and Tidelift were organizing Maintainer Week.\nIf you listened to our Maintainer Week episode, then you already know…",
          "link": "https://changelog.com/posts/thank-a-maintainer-on-us",
          "publishedOn": "2021-06-10T11:05:00.000Z",
          "wordCount": 611,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Thank a maintainer on us!"
        },
        {
          "description": "Maintainer Week is finally here and we’re excited to make this an annual thing! If Maintainer Week is new to you, check out episode #442 with Josh Simmons and Kara Sowles.\nToday we’re talking Brett Cannon. Brett is Dev Manager of the Python Extension for VS Code, Python Steering Council Member, and core team member for Python. He recently shared a blog post The social contract of open source, so we invited Brett to join us for Maintainer Week to discuss this topic in detail.\nThank a maintainer on us! We’re …",
          "link": "https://changelog.com/podcast/444",
          "publishedOn": "2021-06-10T11:00:00.000Z",
          "wordCount": 489,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 444: Every commit is a gift"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Dave Farley, co-author of Continuous Delivery and the inventor of the Deployment Pipeline. Today, most of us ship code the way we do because 25 years ago, Dave cared enough to drive the change that we now call CI/CD. He is one of the great software engineers: opinionated, perseverant &amp; focused since the heydays of the internet. Dave continues inspiring and teaching us all via his newly launched YouTube channel, courses and recent books. The apprentice finally mee…",
          "link": "https://changelog.com/shipit/5",
          "publishedOn": "2021-06-09T21:00:00.000Z",
          "wordCount": 552,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 5: The foundations of Continuous Delivery"
        },
        {
          "description": "Miroslav Nikolov:\nYou may not be a project manager. Perhaps you are a developer who likes to code and solve technical challenges. The organizational matter is something you care less about. After all, your company is likely relying on some agile methods and there are product owners and/or SCRUM masters to handle the process. You just need to build new features.\nWhile that’s true you have to sometimes get out of your comfort zone.\nDiscuss on Changelog News",
          "link": "https://webup.org/blog/arguments-for-a-project-kickoff-strategy/",
          "publishedOn": "2021-06-09T17:57:00.000Z",
          "wordCount": 854,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Arguments for a project kickoff strategy"
        },
        {
          "description": "When we had Adam Wathan on JS Party, I asked him if anybody besides the Tailwind team were working on component libraries. He said yes, but didn’t name any off the top of his head. Well, add DaisyUI to the list.\nYour HTML doesn’t need to be messy. DaisyUI adds component classes to Tailwind CSS. Classes like btn, card, etc… No need to deal with hundreds of utility classes.\nNo script dependencies. 2KB gzipped. Worth a look.\nDiscuss on Changelog News",
          "link": "https://daisyui.com/",
          "publishedOn": "2021-06-09T17:09:00.000Z",
          "wordCount": 1279,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "DaisyUI – component classes for Tailwind"
        },
        {
          "description": "Adam and Jerod sit down to answer a listener question (Hi, Alex! 👋) about how we podcast. Not how we create podcasts, but how we consume podcasts. Along the way we share an update on our comments feature, discuss the Apple Podcasts rollout debacle (and how it affected us launching Ship It!), and give a few personal recommendations of podcasts we’re listening to.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nAdam Stacoviak &nda…",
          "link": "https://changelog.com/backstage/17",
          "publishedOn": "2021-06-09T15:10:00.000Z",
          "wordCount": 290,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Backstage 17: Consuming podcasts like PB&J"
        },
        {
          "description": "LJ Miranda:\nWhen I first saw “Avengers: Endgame” in theaters, I noticed that their time travel rule is quite similar to the Git branching model. Referred to as the time heist, our heroes travelled through time to recover the stones…\nI had to truncate that pull quote to avoid Avengers spoilers. If you’ve seen the movie (or don’t care about getting spoiled) there’s some good Git knowledge to be gained from this analogy.\nDiscuss on Changelog News",
          "link": "https://ljvmiranda921.github.io/notebook/2021/06/05/avengers-git/",
          "publishedOn": "2021-06-09T13:59:00.000Z",
          "wordCount": 1402,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What can \"Avengers: Endgame\" teach us about Git?"
        },
        {
          "description": "Chris and Daniel sit down to chat about some exciting new AI developments including wav2vec-u (an unsupervised speech recognition model) and meta-learning (a new book about “How To Learn Deep Learning And Thrive In The Digital World”). Along the way they discuss engineering skills for AI developers and strategies for launching AI initiatives in established companies.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Med…",
          "link": "https://changelog.com/practicalai/137",
          "publishedOn": "2021-06-08T18:00:00.000Z",
          "wordCount": 409,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 137: Learning to learn deep learning 📖"
        },
        {
          "description": "Althttpd is a simple webserver that has run the sqlite.org website since 2004. Althttpd strives for simplicity, security, and low resource usage.\nAs of 2018, the althttpd instance for sqlite.org answers about 500,000 HTTP requests per day (about 5 or 6 per second) delivering about 50GB of content per day (about 4.6 megabits/second) on a $40/month Linode. The load average on this machine normally stays around 0.1 or 0.2. About 19% of the HTTP requests are CGI to various Fossil source-code repositories.\nRicha…",
          "link": "https://sqlite.org/althttpd/doc/trunk/althttpd.md",
          "publishedOn": "2021-06-08T15:57:00.000Z",
          "wordCount": 2049,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Richard Hipp's single file webserver written in C"
        },
        {
          "description": "Brendan Gregg tells a tale from 2005:\nThis is the story of the most unbelievable demo I’ve been given in world of open source. You can’t make this stuff up.\nI don’t want to ruin it, so I’ll just say that it’s not unbelievable in the way you might think it’s unbelievable.\nDiscuss on Changelog News",
          "link": "https://brendangregg.com/blog/2021-06-04/an-unbelievable-demo.html",
          "publishedOn": "2021-06-08T15:06:00.000Z",
          "wordCount": 2557,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An unbelievable demo"
        },
        {
          "description": "This week we’re joined by Ryan Dahl, Node.js creator, and now the creator of Deno - a simple, modern and secure runtime for JavaScript and TypeScript that uses V8 and is built in Rust.\nWe talk with Ryan about the massive success of Node and how it impacted his life, how he eventually created Deno and what he’s doing differently this time around. We also talk about The Deno Company, and what’s in store for Deno Delpoy.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, a…",
          "link": "https://changelog.com/podcast/443",
          "publishedOn": "2021-06-08T12:00:00.000Z",
          "wordCount": 485,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 443: Exploring Deno Land 🦕"
        },
        {
          "description": "Powered by Mediapipe, TensorFlow, and Jeeliz.\n\nDiscuss on Changelog News",
          "link": "https://handsfree.dev",
          "publishedOn": "2021-06-07T16:31:00.000Z",
          "wordCount": 2044,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Add face, hand, and pose tracking to your projects in a snap ✨👌"
        },
        {
          "description": "I was clueless how big and competitive a marketplace Chrome extensions are until Oleg Anashkin decided to document all of the proposals he’s received over the years to monetize Hover Zoom+. His reasoning:\nThe main reason I continue to maintain this extension is because I can hardly trust others to not fall for one of these offers. I’m fortunate to have a job that pays well enough to allow me to keep my moral compass and ignore all of these propositions. I realize that not everyone has the same financial sec…",
          "link": "https://github.com/extesy/hoverzoom/discussions/670",
          "publishedOn": "2021-06-07T15:03:00.000Z",
          "wordCount": 9240,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Chrome extension devs get hit up incessantly with monetization proposals"
        },
        {
          "description": "We first talked fuzzing with Katie Hockman back in August of 2020. Fast-forward 10 months and native fuzzing in Go is ready for beta testing! Here’s Katie explaining fuzzing, for the uninitiated:\nFuzzing is a type of automated testing which continuously manipulates inputs to a program to find issues such as panics or bugs. These semi-random data mutations can discover new code coverage that existing unit tests may miss, and uncover edge case bugs which would otherwise go unnoticed. Since fuzzing can reach t…",
          "link": "https://blog.golang.org/fuzz-beta",
          "publishedOn": "2021-06-07T13:53:00.000Z",
          "wordCount": 747,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go's fuzzing effort now in beta"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": []
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "Over the past year, responsibly developed AI has transformed health screenings, supportedfact-checking to battle misinformation and save lives, predicted Covid-19 cases to support public health, and protected wildlife after bushfires. Developing AI in a way that gets it right for everyone requires openness, transparency, and a clear focus on understanding the societal implications. That is why we were among the first companies to develop and publish AI Principles and why, each year, we share updates on our …",
          "link": "https://blog.google/technology/ai/update-our-progress-responsible-ai-innovation/",
          "publishedOn": "2021-06-30T17:00:00.000Z",
          "wordCount": 2323,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "An update on our progress in responsible AI innovation"
        },
        {
          "description": "Have you ever noticed that the word art is embedded in the phrase artificial intelligence? Neither did we, but when the opportunity presented itself to explore how artificial intelligence (AI) inspires artistic expression — with the help of internationally renowned Canadian artist Douglas Coupland — the Google Research team jumped on it. This collaboration, with the support of Google Arts &amp; Culture, culminated in a project called Slogans for the Class of 2030, which spotlights the experiences of the fir…",
          "link": "https://blog.google/outreach-initiatives/arts-culture/douglas-coupland-slogans-class-2030/",
          "publishedOn": "2021-06-29T10:00:00.000Z",
          "wordCount": 1308,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Douglas Coupland fuses AI and art to inspire students"
        },
        {
          "description": "Over recent years, we have seen remarkable progress in AI’s ability to confront new problems and help solve old ones. Advancing these efforts was one reason we set up the Google Research India lab in 2019, with a particular emphasis on AI research that could make a positive social impact. It’s also why we've supported nonprofit organizations through the Google AI Impact Challenge.\n\nWorking in partnership with Google.org and Google’s University Relations program, our goal is to help academics and nonprofits …",
          "link": "https://blog.google/technology/ai/30-new-ai-for-social-good-projects/",
          "publishedOn": "2021-06-29T03:00:00.000Z",
          "wordCount": 1241,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "How we’re supporting 30 new AI for Social Good projects"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "I&#8217;m proud and happy to mention that curl just passed the magic limit of 100,000 USD in raised sponsorship money. Or call it donations if you want. Since April 2018. That&#8217;s about 40 months. Donate? Do it here! Donations over time A grand total of 440 awesome organizations and individuals have donated money to the &#8230; Continue reading curl reaches 100K raised &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/06/curl-reaches-100k-raised/",
          "publishedOn": "2021-07-06T06:52:19.000Z",
          "wordCount": 989,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl reaches 100K raised"
        },
        {
          "description": "It is time to once again tell you that people responded very similarly to how they did last year&#8230; curl user survey 2021 analysys Not a lot changed this year compared to last year. Perhaps the biggest three changes this year were that 1. HTTP/3, Unix domain sockets and DNS-over-HTTPS increased significantly among &#8220;used features&#8221; &#8230; Continue reading curl user survey 2021 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/05/curl-user-survey-2021/",
          "publishedOn": "2021-07-05T08:40:21.000Z",
          "wordCount": 747,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl user survey 2021"
        },
        {
          "description": "This part 2. See Giving a away an insane amount of curl stickers for part 1. As suspected already from the start, I ran out of stickers really fast. I ordered more from my trusted sticker guy on the corner, and he could even deliver stickers put into pre-printed envelopes. Envelopes that even got a &#8230; Continue reading Sending those stickers &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/24/sending-those-stickers/",
          "publishedOn": "2021-06-24T12:04:01.000Z",
          "wordCount": 1065,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Sending those stickers"
        },
        {
          "description": "On May 17, I joined the Kathy and Brian, the hosts of the GitHub ReadMe podcast on a video meeting from my home and we had a chat. Mostly about my work on curl. Today the episode &#8220;aired&#8221;. &#8220;curl: 25 years and 200 releases later&#8221; You find it here. Also: Spotify. Apple podcasts. RSS feed. &#8230; Continue reading On the GitHub ReadMe podcast &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/22/on-the-github-readme-podcast/",
          "publishedOn": "2021-06-22T16:11:53.000Z",
          "wordCount": 945,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "On the GitHub ReadMe podcast"
        },
        {
          "description": "curl is a command line tool and library for doing Internet data transfers. It has been around for a loooong time (over 23 years) but there is still a flood of new things being added to it and development being made, to take it further and to keep it relevant today and in the future. &#8230; Continue reading What goes into curl? &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/16/what-goes-into-curl/",
          "publishedOn": "2021-06-15T22:19:25.000Z",
          "wordCount": 2055,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "What goes into curl?"
        },
        {
          "description": "In the afternoon of October 17, 2013 we merged the first config file ever that would use Travis CI for the curl project using the nifty integration at GitHub. This was the actual introduction of the entire concept of building and testing the project on every commit and pull request for the curl project. Before &#8230; Continue reading Bye bye Travis CI &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/14/bye-bye-travis-ci/",
          "publishedOn": "2021-06-14T09:14:30.000Z",
          "wordCount": 1432,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Bye bye Travis CI"
        },
        {
          "description": "In 2012 I wrote a blog post titled curling the metalink, describing how we added support for metalink to curl. Today, we remove that support again. This is a very drastic move, and I feel obliged to explain it so here it goes! curl 7.78.0 will ship without metalink support. Metalink problems There were several &#8230; Continue reading Bye bye metalink in curl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/07/bye-bye-metalink-in-curl/",
          "publishedOn": "2021-06-07T07:06:19.000Z",
          "wordCount": 1076,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Bye bye metalink in curl"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research",
          "publishedOn": "2021-06-12T12:16:09.237Z",
          "wordCount": 1480,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-06-12T12:16:07.738Z",
          "wordCount": 2271,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform",
          "publishedOn": "2021-06-12T12:16:07.716Z",
          "wordCount": 4867,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-06-12T12:16:07.669Z",
          "wordCount": 3218,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks",
          "publishedOn": "2021-06-12T12:16:07.122Z",
          "wordCount": 1631,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan",
          "publishedOn": "2021-06-12T12:16:07.090Z",
          "wordCount": 2259,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-06-12T12:16:07.078Z",
          "wordCount": 2213,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks",
          "publishedOn": "2021-06-12T12:16:07.052Z",
          "wordCount": 3594,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-06-12T12:16:07.028Z",
          "wordCount": 1783,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-06-12T12:16:07.003Z",
          "wordCount": 1451,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning.html",
          "publishedOn": "2021-06-10T12:18:41.631Z",
          "wordCount": 3223,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache.html",
          "publishedOn": "2021-06-10T12:18:41.304Z",
          "wordCount": 2282,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform.html",
          "publishedOn": "2021-06-10T12:18:41.281Z",
          "wordCount": 4864,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data.html",
          "publishedOn": "2021-06-10T12:18:41.156Z",
          "wordCount": 1788,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks.html",
          "publishedOn": "2021-06-10T12:18:41.108Z",
          "wordCount": 1639,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks.html",
          "publishedOn": "2021-06-10T12:18:41.091Z",
          "wordCount": 3583,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research.html",
          "publishedOn": "2021-06-10T12:18:41.075Z",
          "wordCount": 1486,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan.html",
          "publishedOn": "2021-06-10T12:18:40.872Z",
          "wordCount": 2250,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=cGvuclDC_Z1vE_cnVEU6AfLhOPS0h0oMHpEhTRSdXHM5KEqTDahEV1ECVSsZOMl9_kmCvy597kDopqFAXvpeaA');.lst-kix_xko68zpk7do4-7>li{counter-increment:lst-ctn-kix_xko68zpk7do4-7}ol.lst-kix_69oxjbhu0l4-6.start{counter-reset:lst-ctn-kix_69oxjbhu0l4-6 0}ol.lst-kix_xko68zpk7do4-0.start{counter-reset:lst-ctn-kix_xko68zpk7do4-0 0}ol.lst-kix_44h6gatzfsnw-2{list-style-type:none}ol.lst-kix_xko68zpk7do4-6.start{counter-reset:lst-ctn-kix_xko68zpk7do4-6 0}ol.lst-kix_44h6ga…",
          "link": "https://googleprojectzero.blogspot.com/2021/06/an-epyc-escape-case-study-of-kvm.html",
          "publishedOn": "2021-06-29T15:58:00.002Z",
          "wordCount": 6734,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "An EPYC escape: Case-study of a KVM breakout"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Companies offer ongoing bug bounties to freelance ethical hackers to discover security vulnerabilities. Alternatively, penetration testing is a scheduled test of a system’s security to identify weaknesses and vulnerabilities.",
          "link": "https://www.hackerone.com/blog/bug-bounty-vs-penetration-testing-differences-explained",
          "publishedOn": "2021-06-25T20:00:00.000Z",
          "wordCount": 1550,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Bug Bounty vs. Penetration Testing: \tDifferences Explained"
        },
        {
          "description": "Hundreds of HackerOne customers use our platform in their application security processes. For the most part, these are organizations using bug bounty to find vulnerabilities in their deployed applications. But there is so much more that we can do for development teams",
          "link": "https://www.hackerone.com/blog/hackerone-devsecops-0",
          "publishedOn": "2021-06-21T17:00:00.000Z",
          "wordCount": 1690,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "HackerOne in DevSecOps"
        },
        {
          "description": "Vulnerability scanning helps companies identify possible ways an attacker could exploit vulnerabilities that might cause outages, allow unauthorized network access, or acquisition of privileged information. Outdated software products, unpatched operating systems, and misconfigured hardware often lead to vulnerabilities.",
          "link": "https://www.hackerone.com/blog/what-vulnerability-scanning-and-how-do-it-right-0",
          "publishedOn": "2021-06-18T17:00:00.000Z",
          "wordCount": 1723,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What is Vulnerability Scanning? [And How to Do It Right]"
        },
        {
          "description": "Developers need to bring security into their workflows without pivoting to separate security tools to get vulnerability information. HackerOne has created an integration with GitHub to streamline the process of including more security in the Software Development Life Cycle.",
          "link": "https://www.hackerone.com/blog/how-hackerone-and-github-now-work-better-together",
          "publishedOn": "2021-06-17T21:00:00.000Z",
          "wordCount": 711,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How HackerOne and GitHub Now Work Better Together"
        },
        {
          "description": "We recently sat down with Abhijith Chandrashekar, PSIRT Manager at Citrix, to discuss why Citrix continues to expand their bug bounty program and learn about their cloud security and scope expansion plans. Read on to see what he had to say.",
          "link": "https://www.hackerone.com/blog/citrixs-hacker-powered-security-growth-plan-qa-abhijith-chandrashekar",
          "publishedOn": "2021-06-16T15:00:00.000Z",
          "wordCount": 1610,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Citrix’s Hacker-Powered Security Growth Plan: Q&A with Abhijith Chandrashekar"
        },
        {
          "description": "HackerOne recently hosted AWS and a panel of expert ethical hackers to discuss how Server-Side Request Forgery (SSRF) vulnerabilities and cloud misconfiguration are ripe environments for hackers to discover vulnerabilities and improve their skills. In addition, they both represent significant and multi-layered security risks for many organizations.",
          "link": "https://www.hackerone.com/blog/how-hackers-can-help-reduce-your-organizations-application-risk-aws",
          "publishedOn": "2021-06-15T16:00:00.000Z",
          "wordCount": 984,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hackers Can Help Reduce Your Organization's Application Risk on AWS"
        },
        {
          "description": "Penetration testing, aka pen testing or ethical hacking, attempts to attempt to breach a system's security for the purpose of vulnerability identification. Testing is done in an authorized and structured manner to report and rectify so that weaknesses can be reported and rectified.",
          "link": "https://www.hackerone.com/blog/what-penetration-testing-how-does-it-work-step-step-0",
          "publishedOn": "2021-06-14T20:00:00.000Z",
          "wordCount": 2384,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What is Penetration Testing? How Does It Work Step-by-Step?"
        },
        {
          "description": "It's been 60 days since the DoD's Defense Industrial Base Vulnerability Disclosure Program (DIB-VDP) pilot launched. In this blog, DC3 and HackerOne sit down to talk about the pilot’s early successes, learnings to date, and their goals for the future.",
          "link": "https://www.hackerone.com/blog/60-days-insights-dods-defense-industrial-base-vulnerability-disclosure-program-pilot-1",
          "publishedOn": "2021-06-11T15:00:00.000Z",
          "wordCount": 1897,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "60 days of insights from the DoD’s Defense Industrial Base Vulnerability Disclosure Program Pilot"
        },
        {
          "description": "HackerOne sat down with DDS and Army program leaders and one of the security researchers who hacked the Army. We discussed why Hack the matters, the results that were uncovered in Hack the Army 3.0, and their plans for the future of cybersecurity within the DoD and the U.S. Military. Read on to see what they had to say.",
          "link": "https://www.hackerone.com/blog/announcing-hack-army-30-results-conversation-defense-digital-service-us-army-and-hack-army-0",
          "publishedOn": "2021-06-10T12:00:00.000Z",
          "wordCount": 2503,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Announcing Hack the Army 3.0 Results: A Conversation with Defense Digital Service, U.S. Army, and Hack the Army 3.0’s Top Hacker"
        },
        {
          "description": "Reducing risk is the fundamental reason organizations invest in cybersecurity. As the threat landscape grows and evolves, organizations need a proactive approach to building and protecting their security posture.",
          "link": "https://www.hackerone.com/blog/build-resilient-security-posture-vulnerability-intelligence-and-cybersecurity-ratings",
          "publishedOn": "2021-06-07T19:00:00.000Z",
          "wordCount": 1072,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Build a Resilient Security Posture with Vulnerability Intelligence and Cybersecurity Ratings"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "When implementing a language feature for JavaScript, an implementer must make decisions about how the language in the specification maps to the implementation. Private fields is an example of where the specification language and implementation reality diverge, at least in SpiderMonkey– the JavaScript engine which powers Firefox. To understand more, I’ll explain what private fields are, a couple of models for thinking about them, and explain why our implementation diverges from the specification language.\nTh…",
          "link": "https://hacks.mozilla.org/2021/06/implementing-private-fields-for-javascript/",
          "publishedOn": "2021-06-08T15:26:19.000Z",
          "wordCount": 2659,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Implementing Private Fields for JavaScript"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "Today, we're launching a technical preview of GitHub Copilot, a new AI pair programmer that helps you write better code.",
          "link": "https://github.blog/2021-06-29-introducing-github-copilot-ai-pair-programmer/",
          "publishedOn": "2021-06-29T14:28:51.000Z",
          "wordCount": 416,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing GitHub Copilot: your AI pair programmer"
        },
        {
          "description": "GitHub’s bug bounty program is now a mature component of how we improve product security. We're excited to highlight some achievements (and interesting vulnerabilities)!",
          "link": "https://github.blog/2021-06-25-seven-years-github-security-bug-bounty-program/",
          "publishedOn": "2021-06-25T16:01:03.000Z",
          "wordCount": 2085,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Seven years of the GitHub Security Bug Bounty program"
        },
        {
          "description": "We're excited to announce the newest addition to the Student Developer Pack, the GitHub Virtual Event Kit! Access the best virtual event tools in one place at no cost.",
          "link": "https://github.blog/2021-06-24-run-online-campus-events-github-virtual-event-kit/",
          "publishedOn": "2021-06-24T16:00:08.000Z",
          "wordCount": 883,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Run online campus events with your favorite tools at no cost with the new GitHub Virtual Event Kit"
        },
        {
          "description": "Announcing new beta features for GitHub Issues for better planning and tracking of your projects in GitHub, including project tables, task lists, and issue forms.",
          "link": "https://github.blog/2021-06-23-introducing-new-github-issues/",
          "publishedOn": "2021-06-23T16:04:51.000Z",
          "wordCount": 354,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing the new GitHub Issues"
        },
        {
          "description": "We recently set about creating a framework and service for automatically generating social sharing images for repositories and other resources on GitHub.",
          "link": "https://github.blog/2021-06-22-framework-building-open-graph-images/",
          "publishedOn": "2021-06-22T17:07:49.000Z",
          "wordCount": 1755,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "A framework for building Open Graph images"
        },
        {
          "description": "Throughout the beta, we added features to improve the experience of using the Container registry. Today, we’re excited to announce that the Container registry is generally available as part of GitHub Packages!",
          "link": "https://github.blog/2021-06-21-github-packages-container-registry-generally-available/",
          "publishedOn": "2021-06-21T19:04:56.000Z",
          "wordCount": 934,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Packages Container registry is generally available"
        },
        {
          "description": "The latest version of GitHub Desktop allows you to squash commits, squash and merge, reorder, amend your last commit, check out a branch from a previous commit, and more.",
          "link": "https://github.blog/2021-06-16-github-desktop-2-9-squashing-reordering-amending/",
          "publishedOn": "2021-06-16T16:00:57.000Z",
          "wordCount": 676,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Desktop 2.9 includes squashing, reordering, amending, and more!"
        },
        {
          "description": "What began as a small group effort in 2015 has now turned into a global initiative here at GitHub to amplify Black voices and talent in the tech community.",
          "link": "https://github.blog/2021-06-10-blacktocats-turn-five/",
          "publishedOn": "2021-06-10T19:03:23.000Z",
          "wordCount": 941,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Blacktocats turn five"
        },
        {
          "description": "In May, GitHub shipped a total of 20 new features. We love what we do, but we know it’s a lot to keep up with. So we’re trying something new on the GitHub Blog—a monthly recap of everything that shipped to Changelog in the past month. Check out some of the updates you might have missed.",
          "link": "https://github.blog/2021-06-10-whats-new-from-github-changelog-may-2021-recap/",
          "publishedOn": "2021-06-10T17:32:32.000Z",
          "wordCount": 739,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? May 2021 Recap"
        },
        {
          "description": "polkit is a system service installed by default on many Linux distributions. It’s used by systemd, so any Linux distribution that uses systemd also uses polkit. As a member of GitHub Security Lab, my job is to help improve the security of open source software by finding and reporting vulnerabilities. A few weeks ago, I found a privilege escalation vulnerability in polkit.",
          "link": "https://github.blog/2021-06-10-privilege-escalation-polkit-root-on-linux-with-bug/",
          "publishedOn": "2021-06-10T16:00:52.000Z",
          "wordCount": 2932,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Privilege escalation with polkit: How to get root on Linux with a seven-year-old bug"
        },
        {
          "description": "GitHub secret scanning has been securing our users’ code by scanning for and revoking secrets since 2015. Recently, we’ve focused on scanning for package registry credentials as well&#8212;a significant and important expansion on our original",
          "link": "https://github.blog/2021-06-08-securing-open-source-supply-chain-scanning-package-registry-credentials/",
          "publishedOn": "2021-06-08T16:00:30.000Z",
          "wordCount": 1679,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Securing the open source supply chain by scanning for package registry credentials"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "A huge part of Nubank’s Data Science team has been recently focusing on leveraging causal inference along with traditional machine learning to solve some of our toughest problems. This post aims at explaining why causal inference is such a powerful tool to solve business problems with data.\nThe post Beyond prediction machines appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/beyond-prediction-machines/",
          "publishedOn": "2021-06-16T20:29:14.000Z",
          "wordCount": 4455,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Beyond prediction machines"
        },
        {
          "description": "Series G becomes the largest private capital raise by a technology company in Latin America ever.\nThe post Nubank closes a second extension to its Series G round raising it to US$1.15B appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/investors-largest-private-capital-raise-in-latam/",
          "publishedOn": "2021-06-08T12:00:09.000Z",
          "wordCount": 3332,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank closes a second extension to its Series G round raising it to US$1.15B"
        },
        {
          "description": "The deal is an extension of the Series G round raised earlier this year for US$400 million\nThe post Nubank raises US$500 million from Berkshire Hathaway appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/investors-berkshire-hathaway/",
          "publishedOn": "2021-06-08T11:58:19.000Z",
          "wordCount": 3321,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank raises US$500 million from Berkshire Hathaway"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}