{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html",
          "author": null,
          "description": "Posted by Sarah Jacobus, Vulnerability Rewards Team \n\n\nLast year was another record setter for our Vulnerability Reward Programs (VRPs). Throughout 2021, we partnered with the security researcher community to identify and fix thousands of  vulnerabilities – helping keep our users and the internet safe. \n\nThanks to these incredible researchers, Vulnerability Reward Programs across Google continued to grow, and we are excited to report that in 2021 we awarded a record breaking $8,700,000 in vulnerability rewards – with researchers donating over $300,000 of their rewards to a charity of their choice. \n\nWe also launched bughunters.google.com in 2021, a public researcher portal dedicated to keeping Google products and the internet safe and secure. This new platform brings all of our VRPs (Googl…",
          "link": "http://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html",
          "publishedOn": "2022-02-10T17:00:00.001Z",
          "wordCount": 3694,
          "title": "Vulnerability Reward Program: 2021 Year in Review"
        },
        {
          "id": "http://security.googleblog.com/2022/01/reducing-security-risks-in-open-source.html",
          "author": null,
          "description": "Posted by Laurent Simon and Azeem Shaikh, Google Open Source Security Team (GOSST) \n\n\n\nSince our July announcement of Scorecards V2, the Scorecards project—an automated security tool to flag risky supply chain practices in open source projects—has grown steadily to over 40 unique contributors and 18 implemented security checks. Today we are proud to announce the V4 release of Scorecards, with larger scaling, a new security check, and a new Scorecards GitHub Action for easier security automation.\nThe Scorecards Action is released in partnership with GitHub and is available from GitHub's Marketplace. The Action makes using Scorecards easier than ever: it runs automatically on repository changes to alert developers about risky supply-chain practices. Maintainers can view the alerts on GitHub's code scanning dashboard, which is available for free to public repositories on GitHub.com and via GitHub Advanced Security for private repositories. \nAdditionally, we have scaled our weekly Scorecards scans to over one million GitHub repositories, and have partnered with the Open Source Insights website for easy user access to the data. \nFor more details about the release, including the new Dangerous-Workflow security check, visit the OpenSSF's official blog post here.",
          "link": "http://security.googleblog.com/2022/01/reducing-security-risks-in-open-source.html",
          "publishedOn": "2022-01-19T15:00:00.014Z",
          "wordCount": 580,
          "title": "Reducing Security Risks in Open Source Software at Scale: Scorecards Launches V4"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": [
        {
          "id": "http://testing.googleblog.com/2022/02/code-health-now-youre-thinking-with.html",
          "author": null,
          "description": "This is another post in our Code Health series. A version of this post originally appeared in Google bathrooms worldwide as a Google Testing on the Toilet episode. You can download a printer-friendly version to display in your office. \n\n\nby Cathal Weakliam\n\n\nLoops are the standard way to process collections like arrays and lists. However, some loops implement the same patterns repeatedly, leading to duplicate code. Higher-order functions—functions that use other functions as inputs or outputs—can reduce duplication by providing a simpler way to express common operations with collections.\n\n\nConsider these two loops in JavaScript that decide if every object in an array meets a condition:\n\n\n \n  \n    \nlet everyRequestValid = true;\nfor (const request of requests) {\n  if (!isValid(request)) {\n  …",
          "link": "http://testing.googleblog.com/2022/02/code-health-now-youre-thinking-with.html",
          "publishedOn": "2022-02-07T17:03:00.000Z",
          "wordCount": 1937,
          "title": "Code Health: Now You're Thinking With Functions"
        },
        {
          "id": "http://testing.googleblog.com/2022/02/a-tale-of-two-features.html",
          "author": null,
          "description": "By George Pirocanac\n\n\nI have often been asked, “What is the most memorable bug that you have encountered in your testing career?” For me, it is hands down a bug that happened quite a few years ago. I was leading an Engineering Productivity team that supported Google App Engine. At that time App Engine was still in its early stages, and there were many challenges associated with testing rapidly evolving features. Our testing frameworks and processes were also evolving, so it was an exciting time to be on the team. \n\n\nWhat makes this bug so memorable is that I spent so much time developing a comprehensive suite of test scenarios, yet a failure occurred during such an obvious use case that it left me shaking my head and wondering how I had missed it. Even with many years of testing experience…",
          "link": "http://testing.googleblog.com/2022/02/a-tale-of-two-features.html",
          "publishedOn": "2022-02-01T18:11:00.000Z",
          "wordCount": 2316,
          "title": "A Tale of Two Features"
        }
      ]
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/4/1484",
          "author": null,
          "description": "This week Adam is joined by Joe Percoco — the Co-CEO of Titan, a premier investment manager for everyone. Titan is an investment company, a media, and a tech company, all rolled into one. Mid last year, they closed a $58 million Series B round led by Andreessen Horowitz (a16z) at a $450 million valuation. They currently have $750 million in assets managed and more than 35,000 clients.\nWhy should Titan exist? In Joe’s words, “Wall Street ignores everyday investors, and caters only to the ultra wealthy. This divide doesn’t sit well with us. So, we built Titan.” On today’s show Joe shares the journey, the why’s, the how’s, and the sequencing it might take to get to a $1 trillion of assets managed.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and mak…",
          "link": "https://changelog.com/founderstalk/87",
          "publishedOn": "2022-02-12T00:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 87: Building an investment platform for everyone",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/founderstalk/87/founders-talk-87.mp3",
            "length": "58650594",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1586",
          "author": null,
          "description": "Simey de Klerk recenty dove head-first into our transcripts repo and coded up a super-cool feature that’s been on Jerod’s wishlist for awhile now. So, of course, we invited him Backstage to tell the tale!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nSimey de Klerk – Twitter\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nThe issue: A GitHub Action to auto-improve transcripts\nThe post: Auto-improved transcripts with GitHub Actions\nThe script: format.js\nOur survey-game repo\nEric Normand talks FP with us",
          "link": "https://changelog.com/backstage/21",
          "publishedOn": "2022-02-11T20:00:00.000Z",
          "wordCount": null,
          "title": "Backstage 21: Long-time listener, first-time code contributor",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/21/backstage-21.mp3",
            "length": "71407663",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1539",
          "author": null,
          "description": "This week we are talking to Robin Morero, the person behind fabled.se, a DevOps consultancy from Gothenburg, Sweden. Their motto is “move faster and prosper”, which Gerhard prefers to the initial “move fast and break things”.\nFabled works with startups primarily, and after 26 years, Robin has a few interesting insights to share. What do you think, are haunted codebases real? At what point do pull requests become harmful? What about k3s running on KVM as a simple starting point for production? If this reminds you of #7, and the follow-up YouTube stream with Lars, it’s no coincidence.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nShortcut – The first project management platform for software development that bring…",
          "link": "https://changelog.com/shipit/39",
          "publishedOn": "2022-02-11T18:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 39: Haunted codebases & complex ops",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/39/ship-it-39.mp3",
            "length": "62272566",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1563",
          "author": null,
          "description": "Amal and Nick load up on coffee for a not-so-vite (lame joke!) conversation with Evan You all about Vite – a batteries included next-generation frontend tooling library. Vite continues to push the ecosystem forward with even stronger defaults, super speedy local development workflows, and a highly extensible universal plugin API. Need we say more?!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/c…",
          "link": "https://changelog.com/jsparty/212",
          "publishedOn": "2022-02-11T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 212: A deep-dive on Vite",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/212/js-party-212.mp3",
            "length": "71564245",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1565",
          "author": null,
          "description": "Natalie and Johnny are joined by the co-founders of APIToolkit for a deep-dive on the topic. We discuss building them, maintaining them, how can we all be better users, and much more along the way.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “JS Party” to receive an extra 5,000 video minutes.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nSmile Egbai – Twitter, GitHub\nAnthony Alaribe – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nAPIToolkit.io\nDo schools kill creativity? | Sir Ken Robinson",
          "link": "https://changelog.com/gotime/216",
          "publishedOn": "2022-02-10T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 216: Building and using APIs with Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/216/go-time-216.mp3",
            "length": "48444596",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W3no",
          "author": "Jerod Santo",
          "description": "Dave Ceddia shares his go-to list of questions that he (literally) printed and brought with him to interviews for that final 5-ish minutes at the end when you get a chance to ask your own questions. It does come with a small disclaimer, though:\nThis was years ago by the way, long before COVID, when pretty much every interview was in-person. The shock factor of pulling out 2 pages of questions wouldn’t translate so well to Zoom, haha. But still: if time runs out, you can mention that you still have a bunch of questions, and could please email them afterward.\nDiscuss on Changelog News",
          "link": "https://daveceddia.com/interview-questions-to-ask-company/",
          "publishedOn": "2022-02-10T15:18:00.000Z",
          "wordCount": null,
          "title": "Interview questions to ask your interviewer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4Eq3",
          "author": "Jerod Santo",
          "description": "PgBouncer is a popular connection pooler for Postgres. PgCat is that same functionality, only in Rust. This is alpha software and there is no worse place to run alpha software (IMHO) than in places that have direct connections to your database. Still, this is worth linking to because it’s yet another instance of open source infrastructure code getting Rusty.\nDiscuss on Changelog News",
          "link": "https://github.com/levkk/pgcat",
          "publishedOn": "2022-02-10T14:28:00.000Z",
          "wordCount": null,
          "title": "PgBouncer rewritten in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1584",
          "author": null,
          "description": "In the third of the “AI in Africa” spotlight episodes, we welcome Kathleen Siminyu, who is building Kiswahili voice tools at Mozilla. We had a great discussion with Kathleen about creating more diverse voice and language datasets, involving local language communities in NLP work, and expanding grassroots ML/AI efforts across Africa.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nKathleen Siminyu – Twitter, LinkedIn\nJoyce Nabende – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\n“Introducing myself” from Kathleen\nMasakhane\nCommon Voice\nOpen for Good Alliance",
          "link": "https://changelog.com/practicalai/167",
          "publishedOn": "2022-02-09T16:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 167: 🌍 AI in Africa - Voice & language tools",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/167/practical-ai-167.mp3",
            "length": "42118774",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/N5rd",
          "author": "Jerod Santo",
          "description": "A couple weeks back I expressed some Windows FOMO* while linking out to a very cool Swiss Army knife for developers project. Well, FOMO-be-gone! There is now a DevToys project for we Mac users.\n*I have since been informed of DevUtils.app, which is also worth a gander.\nDiscuss on Changelog News",
          "link": "https://github.com/ObuchiYuki/DevToysMac",
          "publishedOn": "2022-02-09T15:07:00.000Z",
          "wordCount": null,
          "title": "DevToys for macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/n7b2",
          "author": "Jerod Santo",
          "description": "Garage is a distributed storage solution, that automatically replicates your data on several servers. Garage takes into account the geographical location of servers, and ensures that copies of your data are located at different locations when possible for maximal redundancy, a unique feature in the landscape of distributed storage systems.\nIt has an S3-compatible API and can be used as a storage backend for things like NextCloud, Matrix, and Mastodon. It’s being built by a non-profit in France that is “working to promote self-hosting and small-scale hosting.” Why do they do this?\nself-hosting means running our own hardware at home, and providing 24/7 Internet services from there. We have many reasons for doing this. One is because this is the only way we can truly control who has access to our data. Another one is that it helps us be aware of the physical substrate of which the Internet is made: making the Internet run has an environmental cost which we want to evaluate and keep under control. The physical hardware also gives us a sense of community, calling to mind all of the people that could currently be connected and making use of our services, and reminding us of the purpose for which we are doing this.\nDiscuss on Changelog News",
          "link": "https://garagehq.deuxfleurs.fr/blog/2022-introducing-garage/",
          "publishedOn": "2022-02-09T14:20:00.000Z",
          "wordCount": null,
          "title": "Garage - a self-hosted distributed object storage solution",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlpr",
          "author": "Jerod Santo",
          "description": "This major undertaking was discussed by Matt Ahrens on our recent ZFS episode. How it works:\nThe feature reflows existing data, essentially rewriting it onto a new arrangement of disks – meaning the original group plus a newly added disk. In so doing, a new adjacent chunk of free space is created at the end of the logical RAID-Z group and thus at the end of each physical disk.\nWith a disclaimer:\nWhile all capabilities of this feature have been implemented and all tests so far have been passed, there are still a few loose ends to tie up. Specifically, there is some code cleanup to do, some verbose logging to remove, some code documentation to write, and similar relatively minor tasks. We aim for this to be integrated by Q3.\nDiscuss on Changelog News",
          "link": "https://freebsdfoundation.org/blog/raid-z-expansion-feature-for-zfs-goes-live/",
          "publishedOn": "2022-02-08T22:53:00.000Z",
          "wordCount": null,
          "title": "RAID-Z expansion feature for ZFS goes live",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aOrD",
          "author": "Jerod Santo",
          "description": "Adrien Griveau makes the case for settings as a feature, not a design bug. He build the argument from a simple (and perhaps controversial) point: “users love settings”\nThere certainly are moments where I find myself on the settings page of a product because it failed to deliver the experience I really wanted. But not all settings are created equal.\nThere’s a difference between product settings that a product needs to get right by default and preferences that designers deliberately shouldn’t have a strong opinion on.\nDiscuss on Changelog News",
          "link": "https://linear.app/blog/settings-are-not-a-design-failure",
          "publishedOn": "2022-02-08T17:07:00.000Z",
          "wordCount": null,
          "title": "Settings are not a design failure",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1555",
          "author": null,
          "description": "This week we’re joined by Jacob Kaplan-Moss and we’re talking about his extensive writing on work sample tests. These tests are an exercise, a simulation, or a small slice of real day-to-day work that candidates will perform as part of their job. Over the years, as an engineering leader, Jacob has become a practicing expert in effectively hiring engineers — today he shares a wealth of knowledge on the subject.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at developer.squareup.com to dive into the docs, APIs, SDKs and to create your …",
          "link": "https://changelog.com/podcast/479",
          "publishedOn": "2022-02-08T17:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 479: Principles for hiring engineers",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/479/the-changelog-479.mp3",
            "length": "75095015",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/P5ra",
          "author": "Jerod Santo",
          "description": "A (WIP) series on working with the K8s API from both the command line and from code.\n\nDiscuss on Changelog News",
          "link": "https://iximiuz.com/en/series/working-with-kubernetes-api/",
          "publishedOn": "2022-02-08T16:16:00.000Z",
          "wordCount": null,
          "title": "Working with the Kubernetes API",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AaoP",
          "author": "Jerod Santo",
          "description": "Conor O’Neill:\nI blame my life-long work obsession with automation and avoiding repetitive drudgery on my first boss and mentor Danny in S3. He was horrified to see me doing the same thing over and over in a VAX code editor and introduced me to the magical world of macros.\nFrom that point onwards, I was a man on a mission to save us all as much time as possible in our working days.\nFrom Yahoo! Pipes to IFTTT to Node-RED and beyond: this is quite the journey.\nDiscuss on Changelog News",
          "link": "https://www.tines.com/blog/my-thirty-years-of-dodging-repetitive-work-with-automation-tools",
          "publishedOn": "2022-02-08T15:29:00.000Z",
          "wordCount": null,
          "title": "My thirty years of dodging repetitive work with automation tools",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zgr5",
          "author": "Jerod Santo",
          "description": "Andrew Stetsenko:\nRelocation to a foreign country for work can be very exciting and lead to unique opportunities that couldn’t be accessed in your home country. At the same time, it’s a real challenge - I know it firsthand… Hopefully, this handbook will give you the necessary guidance. Topics covered include resume preparation, job search, salary negotiation, relocation packages, and more.\nDiscuss on Changelog News",
          "link": "https://github.com/AndrewStetsenko/tech-jobs-with-relocation",
          "publishedOn": "2022-02-07T16:45:00.000Z",
          "wordCount": null,
          "title": "An all-in-one guide to getting a tech job abroad",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRrG",
          "author": "Jerod Santo",
          "description": "It’s still in closed beta, but this looks like a really cool environment for data scientists and other folks who code to accomplish other goals vs code as craft. One cool thing you can do is take your Jupyter notebooks and convert them to PyFlow graphs (and vice versa).\nDiscuss on Changelog News",
          "link": "https://github.com/Bycelium/PyFlow",
          "publishedOn": "2022-02-07T14:50:00.000Z",
          "wordCount": null,
          "title": "PyFlow – a tool for visual and modular block programming in Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1556",
          "author": null,
          "description": "This week we’re joined by Nora Jones, founder and CEO at Jeli where they help teams gain insight and learnings from incidents. Back in December Nora shared here thoughts in a Changelog post titled “Incident” shouldn’t be a four-letter word - which got a lot of attention from our readers. Today we’re talking with Nora about all things incidents — the learning and growth they represent for teams, why teams should focus on learning from incidents in the first place, their Howie guide to post‑incident investigations, why the next emerging role is an Incident Analyst, and she also shares a few book recommendations which we’ve linked up in the show notes.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – Inf…",
          "link": "https://changelog.com/podcast/478",
          "publishedOn": "2022-02-04T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 478: Learning from incidents",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/478/the-changelog-478.mp3",
            "length": "65871902",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/k2qy",
          "author": "Jerod Santo",
          "description": "Daniel Stenberg’s first step toward adding first-party JSON support to everyone’s favorite command-line URL transmitter is a flag that is basically a shortcut for the following flags:\n--data [arg]\n--header \"Content-Type: application/json\"\n--header \"Accept: application/json\"\n\nWill more come of this? Time (and the community) will tell…\nThe discussion has been ignited in the curl community about what, if anything, we should do in curl to make it a smoother and better tool when working with JSON. The offered opinions range from nothing (“curl is content agnostic”) to full-fledged JSON generator, parser and pretty-printer (or a combination in between).\nDiscuss on Changelog News",
          "link": "https://daniel.haxx.se/blog/2022/02/02/curl-dash-dash-json/",
          "publishedOn": "2022-02-04T19:34:00.000Z",
          "wordCount": null,
          "title": "Curl gets a --json flag",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1541",
          "author": null,
          "description": "Ryan Carniato joins Jerod, Amelia, and Nick to discuss SolidjS – a declarative, efficient, and flexible JavaScript library for building user interfaces.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “JS Party” to receive an extra 5,000 video minutes.\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nRyan Carniato – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nNick Nisi – Twitter, GitHub, Website\nNotes and Links\nHolla! JSConf Mexico (On YouTube)\nSolidJS website\nJS Framework Benchmark\nIsomorphic UI Benchmark\nRyan Florence Tweet\nSolid Start meta-framework\nMarkoJS",
          "link": "https://changelog.com/jsparty/211",
          "publishedOn": "2022-02-04T17:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 211: A Solid option for building UIs",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/211/js-party-211.mp3",
            "length": "53408946",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/wkdo",
          "author": "Jerod Santo",
          "description": "Ships with a file explorer, autocompletion, git integration, status line, fuzzy finding, and more.\n\nDiscuss on Changelog News",
          "link": "https://github.com/kabinspace/AstroVim",
          "publishedOn": "2022-02-04T15:46:00.000Z",
          "wordCount": null,
          "title": "AstroVim is an aesthetic/feature-rich Neovim config",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1538",
          "author": null,
          "description": "Gunnar Holwerda (Engineering Manager) and Tom Pansino (DevOps Team Lead) share with us a few stories about how the teams at opensesame.com manage AWS operational complexity. The first link in the episode show notes are the slides that Tom & Gunnar prepared for this conversation. Check them out as you hear us speak about the Inverse Conway Manoeuvre, and why you should always go for the bananas.\nIf you like this episode, and have a similar story to share, please reach out to us. We all love real-world stories that we can learn from, and perhaps contribute to.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporti…",
          "link": "https://changelog.com/shipit/38",
          "publishedOn": "2022-02-04T15:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 38: Go for the bananas",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/38/ship-it-38.mp3",
            "length": "67232814",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/d38l",
          "author": "Jerod Santo",
          "description": "Anybody who’s had to design/implement HTML emails knows how utterly painful it is. With Mailwind you get to do it the same way you’d build a site with Tailwind and then run:\nmailwind --input-html email.html --output-css style.css\n# or for inline styles\nmailwind --input-html email.html --output-html email-inlined.html\n\nAnd you’re off to the outbox! 📤\nDiscuss on Changelog News",
          "link": "https://github.com/soheilpro/mailwind",
          "publishedOn": "2022-02-04T14:48:00.000Z",
          "wordCount": null,
          "title": "Use Tailwind to design HTML emails",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lb4W",
          "author": "Jerod Santo",
          "description": "Just wow. This is an impressively hacky hack. You’re probably wondering how? As many such things do, it all starts with a new (Chrome-only) API:\nA new set of APIs affectionately known as Houdini give your browser the power to control CSS via its own Object Model in Javascript. In English, this means that you can make custom CSS styles, add custom properties, and so on…\nAnd it ends with something that looks like this:\nmain {\n  // ...\n  --sql-query: SELECT name FROM test;\n}\n\nDiscuss on Changelog News",
          "link": "https://www.leemeichin.com/posts/yes-i-can-connect-to-a-db-in-css.html",
          "publishedOn": "2022-02-03T18:17:00.000Z",
          "wordCount": null,
          "title": "Yes, I can connect to a DB in CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1518",
          "author": null,
          "description": "MLOps is an increasingly popular topic that is no longer just a subset of DevOps. Go is a great choice for infrastructure. What role does Go play in MLOps?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “Go Time” to receive an extra 5,000 video minutes.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nMike Eastham – Twitter, LinkedIn\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nUber’s Michelangelo project\nWhat is a Feature and a Feature Store\nContribute to FEAST",
          "link": "https://changelog.com/gotime/215",
          "publishedOn": "2022-02-03T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 215: MLOps in Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/215/go-time-215.mp3",
            "length": "43918914",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pkEM",
          "author": "Jerod Santo",
          "description": "Read the comments for all the bug reports and iteration. 🔥\n\nDiscuss on Changelog News",
          "link": "https://gist.github.com/huytd/6a1a6a7b34a0d0abcac00b47e3d01513",
          "publishedOn": "2022-02-03T15:32:00.000Z",
          "wordCount": null,
          "title": "A Wordle clone in less than 50 lines of bash",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/j5Zq",
          "author": "Jerod Santo",
          "description": "A nice set of algorithms implemented with Go best practices in mind, making this a good learning resource. I wonder how much churn we’ll see on these once generics are officially added to the language… 🤔\nDiscuss on Changelog News",
          "link": "https://github.com/TheAlgorithms/Go",
          "publishedOn": "2022-02-02T17:54:00.000Z",
          "wordCount": null,
          "title": "Algorithms implemented in Go (for education)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQrQ",
          "author": "Jerod Santo",
          "description": "“Think TCPDump and Wireshark re-invented for Kubernetes.”\n\nDiscuss on Changelog News",
          "link": "https://github.com/up9inc/mizu",
          "publishedOn": "2022-02-02T17:01:00.000Z",
          "wordCount": null,
          "title": "Mizu – an API traffic viewer for Kubernetes",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bNrW",
          "author": "Jerod Santo",
          "description": "If you’d prefer code over comics, see instead her little Go program that explains the same.\n\nDiscuss on Changelog News",
          "link": "https://wizardzines.com/comics/life-of-a-dns-query/",
          "publishedOn": "2022-02-02T15:32:00.000Z",
          "wordCount": null,
          "title": "Life of a DNS query",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3ro",
          "author": "Jerod Santo",
          "description": "They brand CasaOS as an operating system, but it’s really a layer on top of Linux that provides a nice UI and easy app (docker container) installation. It’s early days for the project, but we definitely need some open source options in this space, so here’s hoping they continue to progress!\n\nDiscuss on Changelog News",
          "link": "https://www.casaos.io/",
          "publishedOn": "2022-02-02T14:39:00.000Z",
          "wordCount": null,
          "title": "CasaOS – a home cloud system based on the Docker ecosystem",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/q0rL",
          "author": "Jerod Santo",
          "description": "Ben Kuhn is a big fan of one-on-one meeting between managers and their direct reports to discuss whatever the report wants. So, he suggested his partner try them with him to improver her graduate program experience.\nIn the end, they succeeded far beyond my expectations: Eve thinks our one-on-ones sped up her dissertation by about a year.\nDiscuss on Changelog News",
          "link": "https://www.benkuhn.net/11/",
          "publishedOn": "2022-02-01T22:47:00.000Z",
          "wordCount": null,
          "title": "The unreasonable effectiveness of one-on-ones",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1568",
          "author": null,
          "description": "In addition to being a Developer Advocate at Hugging Face, Thomas Simonini is building next-gen AI in games that can talk and have smart interactions with the player using Deep Reinforcement Learning (DRL) and Natural Language Processing (NLP).  He also created a Deep Reinforcement Learning course that takes a DRL beginner to from zero to hero.  Natalie and Chris explore what’s involved, and what the implications are, with a focus on the development path of the new AI data scientist.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nThomas Simonini – Twitter, GitHub, LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nThomas Simonini | Hugging Face\nDeep Reinforcement Learning course",
          "link": "https://changelog.com/practicalai/166",
          "publishedOn": "2022-02-01T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 166: Exploring deep reinforcement learning",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/166/practical-ai-166.mp3",
            "length": "60236341",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JLO2",
          "author": "Jerod Santo",
          "description": "It’s behind a --experimental-fetch flag for now and the Node team are seeking feedback on this very exciting feature. If you’re not well aware of the fetch API and why it’d be a productivity boon to have it in Node, check the MDN page on it.\nDiscuss on Changelog News",
          "link": "https://github.com/nodejs/node/commit/6ec225392675c92b102d3caad02ee3a157c9d1b7",
          "publishedOn": "2022-02-01T14:44:00.000Z",
          "wordCount": null,
          "title": "Top-level `fetch` just landed in Node.js",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1562",
          "author": null,
          "description": "Welcome to Song Encoder, a special series of The Changelog podcast featuring people who create at the intersection of software and music. This episode features Pwnie Award-winning songwriter Forrest Brazeal.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nForrest Brazeal – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\n168 AWS Services in 2 minutes\nThe Ransomware Song\nThat Sinking Feeling (The #HugOps Song)\nServerless v Containers\nLook At You Now (The Google Cloud Song)\nKingston Trio-Merry Minuet\nBig Tech ((It’s Probably Fine))\nThe AWS Elastic Load Balancer Yodel Rag\nSong Encoder: $STDOUT",
          "link": "https://changelog.com/podcast/477",
          "publishedOn": "2022-01-31T20:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 477: Song Encoder: Forrest Brazeal",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/477/the-changelog-477.mp3",
            "length": "35747291",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Lp75",
          "author": "Jerod Santo",
          "description": "An interesting exploration of Tesla’s recent update to their in-car control screen that resulted from the author not being able to find the defogger control. Here’s an example of the kind of analysis he provides:\nEdward Tufte has this visual rule that 1+1=3. With a single line on the screen, you have just that single object, but adding a second line does something interesting, it adds a third ‘object’ on the screen, the negative space between the two. All good visual designers deeply understand this effect.\nIn UX design we have a cognitive equivalent. If you have two buttons, there is a third ‘object’ created, the decision a user must make on which button to tap. This cognitive load is invisible and rarely discussed but it can be a real source of confusion.\n\nDiscuss on Changelog News",
          "link": "https://jenson.org/tesla/",
          "publishedOn": "2022-01-31T15:39:00.000Z",
          "wordCount": null,
          "title": "A UX designer walks into a Tesla bar",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bNel",
          "author": "Jerod Santo",
          "description": "Avi Lumelsky shares his journey finding and reporting databases with sensitive data about Fortune-500 companies, hospitals, crypto platforms, startups during due diligence, and more.\nHis major entry point: misconfiguration\nDiscuss on Changelog News",
          "link": "https://infosecwriteups.com/how-i-discovered-thousands-of-open-databases-on-aws-764729aa7f32",
          "publishedOn": "2022-01-31T14:43:00.000Z",
          "wordCount": null,
          "title": "How I discovered thousands of open databases on AWS",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1557",
          "author": null,
          "description": "Tobie Langel, Open source strategist and Principal at UnlockOpen, joins Chris, Feross, and Amal to discuss recent widespread incidents affecting the JavaScript community (and breaking CI builds) around the globe. Two widely used npm libraries were self-sabotaged by their single maintainer, yet again, highlighting the many gaps in our OSS supply chain security, sustainability and overall practices. We explore all these topics and solution on what our ecosystem needs to be more resilient to these types of attacks in the future.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry hel…",
          "link": "https://changelog.com/jsparty/210",
          "publishedOn": "2022-01-29T15:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 210: What's in your package.json?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/210/js-party-210.mp3",
            "length": "67025636",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JLOA",
          "author": "Jerod Santo",
          "description": "I love how much hacking has been inspired by Wordle.\nThe Wordle source code contains 2,315 days of answers (all common 5-letter English words) and 10,657 other valid, less-common 5-letter English words.\nWe combine these to form a set of 12,972 possible words/answers.\nWe then simulate playing 1,000 Wordle games for each of these possible words, guessing based on the frequency of the word in the English language and the feedback received.\nThen we take three measures to evaluate the observed distribution of ⬛🟨🟩 squares on Twitter according to our valid words.\nThe resulting code is included in the article.\nDiscuss on Changelog News",
          "link": "https://www.kaggle.com/benhamner/wordle-1-6",
          "publishedOn": "2022-01-28T16:41:00.000Z",
          "wordCount": null,
          "title": "Get the daily Wordle on the first try using the tweet distribution",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5eM",
          "author": "Jerod Santo",
          "description": "Lots of people talk about Kubernets’ complexity, but it’s rare for someone to attempt to plumb the depths of why exactly that is.\nI don’t claim to have the full answer, but this post is an attempt to commit to paper two specific thoughts or paradigms I have that I reach for as I try to understand why working with Kubernetes feels so hairy sometimes.\nDiscuss on Changelog News",
          "link": "https://buttondown.email/nelhage/archive/two-reasons-kubernetes-is-so-complex/",
          "publishedOn": "2022-01-28T15:54:00.000Z",
          "wordCount": null,
          "title": "Two reasons Kubernetes is so complex",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1561",
          "author": null,
          "description": "This week Adam is joined by Christine Yen, co-founder and CEO of Honeycomb. Christine and Adam recorded this show late last year, just after their Series C funding round. They talk about the superpower of observability for developers, how she and Charity Majors got to the place to found Honeycomb, the state of their platform today, what exactly observability is, and their goals for the future of Honeycomb.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nWorkOS – A platform that gives developers a set of building blocks for quickly adding enterprise-ready features to their application. Add Single Sign-On (Okta, Azure, Google, Microsoft OAuth), sync users from any SCIM directory, HRIS integration, audit trails (SIE…",
          "link": "https://changelog.com/founderstalk/86",
          "publishedOn": "2022-01-28T12:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 86: Bringing observability superpowers to all",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/founderstalk/86/founders-talk-86.mp3",
            "length": "76818023",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1485",
          "author": null,
          "description": "One of the most common questions we receive at Go Time is how to handle schema migrations in Go. In this episode Jon is joined by Mike Fridman and Vojtech Vitek, maintainers of the popular schema migration tool pressly/goose, to discuss techniques, tools, and tips for handling schema migrations.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGitLab – The DevOps platform that empowers organizations to maximize the overall return on software development by delivering software faster, more efficiently, while strengthening security and compliance. Identify and address blockers immediately, focus on delivering value — not maintaining integrations, automate security and compliance. Get started with their free tier (no credit card required). Learn more at about.gitlab.com/solutions/devops-platform\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nMike Fridman – Twitter, GitHub, Website\nVojtech Vitek – Twitter, GitHub\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\ngoose\nmigrate\nsquirrel",
          "link": "https://changelog.com/gotime/214",
          "publishedOn": "2022-01-27T17:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 214: Migrations without migraines",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/214/go-time-214.mp3",
            "length": "47354137",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/o9rm",
          "author": "Jerod Santo",
          "description": "This is a ‘Linux Swiss Army Knife’, offering maximum utility while still being able to fit in your pocket. Is it fast? No. Can it run a GUI? Also no. But it can run scripts, ping a server, toggle a few GPIOs, and interact with a USB device.\n\nDiscuss on Changelog News",
          "link": "https://bbenchoff.github.io/pages/LinuxDevice.html",
          "publishedOn": "2022-01-27T16:53:00.000Z",
          "wordCount": null,
          "title": "Linux for $15 (a Minimum Viable Computer)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlry",
          "author": "Jerod Santo",
          "description": "The criteria for inclusion is as follows:\nIts product is strongly based on an open source repo\nIt has a well-known closed-sourced competitor, solving a similar business problem\nIt is a private for-profit company, founded in the last 10 years\nIts repo has 100+ stars on GitHub\nI’m seeing lots of Changelog guests & friends in this awesome list. 😎\nDiscuss on Changelog News",
          "link": "https://github.com/RunaCapital/awesome-oss-alternatives",
          "publishedOn": "2022-01-27T15:17:00.000Z",
          "wordCount": null,
          "title": "Open source startup alternatives to well-known SaaS products",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1522",
          "author": null,
          "description": "Vincent Ambo –the person behind nixery.dev, tvl.fyi, and a former Google engineer– shares his take on monorepos, Nix, and fully declarative systems without any Flux, Argo or Kubernetes.\nWhile the tooling is impressive, it’s the principles behind it that captivated Gerhard’s imagination. Vincent has a rather interesting take on the monorepository idea, including one change - one version - one deploy. There are a lot of interesting links in the show notes, including all the code that Vincent uses to manage infrastructure.\nAs a result of this conversation, Gerhard is running Nix on one of his Macs, and also started experimenting with his first NixOS production instance.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsor…",
          "link": "https://changelog.com/shipit/37",
          "publishedOn": "2022-01-27T14:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 37: Building fully declarative systems with Nix",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/37/ship-it-37.mp3",
            "length": "62622209",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/d3r2",
          "author": "Jon Parise",
          "description": "This is a piece that I wrote for GitHub’s ReadME project about an important aspect of software maintenance: recognizing which contributions are a good fit for a project—and which are not.\nThe thought process applies equally well to proprietary code bases and open source projects.\nDiscuss on Changelog News",
          "link": "https://github.com/readme/guides/decision-framework",
          "publishedOn": "2022-01-26T19:13:00.000Z",
          "wordCount": null,
          "title": "Knowing when to say 'no'",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eZrO",
          "author": "Jerod Santo",
          "description": "Old as in old school cool not old as in passe:\nDespite the new gatekeepers’ best efforts, the old Internet never completely disappeared. Personal websites created by individuals that have always been the meat of the old Internet are still around. They are still about exploration, innovation, fun, and all the rest. Try as the new gatekeepers have, they simply have not had the power to eradicate the old Internet completely. All they can do is pretend it does not exist. And, that is exactly what they do.\nBut…\n… the old Internet seems to be slowly and quietly coming back, and it is coming back even better than before. Now it has better technology and an additional well-defined purpose that it never had before.\nSome people have begun to refer to personal websites as the “indie web”, the “small Internet”, or the “smol Internet”. Some seem to reserve the last two terms exclusively for the Gemini Network, which nearly quadrupled in size last year. But, I think all three terms should also apply to some of the other networks that use alternative networking protocols–the Gopher Network, the Tor network, and the ZeroNet network, to name a few.\nDiscuss on Changelog News",
          "link": "https://cheapskatesguide.org/articles/old-internet-coming-back.html",
          "publishedOn": "2022-01-26T15:38:00.000Z",
          "wordCount": null,
          "title": "The old internet shows signs of quietly coming back",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRe0",
          "author": "Jerod Santo",
          "description": "Linux users on Tuesday got a major dose of bad news—a 12-year-old vulnerability in a system tool called Polkit gives attackers unfettered root privileges on machines running any major distribution of the open source operating system.\nPreviously called PolicyKit, Polkit manages system-wide privileges in Unix-like OSes. It provides a mechanism for nonprivileged processes to safely interact with privileged processes. It also allows users to execute commands with high privileges by using a component called pkexec, followed by the command.\nOh my. It requires local access first, which is the only good news here.\nDiscuss on Changelog News",
          "link": "https://arstechnica.com/information-technology/2022/01/a-bug-lurking-for-12-years-gives-attackers-root-on-every-major-linux-distro/?utm_brand=arstechnica",
          "publishedOn": "2022-01-26T14:51:00.000Z",
          "wordCount": null,
          "title": "A bug lurking for 12 years gives attackers root on every major Linux distro",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1564",
          "author": null,
          "description": "From drug discovery at the Quebec AI Institute to improving capabilities with low-resourced languages at the Masakhane Research Foundation and Google AI, Bonaventure Dossou looks for opportunities to use his expertise in natural language processing to improve the world - and especially to help his homeland in the Benin Republic in Africa.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nBonaventure Dossou – Twitter, GitHub, LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nBonaventure Dossou | Instagram\n2020 — ongoing: My Year of Fame and how I joined the world of Research",
          "link": "https://changelog.com/practicalai/165",
          "publishedOn": "2022-01-25T22:25:00.000Z",
          "wordCount": null,
          "title": "Practical AI 165: The world needs an AI superhero",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/165/practical-ai-165.mp3",
            "length": "41811145",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/13Qw",
          "author": "Jerod Santo",
          "description": "PRQL (pronounced “Prequel”) aims to be “a simpler and more powerful SQL”\nLike SQL, it’s readable, explicit and declarative. Unlike SQL, it forms a logical pipeline of transformations, and supports abstractions such as variables and functions. It can be used with any database that uses SQL, since it transpiles to SQL.\nTo get an idea on PRQL’s design, they provide this SQL statement as an example:\nSELECT TOP 20\n    title,\n    country,\n    AVG(salary) AS average_salary,\n    SUM(salary) AS sum_salary,\n    AVG(salary + payroll_tax) AS average_gross_salary,\n    SUM(salary + payroll_tax) AS sum_gross_salary,\n    AVG(salary + payroll_tax + benefits_cost) AS average_gross_cost,\n    SUM(salary + payroll_tax + benefits_cost) AS sum_gross_cost,\n    COUNT(*) as count\nFROM employees\nWHERE salary + payroll_tax + benefits_cost > 0 AND country = 'USA'\nGROUP BY title, country\nORDER BY sum_gross_cost\nHAVING count > 200\n\nAnd then translate it to PRQL, which looks like:\nfrom employees\nfilter country = \"USA\"                           # Each line transforms the previous result.\nlet gross_salary = salary + payroll_tax          # This _adds_ a column / variable.\nlet gross_cost   = gross_salary + benefits_cost  # Variables can use other variables.\nfilter gross_cost > 0\naggregate by:[title, country] [                  # `by` are the columns to group by.\n    average salary,                              # These are the calcs to run on the groups.\n    sum     salary,\n    average gross_salary,\n    sum     gross_salary,\n    average gross_cost,\n    sum     gross_cost,\n    count,\n]\nsort sum_gross_cost                              # Uses the auto-generated column name.\nfilter count > 200\ntake 20\n\nDiscuss on Changelog News",
          "link": "https://github.com/max-sixty/prql",
          "publishedOn": "2022-01-25T19:35:00.000Z",
          "wordCount": null,
          "title": "PRQL – a modern language for transforming data",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2r2",
          "author": "Jerod Santo",
          "description": "Troy Hunt (of Have I been Pwned fame) has been a vocal proponent of cloud-first services for awhile. Last December, that strategy came back to bite him:\nIt all started with my monthly Azure bill for December which was way over what it would normally be. It only took a moment to find the problem…\nHe goes on to tell the tale in excruciating detail. Be careful out there, cloud natives.\nDiscuss on Changelog News",
          "link": "https://www.troyhunt.com/how-i-got-pwned-by-my-cloud-costs/",
          "publishedOn": "2022-01-25T15:49:00.000Z",
          "wordCount": null,
          "title": "How I got pwned by my cloud costs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mar1",
          "author": "Jerod Santo",
          "description": "Rebuilding Wordle is a fun way to show off what your frontend framework is capable of (and how). Evan You has been doing just that for Vue. It’s not a 100% reproduction of the original, but it does have one cool feature the official game does NOT:\nYou can make your own Wordle and send it to friends by base64-encoding a word and include it as the URL query\nHere’s a custom one using an acronym that many devs think about often…\nDiscuss on Changelog News",
          "link": "https://github.com/yyx990803/vue-wordle",
          "publishedOn": "2022-01-25T15:02:00.000Z",
          "wordCount": null,
          "title": "Wordle built with Vue, aka VVordle",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1550",
          "author": null,
          "description": "This week Paul Copplestone, CEO of Supabase joined us to catch us up on the next big thing happening in the world of Postgres. Supabase might be best known as “the open source Firebase alternative,” a tagline they might be reluctant to maintain. But from Adam’s perspective, he’s never been more excited about what they’re bringing to market for Postgres fans. In the last year, Supabase has gone from 0 to more than 80,000 databases on their platform — and they’re still in beta…and it’s open source. Hopefully today’s show sheds some light on why everyone is talking about Supabase.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From…",
          "link": "https://changelog.com/podcast/476",
          "publishedOn": "2022-01-25T03:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 476: Supabase is all in on Postgres",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/476/the-changelog-476.mp3",
            "length": "72972200",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/6O6d",
          "author": "Jerod Santo",
          "description": "Wesley Aptekar-Cassels has been using NixOS on his main laptop for ~3 years and he’s ready to talk about it:\nI don’t think that NixOS is the future, but I do absolutely think that the ideas in it are, so I want to write about what I think it gets right and what it gets wrong, in the hopes that other projects can take note. As such, this post will not assume knowledge of NixOS — if you’ve used NixOS significantly, there probably isn’t anything new in here for you.\nDiscuss on Changelog News",
          "link": "https://blog.wesleyac.com/posts/the-curse-of-nixos",
          "publishedOn": "2022-01-24T19:15:00.000Z",
          "wordCount": null,
          "title": "The curse of NixOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03EQ",
          "author": "Jerod Santo",
          "description": "This is just one of Charm’s various open source CLI projects.\n\nDiscuss on Changelog News",
          "link": "https://github.com/charmbracelet/soft-serve",
          "publishedOn": "2022-01-24T16:35:00.000Z",
          "wordCount": null,
          "title": "Soft Serve – a tasty, self-hostable git server for the command line🍦",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lbPY",
          "author": "Jerod Santo",
          "description": "This repo links to dozens of courses for each of 23 categories of computing. It’s just an astounding amount of freely accessible education.\nDiscuss on Changelog News",
          "link": "https://github.com/Developer-Y/cs-video-courses",
          "publishedOn": "2022-01-24T15:49:00.000Z",
          "wordCount": null,
          "title": "A list of CS courses with video lectures 📽",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pknV",
          "author": "Jerod Santo",
          "description": "It’s not very often that I get Windows FOMO, but DevToys is doing it for me. It provides a sweet GUI for 14 tools including a JSON/Yaml converter, a JWT decoder, a text comparer, and a hash generator.\n\nDiscuss on Changelog News",
          "link": "https://devtoys.app/",
          "publishedOn": "2022-01-24T14:27:00.000Z",
          "wordCount": null,
          "title": "DevToys – an offline Swiss Army knife for developers",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1506",
          "author": null,
          "description": "Cloudflare has a lot more to offer than merely DDoS protection and CDN services. On this episode, Jon Kuperman joins Amal & Jerod to talk through many of their cool new things like Workers, KV, Durable Objects, and R2 Storage. Thanks to listener Matt Mannucci for requesting this episode!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nJon Kuperman – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nWorkers\nWorkers Chat Demo\nArgo Smart Routing\nR2 announcement\nDurable Objects\nKV",
          "link": "https://changelog.com/jsparty/209",
          "publishedOn": "2022-01-21T17:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 209: What Cloudflare is up to",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/209/js-party-209.mp3",
            "length": "64169717",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Z3De",
          "author": "Jerod Santo",
          "description": "If you landed here hoping this project isn’t serious… fear not. It’s just for fun, but it really works!\nHave you ever thought to yourself: Why don’t we have an immersive 3D sandbox user interface to manage workloads on my favorite container orchestrator? No? Well here it is anyway.\nPigs are pods. Cows are ReplicaSets. Chickens are services. You get the drift.\n\nDiscuss on Changelog News",
          "link": "https://github.com/erjadi/kubecraftadmin",
          "publishedOn": "2022-01-21T15:54:00.000Z",
          "wordCount": null,
          "title": "Minecraft as a k8s admin tool",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJmm",
          "author": "Jerod Santo",
          "description": "Jesse O’Brien from Test Double wants us to stop using the term “Tech Debt”\nThere’s loads of reasons why unmaintainable code ends up running in the systems our products are built on, but none of these fit the definition of debt.\nInstead, I propose we drop the term Tech Debt and start talking about maintenance tasks. Maintenance is what we’re really talking about. When parts on our car or bicycle suffers wear from driving them around, we don’t talk to our mechanic about “mechanical debt”. (Go back and re-read that sentence, but replace things with “software” and “programmers”). We talk about maintenance.\nThis post starts as mostly a semantic debate, and I’m not convinced by his arguments there. I think the debt metaphor is useful when you’re talking about trading quality for speed. That’s what you do when you take on debt: you trade higher cost at a future date (principle + interest) to gain access to the money today (speed).\nThat being said, I really like where Jesse ends this piece talking about software maintenance and methods of going about it. Lots of actionable advice there and I’m 100% onboard with talking about software maintenance early and often. One of the first things I consider when somebody approaches me with a feature idea is ask myself: what will this cost to maintain?\nDiscuss on Changelog News",
          "link": "https://blog.testdouble.com/posts/2022-01-20-stop-paying-debts-start-maintaining-code/",
          "publishedOn": "2022-01-21T15:08:00.000Z",
          "wordCount": null,
          "title": "Stop paying tech debts, start maintaining code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykPR",
          "author": "Jerod Santo",
          "description": "Andrew Kutz:\nAfter spending some time playing with them, I began to appreciate how generics in Go have been designed and implemented with the same elegance and simplicity as Go itself. I hope you will agree, and to that end, this repository is a hands-on approach to learning all about generics in Go.\nDiscuss on Changelog News",
          "link": "https://github.com/akutz/go-generics-the-hard-way",
          "publishedOn": "2022-01-21T14:18:00.000Z",
          "wordCount": null,
          "title": "A hands-on approach to getting started with Go generics",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1523",
          "author": null,
          "description": "Gerhard loves simple ideas executed well, which is why he is excited to be speaking today with Ildar Iskhakov & Matvey Kukuy about their startup Amixr, a.k.a. Grafana OnCall.\nIldar & Matvey started with a simple idea and a simple stack - Django, Celery, RabbitMQ & MySQL - all running on Kubernetes. Because they kept their main thing their main thing, and kept improving it every day for a couple of years, now your on-call can be simple too.\nThis is another Big Tent philosophy story with a Black Swan moment towards the end.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMongoDB – An integrated suite of cloud database and services — They have a FREE forever tier, so you can prove to yourself and to your team that t…",
          "link": "https://changelog.com/shipit/36",
          "publishedOn": "2022-01-20T22:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 36: Keep on-call simple",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/36/ship-it-36.mp3",
            "length": "55905687",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Q5lM",
          "author": "Jerod Santo",
          "description": "Eleventy creator, Zach Leatherman:\nThis project would not be possible without our lovely community. Thank you to everyone that built something with Eleventy (×476 authors on our web site!), wrote a blog post about Eleventy, contributed code to core or plugins, documentation, asked questions, answered questions, braved The Leaderboards, participated on Discord, filed issues, attended (or organized!) a meetup, said a kind word on Twitter ❤️.\nCongrats to Zach and the entire Eleventy community on the big 1.0! 🎉\nDiscuss on Changelog News",
          "link": "https://www.zachleat.com/web/eleventy-one-point-oh/",
          "publishedOn": "2022-01-20T17:52:00.000Z",
          "wordCount": null,
          "title": "Eleventy v1.0.0, the stable release",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1399",
          "author": null,
          "description": "Alexey Palazhchenko joins Natalie to discuss the implications of GitHub’s Copilot on code generation. Go’s design lends itself nicely to computer generated authoring: thanks to go fmt, there’s already only one Go style. This means AI-generated code will be consistent and seamless. Its focus on simplicity & readability make it tailor made for this new approach to software creation. Where might this take us?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGitLab – The DevOps platform that empowers organizations to maximize the overall return on software development by delivering software faster, more efficiently, while strengthening security and compliance. Identify and address blockers immediately, focus on delivering value — not maintaining integrations, automate security and compliance. Get started with their free tier (no credit card required). Learn more at about.gitlab.com/solutions/devops-platform\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nAlexey Palazhchenko – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nFerretDB\nOpenAI Codex\nGitHub Copilot",
          "link": "https://changelog.com/gotime/213",
          "publishedOn": "2022-01-20T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 213: AI-driven development in Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/213/go-time-213.mp3",
            "length": "48030812",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8Ow8",
          "author": "Jerod Santo",
          "description": "Imagine this: you’ve been paged to investigate a production incident, and after some digging, you identify the commit with the breaking code. You decide to revert the change:\ngit revert 1a2b3c\nUnfortunately, in doing so, a new bug is introduced! As it turns out, hidden in that old “broken” commit was some code that another part of the app depended upon, and when you reverted those lines, it left the site once again in a broken state. 🙃 Oh dear.\nHow can situations like this be avoided? To answer this question, we first need to examine how these types of commits come to be.\nIf you’ve never heard of or used git reset… this article is a must-read.\nDiscuss on Changelog News",
          "link": "https://render.com/blog/git-organized-a-better-git-flow",
          "publishedOn": "2022-01-20T14:41:00.000Z",
          "wordCount": null,
          "title": "Git organized: a better git flow",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlPy",
          "author": "Jerod Santo",
          "description": "Arnold Galovics’ follow-up to his excellent monoliths are your friend post from late last year.\nStarting a greenfield project with microservices is easy. The promises are wonderful but often they are far from reality. This time I’ll share my experience on the truth about microservices when starting a project from scratch.\nDiscuss on Changelog News",
          "link": "https://arnoldgalovics.com/truth-about-microservices/",
          "publishedOn": "2022-01-19T19:54:00.000Z",
          "wordCount": null,
          "title": "The truth about starting with microservices",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9Oma",
          "author": "Jerod Santo",
          "description": "Jakob Greenfeld:\nI recently discovered a simple step-by-step process that significantly increased my personal productivity and made me happier along the way.\nIt costs $0 and no, it’s not some note-taking or to-do list system.\nThe steps are:\ndevelop meta-awareness of your state of mind.\npattern-match to identify your mind’s most common modes.\nlearn to pick activities that match each mode.\nBut that probably won’t hit home until you read through his explanation of each step.\nDiscuss on Changelog News",
          "link": "https://jakobgreenfeld.com/personal-productivity",
          "publishedOn": "2022-01-19T16:19:00.000Z",
          "wordCount": null,
          "title": "Effortless personal productivity (or how I learned to love my monkey mind)",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1560",
          "author": null,
          "description": "You might know about MLPerf, a benchmark from MLCommons that measures how fast systems can train models to a target quality metric. However, MLCommons is working on so much more! David Kanter joins us in this episode to discuss two new speech datasets that are democratizing machine learning for speech via data scale and language/speaker diversity.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nThe Brave Browser – Browse the web up to 8x faster than Chrome and Safari, block ads and trackers by default, and reward your favorite creators with the built-in Basic Attention Token. Download Brave for free and give tipping a try right here on changelog.com.\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nDavid Kanter – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nPress Release about MLCommons datasets: MLCommons™ Association Unveils Open Datasets and Tools to Drive Democratization of Machine Learning\nNeurIPS Papers:\n\nPeople’s Speech Dataset\nMultilingual Spoken Words Corpus (MSWC)\nGradient article: New Datasets to Democratize Speech Recognition Technology\nBlog posts for more insight:\n\nPeople’s Speech\nMultilingual Spoken Words Corpus (MSWC)\nDownloads:\n\nPeople’s Speech\nMultilingual Spoken Words Corpus",
          "link": "https://changelog.com/practicalai/164",
          "publishedOn": "2022-01-19T15:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 164: Democratizing ML for speech",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/164/practical-ai-164.mp3",
            "length": "43280267",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1544",
          "author": null,
          "description": "This week Matt Ahrens joins Adam to talk about ZFS. Matt co-founded the ZFS project at Sun Microsystems in 2001. And 20 years later Adam picked up ZFS for use in his home lab and loved it. So, he reached out to Matt and invited him on the show. They cover the origins of the file system, its journey from proprietary to open source, architecture choices like copy-on-write, the ins and outs creating and managing ZFS, RAID-Z and RAID-Z expansion, and Matt even shares plans for ZFS in the cloud with ZFS object store.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s bu…",
          "link": "https://changelog.com/podcast/475",
          "publishedOn": "2022-01-18T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 475: Making the ZFS file system",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/475/the-changelog-475.mp3",
            "length": "87137250",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eZPO",
          "author": "Jerod Santo",
          "description": "This is an excellent explanation of the difference between these styles of programming and why declarative is all the rage these days.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=E7Fbf7R3x6I",
          "publishedOn": "2022-01-18T20:15:00.000Z",
          "wordCount": null,
          "title": "Imperative vs declarative programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RR50",
          "author": "Jerod Santo",
          "description": "This post by Shayon Mukherjee is in response to the recently logged post by Mike Coutermarsh in praise of MySQL for infra folks:\nThis is not a MySQL vs PostgreSQL post. This is just a small summary of what I have come to appreciate about PostgreSQL as an Infrastructure Engineer.\nAlways good to keep in mind whenever comparing technologies: trade-offs abound and certain people in certain situations will value certain things about different technologies differently. That’s for certain. 😉\nDiscuss on Changelog News",
          "link": "https://www.shayon.dev/post/2022/17/why-i-enjoy-postgresql-infrastructure-engineers-perspective/",
          "publishedOn": "2022-01-18T19:19:00.000Z",
          "wordCount": null,
          "title": "Why I enjoy PostgreSQL (an infra engineer's perspective)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2P2",
          "author": "Martin Heinz",
          "description": "If you’re using GitHub as your version control system of choice then GitHub Apps can be incredibly useful for many tasks including building CI/CD, managing repositories, querying statistical data and much more. In this article we will walk through the process of building such an app in Go including setting up the GitHub integration, authenticating with GitHub, listening to webhooks, querying GitHub API and more.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/65",
          "publishedOn": "2022-01-18T16:26:00.000Z",
          "wordCount": null,
          "title": "Building GitHub Apps with Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73dp",
          "author": "Adam Stacoviak",
          "description": "From Mike Coutermarsh:\nFor years I’ve been noticing this pattern of infrastructure engineers I really respect preferring MySQL and product engineers preferring Postgres. It took quite a while for me to understand it. Especially coming from my background as a product engineer. Infrastructure engineers generally…\nRead on to hear why (from Mike’s perspective).\nDiscuss on Changelog News",
          "link": "https://mikecoutermarsh.com/why-infrastructure-engineers-prefer-mysql/",
          "publishedOn": "2022-01-18T15:40:43.000Z",
          "wordCount": null,
          "title": "Why infrastructure engineers prefer MySQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2pE",
          "author": "Jerod Santo",
          "description": "Daniel Stenberg lays out how he thinks we can view the world of software and open source in light of supply chain security, maintainer sustainability, and the like:\nInside the pyramid there is a hierarchy where things using software are build on top of others, in layers. The higher up you go, the more you stand on the shoulders of open source components below you.\nAt the very bottom of the pyramid are the foundational components. Operating systems and libraries. The stuff virtually everything runs or depends upon. The components you really don’t want to have serious security vulnerabilities.\n\nDiscuss on Changelog News",
          "link": "https://daniel.haxx.se/blog/2022/01/17/enforcing-the-pyramid-of-open-source/",
          "publishedOn": "2022-01-17T21:20:00.000Z",
          "wordCount": null,
          "title": "Enforcing the pyramid of open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13jw",
          "author": "Jerod Santo",
          "description": "Jim Hall used grep and some fancy regular expressions to get a leg up on Wordle, the word game that keeps you guessing… but only once per day. Some people may think of Jim’s technique as cheating. I wouldn’t necessarily disagree.\nBut it’s a lot better than View Source-ing to get at the answer, which you can also do in a pinch. 😉\n(Also there’s zero point to Wordle other than having fun, so it’s really only cheating if your answer-finding-method is less fun than you’d have otherwise. Even then, you’re only cheating yourself.)\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/22/1/word-game-linux-command-line",
          "publishedOn": "2022-01-17T18:24:00.000Z",
          "wordCount": null,
          "title": "Solving Wordle with help from the Linux command line",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73X6",
          "author": "Jerod Santo",
          "description": "This is an excellent machine learning primer where you scroll the page and the author(s) walk you through the process of creating a model to distinguish homes in New York from homes in San Francisco.\nDiscuss on Changelog News",
          "link": "http://www.r2d3.us/visual-intro-to-machine-learning-part-1/",
          "publishedOn": "2022-01-17T15:57:00.000Z",
          "wordCount": null,
          "title": "A visual introduction to machine learning",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/DzJ1",
          "author": "Jerod Santo",
          "description": "Eight people have stepped up to take over maintenance of the suddenly abandoned JS library that generates fake data. These transitions are tricky to make smoothly. Props to the new team on being very careful and thoughtful each step along the way, especially when it comes to funding the project. Here’s a nice note from the new team:\nWe’re excited to give new life to this idea and project.\nThis project can have a fresh start and it will become even cooler.\nWe felt we needed to do a public announcement because of all of the attention the project received in the media and from the community.\nWe believe that we have acted in the way that is best for the community.\nDiscuss on Changelog News",
          "link": "https://fakerjs.dev/update.html",
          "publishedOn": "2022-01-17T15:11:00.000Z",
          "wordCount": null,
          "title": "Faker.js is now a community maintained project",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1533",
          "author": null,
          "description": "This week Adam is joined by Sam Lambert, CEO of PlanetScale. Now that PlanetScale is in general availability, Adam had to get Sam on the show to talk about the behind the scenes of building this database platform, how this is the last database you’ll ever need and what that means for developers, why serverless, its open source underpinnings with Vitess, and a preview of what’s to come.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days…",
          "link": "https://changelog.com/founderstalk/85",
          "publishedOn": "2022-01-14T20:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 85: Making the last database you’ll ever need",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/founderstalk/85/founders-talk-85.mp3",
            "length": "82788990",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lbeY",
          "author": "Jerod Santo",
          "description": "Funny how stuff like this plays out sometimes:\nMy cog tool has been having a resurgence of late: a number of people are discovering it’s useful to run a little bit of Python code inside otherwise static files.\nHe goes on to list out a bunch of tweets from people finding it useful for various tasks and even got to talk about the project on podcast.__init__. Cool tool, cool story.\nDiscuss on Changelog News",
          "link": "https://nedbatchelder.com/blog/202201/cog_resurgence.html",
          "publishedOn": "2022-01-14T18:19:00.000Z",
          "wordCount": null,
          "title": "Ned Batchelder's cog tool is an overnight success 17 years in the making",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1547",
          "author": null,
          "description": "Swyx is the known for learning in public, and he joins the party to teach Ali and Nick about what he’s been working on with Temporal IO, what it is, and why he’s excited about it. We also talk about his role as Director of Developer Experience, including what developer experience is, how to do it, and what goals to set.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/changelog\n\n    \nRaygun – Never…",
          "link": "https://changelog.com/jsparty/208",
          "publishedOn": "2022-01-14T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 208: Temporal is like React for the backend",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/208/js-party-208.mp3",
            "length": "55707311",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MdV2",
          "author": "Jerod Santo",
          "description": "This post covers 5 cases where the author uses the JSON data type for column definitions:\nDumping request data for later processing\nSupporting extra fields\nSome one-to-many relationships\nKey-value use cases\nSimpler EAV design\nCraig Kerstiens has also weighed in on this topic for us.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/01/08/when-to-use-json-data-type-in-database-schema-design/",
          "publishedOn": "2022-01-14T16:07:01.000Z",
          "wordCount": null,
          "title": "When to use JSON data type in database schema design?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQD3",
          "author": "Jerod Santo",
          "description": "Edit the font in your browser and download the result. Cool! Made possible by SVG and OpenType.js.\nDiscuss on Changelog News",
          "link": "https://brutalita.com/",
          "publishedOn": "2022-01-14T15:19:00.000Z",
          "wordCount": null,
          "title": "Brutalita is an experimental grid-based font & editor",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Lpy5",
          "author": "Jerod Santo",
          "description": "System76’s COSMIC desktop environment is still in early development, but here’s an early preview that might pique your interest. Love that launcher. 🤩\n\nDiscuss on Changelog News",
          "link": "https://blog.edfloreshz.dev/articles/linux/system76/rust-based-desktop-environment/",
          "publishedOn": "2022-01-14T14:25:00.000Z",
          "wordCount": null,
          "title": "Exploring System76's new Rust based desktop environment",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1521",
          "author": null,
          "description": "Today Gerhard shares the entire story behind his lost packets. He is talking with Drew Marshall, director at Trunk Networks and No One Internet, a Cloud Services Provider & ISP based in Sussex, UK.\nGerhard’s Vodafone ISP gateway was losing packets, and recording some of the previous episodes used to be challenging as his internet connection would cut out up to 10 seconds at a time, multiple times per recording session. He was convinced that his Unifi Dream Machine Pro was not the issue. Drew helped Gerhard realise that it actually was. Not only has Gerhard’s DNS latency improved by 3x, but he can now fail-over between two WAN connections. And because nothing beats a real-world experiment, you can guess what is coming in this episode 😉\nYou will find latency & packet loss graphs, speed test…",
          "link": "https://changelog.com/shipit/35",
          "publishedOn": "2022-01-14T12:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 35: How I found my lost network packets",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/35/ship-it-35.mp3",
            "length": "57604289",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/openpilot-hiring/",
          "author": null,
          "description": "The openpilot team is one of three teams at comma. Our main goal is to provide a stable and highly reliable platform for the research team’s models to run on. This includes everything from the OS our devices run to the cars that openpilot drives. We’re looking for great engineers who want to work on all parts of that stack.",
          "link": "https://blog.comma.ai/openpilot-hiring/",
          "publishedOn": "2022-02-02T12:00:00.000Z",
          "wordCount": 466,
          "title": "Join the openpilot team!"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/health/ask-a-techspert-what-does-ai-do-when-it-doesnt-know/",
          "author": null,
          "description": "As humans, we constantly learn from the world around us. We experience inputs that shape our knowledge — including the boundaries of both what we know and what we don’t know.\nMany of today’s machines also learn by example. However, these machines are typically trained on datasets and information that doesn’t always include rare or out-of-the-ordinary examples that inevitably come up in real-life scenarios. What is an algorithm to do when faced with the unknown?\nI recently spoke with Abhijit Guha Roy, an engineer on the Health AI team, and Ian Kivlichan, an engineer on the Jigsaw team, to hear more about using AI in real-world scenarios and better understand the importance of training it to know when it doesn’t know.\nAbhijit, tell me about your recent research in the dermatology space.\nWe’r…",
          "link": "https://blog.google/technology/health/ask-a-techspert-what-does-ai-do-when-it-doesnt-know/",
          "publishedOn": "2022-02-08T17:00:00.000Z",
          "wordCount": 1666,
          "title": "Ask a Techspert: What does AI do when it doesn’t know?"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=18392",
          "author": "Daniel Stenberg",
          "description": "I’m the lead developer in the curl project. We make the command line tool curl and the library libcurl, for doing Internet transfers. The command line tool uses the library for all the internet transfer heavy lifting. The command line tool is somewhat of a shell binding to access libcurl. We make these things. We … Continue reading My work on tool vs library →",
          "link": "https://daniel.haxx.se/blog/2022/02/10/my-work-on-tool-vs-library/",
          "publishedOn": "2022-02-10T13:29:18.000Z",
          "wordCount": 1729,
          "title": "My work on tool vs library"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18389",
          "author": "Daniel Stenberg",
          "description": "The curl “cockpit” is yet again extended with a new command line option: --json. The 245th command line option. curl is a generic transfer tool for sending and receiving data across networks and it is completely agnostic as to what it transfers or even why. To allow users to craft all sorts of transfers, or … Continue reading curl dash-dash-json →",
          "link": "https://daniel.haxx.se/blog/2022/02/02/curl-dash-dash-json/",
          "publishedOn": "2022-02-02T08:12:18.000Z",
          "wordCount": 1229,
          "title": "curl dash-dash-json"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18332",
          "author": "Daniel Stenberg",
          "description": "I did an online presentation with this name for the Rust Linz meetup, on January 27 2022. This is the recording: The individual slides are also available. Content quickly In this presentation I talk about how libcurl’s most important aspect is the stable ABI and API. If we just maintain those, we can change the … Continue reading curl with rust →",
          "link": "https://daniel.haxx.se/blog/2022/02/01/curl-with-rust/",
          "publishedOn": "2022-02-01T08:03:00.000Z",
          "wordCount": 814,
          "title": "curl with rust"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17464",
          "author": "Daniel Stenberg",
          "description": "In the curl project we switched to using git for source code control in March 2010. Since then we have exact tracking of every commit author to the project. In the times before git, we used CVS which doesn’t properly separate committers from authors. The number of commit authors in curl has gradually been increasing … Continue reading 1,000 commit authors →",
          "link": "https://daniel.haxx.se/blog/2022/01/30/1000-commit-authors/",
          "publishedOn": "2022-01-30T22:24:18.000Z",
          "wordCount": 1119,
          "title": "1,000 commit authors"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18206",
          "author": "Daniel Stenberg",
          "description": "On Friday January 21, 2022 I received this email. I tweeted about it and it took off like crazy. The email comes from a fortune-500 multi-billion dollar company that apparently might be using a product that contains my code, or maybe they have customers who do. Who knows? My guess is that they do this … Continue reading LogJ4 Security Inquiry – Response Required →",
          "link": "https://daniel.haxx.se/blog/2022/01/24/logj4-security-inquiry-response-required/",
          "publishedOn": "2022-01-24T14:45:57.000Z",
          "wordCount": 1901,
          "title": "LogJ4 Security Inquiry – Response Required"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18034",
          "author": "Daniel Stenberg",
          "description": "The well-known log4j security vulnerability of December 2021 triggered a lot of renewed discussions around software supply chain security, and sometimes it has also been said to be an Open Source related issue. This was not the first software component to have a serious security flaw, and it will not be the last. What can … Continue reading Enforcing the pyramid of Open Source →",
          "link": "https://daniel.haxx.se/blog/2022/01/17/enforcing-the-pyramid-of-open-source/",
          "publishedOn": "2022-01-17T08:00:42.000Z",
          "wordCount": 2478,
          "title": "Enforcing the pyramid of Open Source"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-02-11T12:13:04.332Z",
          "wordCount": 2052,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-02-05T12:10:17.651Z",
          "wordCount": 995,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2022-01-31T12:13:24.172Z",
          "wordCount": 2819,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-01-21T12:13:58.073Z",
          "wordCount": 830,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-01-21T12:13:58.060Z",
          "wordCount": 806,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2022-01-17T12:15:21.266Z",
          "wordCount": 2822,
          "title": "How we built Twitter’s highly reliable ads pacing service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-01-15T12:14:22.581Z",
          "wordCount": 1677,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2022-01-15T12:14:22.112Z",
          "wordCount": 2618,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "author": null,
          "description": "This blog post shares optimization findings to speed up Transformer-based models’ CPU inference and improve computational demand in Google Cloud.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "publishedOn": "2022-01-14T12:14:46.174Z",
          "wordCount": 2672,
          "title": "Speeding up Transformer CPU inference in Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html",
          "author": null,
          "description": "ol.lst-kix_p008n8rtcs1c-3.start{counter-reset:lst-ctn-kix_p008n8rtcs1c-3 0}.lst-kix_sr4t049r1bof-6>li{counter-increment:lst-ctn-kix_sr4t049r1bof-6}.lst-kix_ygk8qly5wagc-7>li:before{content:\"\\0025cb  \"}.lst-kix_p008n8rtcs1c-6>li{counter-increment:lst-ctn-kix_p008n8rtcs1c-6}.lst-kix_ygk8qly5wagc-6>li:before{content:\"\\0025cf  \"}.lst-kix_p008n8rtcs1c-7>li{counter-increment:lst-ctn-kix_p008n8rtcs1c-7}ol.lst-kix_p008n8rtcs1c-0.start{counter-reset:lst-ctn-kix_p008n8rtcs1c-0 0}.lst-kix_ygk8qly5wagc-8>li:before{content:\"\\0025a0  \"}ol.lst-kix_sr4t049r1bof-1.start{counter-reset:lst-ctn-kix_sr4t049r1bof-1 0}.lst-kix_sr4t049r1bof-5>li{counter-increment:lst-ctn-kix_sr4t049r1bof-5}.lst-kix_7tz9dwqwiu1-5>li:before{content:\"\\0025a0  \"}.lst-kix_7tz9dwqwiu1-4>li:before{content:\"\\0025cb  \"}.lst-kix_7tz9dwqwiu…",
          "link": "https://googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html",
          "publishedOn": "2022-02-10T16:58:00.000Z",
          "wordCount": 2910,
          "title": "A walk through Project Zero metrics"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/01/zooming-in-on-zero-click-exploits.html",
          "author": null,
          "description": "ul.lst-kix_ef7dug197aaw-4{list-style-type:none}ul.lst-kix_ef7dug197aaw-3{list-style-type:none}.lst-kix_ef7dug197aaw-0>li:before{content:\"-  \"}ul.lst-kix_ef7dug197aaw-2{list-style-type:none}ul.lst-kix_ef7dug197aaw-1{list-style-type:none}.lst-kix_ef7dug197aaw-1>li:before{content:\"-  \"}ul.lst-kix_ef7dug197aaw-8{list-style-type:none}ul.lst-kix_ef7dug197aaw-7{list-style-type:none}ul.lst-kix_ef7dug197aaw-6{list-style-type:none}ul.lst-kix_ef7dug197aaw-5{list-style-type:none}ul.lst-kix_ef7dug197aaw-0{list-style-type:none}.lst-kix_ef7dug197aaw-7>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-6>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-8>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-5>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-3>li:before{content:\"-  \"}.lst-kix_ef7dug197aaw-2>li:before{content…",
          "link": "https://googleprojectzero.blogspot.com/2022/01/zooming-in-on-zero-click-exploits.html",
          "publishedOn": "2022-01-18T17:28:00.000Z",
          "wordCount": 4892,
          "title": "Zooming in on Zero-click Exploits"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47599",
          "author": "Benjamin VanderSloot",
          "description": "Before we roll out State Partitioning for all Firefox users, we intend to make a few privacy and ergonomic improvements to the Storage Access API. In this blog post, we’ll detail a few of the new changes we made. \nThe post Improving the Storage Access API in Firefox appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/02/improving-the-storage-access-api-in-firefox/",
          "publishedOn": "2022-02-08T16:59:21.000Z",
          "wordCount": 1504,
          "title": "Improving the Storage Access API in Firefox"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47574",
          "author": "Christian Holler",
          "description": "On January 13th 2022, Firefox became unusable for close to two hours for users worldwide. This incident interrupted many people’s workflow. This post highlights the complex series of events and circumstances that, together, triggered a bug deep in the networking code of Firefox. What Happened? Firefox has a number of servers and related infrastructure that […]\nThe post Retrospective and Technical Details on the recent Firefox Outage appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/02/retrospective-and-technical-details-on-the-recent-firefox-outage/",
          "publishedOn": "2022-02-02T09:00:50.000Z",
          "wordCount": 1546,
          "title": "Retrospective and Technical Details on the recent Firefox Outage"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47585",
          "author": "Xavier Harding",
          "description": "Adetona Adewale Akeem, more popularly known as iSlimfit, is a Nigeria-born revered digital technologist and marketing expert. He is the co-founder of Menopays, a fintech startup offering another Buy Now Pay Later (BNPL) option across Africa. We chatted with him about founding Menopays and the impact of tech solutions developed in Nigeria. \nThe post Hacks Decoded: Adewale Adetona appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/01/hacks-decoded-adewale-adetona/",
          "publishedOn": "2022-01-31T17:44:10.000Z",
          "wordCount": 2124,
          "title": "Hacks Decoded: Adewale Adetona"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47555",
          "author": "Francesca Minelli",
          "description": "If you’ve ever built anything with web technologies, you’re probably familiar with MDN Web Docs. With about 13,000 pages documenting how to use programming languages such as HTML, CSS and JavaScript, the site has about 8,000 people using it at any given moment. MDN relies on contributors to help maintain its ever-expanding and up to date documentation. We reached out to 4 long-time community contributors to talk about how and why they started contributing, why they kept going, and ask what advice they have for new contributors.\nThe post Contributing to MDN: Meet the Contributors appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/01/contributing-to-mdn-meet-the-contributors/",
          "publishedOn": "2022-01-18T16:07:59.000Z",
          "wordCount": 2488,
          "title": "Contributing to MDN: Meet the Contributors"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=63029",
          "author": "Matt Butler",
          "description": "Stop context switching. Keep your team’s project planning next to your code.",
          "link": "https://github.blog/2022-02-11-getting-started-with-project-planning-on-github/",
          "publishedOn": "2022-02-11T17:30:43.000Z",
          "wordCount": 1347,
          "title": "Getting started with project planning on GitHub"
        },
        {
          "id": "https://github.blog/?p=62982",
          "author": "Brian Douglas",
          "description": "Reusable workflows offer a simple and powerful way to avoid copying and pasting workflows across your repositories.",
          "link": "https://github.blog/2022-02-10-using-reusable-workflows-github-actions/",
          "publishedOn": "2022-02-10T17:56:42.000Z",
          "wordCount": 1545,
          "title": "How to start using reusable workflows with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=62926",
          "author": "Nancy Gariché",
          "description": "A comprehensive guide for vulnerability reporters.",
          "link": "https://github.blog/2022-02-09-coordinated-vulnerability-disclosure-cvd-open-source-projects/",
          "publishedOn": "2022-02-09T20:24:56.000Z",
          "wordCount": 2526,
          "title": "Coordinated vulnerability disclosure (CVD) for open source projects"
        },
        {
          "id": "https://github.blog/?p=62828",
          "author": "Erin Havens",
          "description": "Today, we’re shipping improvements to Dependabot alerts that make them easier to understand and remediate.",
          "link": "https://github.blog/2022-02-08-improving-developer-experience-dependabot-alerts/",
          "publishedOn": "2022-02-08T19:11:24.000Z",
          "wordCount": 859,
          "title": "Improving the developer experience for Dependabot alerts"
        },
        {
          "id": "https://github.blog/?p=62511",
          "author": "Michelle Mannering",
          "description": "Here's January's top staff picks on projects that shipped major version releases.",
          "link": "https://github.blog/2022-02-04-release-radar-jan-2022/",
          "publishedOn": "2022-02-04T23:00:58.000Z",
          "wordCount": 1588,
          "title": "Release Radar · January 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=62836",
          "author": "Scott Sanders",
          "description": "In January, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2022-02-02-github-availability-report-january-2022/",
          "publishedOn": "2022-02-03T00:00:24.000Z",
          "wordCount": 318,
          "title": "GitHub Availability Report: January 2022"
        },
        {
          "id": "https://github.blog/?p=62762",
          "author": "Brian Douglas",
          "description": "A quick guide on the advantages of using GitHub Actions as your preferred CI/CD tool—and how to build a CI/CD pipeline with it.",
          "link": "https://github.blog/2022-02-02-build-ci-cd-pipeline-github-actions-four-steps/",
          "publishedOn": "2022-02-02T19:48:18.000Z",
          "wordCount": 2528,
          "title": "How to build a CI/CD pipeline with GitHub Actions in four simple steps"
        },
        {
          "id": "https://github.blog/?p=62801",
          "author": "Jessica Lord",
          "description": "Along with the release of sponsors-only repositories, here’s a look at what’s new and what’s next for Sponsors.",
          "link": "https://github.blog/2022-02-02-new-sponsors-only-repositories-custom-amounts-and-more/",
          "publishedOn": "2022-02-02T18:00:04.000Z",
          "wordCount": 940,
          "title": "New sponsors-only repositories, custom amounts, and more"
        },
        {
          "id": "https://github.blog/?p=62743",
          "author": "Nick Rolfe",
          "description": "How we add support for new languages to CodeQL.",
          "link": "https://github.blog/2022-02-01-code-scanning-and-ruby-turning-source-code-into-a-queryable-database/",
          "publishedOn": "2022-02-01T17:07:01.000Z",
          "wordCount": 3083,
          "title": "Code scanning and Ruby: turning source code into a queryable database"
        },
        {
          "id": "https://github.blog/?p=62786",
          "author": "Myles Borins",
          "description": "Starting today, we are rolling out mandatory 2FA to all maintainers of top-100 npm packages by dependents.",
          "link": "https://github.blog/2022-02-01-top-100-npm-package-maintainers-require-2fa-additional-security/",
          "publishedOn": "2022-02-01T17:00:04.000Z",
          "wordCount": 1005,
          "title": "Top-100 npm package maintainers now require 2FA, and additional security-focused improvements to npm"
        },
        {
          "id": "https://github.blog/?p=62734",
          "author": "Justin Hutchings",
          "description": "The dependency graph helps developers and maintainers understand the code they depend on, and now includes GitHub Actions!",
          "link": "https://github.blog/2022-01-31-dependency-graph-now-supports-github-actions/",
          "publishedOn": "2022-01-31T17:03:37.000Z",
          "wordCount": 501,
          "title": "Dependency graph now supports GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=62686",
          "author": "Rose Coogan",
          "description": "In GitHub's latest transparency report, we’re giving you a by-the-numbers look at how we responded to requests for user info and content removal.",
          "link": "https://github.blog/2022-01-27-2021-transparency-report/",
          "publishedOn": "2022-01-27T23:35:14.000Z",
          "wordCount": 5315,
          "title": "2021 Transparency Report"
        },
        {
          "id": "https://github.blog/?p=62658",
          "author": "Alvaro Munoz",
          "description": "When it comes to secure database access, there's more to consider than SQL injections. OWASP Top 10 Proactive Control C3 offers guidance.",
          "link": "https://github.blog/2022-01-27-beyond-sql-injection-owasp-tips-secure-database-access/",
          "publishedOn": "2022-01-27T21:17:41.000Z",
          "wordCount": 1728,
          "title": "Thinking beyond SQL injection: OWASP tips for secure database access"
        },
        {
          "id": "https://github.blog/?p=62624",
          "author": "Juan Pablo Flores Cortés",
          "description": "Learn new skills, build projects and meet like-minded students with the latest shows from the GitHub Education Stream Team.",
          "link": "https://github.blog/2022-01-26-get-ready-for-campus-tv-season-2-new-beginnings/",
          "publishedOn": "2022-01-26T17:59:38.000Z",
          "wordCount": 1766,
          "title": "Get ready for Campus TV Season 2: 🌱 New Beginnings"
        },
        {
          "id": "https://github.blog/?p=62598",
          "author": "Berk Veral",
          "description": "GitHub continues to improve account security and developer experience with a new 2FA mechanism in GitHub Mobile on iOS and Android.",
          "link": "https://github.blog/2022-01-25-secure-your-github-account-github-mobile-2fa/",
          "publishedOn": "2022-01-25T16:41:56.000Z",
          "wordCount": 738,
          "title": "Secure your GitHub account with GitHub Mobile 2FA"
        },
        {
          "id": "https://github.blog/?p=62535",
          "author": "Taylor Blau",
          "description": "The open source Git project just released Git 2.35. Here's GitHub's look at some of the most interesting features and changes introduced since last time.",
          "link": "https://github.blog/2022-01-24-highlights-from-git-2-35/",
          "publishedOn": "2022-01-24T20:00:43.000Z",
          "wordCount": 2563,
          "title": "Highlights from Git 2.35"
        },
        {
          "id": "https://github.blog/?p=62405",
          "author": "Michelle Mannering",
          "description": "Many of us were wrapping up projects, emails, events, and getting ready for Christmas. While we were all busy getting ready for the festive season, our community was still hard at work shipping open source",
          "link": "https://github.blog/2022-01-21-release-radar-dec-2021/",
          "publishedOn": "2022-01-21T23:00:29.000Z",
          "wordCount": 1209,
          "title": "Release Radar · December 2021 Edition"
        },
        {
          "id": "https://github.blog/?p=62495",
          "author": "Peter Cihon",
          "description": "When digital infrastructure is overlooked by governments, it isn't just a missed opportunity: policies may inadvertently endanger open source collaboration.",
          "link": "https://github.blog/2022-01-20-open-source-creates-value-but-how-do-you-measure-it/",
          "publishedOn": "2022-01-20T16:58:28.000Z",
          "wordCount": 1576,
          "title": "Open source creates value, but how do you measure it?"
        },
        {
          "id": "https://github.blog/?p=62472",
          "author": "Jose Palafox",
          "description": "We’re excited to announce the V4 release of the OpenSSF’s Scorecard project in partnership with Google.",
          "link": "https://github.blog/2022-01-19-reducing-security-risk-oss-actions-opensff-scorecards-v4/",
          "publishedOn": "2022-01-19T15:00:02.000Z",
          "wordCount": 644,
          "title": "Reducing security risk in open source software with GitHub Actions and OpenSSF Scorecards V4"
        },
        {
          "id": "https://github.blog/?p=62454",
          "author": "Nicole Numrich",
          "description": "With the successful liftoff of the James Webb Space Telescope, we ask our very own Arfon Smith about the history of open source and space science.",
          "link": "https://github.blog/2022-01-18-how-open-source-is-supporting-nasas-new-eyes-in-space/",
          "publishedOn": "2022-01-18T17:41:41.000Z",
          "wordCount": 1727,
          "title": "How open source is supporting NASA’s new eyes in space"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18086",
          "author": "Nubank Editorial",
          "description": "Yes, She Codes is back! Applications for the program are open until February 13. See more details about the event and learn how to apply\nThe post Yes, She Codes: Nubank opens applications for the 4th edition of the software engineers hiring program appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/yes-she-codes-nubank-fourth-edition-2022/",
          "publishedOn": "2022-02-07T16:26:01.000Z",
          "wordCount": 3608,
          "title": "Yes, She Codes: Nubank opens applications for the 4th edition of the software engineers hiring program"
        },
        {
          "id": "https://building.nubank.com.br/?p=18070",
          "author": "Matt Swann - Chief Technology Officer at Nubank",
          "description": "The key role of customer-centricity in creating continuous improvement cycles and mechanisms to inspect metrics, processes, and incidents, thus engaging tech teams\nThe post People at the center of the strategy: the first step to innovation appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/matt-swann-people-at-the-center-of-the-strategy-the-first-step-to-innovation/",
          "publishedOn": "2022-02-04T18:56:50.000Z",
          "wordCount": 3565,
          "title": "People at the center of the strategy: the first step to innovation"
        },
        {
          "id": "https://building.nubank.com.br/?p=18048",
          "author": "Nubank Editorial",
          "description": "To reinforce Nubank's commitment to caring for the environment, the positive social impact on people's lives, and the best corporate governance practices, today we launched a manifesto video. Watch now.\nThe post Nu Impacto Manifesto: Nubank’s commitment to the adoption of ESG practices appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-impacto-manifesto/",
          "publishedOn": "2022-01-24T21:24:11.000Z",
          "wordCount": 3127,
          "title": "Nu Impacto Manifesto: Nubank’s commitment to the adoption of ESG practices"
        },
        {
          "id": "https://building.nubank.com.br/?p=18035",
          "author": "Nubank Editorial",
          "description": "The largest voluntary initiative of its kind in the world brings together companies willing to make a difference to change corporate sustainability indicators. Understand Nubank's participation.\nThe post Nubank joins the UN Global Compact appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-joins-the-un-global-compact/",
          "publishedOn": "2022-01-17T21:56:57.000Z",
          "wordCount": 3067,
          "title": "Nubank joins the UN Global Compact"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/vulnerability-disclosure/securing-digital-transformation-vulnerability-disclosure-qa-john-deere",
          "author": "HackerOne",
          "description": "To help fortify security defenses for their customers, dealers, suppliers, and employees, John Deere recently launched a public Vulnerability Disclosure Program (VDP) with HackerOne.\n\nHackerOne recently met with James Johnson, CISO at John Deere, to learn why his security team works with ethical hackers to help identify security gaps and increase their product and data security.",
          "link": "https://www.hackerone.com/vulnerability-disclosure/securing-digital-transformation-vulnerability-disclosure-qa-john-deere",
          "publishedOn": "2022-02-09T16:00:00.000Z",
          "wordCount": 1429,
          "title": "Securing Digital Transformation with Vulnerability Disclosure: A Q&A with John Deere CISO, James Johnson"
        },
        {
          "id": "https://hackerone.com/ceo/only-solution-scales-cybersecurity-challenge",
          "author": "Mårten Mickos",
          "description": "Cybersecurity is stretched thin. We all know it, so why state it again? \n\nBecause cybersecurity is thinner today than yesterday. Because many keep repeating the same measures that don’t work. And because there actually is a solution.\n\nFacts are undeniable:",
          "link": "https://www.hackerone.com/ceo/only-solution-scales-cybersecurity-challenge",
          "publishedOn": "2022-01-31T21:00:21.000Z",
          "wordCount": 1496,
          "title": "The Only Solution That Scales With the Cybersecurity Challenge"
        },
        {
          "id": "https://hackerone.com/customer-stories/nine-months-dib-vdp-pilot-nearly-1000-valid-vulnerabilities-have-been-identified",
          "author": "HackerOne",
          "description": "With three months left in the 12-month pilot with the Department of Defense’s Defense Industrial Base Vulnerability Disclosure Pilot (DOD DIB-VDP Pilot), HackerOne sat down with DC3 to discuss why new DIB companies are joining the pilot and hear why hackers are a critical partner for the DOD.",
          "link": "https://www.hackerone.com/customer-stories/nine-months-dib-vdp-pilot-nearly-1000-valid-vulnerabilities-have-been-identified",
          "publishedOn": "2022-01-28T15:00:00.000Z",
          "wordCount": 944,
          "title": "Nine months into the DIB-VDP Pilot, nearly 1,000 valid vulnerabilities have been identified"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/hackerone-global-top-10-hacker-expertise-industry-data-and-date",
          "author": "HackerOne",
          "description": "Many security teams use the OWASP Top 10 as a guideline to understand where they should focus their security strategies and cyberattack prevention efforts. The OWASP Top 10 originated in 2003 and has become a benchmark for compliance, education, and vendor tools.",
          "link": "https://www.hackerone.com/vulnerability-management/hackerone-global-top-10-hacker-expertise-industry-data-and-date",
          "publishedOn": "2022-01-14T21:55:11.000Z",
          "wordCount": 1414,
          "title": "The HackerOne Global Top 10—Hacker Expertise, Industry Data, and Up-to-Date Vulnerabilities"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/86525b3e21ca",
          "author": "Netflix Technology Blog",
          "description": "by Sam Setegne, Jai Balani, Olek Gorajek",
          "link": "https://netflixtechblog.com/data-pipeline-asset-management-with-dataflow-86525b3e21ca?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-02-09T17:33:22.000Z",
          "wordCount": 3155,
          "title": "Data pipeline asset management with Dataflow"
        },
        {
          "id": "https://medium.com/p/aceb26a83495",
          "author": "Netflix Technology Blog",
          "description": "By Karen Casella, Director of Engineering, Access & Identity Management",
          "link": "https://netflixtechblog.com/demystifying-interviewing-for-backend-engineers-netflix-aceb26a83495?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-02-01T14:24:18.000Z",
          "wordCount": 1781,
          "title": "Demystifying Interviewing for Backend Engineers @ Netflix"
        },
        {
          "id": "https://medium.com/p/394bc7d0f94c",
          "author": "Netflix Technology Blog",
          "description": "Martin Tingley with Wenjing Zheng, Simon Ejdemyr, Stephanie Lane, Colin McFarland, Mihir Tendulkar, and Travis Brooks",
          "link": "https://netflixtechblog.com/netflix-a-culture-of-learning-394bc7d0f94c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-25T16:23:45.000Z",
          "wordCount": 3281,
          "title": "Netflix: A Culture of Learning"
        },
        {
          "id": "https://medium.com/p/eab2602b86fe",
          "author": "Netflix Technology Blog",
          "description": "How the Netflix TVUI team implemented a robust strategy to quickly and easily detect performance anomalies before they a",
          "link": "https://netflixtechblog.com/fixing-performance-regressions-before-they-happen-eab2602b86fe?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-24T21:49:43.000Z",
          "wordCount": 2865,
          "title": "Fixing Performance Regressions Before they Happen"
        },
        {
          "id": "https://medium.com/p/5bcc52d853d1",
          "author": "Netflix Technology Blog",
          "description": "By Vikram Srivastava and Marcelo Mayworm",
          "link": "https://netflixtechblog.com/auto-diagnosis-and-remediation-in-netflix-data-platform-5bcc52d853d1?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-01-14T04:23:22.000Z",
          "wordCount": 1352,
          "title": "Auto-Diagnosis and Remediation in Netflix Data Platform"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-1",
          "author": "Market Radar",
          "description": "Crypto, stocks and ETFs with an interesting graphic setup",
          "link": "https://marketradar.substack.com/p/charts-to-watch-1",
          "publishedOn": "2022-02-09T16:06:23.000Z",
          "wordCount": null,
          "title": "Charts to watch #1",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5698298-5d4d-4523-9dd6-1901f57c9dbc_953x564.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/portfolio-performance-review-0204",
          "author": "Market Radar",
          "description": "Balanced and Pure Stock Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-performance-review-0204",
          "publishedOn": "2022-02-04T16:25:52.000Z",
          "wordCount": null,
          "title": "Portfolio Performance review: 02.04",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F65fba494-db47-4249-81cd-4450023f0e69_598x387.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/a-terrible-january-can-be-a-source",
          "author": "Market Radar",
          "description": "A bad start doesn't have to scare you!",
          "link": "https://marketradar.substack.com/p/a-terrible-january-can-be-a-source",
          "publishedOn": "2022-02-01T17:30:45.000Z",
          "wordCount": null,
          "title": "A terrible January can be a source of opportunities",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Faac67415-e0a7-4854-b06c-f9508e8cb5e5_826x570.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/the-pure-stocks-portfolio",
          "author": "Market Radar",
          "description": "A model portfolio with my favorite picks",
          "link": "https://marketradar.substack.com/p/the-pure-stocks-portfolio",
          "publishedOn": "2022-01-27T17:00:58.000Z",
          "wordCount": null,
          "title": "The Pure Stocks Portfolio",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa1dc2e72-b691-4b8a-8d3b-3959944c82ad_645x479.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/2022-false-start-for-us-equities",
          "author": "Market Radar",
          "description": "Lot of pain for U.S. stocks, but there are bright spots elsewhere",
          "link": "https://marketradar.substack.com/p/2022-false-start-for-us-equities",
          "publishedOn": "2022-01-21T16:15:52.000Z",
          "wordCount": null,
          "title": "2022: False start for U.S. equities",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F506491cb-7491-45f8-8b9d-f5c27d2e06f1_310x313.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/the-balanced-portfolio",
          "author": "Market Radar",
          "description": "A detailed presentation of an ETF Portfolio",
          "link": "https://marketradar.substack.com/p/the-balanced-portfolio",
          "publishedOn": "2022-01-18T16:35:51.000Z",
          "wordCount": null,
          "title": "The Balanced Portfolio",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4f8bf5f7-1bff-49ed-ac16-62a9a8da805f_528x400.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/introduction-of-two-sample-portfolios",
          "author": "Market Radar",
          "description": "Two portfolios to inspire your investments",
          "link": "https://marketradar.substack.com/p/introduction-of-two-sample-portfolios",
          "publishedOn": "2022-01-14T17:26:45.000Z",
          "wordCount": null,
          "title": "Introduction of two sample portfolios: Balanced and Pure Stocks",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2d500335-e407-48c5-a603-5a8b7cb28c75_2640x1815.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}