{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/04/the-package-analysis-project-scalable.html",
          "author": null,
          "description": "Posted by Caleb Brown, Open Source Security Team \n\n\nDespite open source software’s essential role in all software built today, it’s far too easy for bad actors to circulate malicious packages that attack the systems and users running that software. Unlike mobile app stores that can scan for and reject malicious contributions, package repositories have limited resources to review the thousands of daily updates and must maintain an open model where anyone can freely contribute. As a result, malicious packages like ua-parser-js, and node-ipc are regularly uploaded to popular repositories despite their best efforts, with sometimes devastating consequences for users. \nGoogle, a member of the Open Source Security Foundation (OpenSSF), is proud to support the OpenSSF’s Package Analysis project, w…",
          "link": "http://security.googleblog.com/2022/04/the-package-analysis-project-scalable.html",
          "publishedOn": "2022-04-28T16:05:00.008Z",
          "wordCount": 1291,
          "title": "The Package Analysis Project: Scalable detection of malicious open source packages"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-we-fought-bad-apps-and-developers.html",
          "author": null,
          "description": "Posted by Steve Kafka and Khawaja Shams, Android Security and Privacy Team \nProviding a safe experience to billions of users continues to be one of the highest priorities for Google Play. Last year we introduced multiple privacy focused features, enhanced our protections against bad apps and developers, and improved SDK data safety. In addition, Google Play Protect continues to scan billions of installed apps each day across billions of devices to keep people safe from malware and unwanted software.  \n  \nWe continue to enhance our machine learning systems and review processes, and in 2021 we blocked 1.2 million policy violating apps from being published on Google Play, preventing billions of harmful installations. We also continued in our efforts to combat malicious and spammy developers, …",
          "link": "http://security.googleblog.com/2022/04/how-we-fought-bad-apps-and-developers.html",
          "publishedOn": "2022-04-27T16:01:00.000Z",
          "wordCount": 1021,
          "title": "How we fought bad apps and developers in 2021"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-to-slsa-part-3-putting-it-all.html",
          "author": null,
          "description": "Posted by Tom Hennen, software engineer, BCID & GOSST \n\n\nIn our last two posts (1,2) we introduced a fictional example of Squirrel, Oppy, and Acme learning to SLSA and covered the basics and details of how they’d use SLSA for their organizations. Today we’ll close out the series by exploring how each organization pulls together the various solutions into a heterogeneous supply chain. \nAs a reminder, Acme is trying to produce a container image that contains three artifacts:\n\nThe Squirrel package ‘foo’\nThe Oppy package ‘baz’\nA custom executable, ‘bar’, written by Acme employees.\nThe process starts with ‘foo’ package authors triggering a build using GitHub Actions. This results in a new version of ‘foo’ (an artifact with hash ‘abc’) being pushed to the Squirrel repo along with its SLSA proven…",
          "link": "http://security.googleblog.com/2022/04/how-to-slsa-part-3-putting-it-all.html",
          "publishedOn": "2022-04-14T17:28:00.008Z",
          "wordCount": 1091,
          "title": "How to SLSA Part 3 - Putting it all together"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-to-slsa-part-2-details.html",
          "author": null,
          "description": "Posted by Tom  Hennen, software engineer, BCID & GOSST \n\nIn our last post we introduced a fictional example of Squirrel, Oppy, and Acme learning to use SLSA and covered the basics of what their implementations might look like. Today we’ll cover the details: where to store attestations and policies, what policies should check, and how to handle key distribution and trust.\n\nAttestation storage\nAttestations play a large role in SLSA and it’s essential that consumers of artifacts know where to find the attestations for those artifacts.\n\nCo-located in repo\n\nAttestations could be colocated in the repository that hosts the artifact. This is how Squirrel plans to store attestations for packages. They even want to add support to the Squirrel CLI (e.g. acorn get-attestations foo@1.2.3).\nAcme really …",
          "link": "http://security.googleblog.com/2022/04/how-to-slsa-part-2-details.html",
          "publishedOn": "2022-04-13T16:00:00.002Z",
          "wordCount": 4114,
          "title": "How to SLSA Part 2 - The Details"
        },
        {
          "id": "http://security.googleblog.com/2022/04/how-to-slsa-part-1-basics.html",
          "author": null,
          "description": "Posted by Tom Hennen, Software Engineer, BCID & GOSST \n\nOne of the great benefits of SLSA (Supply-chain Levels for Software Artifacts) is its flexibility. As an open source framework designed to improve the integrity of software packages and infrastructure, it is as applicable to small open source projects as to enterprise organizations. But with this flexibility can come a bewildering array of options for beginners—much like salsa dancing, someone just starting out might be left on the dance floor wondering how and where to jump in.\nThough it’s tempting to try to establish a single standard for how to use SLSA, it’s not possible: SLSA is not a line dance where everyone does the same moves, at the same time, to the same song. It’s a varied system with different styles, moves, and flourishe…",
          "link": "http://security.googleblog.com/2022/04/how-to-slsa-part-1-basics.html",
          "publishedOn": "2022-04-12T16:00:00.001Z",
          "wordCount": 1841,
          "title": "How to SLSA Part 1 - The Basics"
        },
        {
          "id": "http://security.googleblog.com/2022/04/improving-software-supply-chain.html",
          "author": null,
          "description": "Posted by Asra Ali and Laurent Simon, Google Open Source Security Team (GOSST)\n\nMany of the recent high-profile software attacks that have alarmed open-source users globally were consequences of supply chain integrity vulnerabilities: attackers gained control of a build server to use malicious source files, inject malicious artifacts into a compromised build platform, and bypass trusted builders to upload malicious artifacts. \nEach of these attacks could have been prevented if there were a way to detect that the delivered artifacts diverged from the expected origin of the software. But until now, generating verifiable information that described where, when, and how software artifacts were produced (information known as provenance) was difficult. This information allows users to trace artif…",
          "link": "http://security.googleblog.com/2022/04/improving-software-supply-chain.html",
          "publishedOn": "2022-04-07T13:00:00.002Z",
          "wordCount": 1602,
          "title": "Improving software supply chain security with tamper-proof builds"
        },
        {
          "id": "http://security.googleblog.com/2022/04/find-and-eek-increased-rewards-for.html",
          "author": null,
          "description": "Posted by Medha Jain, Program Manager, Devices & Services Security \n\n\nAt Google, we constantly invest in security research to raise the bar for our devices, keeping our users safe and building their trust in our products. In 2021, we published Google Nest security commitments, in which we committed to engage with the research community to examine our products and services and report vulnerabilities.\nWe are now looking to deepen this relationship and accelerate the path toward building more secure devices. Starting today, we will introduce a new vulnerability rewards structure for submissions impacting smart home (Google Nest) and wearables (Fitbit) devices through our Bug Hunters platform. \nBonus!\n\nWe are paying higher rewards retroactively for eligible Google Nest and Fitbit devices repor…",
          "link": "http://security.googleblog.com/2022/04/find-and-eek-increased-rewards-for.html",
          "publishedOn": "2022-04-05T13:00:00.006Z",
          "wordCount": 758,
          "title": "Find and $eek! Increased rewards for Google Nest & Fitbit devices"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/9OEm",
          "author": "Shekhar Gulati",
          "description": "In this post, I will talk about important factors you should consider when architecting systems that are powered by third-party systems. The factors I detail are:\ndeployment model\ntechnology coherence\nNFRs and SLAs\nInfrastructure and hardware needs\nAPI style and documentation\nIdempotent APIs\nGetting data out of the third party provider\nCommunity\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/02/16/factors-to-consider-when-architecting-systems-on-top-of-third-party-systems/",
          "publishedOn": "2022-04-29T21:39:00.000Z",
          "wordCount": null,
          "title": "Factors to consider when architecting systems that uses third-party systems",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQeG",
          "author": "Jerod Santo",
          "description": "Spacedrive helps you organize your files across many devices in one place. Here’s the motivation:\nMany of us have multiple cloud accounts, drives that aren’t backed up and data at risk of loss. We depend on cloud services like Google Photos and iCloud, but are locked in with limited capacity and almost zero interoperability between services and operating systems. Photo albums shouldn’t be stuck in a device ecosystem, or harvested for advertising data. They should be OS agnostic, permanent and personally owned. Data we create is our legacy, that will long outlive us—open source technology is the only way to ensure we retain absolute control over the data that defines our lives, at unlimited scale.\n\nDiscuss on Changelog News",
          "link": "https://github.com/spacedriveapp/spacedrive",
          "publishedOn": "2022-04-29T20:53:00.000Z",
          "wordCount": null,
          "title": "A cross-platform file explorer powered by a virtual distributed filesystem",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3W1",
          "author": "Jerod Santo",
          "description": "This is alpha software, but it seems pretty low risk to give it a try.\nWireit works with npm run, it doesn’t replace it. To configure an NPM script for Wireit, move the command into a new wireit section of your package.json, and replace the original script with the wireit command.\nNow when you run npm run build, Wireit upgrades the script to be smarter and more efficient.\nDiscuss on Changelog News",
          "link": "https://github.com/google/wireit",
          "publishedOn": "2022-04-29T18:23:00.000Z",
          "wordCount": null,
          "title": "Wireit upgrades your npm scripts to make them smarter and more efficient",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1639",
          "author": null,
          "description": "Nick rewrote our JS Danger game board app from Dojo to React for his talk at React Global Online Summit about componentizing application state with React and XState.\nOn this episode Jerod, KBall, and Feross chat with Nick about the entire process and what he learned along the way. Oh, we also play an epic round of Pro Tip Time!\nDiscuss on Changelog News\nChangelog++ members get a bonus 8 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nJerod Santo – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nFeross Aboukhadijeh – Twitter, GitHub, Website\nNotes and Links\nNick’s talk at React Global Online Summit\nOur Quiz Game repo on GitHub\nJS Party #191 on XState\nDon’t check in broken code\nConventional Comments\nEverything Everywhere All at Once\nElon Musk is buying Twitter. I’m buying JavaScript.\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/223",
          "publishedOn": "2022-04-29T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 223: Nick's big rewrite",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/223/js-party-223.mp3",
            "length": "49274899",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/q0Pe",
          "author": "Jerod Santo",
          "description": "This post by Chris de la Iglesia starts off very down on blockchains, but ends up not so down after all:\nWe are entering a new world with a new focus on giving users control over their data, their identity, and their systems. We are building distributed filesystems, distributed identity, and yes, blockchains. I think oftentimes we end up seeing only the blockchain technology due to the headlines and the financial investment, but distributed systems as a whole are taking off in a big, big way.\nDiscuss on Changelog News",
          "link": "https://cmdli.dev/blog/blockchain/",
          "publishedOn": "2022-04-29T13:59:00.000Z",
          "wordCount": null,
          "title": "Let's talk about blockchains",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1612",
          "author": null,
          "description": "Matan Peled from Technion University joins Natalie & Mat to discuss his PhD research on meta programming and static analyzers. How does Go’s measure up? What would Matan’s look like if he built one? All that and more!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity f…",
          "link": "https://changelog.com/gotime/227",
          "publishedOn": "2022-04-28T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 227: Analyzing static analysis",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/227/go-time-227.mp3",
            "length": "56470660",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Q5Yy",
          "author": "Jerod Santo",
          "description": "The second jq alternative we’ve discovered this week! (first here)\njq is hard to use. There are alternatives like fq and zq, but they still make you learn a new programming language. Im tired of learning new programming languages.\ngq is not optimized for speed, flexibility or beauty. gq is optimized for minimal learning/quick usage. gq understands that you don’t use it constantly, you use it once a month and then forget about it. So when you come back to it, gq will be easy to relearn. Just use the builtin library just like you would any other go project and you’re done. No unfamiliar syntax or operations, or surprising limits. Thats it.\nI don’t know if Go is a great fit for this use-case, but if you already know it well… makes sense.\nDiscuss on Changelog News",
          "link": "https://github.com/hherman1/gq",
          "publishedOn": "2022-04-28T14:03:00.000Z",
          "wordCount": null,
          "title": "jq but using Go instead",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zgyn",
          "author": "Jerod Santo",
          "description": "I used scare quotes around “whole life” because those are his words and surely there’s a lot more to life than things you can quantify, but still: this is interesting\nBack in 2019, I started collecting all kinds of metrics about my life. Every single day for the last 2.5 years I tracked over 100 different data types - ranging from fitness & nutrition to social life, computer usage and weather.\nThis data produces 44 graphs that are all shared publicly on the website.\n\nDiscuss on Changelog News",
          "link": "https://howisfelix.today/",
          "publishedOn": "2022-04-28T13:13:00.000Z",
          "wordCount": null,
          "title": "Felix Krause put his \"whole life\" into a single database",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1628",
          "author": null,
          "description": "This is our 5th Kaizen where we talk about the next improvement to changelog.com: we are now running on fly.io and our PostgreSQL is managed. This is a migration that many were curious about, including Simey de Klerk, the person that requested this episode.\nAfter migrating all our media files to AWS S3 (check episode 40), we thought that this part was going to be easy. Plan met reality. Pull request 407 has all the details.\nWe want to emphasise the type of partner relationships that we seek at Changelog & why they are important to us, as well as to our listeners. Honeycomb & Fly embody the principles that we care about, and Gerhard thinks that we are currently missing a Kubernetes partner.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ad…",
          "link": "https://changelog.com/shipit/50",
          "publishedOn": "2022-04-27T16:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 50: Kaizen! We are flying ✈️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/50/ship-it-50.mp3",
            "length": "65607074",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/YNYP",
          "author": "Jerod Santo",
          "description": "If you’ve found the (excellent) jq tool for working with JSON a bit unwieldy… check out zq and see if you like its API any better. I wouldn’t put too much weight on the faster aspect, though:\nWe will cover zq’s performance in a future article, but to cut to the chase here, zq is almost always at least a bit faster than jq when processing JSON inputs\nAlmost always at least a bit faster is not something you’re likely to notice in practice.\nDiscuss on Changelog News",
          "link": "https://www.brimdata.io/blog/introducing-zq/",
          "publishedOn": "2022-04-27T15:20:00.000Z",
          "wordCount": null,
          "title": "Introducing zq: an easier (and faster) alternative to jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/o9Y8",
          "author": "Jerod Santo",
          "description": "A solid rant by Terence Eden, who has to use macOS for work but would rather not:\nI know you’re going to be tempted to reply with “you’re using it wrong” - but I’m not. This is how I like to use my computer. And it is clear that the MacBook isn’t my computer - it is Apple’s. (OK, OK! It belongs to my employer!)\nSome of his grievances like window snapping and moving/removing UI elements can be alleviated with 3rd-party solutions, but he’s not wrong that the operating system doesn’t provide these features.\nDiscuss on Changelog News",
          "link": "https://shkspr.mobi/blog/2020/04/things-i-cant-do-on-macos-which-i-can-do-on-ubuntu/",
          "publishedOn": "2022-04-27T14:28:00.000Z",
          "wordCount": null,
          "title": "Things I can’t do on macOS which I can do on Ubuntu",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MdM6",
          "author": "Jerod Santo",
          "description": "Mihai Parparita:\nIt’s a golden age of emulation. Between increasing CPU power, WebAssembly, and retrocomputing being so popular The New York Times is covering it, it’s never been easier to relive your 80s / 90s / 2000s nostalgia. Projects like v86 make it easy to run your chosen old operating system in the browser. My heritage being of the classic Mac line, I was curious what the easiest to use emulation option was in the modern era…\nHere’s a video demo of what resulted: a full-featured classic 68K Mac in your browser.\nDiscuss on Changelog News",
          "link": "https://blog.persistent.info/2022/03/blog-post.html",
          "publishedOn": "2022-04-27T13:41:00.000Z",
          "wordCount": null,
          "title": "Infinite Mac: an instant-booting Quadra in your browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1627",
          "author": null,
          "description": "Today we’re talking with Zach Lloyd, founder of Warp — the terminal being re-imagined for the 21st century and beyond. Warp is a blazingly fast, rust-based terminal that’s being designed from the ground up to work like a modern app. We get into all the details — why now is the right time to re-invent the terminal, where they got started, the business they aim to build around Warp, what it’s going to take to gain adoption and grow, but more importantly — what’s Warp like today to get developers excited and give it a try.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry …",
          "link": "https://changelog.com/podcast/487",
          "publishedOn": "2022-04-26T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 487: Warp wants to be the terminal of the future",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/487/the-changelog-487.mp3",
            "length": "71844559",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1640",
          "author": null,
          "description": "We all hear a lot about MLOps these days, but where does MLOps end and DevOps begin? Our friend Luis from OctoML joins us in this episode to discuss treating AI/ML models as regular software components (once they are trained and ready for deployment). We get into topics including optimization on various kinds of hardware and deployment of models at the edge.\nDiscuss on Changelog News\nChangelog++ members get a bonus 0 minutes at the end of this episode and zero ads. Join today!\nSponsors\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nLuis Ceze – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nOctoML\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/176",
          "publishedOn": "2022-04-26T14:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 176: MLOps is NOT Real",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/176/practical-ai-176.mp3",
            "length": "44741317",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/RRYM",
          "author": "Jerod Santo",
          "description": "Eric Jang was recently on the job market (finally landing at [Halodi Robotics])(https://halodi.com/) and in this post he shares his process and view of the job market today. He also has some insights on where it’s headed. In brief:\nIn the future, every successful tech company will use their data moats to build some variant of an Artificial General Intelligence.\nDiscuss on Changelog News",
          "link": "https://evjang.com/2022/04/25/rome.html",
          "publishedOn": "2022-04-26T13:20:01.000Z",
          "wordCount": null,
          "title": "The machine learning job market in 2022",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3Yj6",
          "author": "Jerod Santo",
          "description": "And if you like Alpine, there’s a companion collection of snippets that you can copy/paste into your project.\nDiscuss on Changelog News",
          "link": "https://www.hyperui.dev/",
          "publishedOn": "2022-04-26T12:35:00.000Z",
          "wordCount": null,
          "title": "A collection of free Tailwind CSS components",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2YN",
          "author": "Jerod Santo",
          "description": "A nice little web-based tool to help you quickly/visually grok some JSON data you’re working with. I tested it on some game data from an old JS Danger episode, and it handled it pretty well.\n\nDiscuss on Changelog News",
          "link": "https://jsonvisio.com/",
          "publishedOn": "2022-04-25T15:14:00.000Z",
          "wordCount": null,
          "title": "Visualize your JSON with interactive graphs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13Ln",
          "author": "Jerod Santo",
          "description": "Still in beta, but Fleet has a lot of promise. It boasts compile times up to 5x faster than cargo. Here’s how:\nFleet works by optimizing your builds using existing tooling available in the Rust ecosystem, including seamlessly integrating sccache, lld, zld, ramdisks (for those using WSL or HDD’s) et al.\nDiscuss on Changelog News",
          "link": "https://github.com/dimensionhq/fleet",
          "publishedOn": "2022-04-25T14:26:00.000Z",
          "wordCount": null,
          "title": "A blazing fast build tool for Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1608",
          "author": null,
          "description": "Frank Krueger joined us to talk about solving hard problems. Earlier this year he wrote a blog post titled “Practical Guide to Solving Hard Problems,” and a lot of what he had to say really resonated with us. The premise is simple — if you have to write some code that you’re just not sure how to write…what do you do? What are the practical steps that you can take when you’re feeling stumped? Today’s show goes deep on that subject…practical ways to solve hard problems and ship your best work.\nFrank has his own podcast called Merge Conflict — check it out at mergeconflict.fm.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry.…",
          "link": "https://changelog.com/podcast/486",
          "publishedOn": "2022-04-22T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 486: Practical ways to solve hard problems",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/486/the-changelog-486.mp3",
            "length": "72806695",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1634",
          "author": null,
          "description": "Daniel Rosenwasser and Ryan Cavanaugh from the TypeScript team at Microsoft join Nick and Boneskull to catch us up on the latest happening with the TypeScript project, including what’s exciting in the new 4.7 beta release. Then, we dive deep into the new, TC-39 stage 1 Type Annotations proposal, what it is, and what it means for the future of a not really typed JavaScript!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFeaturing\nDaniel Rosenwasser – Twitter, GitHub\nRyan Cavanaugh – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\nTypeScript 4.7 beta announcement\nType Annotations proposal (Stage 1)\nType checking JavaScript files\nUnderstanding the TypeScript compiler\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/222",
          "publishedOn": "2022-04-22T16:10:00.000Z",
          "wordCount": null,
          "title": "JS Party 222: The Type Annotations proposal",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/222/js-party-222.mp3",
            "length": "64545467",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/wkzG",
          "author": "Jerod Santo",
          "description": "Let’s be honest: The current generation of robotic lawn mowers sucks. Basically all of these bots drive in a random direction until they hit the border of the lawn, rotate for a randomized duration and repeat. I think we can do better!\nTherefore, we have disassembled the cheapest off-the-shelf robotic mower we could find (YardForce Classic 500) and were surprised that the hardware itself is actually quite decent.\nThe bot itself is surprisingly high quality and doesn’t need to be changed at all. We just need some better software in there.\nHere’s an overview video that explains the entire idea.\nDiscuss on Changelog News",
          "link": "https://github.com/ClemensElflein/OpenMower",
          "publishedOn": "2022-04-22T14:52:00.000Z",
          "wordCount": null,
          "title": "OpenMower – a DIY smart mowing robot for everyone",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6OlQ",
          "author": "Jerod Santo",
          "description": "Nice to see some efforts around standardizing MLOps. Here’s their high-level selling points:\n📦 Docker containers without the pain\n🤬️ No more CUDA hell\n✅ Define the inputs and outputs for your model with standard Python\n🎁Automatic HTTP prediction server\n🥞 Automatic queue worker\n☁️ Cloud storage\n🚀 Ready for production\nDiscuss on Changelog News",
          "link": "https://github.com/replicate/cog",
          "publishedOn": "2022-04-22T14:06:00.000Z",
          "wordCount": null,
          "title": "Containers for machine learning",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1618",
          "author": null,
          "description": "Björn Rabenstein & Bartlomiej Płotka join Mat & Johnny to discuss observability, monitoring and instrumentation for gophers.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFlatfile – Data import is broken. We fixed it. Flatfile’s powerful out-of-the-box solution takes the data import burden off your shoulders, freeing you to solve bigger business problems and build products that people love.\n\n    \nFeaturing\nBjörn Rabenstein – GitHub\nBartlomiej Płotka – Twitter, GitHub, LinkedIn, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nPrometheus\nGo’s client library for Prometheus\nBjörn’s talk at Gophercon UK\nOpen Telemetry\nGrafana’s Big Tent\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/226",
          "publishedOn": "2022-04-21T19:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 226: Instrumentation for gophers",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/226/go-time-226.mp3",
            "length": "57972390",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNj7",
          "author": "Martin Heinz",
          "description": "With the recent events relating to Google Analytics platform, it’s becoming very clear that the time has come for many of us to migrate from Google Analytics to different platforms.\nIn this article we will go over both the “Why?”, so that you can make an informed decision whether you need to migrate of not, as well as the “How?” of migrating from Google Analytics - that is, quickly and easily taking your data and moving to different analytics platform without too much hassle.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/71",
          "publishedOn": "2022-04-21T14:39:00.000Z",
          "wordCount": null,
          "title": "Why and how you should leave Google Analytics",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03Ng",
          "author": "Jerod Santo",
          "description": "From the engineering team at Bloomberg:\nIt can track memory allocations in Python code, in native extension modules, and in the Python interpreter itself. It can generate several different types of reports to help you analyze the captured memory usage data. While commonly used as a CLI tool, it can also be used as a library to perform more fine-grained profiling tasks.\nIt has a lot of nice outputs so you can grok what’s going on.\n\nDiscuss on Changelog News",
          "link": "https://bloomberg.github.io/memray/",
          "publishedOn": "2022-04-21T13:51:00.000Z",
          "wordCount": null,
          "title": "Memray is a memory profiler for Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1591",
          "author": null,
          "description": "Alex Sims, a Senior Software Engineer at James & James, an eCommerce fulfilment company, reached out to us about the Kaizen story of the third-party logistics (3PL) platform that he has been involved with for several years now.\nThe system delivered 16 millions of orders in 10 years, and 4.5 million in the last year alone. All the numbers are going up, and there is only so much that a single PHP monolith deployed as VM images can handle. So how do you even start thinking about the architectural improvements, and inspire everyone involved to move towards better?\nWe encourage you to look at the architectural diagrams in the show notes, especially the 10 year roadmap, and ask Alex for a blog post follow-up. While today’s episode was a good conversation starter, there is a lot that we did not h…",
          "link": "https://changelog.com/shipit/49",
          "publishedOn": "2022-04-20T16:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 49: Improving an eCommerce fulfillment platform",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/49/ship-it-49.mp3",
            "length": "60460430",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W3Y1",
          "author": "Jerod Santo",
          "description": "Brave is rolling out a new feature called De-AMP, which allows Brave users to bypass Google-hosted AMP pages, and instead visit the content’s publisher directly. AMP harms users’ privacy, security and internet experience, and just as bad, AMP helps Google further monopolize and control the direction of the Web.\nThe Brave team is really doubling down on privacy and security. I don’t think that strategy would’ve won users a few years ago, but in 2022 and beyond…\nDiscuss on Changelog News",
          "link": "https://brave.com/privacy-updates/18-de-amp/",
          "publishedOn": "2022-04-20T14:51:00.000Z",
          "wordCount": null,
          "title": "Brave amps up privacy by cutting out AMP",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4EpE",
          "author": "Jerod Santo",
          "description": "Curious how OpenAI’s new DALL-E 2 manages to generate impressive artwork from short natural language prompts? This article breaks down the steps then focuses in on how it does the image generation step.\n\nDiscuss on Changelog News",
          "link": "https://www.assemblyai.com/blog/how-dall-e-2-actually-works/",
          "publishedOn": "2022-04-20T13:58:00.000Z",
          "wordCount": null,
          "title": "How DALL-E 2 actually works",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5Py",
          "author": "Jerod Santo",
          "description": "This guide by Josh Comeau is Josh doing what Josh does so well: taking complex/arcane/technical topics and making them approachable & fun for his audience.\nIt takes years of practice to become a terminal guru, but here’s the good news: we can take a shortcut. We don’t really need to know 98% of the stuff you can do with a terminal. If we focus on the most-important critical fundamentals, we should be able to become comfortable with the command line in a remarkably short amount of time. ✨\nThat’s what this blog post is all about.\nDiscuss on Changelog News",
          "link": "https://www.joshwcomeau.com/javascript/terminal-for-js-devs/",
          "publishedOn": "2022-04-19T20:25:00.000Z",
          "wordCount": null,
          "title": "The frontend developer's guide to the terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1638",
          "author": null,
          "description": "In the fourth “AI in Africa” spotlight episode, we welcome Leonida Mutuku and Godliver Owomugisha, two experts in applying advanced technology in agriculture. We had a great discussion about ending poverty, hunger, and inequality in Africa via AI innovation. The discussion touches on open data, relevant models, ethics, and more.\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 1 minutes at the end of this episode and zero ads. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nLeo Mutuku – Twitter, GitHub, LinkedIn, Website\nGodliver Owomugisha – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nJoyce Nabende – Twitter\nNotes and Links\nGodliver’s Google Scholar page\nGodliver’s academic homepage\nLocal Development Research Institute (LDRI)\nCropSpec\nOpen for Good Alliance\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/175",
          "publishedOn": "2022-04-19T19:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 175: 🌍 AI in Africa - Agriculture",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/175/practical-ai-175.mp3",
            "length": "49776049",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1631",
          "author": null,
          "description": "We’ve been using Parker Selbert’s Oban library for years and he even helped us hold it right by improving our open source implementation!\nSo, Jerod invited him Backstage to discuss the library, how we’re using it, Parker’s plan to make it financially sustainable, his “freedom number” of Oban Pro subscribers, and a bunch of other random stuff along the way. Let’s go!\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 0 minutes at the end of this episode and zero ads. Join today!\nFeaturing\nParker Selbert – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nGet Oban Web+Pro\nParker’s Oban PR on our repo\nWe discuss on Ship It! #20 (Kaizen!)\nPlausible Analytics is also open source\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/23",
          "publishedOn": "2022-04-19T14:30:00.000Z",
          "wordCount": null,
          "title": "Backstage 23: The Oban Pro",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/23/backstage-23.mp3",
            "length": "57394711",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Lp33",
          "author": "Jerod Santo",
          "description": "I thought Ali and Jen had some excellent advice in this segment of our JS Party episode on web dev for beginners, so I’m re-sharing it here in hopes that you might share it with people you know who may be stuck in the early phases of their web development path.\nI also like what I had to say (imagine that!)\nOne thing that is true about software development in general… is that it’s actually really hard. And we need to just say that. Because you’re gonna hit bumps. You’re gonna hit walls. And some people will power through those walls and other people won’t, and that’s just the way life is…\nBut I think having something real that you want to exist… having a real project that you want to see into the world helps you get through those moments.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=czO431qQY60",
          "publishedOn": "2022-04-19T13:39:00.000Z",
          "wordCount": null,
          "title": "Want to learn web development? build something real!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJzN",
          "author": "Jerod Santo",
          "description": "Supabase CTO Ant Wilson walks through the pros & cons of open sourcing your startup and why he believes the answer to the question in the headline is (probably) “yes”\nOpen-sourcing Supabase ended up surprising us in many ways. Many people imagine that maintaining your business in public might be burdensome - but the opposite is true. There are many unexpected upsides that have made building Supabase - the product and the company - easier.\nWhile some of this advice comes from our lens as a Dev Tools or PaaS company, most of it will apply to any software company.\nDiscuss on Changelog News",
          "link": "https://supabase.com/blog/2022/03/25/should-i-open-source-my-company",
          "publishedOn": "2022-04-18T17:15:00.000Z",
          "wordCount": null,
          "title": "Should I open source my company?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykaE",
          "author": "Jerod Santo",
          "description": "Sounds like Jacob Kaplan-Moss isn’t the only hiring manager who’s keen on the reverse code review:\nWhen hiring developers, there are many things we are looking for, but over the years I have found that raw coding ability is easily the most important quality to look for.   I can quickly train a person to have knowledge in some domain, but I’ve never seen raw coding ability come from anything other than personal commitment to extensive and deep practice.   Because of this, I have found that some methods work better than others to discover talent.\n… instead of writing code, consider instead having the candidate read existing code and talk about what it does and how it works. This offers some powerful advantages:\nThe advantages in brief:\nReading probes the most fundamental skills\nReading code is way more efficient than writing.\nReading puts candidates at ease compared to writing code.\nClick through for the details and how to put this in to practice.\nDiscuss on Changelog News",
          "link": "https://freakingrectangle.wordpress.com/2022/04/15/how-to-freaking-hire-great-developers/",
          "publishedOn": "2022-04-18T15:31:00.000Z",
          "wordCount": null,
          "title": "How to freaking find great developers by having them read code",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1619",
          "author": null,
          "description": "Rasmus Porsager created Postgres.js –the fastest full-featured PostgreSQL client for Node.js and Deno. Today he joins Jerod for a deep-dive on Postgres, why he created this open source library, and how you can use it to build pg-backed JavScript applications.\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code JSPARTY and get the team plan free for three months.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nRasmus Porsager – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\nJSNation\nReact Summit\npostgres.js on GitHub\npostgres-shift\nHashQL\nHashQL Todos Sample\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/221",
          "publishedOn": "2022-04-15T19:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 221: Postgres.js",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/221/js-party-221.mp3",
            "length": "48473246",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8ObE",
          "author": "Jerod Santo",
          "description": "Lexical is an extensible JavaScript web text-editor framework with an emphasis on reliability, accessibility and performance. Lexical aims to provide a best-in-class developer experience, so you can easily prototype and build features with confidence. Combined with a highly extensible architecture, Lexical allows developers to create unique text editing experiences that scale in size and functionality.\nIt has solid React integration because Facebook, but Lexical has no dependencies and can be used and extended independent of any library or framework.\nDiscuss on Changelog News",
          "link": "https://lexical.dev/",
          "publishedOn": "2022-04-15T14:15:00.000Z",
          "wordCount": null,
          "title": "Lexical – an extensible web text editor framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5ea",
          "author": "Jerod Santo",
          "description": "A tragic tale, but one worth sharing because we can all learn from their mistake:\nDue to an unfortunate sequence of events, I accidentally made the project’s repository private for a moment. And GitHub cascade-deleted our community that took 10 years to build.\nWhoops! This reminds me of the time I thought it’d be cute to set JSPartyFM’s Twitter birth date to the day our first episode shipped, which immediately resulted in the account being suspended for being too young.\nSounds like GitHub isn’t up for restoring their stars, so if you were following HTTPie before, you’ll want to head over there and give ’em a re-star.\nDiscuss on Changelog News",
          "link": "https://httpie.io/blog/stardust",
          "publishedOn": "2022-04-15T13:27:01.000Z",
          "wordCount": null,
          "title": "How HTTPie lost 54k GitHub stars",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1622",
          "author": null,
          "description": "We often have code that’s similar between projects and we find ourselves copying that code around. In this episode we discuss what to do with this common code, how to organize it, and what code qualifies as this common code.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “Go Time” to receive an extra 5,000 video minutes.\n\n    \nFeaturing\nIan Lopshire – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nThoughts on how to structure Go code\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/225",
          "publishedOn": "2022-04-14T18:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 225: Go code organization best practices",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/225/go-time-225.mp3",
            "length": "58777387",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2512",
          "author": "Kelsey Hightower",
          "description": "What you’re about to read is a fancified excerpt from Ship It! #44. You should read the original transcript or listen to the entire conversation for more context. To set the stage, this is Kelsey’s response to Gerhard asking what the biggest takeaway should be from their conversation.\nThe reason we find ourselves as practitioners (as an industry as a whole) constantly migrating between different platforms, journeys, and digital transformations…\nWe do this because I don’t think we ever understood the fundamentals.\nThe fundamentals are very clear. If you’re thinking about application delivery, for example, we know what the fundamentals are.\nIdeally, we’re versioning the source code we write, and using tools that enable us to build and package applications in a reproducible way. 15 years ago …",
          "link": "https://changelog.com/posts/automation-is-the-serialization-of-understanding",
          "publishedOn": "2022-04-14T17:05:22.000Z",
          "wordCount": null,
          "title": "Automation is the serialization of understanding",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P5AE",
          "author": "Jerod Santo",
          "description": "Gergely Orosz did an excellent job detailing the ins & outs of Atlassian’s epic outage:\nHundreds of companies have no access to JIRA, Confluence and OpsGenie. What can engineering teams learn from the poor handling of this outage?\nThe TL;DR on the cause of the outage is a script that was supposed to “mark for deletion” some records also had “permanently delete” functionality and was run against a wrong list of IDs, improperly deleting 400 of their customers. Oh, and their backup restore process is really good at doing all customers, but not a subset. Ruh roh!\nLots to learn here, and Gergely puts a fine point on the biggest takeaways. A must-read!\nDiscuss on Changelog News",
          "link": "https://newsletter.pragmaticengineer.com/p/scoop-atlassian",
          "publishedOn": "2022-04-14T15:12:00.000Z",
          "wordCount": null,
          "title": "Inside the longest Atlassian outage of all time",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Aade",
          "author": "Jerod Santo",
          "description": "Adam Chalmers:\nOver the last few weeks I built my own DNS client. Mostly because I thought dig was kinda clunky. Partly because I wanted to learn more about DNS. So here’s how I built it, and how you can build your own too. It’s a great weekend project, and I learned a lot from finishing it.\nDNS is simple enough that you can grok it quickly, but still complex enough that Adam learned a ton along the way: reading RFCs, network sockets, Bitvec, and more.\nDiscuss on Changelog News",
          "link": "https://blog.adamchalmers.com/making-a-dns-client/",
          "publishedOn": "2022-04-14T14:26:00.000Z",
          "wordCount": null,
          "title": "What I learned from making a DNS client in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1633",
          "author": null,
          "description": "JS Party is a weekly celebration of JavaScript and the web so fun is at the heart of every episode.\nWe play games like Frontend Feud… (clip from episode #192)\nDiscuss and analyze the news… (clip from episode #213)\nExplain technical concepts to each other like we’re 5… (clip from episode #195)\nDebate hot topics like should websites work without JS? (clip from episode #87)\nInteriew amazing devs like Rich Harris and Una Kravets… (clip from episode #167)\nThis is JS Party! Listen and subscribe today.\nWe’d love to have you with us. 💚\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nAmelia Wattenberger – Twitter, GitHub, Website\nNick Nisi – Twitter, GitHub, Website\nDivya – Twitter, GitHub, LinkedIn, Website\nAmal Hussein – Twitter, GitHub\nMikeal Rogers – Twitter, GitHub\nFeross Aboukhadijeh – Twitter, GitHub, Website\nChristopher Hiller – Twitter, GitHub, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/trailer-2",
          "publishedOn": "2022-04-13T18:36:32.000Z",
          "wordCount": null,
          "title": "JS Party This is JS Party!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/trailer-2/js-party-trailer-2.mp3",
            "length": "2546435",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/3YVD",
          "author": "Jerod Santo",
          "description": "Florin Lipan managed to squeeze a fully-functional static web server into a Docker image that has a 186KB footprint! Here I was thinking FROM alpine was a skinny starting point…\nDiscuss on Changelog News",
          "link": "https://lipanski.com/posts/smallest-docker-image-static-website",
          "publishedOn": "2022-04-13T16:03:01.000Z",
          "wordCount": null,
          "title": "The smallest Docker image to serve static websites",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1597",
          "author": null,
          "description": "In this episode we talk about launching Dagger with all four founders: Andrea, Eric, Sam & Solomon.\nWhile you may remember Sam & Solomon from episode 23, this time we assembled all four superheroes in this story and went deeper, covering nearly three years of refinements, the launch, as well as the world-class team & community that is coming together to solve the next problem of shipping software. Container images and Kubernetes are great steps in the right direction, but now it’s time for the next leap into the future.\nYou can use Dagger to run your CI/CD pipelines locally, without needing to commit and push. You can also use Dagger as a Makefile alternative, which resonates with Gerhard, but go further and your perspective on documentation & automation may start shifting.\nGerhard believe…",
          "link": "https://changelog.com/shipit/48",
          "publishedOn": "2022-04-13T15:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 48: Launching Dagger",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/48/ship-it-48.mp3",
            "length": "64744151",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/29yM",
          "author": "Jerod Santo",
          "description": "On our episode with Brian Kernighan, I asked him if there were ever a situation in which he would advise you start a new program in C today. His response:\nI think probably unless you are in one of these resource-constrained environments, clearly, right upfront, that you’re going to be resource-constrained and the improvement of hardware isn’t gonna rescue you in the next couple of years, I would not start with C. I really wouldn’t. And then it depends what is your application.\nAs if on queue, StackOverflow blogger Marcin Pasinski has done a comparison between C and Go in the quintessential resource-constrained environment. Oddly enough, no mention of TinyGo in the piece, but otherwise a solid analysis.\nDiscuss on Changelog News",
          "link": "https://stackoverflow.blog/2022/04/04/comparing-go-vs-c-in-embedded-applications/",
          "publishedOn": "2022-04-13T14:06:00.000Z",
          "wordCount": null,
          "title": "Comparing Go vs C in embedded applications",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1587",
          "author": null,
          "description": "This week we’re joined by Deepthi Sigireddi, Vitess Maintainer and engineer at PlanetScale — of course we’re talking about all things Vitess. We talk about its origin inside YouTube, how Vitess handles sharding, Deepthi’s journey to Vitess maintainer, when you should begin using it, and how it fits into cloud native infra.\nDiscuss on Changelog News\nChangelog++ members will hear a bonus 11 minutes at the end of this episode and zero ads. Join today!\nSponsors\nInfluxData – The time series platform for building and operating time series applications — InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped data produced by sensors, applications, and infrastructure. Learn more at influxdata…",
          "link": "https://changelog.com/podcast/485",
          "publishedOn": "2022-04-12T19:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 485: The story of Vitess",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/485/the-changelog-485.mp3",
            "length": "87703996",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/makl",
          "author": "Jerod Santo",
          "description": "Hidde de Vries:\nWebAIM have come out with their latest report on which accessibility issues they found in the top million websites that they tested automatically. What is some low hanging fruit you could fix today?\nDiscuss on Changelog News",
          "link": "https://hiddedevries.nl/en/blog/2022-04-12-common-accessibility-issues-that-you-can-fix-today",
          "publishedOn": "2022-04-12T15:30:00.000Z",
          "wordCount": null,
          "title": "Common accessibility issues that you can fix today",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/wkAk",
          "author": "Jerod Santo",
          "description": "Nils Norman Haukås:\nI have been a big fan of the write libraries, not frameworks argument for a while now. Lately, I’ve come to ponder that there might be a fruitful expansion to this argument, that we should start to value principles over patterns, patterns over libraries, and libraries over frameworks.\nI don’t disagree!\nThe challenge with principles & patterns is they are more difficult to formalize (and communicate) than libraries & frameworks because they’re by nature less specific and more meta (lowercase “m” ftw).\nIn other words, libraries & frameworks are an end product. Principles & patterns are means to an end. It’s easier to ship a product than to ship the means to it.\nThe latter is the realm of documentation, education, and conversation.\nDiscuss on Changelog News",
          "link": "https://nilsnh.no/2022/04/09/innovating-beyond-libraries-and-frameworks/",
          "publishedOn": "2022-04-12T14:32:00.000Z",
          "wordCount": null,
          "title": "Innovating beyond libraries and frameworks",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lbg2",
          "author": "Jerod Santo",
          "description": "Dan Luu:\nWave is a $1.7B company with 70 engineers whose product is a CRUD app that adds and subtracts numbers. In keeping with this, our architecture is a standard CRUD app architecture, a Python monolith on top of Postgres. Starting with a simple architecture and solving problems in simple ways where possible has allowed us to scale to this size while engineers mostly focus on work that delivers value to users.\nDespite the unreasonable effectiveness of simple architectures, most press goes to complex architectures. For example, at a recent generalist tech conference, there were six talks on how to build or deal with side effects of complex, microservice-based, architectures and zero how one might build out a simple monolith… Larger conferences are similar; a recent enterprise-oriented conference in SF had a double digit number of talks on dealing with the complexity of a sophisticated architecture and zero on how to build a simple monolith.\nHe goes on to describe boring choices they’ve made and  counter-balances that some by also describing why they’ve made some more complex choices such as GraphQL and Kubernetes. An excellent, nuanced piece.\nDiscuss on Changelog News",
          "link": "https://danluu.com/simple-architectures/",
          "publishedOn": "2022-04-11T19:15:00.000Z",
          "wordCount": null,
          "title": "In defense of simple architectures",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3mN",
          "author": "ehmicky",
          "description": "For all your object wrangling needs:\n⛏️ Dot-delimited paths: foo.bar.0.baz\n⭐ Wildcards: foo.*, **.bar\n🗺️ Regexps: foo./ba?/\n🏜️ Slices: foo.0:2\n🚂 Unions: foo bar baz\nDiscuss on Changelog News",
          "link": "https://github.com/ehmicky/wild-wild-path",
          "publishedOn": "2022-04-11T16:21:00.000Z",
          "wordCount": null,
          "title": "Wild Wild Path – access object property paths using wildcards and regexps",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pkVP",
          "author": "Jerod Santo",
          "description": "Mike Lapidakis thinks Apple’s Hide My Email feature that debuted in iOS 15 is “one of the most under-rated privacy launches of the past year.”\nI’m a huge fan of the service and think the practice of a unique email per site is nearly as essential as using a unique password. When it’s this easy, you have no excuse.\nDiscuss on Changelog News",
          "link": "https://empty.coffee/an-ode-to-apples-hide-my-email/",
          "publishedOn": "2022-04-11T15:08:00.000Z",
          "wordCount": null,
          "title": "An ode to Apple's Hide My Email",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/j592",
          "author": "Jerod Santo",
          "description": "Dominick Schroer:\nWhen was the last time you completed a project? When was the last time you started a project? Have you every felt that you were trapped working on something that you don’t enjoy anymore? Size is something that I’m sure most developers with the drive to do side projects have felt. Recently I have been completing more projects with more success than ever before. This is my new process.\nHis 4-step process is so simple it might be brilliant.\nDiscuss on Changelog News",
          "link": "https://schroer.ca/2022/04/10/the-joy-of-small-projects/",
          "publishedOn": "2022-04-11T14:13:00.000Z",
          "wordCount": null,
          "title": "The joy of small projects",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/q0Zd",
          "author": "Jerod Santo",
          "description": "Though the application overall is stable and usable, it should not be considered safe for critically important work. There are numerous bugs and half working implementations. Pull requests are greatly appreciated.\nIf this kind of thing is your bag, I’ve also heard Geany is worth a look.\n\nDiscuss on Changelog News",
          "link": "https://github.com/dail8859/NotepadNext",
          "publishedOn": "2022-04-09T14:15:00.000Z",
          "wordCount": null,
          "title": "A cross-platform reimplementation of Notepad++",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JLVr",
          "author": "Jerod Santo",
          "description": "Louis Lazaris describes/demos somewhat obscure HTML attributes you may find useful enough to personally use in one of your projects. I learned a few things, maybe you will too.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/03/html-attributes-you-never-use/",
          "publishedOn": "2022-04-08T20:47:00.000Z",
          "wordCount": null,
          "title": "Those HTML attributes you never use",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1590",
          "author": null,
          "description": "This episode was requested by Tyler Smith who feels that he may not need Kubernetes just yet. Tyler has a few questions about Docker & Docker Swarm, so Andrea Luzzardi, former Docker Swarm Lead, joins us today to answer them.\nWe talk about Docker Swarm beginnings, some of the challenges that it faced, and what Andrea’s recommendation is for Tyler’s journey with Docker Swarm.\nAfter dedicating four years of his professional career to Docker Swarm, Andrea is the best person that Gerhard knows to talk about this subject. And guess what, the same thing happened now as it did at KubeCon 2015: Sam pointed to Andrea. It will all make sense in the first five minutes. This one is going to be fun!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads d…",
          "link": "https://changelog.com/shipit/47",
          "publishedOn": "2022-04-08T20:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 47: The Docker Swarm story",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/47/ship-it-47.mp3",
            "length": "44359193",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zg0P",
          "author": "Jerod Santo",
          "description": "There’s a lot going on in that picture. Let’s take a closer look at exactly what computers and gear they were using to do the 3D animation for this game.\nWhy? Because, Final Fantasy 7 is a true classic. When the game was first released in early 1997, for the Sony PlayStation, it took the RPG gaming world by storm. To this day, many consider it the greatest entry in the franchise.\nI remember getting this game for Christmas and playing it nearly non-stop until school started again after the new year. Greatest entry in the franchise? Easily!\n\nDiscuss on Changelog News",
          "link": "https://lunduke.substack.com/p/the-computers-used-to-do-3d-animation?s=r",
          "publishedOn": "2022-04-08T19:16:00.000Z",
          "wordCount": null,
          "title": "The computers used to do 3D animation for Final Fantasy VII",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1616",
          "author": null,
          "description": "KBall and Jerod digest and disect recent JS community news (React 18, Redwood 1.0, MDN Plus) then sit down for yet another game of HeadLIES! Can KBall fare better than Nick Nisi did last April Fools?!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square selle…",
          "link": "https://changelog.com/jsparty/220",
          "publishedOn": "2022-04-08T18:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 220: Headlines and HeadLIES!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/220/js-party-220.mp3",
            "length": "53426075",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1614",
          "author": null,
          "description": "Has Go caught your interest, but you just haven’t had the time/opportunity to really dig into it? Are you relatively productive in your current language/ecosystem but wonder if the grass truly is greener on Go’s side of the fence? If so, this episode’s for you!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “Go Time” to receive an extra 5,000 video minutes.\n\n    \nFeaturing\nIan Lopshire – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nNotes and Links\nCharm on The Changelog\nGo Proverbs\nGo Code Review Comments\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/224",
          "publishedOn": "2022-04-07T19:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 224: Answering questions for the Go-curious",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/224/go-time-224.mp3",
            "length": "59242161",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/YNwW",
          "author": "Jerod Santo",
          "description": "Solid piece on literate programming by Richard Gall for The New Stack. My foremost exposure to the practice came from Jeremy Ashkenas’ CoffeeScript and Backbone.js docs. I always found it cool and useful to read, but couldn’t imagine myself writing code/docs that way. Which brings us to this bit at the end of the article:\n“One of the things we learned is that it’s very expensive,” he said. “And so you spend time trying to figure out what sort of situations justify the expense. And one of them is where people are building relatively small, sophisticated kernels that are going to be shared widely.”\nSeems like Jeremy’s use case drilled it. If you’re mostly writing application code, literate programming probably isn’t worth the headache, but for library/framework authors…\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/why-literate-programming-might-help-you-write-better-code/",
          "publishedOn": "2022-04-07T14:43:00.000Z",
          "wordCount": null,
          "title": "Literate programming might help you write better code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/o9yN",
          "author": "Jerod Santo",
          "description": "After recording Ship It! #46, Nabeel Sulieman and Gerhard stuck around to pair on getting KCert (a simpler alternative to cert-manager) set up on our LKE infra. It works!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=OcBAh9S_NRA",
          "publishedOn": "2022-04-07T13:35:00.000Z",
          "wordCount": null,
          "title": "Let's install KCert on Linode Kubernetes Engine!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlqN",
          "author": "Jerod Santo",
          "description": "I’ve been using asdf on my new machine to manage Elixir/Erlang and Node versions and it works like a charm. Highly recommend! There are some complaints in the comments of this post about it being slow, but I haven’t had that problem yet.\nDiscuss on Changelog News",
          "link": "https://jinyuz.dev/posts/tips-and-tricks/Switching-from-pyenv,-rbenv,-goenv-and-nvm-to-asdf",
          "publishedOn": "2022-04-06T16:04:00.000Z",
          "wordCount": null,
          "title": "Switching to asdf (from pyenv, rbenv, goenv, and nvm)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aO2m",
          "author": "Jerod Santo",
          "description": "DuckDuckGo and Bing are not true alternatives – they’re just worse versions of Google.\nThe next Google can’t just be an input box that spits out links. We need new thinking to create something much better than what came before.\nIn the last few years, different groups of people came to the same conclusion, and started working on the next generation of search engines.\nFor this new generation, privacy is necessary, and invasive ads are not an option. But that’s where the commonalities end. Beyond that, they’ve all taken the idea of a search engine in very different directions.\nThe post goes on to describe & detail a whole new wave of search engines. I had no idea so many people were working on this problem. Exciting!\nDiscuss on Changelog News",
          "link": "https://dkb.io/post/the-next-google",
          "publishedOn": "2022-04-06T13:52:00.000Z",
          "wordCount": null,
          "title": "The next Google",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4EPj",
          "author": "Jerod Santo",
          "description": "Ever wanted to identify what font was being used o a website, PDF, mobile app, or image file? Here’s the resource you need to get you there in as few steps as possible.\nDiscuss on Changelog News",
          "link": "https://learnui.design/blog/identifying-fonts.html",
          "publishedOn": "2022-04-05T17:29:00.000Z",
          "wordCount": null,
          "title": "The complete guide to identifying fonts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRjm",
          "author": "Jerod Santo",
          "description": "You might not need this curated checklist of 300+ tips for protecting digital security and privacy (you probably do), but I bet there’s someone in your life who does (you probably do, too).\nDiscuss on Changelog News",
          "link": "https://security-list.js.org/",
          "publishedOn": "2022-04-05T16:35:00.000Z",
          "wordCount": null,
          "title": "The ultimate personal security checklist 🔐",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1623",
          "author": null,
          "description": "Abubakar Abid joins Daniel and Chris for a tour of Gradio and tells them about the project joining Hugging Face. What’s Gradio? The fastest way to demo your machine learning model with a friendly web interface, allowing non-technical users to access, use, and give feedback on models.\nDiscuss on Changelog News\nChangelog++ members save 0 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nAbubakar Abid – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nGradio | We are joining Hugging Face!\nGradio | Github\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/174",
          "publishedOn": "2022-04-05T15:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 174: Quick, beautiful web UIs for ML apps",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/174/practical-ai-174.mp3",
            "length": "41031514",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/73N0",
          "author": "Jerod Santo",
          "description": "Asahi Linux is a project and community with the goal of porting Linux to Apple Silicon Macs, starting with the 2020 M1 Mac Mini, MacBook Air, and MacBook Pro.\nOur goal is not just to make Linux run on these machines but to polish it to the point where it can be used as a daily OS. Doing this requires a tremendous amount of work, as Apple Silicon is an entirely undocumented platform. In particular, we will be reverse engineering the Apple GPU architecture and developing an open-source driver for it.\nAsahi Linux is developed by a thriving community of free and open source software developers.\nYes, please!\nDiscuss on Changelog News",
          "link": "https://asahilinux.org/",
          "publishedOn": "2022-04-05T14:47:00.000Z",
          "wordCount": null,
          "title": "Linux on Apple Silicon",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Dz95",
          "author": "Jerod Santo",
          "description": "Install via gh extension install dlvhdr/gh-dash. Customize ~/.config/gh-dash/config.yml.\n\nDiscuss on Changelog News",
          "link": "https://github.com/dlvhdr/gh-dash",
          "publishedOn": "2022-04-04T16:54:00.000Z",
          "wordCount": null,
          "title": "A GitHub CLI extension to display a dashboard of PRs and issues",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k28W",
          "author": "Jerod Santo",
          "description": "For now, [x]it! is merely a file format specification.\nYou don’t have to use a specific tool for .xit files, the basic operations like creating items or checking them off can be done in every text editor. Tools can make the experience more convenient, though, and provide support for common use cases.\nThe cool thing is anybody/everybody can now develop integrations for their favorite tools.\nDiscuss on Changelog News",
          "link": "https://xit.jotaen.net/",
          "publishedOn": "2022-04-04T15:48:00.000Z",
          "wordCount": null,
          "title": "A plaintext file format for todos and check lists",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gdNa",
          "author": "Jerod Santo",
          "description": "The Squeaky team goes from dev straight to prod (same here), but many people advocate for (and use) staging or other “pre-live” environments instead.\nWhile there are obvious benefits to deploying to different environments, at Squeaky we’ve decided to take a different approach. We only have two environments: our laptops, and production. Once we merge into the main branch, it will be immediately deployed to production.\nPerhaps that sounds unusual, but so far it’s outweighed the benefits of pre-live environments, and we believe it’s helping us to ship faster, and lower the number of issues on production. So, I thought I’d write this post to share why we think it works, and why you should consider it too.\nDiscuss on Changelog News",
          "link": "https://squeaky.ai/blog/development/why-we-dont-use-a-staging-environment",
          "publishedOn": "2022-04-04T14:58:00.000Z",
          "wordCount": null,
          "title": "Why we don't use a staging environment",
          "itunes": {}
        },
        {
          "id": "changelog.com/12/1606",
          "author": null,
          "description": "For the first time ever, we’re producing somebody else’s podcast! Our friends at Grafana asked us to help them launch a show for the observability community. It’s called Big Tent and on this episode we are backstage with Tom Wilkie, Mat Ryer, & Matt Toback talking through what they’re up to and why we’re helping out.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nTom Wilkie – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nMatt Toback – Twitter, GitHub, LinkedIn\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nGrafana’s Big Tent\nTom Wilkie on Go Time #126\nRaj Dutt on Founders Talk #73\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/22",
          "publishedOn": "2022-04-04T14:00:00.000Z",
          "wordCount": null,
          "title": "Backstage 22: Helping Grafana set up their Big Tent",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/22/backstage-22.mp3",
            "length": "53131970",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1576",
          "author": null,
          "description": "Feross has been working on something big. He joins Chris and Nick, along with guests Bret Comnes and Mik Lysenko to discuss Socket, what it is, and its focus on the security of the JavaScript supply chain.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n…",
          "link": "https://changelog.com/jsparty/219",
          "publishedOn": "2022-04-01T18:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 219: Making moves on supply chain security",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/219/js-party-219.mp3",
            "length": "61687052",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/6OgL",
          "author": "Jerod Santo",
          "description": "Hot off the press from our friend Ben Johnson:\nPostlite is a network proxy to allow access to remote SQLite databases over the Postgres wire protocol. This allows GUI tools to be used on remote SQLite databases which can make administration easier.\nThe proxy works by translating Postgres frontend wire messages into SQLite transactions and converting results back into Postgres response wire messages. Many Postgres clients also inspect the pg_catalog to determine system information so Postlite mirrors this catalog by using an attached in-memory database with virtual tables. The proxy also performs minor rewriting on these system queries to convert them to usable SQLite syntax.\nIt appears that Ben is taking code contributions this time around, but only for bug & documentation fixes.\nDiscuss on Changelog News",
          "link": "https://github.com/benbjohnson/postlite",
          "publishedOn": "2022-04-01T16:40:00.000Z",
          "wordCount": null,
          "title": "A Postgres wire compatible SQLite proxy",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/53XO",
          "author": "Jerod Santo",
          "description": "Automerge is a Conflict-Free Replicated Data Type (CRDT), which allows concurrent changes on different devices to be merged automatically without requiring any central server.\nI could see this library being super useful in many applications.\nDiscuss on Changelog News",
          "link": "https://automerge.org/",
          "publishedOn": "2022-04-01T14:34:00.000Z",
          "wordCount": null,
          "title": "A library of data structures for building collaborative applications in JS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lbN2",
          "author": "Jerod Santo",
          "description": "A fun post from the Grafana blog for your Friday enjoyment:\nIt started as all good projects do … with Rick Astley.\nAfter seeing the project about how to Rickroll your friends with Grafana — in which a seemingly innocent hyperlink surprises users with the music video for Astley’s classic “Never Gonna Give You Up” rendered with Prometheus and Grafana — a question arose: Can Grafana run Doom?\nThankfully, this post breaks Betteridge’s law of headlines. The answer to the question is a resounding yes!\nDiscuss on Changelog News",
          "link": "https://grafana.com/blog/2022/03/31/can-grafana-run-doom/",
          "publishedOn": "2022-04-01T13:48:01.000Z",
          "wordCount": null,
          "title": "Can Grafana run Doom?",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/investing-in-eastern-europes-ai-future/",
          "author": null,
          "description": "It was an honor and a privilege to attend a special event in the Bulgarian capital, Sofia, today to launch INSAIT, the Institute for Computer Science, Artificial Intelligence and Technology. INSAIT is a new AI and computer science research institute that will provide truly world-class facilities.\n\n\nIt’s fantastic to see the country where I was born leading the charge in bridging Eastern Europe to the world-stage in computer science research.\n\n\nThe institute is modeled on the computer science departments of renowned institutions such as MIT, UC Berkeley and the Max-Planck Institute, and is backed by the Bulgarian government with an endowment fund of nearly $100 million. Its computer science and AI research will span topics such as machine learning, quantum computing, information security, r…",
          "link": "https://blog.google/technology/ai/investing-in-eastern-europes-ai-future/",
          "publishedOn": "2022-04-11T10:30:00.000Z",
          "wordCount": 1025,
          "title": "Investing in Eastern Europe’s AI future"
        },
        {
          "id": "https://blog.google/products/maps/how-ai-and-imagery-build-self-updating-map/",
          "author": null,
          "description": "Building a map is complex, and keeping it up-to-date is even more challenging. Think about how often your city, town or neighborhood changes on a day-to-day basis. Businesses and shops open and close, stretches of highway are added, and roadways change. In today’s Maps 101 installment, we’ll dive into two ways Google Maps uses advancements in AI and imagery to help you see the latest information about the world around you every single day.\nAutomatically updating business hours\nOver the past few years, businesses have experienced a lot of change — including constantly updating operating hours based on changing pandemic-related restrictions. To keep up with this pace of change, we developed a machine learning model that automatically identifies if business hours are likely wrong, then instan…",
          "link": "https://blog.google/products/maps/how-ai-and-imagery-build-self-updating-map/",
          "publishedOn": "2022-04-07T17:00:00.000Z",
          "wordCount": 1411,
          "title": "How AI and imagery build a self-updating map"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=18936",
          "author": "Daniel Stenberg",
          "description": "– Everything I know and learned about running and maintaining Open Source projects for three decades. For several years now, I have had a blog post series in mind to describe something about what people could expect to happen in Open Source projects. I had a few already half-started blog post drafts for some sub … Continue reading Uncurled →",
          "link": "https://daniel.haxx.se/blog/2022/04/30/uncurled/",
          "publishedOn": "2022-04-30T10:18:05.000Z",
          "wordCount": 1124,
          "title": "Uncurled"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18986",
          "author": "Daniel Stenberg",
          "description": "Welcome to the third curl release of the year. Release presentation Numbers the 207th release6 changes53 days (total: 8,804)125 bug-fixes (total: 7,816)185 commits (total: 28,507)2 new public libcurl function (total: 88)0 new curl_easy_setopt() option (total: 295)2 new curl command line option (total: 247)60 contributors, 29 new (total: 2,626)35 authors, 13 new (total: 1,027)4 security fixes … Continue reading curl 7.83.0 headers bonanza →",
          "link": "https://daniel.haxx.se/blog/2022/04/27/curl-7-83-0-headers-bonanza/",
          "publishedOn": "2022-04-27T06:28:39.000Z",
          "wordCount": 1157,
          "title": "curl 7.83.0 headers bonanza"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18954",
          "author": "Daniel Stenberg",
          "description": "On June 6 2022, we will gather a bunch of curl aficionados in the Firehouse at the Fort Mason Centre in San Francisco, USA. All details can be found here. We will add more info and details as we get closer to the event. curl up is the annual curl developers and users “conference” where … Continue reading curl up 2022 San Francisco →",
          "link": "https://daniel.haxx.se/blog/2022/04/20/curl-up-2022-san-francisco/",
          "publishedOn": "2022-04-20T21:49:21.000Z",
          "wordCount": 615,
          "title": "curl up 2022 San Francisco"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18598",
          "author": "Daniel Stenberg",
          "description": "With the brand new merged support for the msh3 library, curl now supports no less than three different HTTP/3 backends. It was merged into curl’s git repository on April 10. When you build curl, you have the option to build it with HTTP/3 support enabled. The HTTP/3 support in curl is still considered experimental so … Continue reading msh3 as the third h3 backend →",
          "link": "https://daniel.haxx.se/blog/2022/04/10/msh3-as-the-third-h3-backend/",
          "publishedOn": "2022-04-10T16:28:23.000Z",
          "wordCount": 419,
          "title": "msh3 as the third h3 backend"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18946",
          "author": "Daniel Stenberg",
          "description": "I didn’t expect this, and this year I wasn’t asked ahead of time if I wanted to receive this gift. It is however something of a collector’s item that I find very enjoyable. I received my GitHub contribution matrix printed in steel. This is my 2021 contribution skyline. (Click the images for higher resolution.) The … Continue reading More steel →",
          "link": "https://daniel.haxx.se/blog/2022/04/09/more-steel/",
          "publishedOn": "2022-04-09T10:21:15.000Z",
          "wordCount": 427,
          "title": "More steel"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-04-24T12:16:00.079Z",
          "wordCount": 808,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-04-24T12:15:59.702Z",
          "wordCount": 791,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2022-04-20T12:23:27.828Z",
          "wordCount": 2812,
          "title": "How we built Twitter’s highly reliable ads pacing service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-04-18T12:17:57.657Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2022-04-17T12:15:44.137Z",
          "wordCount": 2606,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-04-17T12:15:43.376Z",
          "wordCount": 1663,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-04-14T12:18:31.019Z",
          "wordCount": 2038,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-04-08T12:16:45.951Z",
          "wordCount": 984,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2022-04-03T12:15:30.230Z",
          "wordCount": 2822,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-04-01T12:19:04.569Z",
          "wordCount": 1608,
          "title": "Data transfer in Manhattan using RocksDB"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_qhs0t3wlsx02-8>li{counter-increment:lst-ctn-kix_qhs0t3wlsx02-8}ol.lst-kix_h2vtkcla8l9d-2.start{counter-reset:lst-ctn-kix_h2vtkcla8l9d-2 0}ul.lst-kix_9i24fh2252ug-1{list-style-type:none}.lst-kix_h2vtkcla8l9d-3>li{counter-increment:lst-ctn-kix_h2vtkcla8l9d-3}ul.lst-kix_9i24fh2252ug-0{list-style-type:none}ul.lst-kix_9i24fh2252ug-3{list-style-type:none}ul.lst-kix_9i24fh2252ug-2{list-style-type:none}ul.lst-kix_9i24fh2252ug-5{list-style-type:none}ul.lst-kix_9i24fh2252ug-4{list-style-type:none}ul.lst-kix_9i24fh2252ug-7{list-style-type:none}.lst-kix_czzguda5pqu4-1>li{counter-increment:lst-ctn-kix_czzguda5pqu4-1}ul.lst-kix_9i24fh2252ug-6{list-style-type:none}.lst-kix_jdourvkzhmg1-7>li{counter-increment…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/the-more-you-know-more-you-know-you.html",
          "publishedOn": "2022-04-19T16:06:00.000Z",
          "wordCount": 6268,
          "title": "The More You Know, The More You Know You Don’t Know"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.BGLtzooHlW-c13{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.BGLtzooHlW-c3{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:Consolas,\"Courier New\";font-style:normal}.BGLtzooHlW-c10{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-fa…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-1782-ios-in-wild-vulnerability.html",
          "publishedOn": "2022-04-14T15:58:00.000Z",
          "wordCount": 8658,
          "title": "CVE-2021-1782, an iOS in-the-wild vulnerability in vouchers"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-30737-xerubs-2021-ios-asn1.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.c5{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.c10{color:#434343;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:14pt;font-family:\"Arial\";font-style:normal}.c2{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:10pt;font-family:Consolas,\"Courier New\";font-style:normal}.c0…",
          "link": "https://googleprojectzero.blogspot.com/2022/04/cve-2021-30737-xerubs-2021-ios-asn1.html",
          "publishedOn": "2022-04-07T16:08:00.000Z",
          "wordCount": 6442,
          "title": "CVE-2021-30737, @xerub's 2021 iOS ASN.1 Vulnerability"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47798",
          "author": "Melissa Thermidor",
          "description": "The latest Common Voice dataset, released today, has achieved a major milestone: More than 20,000 hours of open-source speech data that anyone, anywhere can use. The dataset has nearly doubled in the past year. Mozilla’s Common Voice seeks to change the language technology ecosystem by supporting communities to collect voice data for the creation of voice-enabled applications for their own languages. \nThe post Common Voice dataset tops 20,000 hours appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/common-voice-dataset-tops-20000-hours/",
          "publishedOn": "2022-04-28T15:23:57.000Z",
          "wordCount": 587,
          "title": "Common Voice dataset tops 20,000 hours"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47805",
          "author": "Hermina",
          "description": "Almost a month ago, we announced MDN Plus, a new premium service on MDN that allows users to customize their experience on the website.\nWe are very glad to announce today that it is now possible for MDN users around the globe to create an MDN Plus free account, no matter where they are.\nThe post MDN Plus now available in more markets appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/mdn-plus-now-available-in-more-markets/",
          "publishedOn": "2022-04-28T10:05:35.000Z",
          "wordCount": 349,
          "title": "MDN Plus now available in more markets"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47784",
          "author": "Hermina",
          "description": "On March 1st, 2022, MDN Web Docs released a new design and a new brand identity. Overall, the community responded to the redesign enthusiastically and we received many positive messages and kudos. We also received valuable feedback on some of the things we didn’t get quite right, like the browser compatibility table changes as well as some accessibility and readability issues.\nThe post Adopting users’ design feedback appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/adopting-users-design-feedback/",
          "publishedOn": "2022-04-21T15:04:05.000Z",
          "wordCount": 1178,
          "title": "Adopting users’ design feedback"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47775",
          "author": "Melissa Thermidor",
          "description": "We’re pleased to announce that we have partnered with Center for Humane Tech, a nonprofit organization that radically reimagines the digital infrastructure. Its mission is to drive a comprehensive shift toward humane technology that supports the collective well-being, democracy and shared information environment.\nThe post Mozilla partners with the Center for Humane Technology appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/04/mozilla-partners-with-the-center-for-humane-technology/",
          "publishedOn": "2022-04-13T15:02:02.000Z",
          "wordCount": 722,
          "title": "Mozilla partners with the Center for Humane Technology"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=64639",
          "author": "Patrick Thomson",
          "description": "Thanks to the efforts of the Elixir community, GitHub supports code navigation for Elixir repositories. Read how favorite language can add this support too!",
          "link": "https://github.blog/2022-04-29-bringing-code-navigation-to-communities/",
          "publishedOn": "2022-04-29T15:00:02.000Z",
          "wordCount": 787,
          "title": "Bringing code navigation to communities"
        },
        {
          "id": "https://github.blog/?p=64550",
          "author": "Justin Hutchings",
          "description": "These days software is subject to an ever-changing threat landscape. Check out the many ways you can keep your projects secure on GitHub today.",
          "link": "https://github.blog/2022-04-28-best-practices-to-keep-your-projects-secure-on-github/",
          "publishedOn": "2022-04-28T15:55:56.000Z",
          "wordCount": 958,
          "title": "Best practices to keep your projects secure on GitHub"
        },
        {
          "id": "https://github.blog/?p=64509",
          "author": "Sergio Padrino",
          "description": "GitHub Desktop 3.0 brings better integration with your GitHub Pull Requests. You can now receive real time notifications and review the status of your check runs for your pull request.",
          "link": "https://github.blog/2022-04-26-github-desktop-3-0-brings-better-integration-for-your-pull-requests/",
          "publishedOn": "2022-04-26T16:00:26.000Z",
          "wordCount": 1086,
          "title": "GitHub Desktop 3.0 brings better integration for your pull requests"
        },
        {
          "id": "https://github.blog/?p=64330",
          "author": "Lessley Dennington",
          "description": "This is the first post in a two-part series describing friendly forks and alternative strategies for managing them. Stay tuned for part two coming in May!",
          "link": "https://github.blog/2022-04-25-the-friend-zone-friendly-forks-101/",
          "publishedOn": "2022-04-25T17:29:10.000Z",
          "wordCount": 1614,
          "title": "The friend zone: friendly forks 101"
        },
        {
          "id": "https://github.blog/?p=64307",
          "author": "Lee Reilly",
          "description": "The ZX Spectrum, one of the best-selling microcomputers of all time, celebrates its 40 years anniversary today. Read more about how the community is still active - creating new content, archiving old content, and hacking on all sorts of hardware.",
          "link": "https://github.blog/2022-04-23-zx-spectrum-40-year-anniversary/",
          "publishedOn": "2022-04-23T07:01:13.000Z",
          "wordCount": 1595,
          "title": "Celebrating 40 years of ZX Spectrum ❤️ 💛 💚 💙"
        },
        {
          "id": "https://github.blog/?p=64375",
          "author": "Madison Oliver",
          "description": "Do you worry that a CVE will hurt the reputation of your project? In reality, CVEs are a tracking number, and nothing more. Here's how we think of them at GitHub.",
          "link": "https://github.blog/2022-04-22-removing-the-stigma-of-a-cve/",
          "publishedOn": "2022-04-22T16:30:31.000Z",
          "wordCount": 1717,
          "title": "Removing the stigma of a CVE"
        },
        {
          "id": "https://github.blog/?p=64240",
          "author": "Brian Douglas",
          "description": "From plug-and-play automations to protected branches, here are simple ways any developer can build more secure software on GitHub—all with a free account.",
          "link": "https://github.blog/2022-04-22-5-simple-things-every-developer-can-do-to-ship-more-secure-code/",
          "publishedOn": "2022-04-22T14:59:28.000Z",
          "wordCount": 2042,
          "title": "5 simple things every developer can do to ship more secure code"
        },
        {
          "id": "https://github.blog/?p=64370",
          "author": "Jeimy Ruiz",
          "description": "We’re kicking off InFocus, a global virtual event focused on accelerating, securing, and improving the way software development teams work.",
          "link": "https://github.blog/2022-04-21-guide-to-github-infocus-2022/",
          "publishedOn": "2022-04-21T21:14:55.000Z",
          "wordCount": 865,
          "title": "Your guide to GitHub InFocus: Improving the way software development teams work in 2022"
        },
        {
          "id": "https://github.blog/?p=63926",
          "author": "Carlos Martín Nieto",
          "description": "The history of pre-receive hooks, how we discovered that the performance was problematic, and how we went about safely replacing them.",
          "link": "https://github.blog/2022-04-21-improving-git-push-times-through-faster-server-side-hooks/",
          "publishedOn": "2022-04-21T16:30:04.000Z",
          "wordCount": 1361,
          "title": "Improving Git push times through faster server side hooks"
        },
        {
          "id": "https://github.blog/?p=64296",
          "author": "Daniel Adams",
          "description": "Organization profiles can now display custom content visible only to members of the organization. A new Member view can be tailored to show an alternative README and pinned private repositories.",
          "link": "https://github.blog/2022-04-20-organization-profiles-leading-the-way/",
          "publishedOn": "2022-04-20T18:38:24.000Z",
          "wordCount": 673,
          "title": "Organization profiles leading the way"
        },
        {
          "id": "https://github.blog/?p=64268",
          "author": "Gabe Dominguez",
          "description": "We’re releasing exciting improvements that will streamline your Codespaces experience when working with multi-repository projects and monorepos.",
          "link": "https://github.blog/2022-04-20-codespaces-multi-repository-monorepo-scenarios/",
          "publishedOn": "2022-04-20T16:00:57.000Z",
          "wordCount": 1022,
          "title": "Codespaces for multi-repository and monorepo scenarios"
        },
        {
          "id": "https://github.blog/?p=64193",
          "author": "Andrew Eisenberg",
          "description": "Introducing CodeQL packs to help you codify and share your knowledge of vulnerabilities.",
          "link": "https://github.blog/2022-04-19-sharing-security-expertise-through-codeql-packs-part-i/",
          "publishedOn": "2022-04-19T17:00:02.000Z",
          "wordCount": 2115,
          "title": "Sharing security expertise through CodeQL packs (Part I)"
        },
        {
          "id": "https://github.blog/?p=64204",
          "author": "Taylor Blau",
          "description": "Another new release of Git is here! Take a look at some of our highlights on what's new in Git 2.36.",
          "link": "https://github.blog/2022-04-18-highlights-from-git-2-36/",
          "publishedOn": "2022-04-18T16:44:50.000Z",
          "wordCount": 3484,
          "title": "Highlights from Git 2.36"
        },
        {
          "id": "https://github.blog/?p=64202",
          "author": "Mike Hanley",
          "description": "On April 12, GitHub Security began an investigation that uncovered evidence that an attacker abused stolen OAuth user tokens issued to two third-party OAuth integrators, Heroku and Travis-CI, to download data from dozens of organizations, including npm. Read on to learn more about the impact to GitHub, npm, and our users.",
          "link": "https://github.blog/2022-04-15-security-alert-stolen-oauth-user-tokens/",
          "publishedOn": "2022-04-15T22:35:02.000Z",
          "wordCount": 1107,
          "title": "Security alert: Attack campaign involving stolen OAuth user tokens issued to two third-party integrators"
        },
        {
          "id": "https://github.blog/?p=64103",
          "author": "Erin Havens",
          "description": "Today, we're shipping a new feature for Dependabot alerts which helps you better understand how you're affected by a vulnerability.",
          "link": "https://github.blog/2022-04-14-dependabot-alerts-now-surface-if-code-is-calling-vulnerability/",
          "publishedOn": "2022-04-14T16:30:11.000Z",
          "wordCount": 775,
          "title": "Dependabot alerts now surface if your code is calling a vulnerability"
        },
        {
          "id": "https://github.blog/?p=64076",
          "author": "Taylor Blau",
          "description": "Upgrade your local installation of Git, especially if you are using Git for Windows, or you use Git on a multi-user machine.",
          "link": "https://github.blog/2022-04-12-git-security-vulnerability-announced/",
          "publishedOn": "2022-04-12T17:51:41.000Z",
          "wordCount": 660,
          "title": "Git security vulnerability announced"
        },
        {
          "id": "https://github.blog/?p=64119",
          "author": "Evi Liu",
          "description": "Today, we’re excited to bring you a few new features that will help you communicate, collaborate, and connect seamlessly with teams and communities about the software you’re building with the help of GitHub Discussions.",
          "link": "https://github.blog/2022-04-12-whats-new-in-github-discussions-organization-discussions-polls-and-more/",
          "publishedOn": "2022-04-12T17:00:32.000Z",
          "wordCount": 1295,
          "title": "What’s new in GitHub Discussions: Organization Discussions, polls, and more"
        },
        {
          "id": "https://github.blog/?p=64109",
          "author": "blakewilliams",
          "description": "How we sped up GitHub.com by moving slow, non-critical code into rack.after_reply.",
          "link": "https://github.blog/2022-04-11-performance-at-github-deferring-stats-with-rack-after_reply/",
          "publishedOn": "2022-04-11T17:20:57.000Z",
          "wordCount": 919,
          "title": "Performance at GitHub: deferring stats with rack.after_reply"
        },
        {
          "id": "https://github.blog/?p=64018",
          "author": "Michelle Mannering",
          "description": "Each month, we highlight open source projects that have shipped major updates. These include everything from world-changing technology to developer tooling, and weekend projects. Here are our top staff picks on projects that shipped major version releases in March. Babylon.js 5.0 We featured Babylon.js in the November 2020 Release Radar. Since then, Babylon.js has come […]",
          "link": "https://github.blog/2022-04-08-release-radar-mar-2022/",
          "publishedOn": "2022-04-08T17:00:33.000Z",
          "wordCount": 1265,
          "title": "Release Radar · March 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=63975",
          "author": "Matthew John Cheetham",
          "description": "Ensuring secure access to your source code is more important than ever. Git Credential Manager helps make that easy.",
          "link": "https://github.blog/2022-04-07-git-credential-manager-authentication-for-everyone/",
          "publishedOn": "2022-04-07T18:00:41.000Z",
          "wordCount": 2241,
          "title": "Git Credential Manager: authentication for everyone"
        },
        {
          "id": "https://github.blog/?p=64043",
          "author": "Jose Palafox",
          "description": "Learn how to build packages with SLSA 3 provenance using GitHub Actions.",
          "link": "https://github.blog/2022-04-07-slsa-3-compliance-with-github-actions/",
          "publishedOn": "2022-04-07T13:18:08.000Z",
          "wordCount": 1212,
          "title": "Achieving SLSA 3 Compliance with GitHub Actions and Sigstore for Go modules"
        },
        {
          "id": "https://github.blog/?p=64028",
          "author": "Jakub Oleksy",
          "description": "In March, we experienced several incidents resulting in significant impact to multiple GitHub services.",
          "link": "https://github.blog/2022-04-06-github-availability-report-march-2022/",
          "publishedOn": "2022-04-06T18:45:52.000Z",
          "wordCount": 1617,
          "title": "GitHub Availability Report: March 2022"
        },
        {
          "id": "https://github.blog/?p=63758",
          "author": "Courtney Claessens",
          "description": "The new dependency review action and API prevents the introduction of known supply chain vulnerabilities into your code.",
          "link": "https://github.blog/2022-04-06-prevent-introduction-known-vulnerabilities-into-your-code/",
          "publishedOn": "2022-04-06T18:13:40.000Z",
          "wordCount": 641,
          "title": "Prevent the introduction of known vulnerabilities into your code"
        },
        {
          "id": "https://github.blog/?p=63897",
          "author": "Brittany O'Shea",
          "description": "We want to take away the pain and effort of keeping your code secure, so check out how Dependabot empowers developers to keep to their projects secure.",
          "link": "https://github.blog/2022-04-06-how-dependabot-empowers-you-to-keep-your-projects-secure/",
          "publishedOn": "2022-04-06T15:55:44.000Z",
          "wordCount": 1187,
          "title": "How Dependabot empowers you to keep your projects secure"
        },
        {
          "id": "https://github.blog/?p=63820",
          "author": "Brian Douglas",
          "description": "From automating builds and releases to taking care of large-scale regression testing, here are a few ways we use GitHub Actions to build GitHub.",
          "link": "https://github.blog/2022-04-05-4-ways-we-use-github-actions-to-build-github/",
          "publishedOn": "2022-04-05T15:50:13.000Z",
          "wordCount": 2107,
          "title": "4 ways we use GitHub Actions to build GitHub"
        },
        {
          "id": "https://github.blog/?p=63934",
          "author": "Mariam Sulakian",
          "description": "Organizations with GitHub Advanced Security can now proactively protect against secret leaks with secret scanning’s new push protection feature.",
          "link": "https://github.blog/2022-04-04-push-protection-github-advanced-security/",
          "publishedOn": "2022-04-04T17:57:12.000Z",
          "wordCount": 719,
          "title": "Proactively prevent secret leaks with GitHub Advanced Security secret scanning"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18264",
          "author": "Felipe Almeida - Machine Learning Engineer",
          "description": "Nubank's take on how these two roles interact and how each plays a key part in a successful team.\nThe post Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-scientist-x-machine-learning-engineer-roles-how-are-they-different-how-are-they-alike/",
          "publishedOn": "2022-04-26T22:05:36.000Z",
          "wordCount": 4965,
          "title": "Data Scientist x Machine Learning Engineer Roles: How are they different? How are they alike?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18287",
          "author": "Matt Swann - Chief Technology Officer at Nubank",
          "description": "New tools will soon create more value based on transactional data intelligence, supporting innovative companies to generate insights about customer patterns and journeys for their benefit.\nThe post Artificial intelligence applied to financial services appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/matt-swann-artificial-intelligence-applied-to-finanacial-services/",
          "publishedOn": "2022-04-19T19:45:50.000Z",
          "wordCount": 3660,
          "title": "Artificial intelligence applied to financial services"
        },
        {
          "id": "https://building.nubank.com.br/?p=18245",
          "author": "Dilson Caproni, Nathalia Magagne and Larissa Fonseca - IT Risk team at Nubank",
          "description": "Diversity leads Nubank's IT Risk team to challenge the traditional way to deal with technological risks through a multidisciplinary approach.\nThe post Reinventing IT & Cyber Risk Management in the financial market appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/reinventing-it-and-cyber-risk-in-the-financial-market/",
          "publishedOn": "2022-04-13T21:39:44.000Z",
          "wordCount": 4211,
          "title": "Reinventing IT & Cyber Risk Management in the financial market"
        },
        {
          "id": "https://building.nubank.com.br/?p=18229",
          "author": "Nubank Editorial",
          "description": "The magazine listened to over 45,000 people around the world to compile the list. This is the fourth consecutive time that Nubank appears in the ranking.\nThe post Nubank elected best bank in Brazil and one of the bests in the world best banks in Forbes’ ranking appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-forbes-ranking-2022/",
          "publishedOn": "2022-04-13T17:30:16.000Z",
          "wordCount": 3055,
          "title": "Nubank elected best bank in Brazil and one of the bests in the world best banks in Forbes’ ranking"
        },
        {
          "id": "https://building.nubank.com.br/?p=18218",
          "author": "Nubank Press",
          "description": "We're doubling down on our commitment with Mexico and Colombia in order to continue to grow and create impact.\nThe post Nubank strengthens its international operations with a credit line of US$650 million to accelerate growth in Mexico and Colombia appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-credit-line-us-650-million-to-accelerate-mexico-colombia/",
          "publishedOn": "2022-04-11T12:52:13.000Z",
          "wordCount": 3433,
          "title": "Nubank strengthens its international operations with a credit line of US$650 million to accelerate growth in Mexico and Colombia"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/customer-stories/how-wix-improves-their-security-posture-ethical-hackers",
          "author": "HackerOne",
          "description": "Reducing risk is fundamental to Wix’s approach to cybersecurity, and as the threat landscape evolves, they turn to HackerOne Bounty to protect their security posture. Since 2018, Wix has invited tens of thousands of ethical hackers worldwide to ensure new and existing features are secure. We recently met with two Wix security team members to learn how they leverage ethical hackers to detect risks before they become threats and how vulnerability insights help strengthen their security posture.",
          "link": "https://www.hackerone.com/customer-stories/how-wix-improves-their-security-posture-ethical-hackers",
          "publishedOn": "2022-04-21T14:00:00.000Z",
          "wordCount": 1958,
          "title": "How Wix Improves Their Security Posture with Ethical Hackers"
        },
        {
          "id": "https://hackerone.com/company-news/announcing-hackerone-2022-attack-resistance-report-security-survey-how-close-your",
          "author": "HackerOne",
          "description": "Today, HackerOne published The 2022 Attack Resistance Report: A HackerOne Security Survey. Our research revealed an increasing gap—the attack resistance gap—between what organizations can defend and what they need to defend. The gap is the result of four components prevalent across organizations.",
          "link": "https://www.hackerone.com/company-news/announcing-hackerone-2022-attack-resistance-report-security-survey-how-close-your",
          "publishedOn": "2022-04-19T23:40:49.000Z",
          "wordCount": 908,
          "title": "Announcing the HackerOne 2022 Attack Resistance Report: A Security Survey—How to Close Your Organization's Attack Resistance Gap"
        },
        {
          "id": "https://hackerone.com/customer-stories/how-ethical-hackers-help-watson-address-digital-risk",
          "author": "HackerOne",
          "description": "We recently met with A.S. Watson’s Chief Information Security Officer (CISO), Feliks Voskoboynik, to learn how ethical hackers have helped with digital transformation and enabled his team to harden their attack surface. Read on to learn Feliks’ advice on including a bug bounty program as part of a security strategy, the lessons ethical hackers have provided, and what best practices he can share with other CISOs.",
          "link": "https://www.hackerone.com/customer-stories/how-ethical-hackers-help-watson-address-digital-risk",
          "publishedOn": "2022-04-19T16:00:00.000Z",
          "wordCount": 1637,
          "title": "How Ethical Hackers Help A.S. Watson Address Digital Risk"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/5941d3231762",
          "author": "Netflix Technology Blog",
          "description": "by Vivek Kaushal",
          "link": "https://netflixtechblog.com/evolution-of-ml-fact-store-5941d3231762?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-04-26T20:44:04.000Z",
          "wordCount": 2761,
          "title": "Evolution of ML Fact Store"
        },
        {
          "id": "https://medium.com/p/5c0c1c7d7eaf",
          "author": "Netflix Technology Blog",
          "description": "By Alex Hutter, Falguni Jhaveri and Senthil Sayeebaba",
          "link": "https://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-5c0c1c7d7eaf?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-04-12T17:16:41.000Z",
          "wordCount": 2138,
          "title": "How Netflix Content Engineering makes a federated graph searchable"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/pure-stock-portfolio-a-stock-to-sell",
          "author": "Market Radar",
          "description": "A very bad earning report made me change the idea on the company",
          "link": "https://marketradar.substack.com/p/pure-stock-portfolio-a-stock-to-sell",
          "publishedOn": "2022-04-28T13:45:17.000Z",
          "wordCount": null,
          "title": "Pure Stock Portfolio: a stock to sell",
          "itunes": {},
          "enclosure": {
            "url": "https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/407bfb28-506f-41f6-958b-53dbefad58b8_828x823.jpeg",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/earnings-are-positive-surprises-over",
          "author": "Market Radar",
          "description": "We have entered one of the most difficult earning seasons ever",
          "link": "https://marketradar.substack.com/p/earnings-are-positive-surprises-over",
          "publishedOn": "2022-04-21T14:00:39.000Z",
          "wordCount": null,
          "title": "Earnings: are positive surprises over?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F83341bb7-1be7-4bbb-a7f2-925c69ef451b_828x335.jpeg",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/portfolio-rebalancing-april-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-rebalancing-april-2022",
          "publishedOn": "2022-04-14T10:11:36.000Z",
          "wordCount": null,
          "title": "Portfolio Rebalancing: April 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff56c4bfc-6f9f-4aec-b078-4c13027bacd1_1009x677.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-3",
          "author": "Market Radar",
          "description": "A mix of charts on stocks and indices",
          "link": "https://marketradar.substack.com/p/charts-to-watch-3",
          "publishedOn": "2022-04-06T13:00:49.000Z",
          "wordCount": null,
          "title": "Charts to watch #3",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1b6a1918-83d2-462e-b51b-657bf9bfc682_939x651.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}