{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/10/SecurityofPasskeysintheGooglePasswordManager.html",
          "author": null,
          "description": "Posted by Arnar Birgisson, Software Engineer\n\n\nWe are excited to announce passkey support on Android and Chrome for developers to test today, with general availability following later this year. In this post we cover details on how passkeys stored in the Google Password Manager are kept secure. See our post on the Android Developers Blog for a more general overview.\nPasskeys are a safer and more secure alternative to passwords. They also replace the need for traditional 2nd factor authentication methods such as text message, app based one-time codes or push-based approvals. Passkeys use public-key cryptography so that data breaches of service providers don't result in a compromise of passkey-protected accounts, and are based on industry standard APIs and protocols to ensure they are not su…",
          "link": "http://security.googleblog.com/2022/10/SecurityofPasskeysintheGooglePasswordManager.html",
          "publishedOn": "2022-10-12T12:00:00.000Z",
          "wordCount": 2545,
          "title": "Security of Passkeys in the Google Password Manager"
        },
        {
          "id": "http://security.googleblog.com/2022/10/google-pixel-7-and-pixel-7-pro-next.html",
          "author": null,
          "description": "Dave Kleidermacher, Jesse Seed, Brandon Barbello, Sherif Hanna, Eugene Liderman, Android, Pixel, and Silicon Security Teams \nEvery day, billions of people around the world trust Google products to enrich their lives and provide helpful features –  across mobile devices, smart home devices, health and fitness devices, and more. We keep more people safe online than anyone else in the world, with products that are secure by default, private by design and that put you in control. As our advancements in knowledge and computing grow to deliver more help across contexts, locations and languages, our unwavering commitment to protecting your information remains. \nThat’s why Pixel phones are designed from the ground up to help protect you and your sensitive data while keeping you in control. We’re t…",
          "link": "http://security.googleblog.com/2022/10/google-pixel-7-and-pixel-7-pro-next.html",
          "publishedOn": "2022-10-11T17:01:00.004Z",
          "wordCount": 2474,
          "title": "Google Pixel 7 and Pixel 7 Pro: The next evolution in mobile security"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/LWJa",
          "author": "Adam Stacoviak",
          "description": "Rust is quite popular, but why? Emil Ernerfeldt, CTO of rerun.io, shares his thoughts in the subject.\nI believe Rust is the most important development in system programming languages since C. What is novel is not any individual feature (“Rust is not a particularly original language”), but the fact that so many amazing features have come together in one mainstream language.\nRust is not a perfect language (scroll down for my complaints!), but it’s so much nicer than anything else I’ve used.\nI’m not alone in loving Rust - Rust has been the most loved language in the Stack Overflow Developer Survey for seven years straight. So what are the features that make me love Rust so much?\nDiscuss on Changelog News",
          "link": "https://www.rerun.io/blog/why-rust",
          "publishedOn": "2022-10-18T21:17:52.000Z",
          "wordCount": null,
          "title": "Why Rust?",
          "itunes": {}
        },
        {
          "id": "changelog.com/12/1880",
          "author": null,
          "description": "The Open Podcast Prefix Project is a free and open source podcast prefix analytics service committed to open data and listener privacy. This hits close to home for us in a couple ways, so we invited the project’s creator, John Spurlock, Backstage to learn more about it.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJohn Spurlock – Twitter, GitHub, Website\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nop3.dev\nLivewire.io\nThe Podcast Index\npodcastindex.social\nThe new podcast namespace\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/25",
          "publishedOn": "2022-10-18T17:10:00.000Z",
          "wordCount": null,
          "title": "Backstage 25: Should we get down with OP3?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/25/backstage-25.mp3",
            "length": "78326955",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7Ya2",
          "author": "Jerod Santo",
          "description": "Zach Musgrave from Dolt reviews several case studies of performance problems they ran into while benchmarking Dolt DB to get row access to be as fast as MySQL.\nOh, and he also shares how to fix each problem, which is nice. 😉\nDiscuss on Changelog News",
          "link": "https://www.dolthub.com/blog/2022-10-14-golang-performance-case-studies/",
          "publishedOn": "2022-10-18T15:44:00.000Z",
          "wordCount": null,
          "title": "Go performance case studies",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mby0",
          "author": "Martin Heinz",
          "description": "Out-of-the-box, the Python standard library ships with many great libraries, some of which provide CLIs, allowing us to do many cool things directly from terminal without needing to even open a .py file.\nThis includes things like starting a webserver, opening a browser, parsing JSON files, benchmarking programs and many more, all of which we will explore in this article.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/83",
          "publishedOn": "2022-10-18T14:51:00.000Z",
          "wordCount": null,
          "title": "Python CLI tricks that don't require any code whatsoever",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1878",
          "author": null,
          "description": "People are starting to wake up to the fact that they have control and ownership over their data, and governments are moving quickly to legislate these rights. John K. Thomson has written a new book on the topic that is a must read! We talk about the new book in this episode along with how practitioners should be thinking about data exchanges, privacy, trust, and synthetic data.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJohn K. Thompson – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nUse the code podpracticalAI19 for 40% off of Data for All, along with all Manning products in all formats!!!\nData for All\nJohn’s other books:\n\nAnalytics Teams: Harnessing analytics and artificial intelligence for business improvement\nAnalytics: How to win with Intelligence\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/197",
          "publishedOn": "2022-10-18T14:05:00.000Z",
          "wordCount": null,
          "title": "Practical AI 197: Data for All",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/197/practical-ai-197.mp3",
            "length": "47705072",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1879",
          "author": null,
          "description": "We revisit our Harmonai story from last week, Jamie Tanna reviews posting his salary history publicly, Sid Sijbrandij’s new (open core) venture fund, Zed Shaw thinks Stripe is like Paypal in 2010 & Helix is a new Rust-based terminal.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nZach Evans on Twitter\nLessons learned since posting my salary history publicly\nOpen Core Ventures\nStripe is Paypal circa 2010\nHelix Editor (pic)\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-10-17",
          "publishedOn": "2022-10-17T19:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Harmonai revisited, lessons learned from public salary, Open Core Ventures, Stripe is Paypal in 2010 & Helix",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-10-17/the-changelog-news-2022-10-17.mp3",
            "length": "6929476",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1lV",
          "author": "Adam Stacoviak",
          "description": "This is awesome — Brandon, please write down more lessons as learned, even if they’re just something for you to reference later on.\nI’ve been doing this “reliability” stuff for a little while now (~5 years), at companies ranging from about 20 developers to over 2,000. I’ve always cared primarily about the software elements I describe as living “outside” the application – like, how does it get its configuration? What kinds of instances does it run on, and are those the best kinds to use? What steps does it take on its path from “code in a repository” to “running in production”? And I’ve always kept track of what I liked – which mechanisms allowed fast iteration and which caused frustration, which led to outages and which prevented them.\n… So! With that out of the way – this is how I’d rebuild it all from scratch if I could.\nDiscuss on Changelog News",
          "link": "https://www.willett.io/posts/precepts/",
          "publishedOn": "2022-10-17T19:02:36.000Z",
          "wordCount": null,
          "title": "How to build software like an SRE",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rX3n",
          "author": "Jerod Santo",
          "description": "An actual card game to teach actual kids how to actually combine unix commands with pipes.\ntask: print the most common line from a file, we need to first cat the file (in our case the file is card 03.txt), then sort it, uniq count it, then do numeric sort, then tail -1:\nanswer: cat 03.txt | sort | uniq -c | sort -n | tail -1\nPrint it yourself or… actually it’s sold out for now so you’ll have to print it yourself.\n\nDiscuss on Changelog News",
          "link": "https://punkx.org/unix-pipe-game/",
          "publishedOn": "2022-10-17T16:16:00.000Z",
          "wordCount": null,
          "title": "The UNIX Pipe Card Game",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AXnQ",
          "author": "Jerod Santo",
          "description": "Full-stack web development is (still) too complicated. Simple CRUD, a common requirement of any business application, should be simple to build, maintain, and extend when the need arises.\nRemult is a full-stack CRUD framework that uses your TypeScript entities as a single source of truth for your API, frontend type-safe API client and backend ORM.\nThis isn’t just production-ready, it’s been used in production since 2018.\nDiscuss on Changelog News",
          "link": "https://github.com/remult/remult",
          "publishedOn": "2022-10-17T15:30:00.000Z",
          "wordCount": null,
          "title": "A CRUD framework for full stack TypeScript",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdWw",
          "author": "Saul Pwanson",
          "description": "vdsql is a new plugin that allows VisiData to connect to databases and query them directly, using the database’s own query engine.  It uses Ibis to generate SQL for many popular backends, including Postgres, DuckDB, Clickhouse, and more.\nvdsql v0.2, released this past week, is already quite useful, and development continues to improve both vdsql and VisiData for bigger data!\nDiscuss on Changelog News",
          "link": "https://www.visidata.org/blog/2022/connect-visidata-to-sql-databases-with-vdsql/",
          "publishedOn": "2022-10-17T14:42:00.000Z",
          "wordCount": null,
          "title": "Connect VisiData to SQL Databases with vdsql",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1825",
          "author": null,
          "description": "Docusaurus maintainer Sébastien Lorber joins Jerod & Amal for a deep-dive on everybody’s favorite documentation generator. It’s back with a big 2.0 release, boasts some big users, and has a big set of new features such as document versioning, a plugin architecture, and more.\nDiscuss on Changelog News\nChangelog++ members get a bonus 6 minutes at the end of this episode and zero ads. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nSébastien Lorber – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nAmal Hussein – Twitter, GitHub\nNotes and Links\nDocusaurus\nThe showcase\ndocusaurus.new\nThis Week in React\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/247",
          "publishedOn": "2022-10-14T20:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 247: Docusaurus 2 is a pretty big deal",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/247/js-party-247.mp3",
            "length": "67992899",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1851",
          "author": null,
          "description": "This week we’re talking about serverless Postgres! We’re joined by Nikita Shamgunov, co-founder and CEO of Neon. With Neon, truly serverless PostgreSQL is finally here. Neon isn’t Postgres compatible…it actually is Postgres! Neon is also open source under the Apache License 2.0.\nWe talk about what a cloud native serverless Postgres looks like, why developers want Postgres and why of the top 5 databases only Postgres is growing (according to DB-Engines Ranking), we talk about how they separated storage and compute to offer autoscaling, branching, and bottomless storage, we also talk about their focus on DX — where they’re getting it right and where they need to improve. Neon is invite only as of the recording and release of this episode, but near the end of the show Nikita shares a few ways…",
          "link": "https://changelog.com/podcast/510",
          "publishedOn": "2022-10-14T16:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 510: Taking Postgres serverless",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/510/the-changelog-510.mp3",
            "length": "81130627",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwyY",
          "author": "Jerod Santo",
          "description": "Smashing Mag’s Vitaly Friedman puts down some of his recent thoughts on authentication flows:\nnobody wakes up in the morning hoping to finally identify crosswalks and fire hydrants that day. Yet every day, we prompt users through hoops and loops to sign up and log in, to set a complex enough password or recover one, to find a way to restore access to locked accounts and logged-out sessions.\nOf course security matters, yet too often, it gets in the way of usability. As Jared Spool said once, “If a product isn’t usable, it’s also not secure.” That’s when people start using private email accounts and put passwords on stick-it-notes because they forget them. As usual, Jared hits the nail on the head here. So what can we do to improve the authentication UX?\nVitaly lists seven recommendations. Nothing radical here, but solid advice worth thinking through.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/08/authentication-ux-design-guidelines/",
          "publishedOn": "2022-10-13T20:57:00.000Z",
          "wordCount": null,
          "title": "Rethinking authentication UX",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1832",
          "author": null,
          "description": "We’re once again exploring hacking in Go from the eyes of security researchers. This time, Natalie & Ian are joined by Ivan Kwiatkowski (a.k.a. Justice Rage)!\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nIvan Kwiatkowski – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nIan Lopshire – Twitter, GitHub\nNotes and Links\n🎧 Hacking with Go: Part 1\nReversing in action: Golang malware used in the SolarWinds attack\nStowaway\nBrute Ratel\nReverse Engineering for Beginners\nPractical Malware Analysis\nTuring Complete on Steam\nThe Zachtronics Puzzle Pack on Steam\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/251",
          "publishedOn": "2022-10-13T18:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 251: Hacking with Go: Part 2",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/251/go-time-251.mp3",
            "length": "63122622",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X1Rd",
          "author": "Jerod Santo",
          "description": "André Staltz:\nI used to believe there was mass collaboration on the internet. But I’ve realized that collaboration is extremely hard. It does not scale, especially not at internet scale. The examples we look up to are either not collaborative on the microscopic level, or are rare exceptions to the rule.\nThe examples he’s referring to are “Wikipedia, open source projects such as Linux, hacktivism, and crowdsourced science experiments such as Rosetta@home.”\nThis post is sobering, but André speaks from a lot of experience.\nDiscuss on Changelog News",
          "link": "https://staltz.com/the-myth-of-mass-collaboration.html",
          "publishedOn": "2022-10-13T14:00:00.000Z",
          "wordCount": null,
          "title": "The myth of mass collaboration",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1838",
          "author": null,
          "description": "I don’t think that you can imagine just how excited Gerhard was to find out that Audi, his favourite car company, has a Kubernetes competence centre. We have Sebastian Kister joining us today to tell us why people, followed by tech make the process.\nThe right thing to focus on is the genuine smiles that people give in response to something we do or say. That is an important SLI & SLO for reducing friction between silos.\nHow does this impact the flow of artefacts into production systems that design & build cars?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make su…",
          "link": "https://changelog.com/shipit/74",
          "publishedOn": "2022-10-12T21:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 74: Vorsprung durch Technik",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/74/ship-it-74.mp3",
            "length": "69822961",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lOVn",
          "author": "Jerod Santo",
          "description": "ffmpeg is one of the foremost pillars of achievement in free software. It has touched the lives of every reader, whether they know it or not. If you’ve ever watched TV, or gone to a movie, or watched videos online, or listened to a podcast, odds are that ffmpeg was involved in making it possible. It is one of the most well-executed and important software projects of all time.\nYep. It also has one of the most epic man pages in the ’Verse.\nDiscuss on Changelog News",
          "link": "https://drewdevault.com/2022/10/12/In-praise-of-ffmpeg.html",
          "publishedOn": "2022-10-12T15:04:00.000Z",
          "wordCount": null,
          "title": "In praise of ffmpeg",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1872",
          "author": null,
          "description": "Chris sits down with Ankur Goyal to talk about DocQuery, Impira’s new open source ML model.  DocQuery lets you ask questions about semi-structured data (like invoices) and unstructured documents (like contracts) using Large Language Models (LLMs).  Ankur illustrates many of the ways DocQuery can help people tame documents, and references Chris’s real life tasks as a non-profit director to demonstrate that DocQuery is indeed practical AI.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nAnkur Goyal – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nDocQuery\nDocQuery Announcement\nDocQuery Blog Announcement\nDocQuery | GitHub\nImpira\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/196",
          "publishedOn": "2022-10-12T15:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 196: What's up, DocQuery?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/196/practical-ai-196.mp3",
            "length": "40831406",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/04ro",
          "author": "Jerod Santo",
          "description": "New versions of Brave will hide—and, where possible, completely block—cookie consent notifications. Brave’s approach is distinct and more privacy-preserving than similar systems used in other browsers (such as the “auto-consent” systems used in other browsers), and helps keep the Web user-first.\nUnlike other approaches, this won’t simply automate the process of clicking “no” in cookie-banners, Brave will block the cookie-banners themselves.\nDiscuss on Changelog News",
          "link": "https://brave.com/privacy-updates/21-blocking-cookie-notices/",
          "publishedOn": "2022-10-12T14:18:00.000Z",
          "wordCount": null,
          "title": "Brave plans to start blocking cookie consent banners",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoZj",
          "author": "Jamie Tanna",
          "description": "Just over a year ago, I did something quite “out there”, even for me, and I posted my salary history publicly. This was accompanied by a blog post to explain why I was doing it, and it’s certainly been popular.\nWhen I first posted it, I made a note to myself to come back in a year, and see whether anything had changed, as well as to look back on some of the events that happened immediately after my posting, as it certainly made life interesting in the month or so following the post.\nDiscuss on Changelog News",
          "link": "https://www.jvt.me/posts/2022/09/21/year-later-salary-history/",
          "publishedOn": "2022-10-11T19:37:00.000Z",
          "wordCount": null,
          "title": "Lessons learned since posting my salary history publicly",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/04dD",
          "author": "Lucas Shen",
          "description": "R has many such packages. In Python, not so much. This one is designed to be easy to use while being customizable (some examples in the README).\n\nDiscuss on Changelog News",
          "link": "https://github.com/lsys/forestplot",
          "publishedOn": "2022-10-11T18:51:00.000Z",
          "wordCount": null,
          "title": "A Python package to make publication-ready but customizable forest plots",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LWVa",
          "author": "Jerod Santo",
          "description": "This looks like top notch work:\nGet more than 20 components with beautiful defaults and simple props. From charts to input and layout elements, we covered all the essential components to lift the tedious front-end work from your shoulders. Get ahead with our simple API approach in no time.\nCheck out their demo dashboard right here.\nDiscuss on Changelog News",
          "link": "https://www.tremor.so/",
          "publishedOn": "2022-10-11T18:03:00.000Z",
          "wordCount": null,
          "title": "A React library for building dashboards fast",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1871",
          "author": null,
          "description": "The libSQL community is forking SQLite, StabilityAI announces Haromai and Dance Diffusion, Robin Rendle doesn’t believe in sprints, Shubham Garg curates some awesome diagramming tools & Chris Pressey writes up some must-read facts about state machines.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nUnpopular Opinion Twitter Thread\nlibSQL is a fork of SQLite\nStabilityAI announced AI Music Generator Harmonai\nI Don’t Believe in Sprints\nAwesome Diagramming\nFacts About State Machines\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-10-10",
          "publishedOn": "2022-10-10T18:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Forking SQLite, generative AI for music, saying no to sprints, awesome diagramming tools & state machine facts",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-10-10/the-changelog-news-2022-10-10.mp3",
            "length": "7207994",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V10P",
          "author": "Jerod Santo",
          "description": "This lets you do so many cool things, even joining across disparate services:\nselect\n  aws.name aws_user_name,\n  slack.id as slack_user_id,\n  slack.display_name as slack_name\nfrom\n  aws_iam_user as aws,\n  slack_user as slack\nwhere\n  aws.name = slack.email;\n\n+--------------------------+---------------+------------+\n|     aws_user_name        | slack_user_id | slack_name |\n+--------------------------+---------------+------------+\n| dwight@dundermifflin.com | U2EMB8HLP     | dwight     |\n| jim@dundermifflin.com    | U02HE4Z7E     | jim        |\n+--------------------------+---------------+------------+\n\nUseful for compliance, security, ops, and cost management.\nDiscuss on Changelog News",
          "link": "https://github.com/turbot/steampipe",
          "publishedOn": "2022-10-10T15:44:00.000Z",
          "wordCount": null,
          "title": "Use SQL to instantly query your cloud services",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7GA",
          "author": "Jerod Santo",
          "description": "A journey from Stripe to Paypal and back to Stripe led Zed Shaw to the conclusion in the headline. And, no, that is not a compliment (in case you weren’t sure).\nZed goes deep on why he feels this way, listing seven serious downsides to using Stripe today. What’s a dev to do? His advice at the end alone is worth the cost of admission:\nThis is why I advocate to people to be ready to switch payment processing at a moment’s notice. Right now I could flip two options and I’d be back on Paypal. If I was pressed I could probably implement any other payment processor in about a week or a day. The ability to quickly switch payments is your only defense against frozen accounts, fraud, and rogue employees.\nDiscuss on Changelog News",
          "link": "https://learnjsthehardway.com/blog/18-stripe-is-paypal-circa-2010/",
          "publishedOn": "2022-10-10T14:52:00.000Z",
          "wordCount": null,
          "title": "Stripe is Paypal circa 2010",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1870",
          "author": null,
          "description": "This week we’re talking fresh, faster, and new web frameworks by way of JS Party. Yes, today’s show is a web framework sampler because a new batch of web frameworks have emerged. There’s always something new happening in the front-end world and JS Party does an amazing job of keeping us up to date. So…what’s fresh, faster, and new?\nThe first segment of the show focuses on Deno’s Fresh new web framework. Luca Casonato joins Jerod & Feross to talk about Fresh – a next generation web framework, built for speed, reliability, and simplicity.\nIn segment two, AngularJS creator Miško Hevery joins Jerod and KBall to talk about Qwik. He says Qwik is a fundamental rethinking of how a web application should work. And he’s attempting to convince Jerod & KBall that the implications of that are BIG.\nIn t…",
          "link": "https://changelog.com/podcast/509",
          "publishedOn": "2022-10-07T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 509: A new batch of web frameworks emerge!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/509/the-changelog-509.mp3",
            "length": "91427739",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1862",
          "author": null,
          "description": "Hang with Jerod, Nick & KBall while we discuss what’s new & noteworthy in the web world. Cloudflare Turnstile, Linkify 4.0, TC39 updates, the Figma acquisition, Penpot, pay transparency, and more! We might even discuss TypeScript if Nick gets his way…\nDiscuss on Changelog News\nChangelog++ members get a bonus 16 minutes at the end of this episode and zero ads. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. S…",
          "link": "https://changelog.com/jsparty/246",
          "publishedOn": "2022-10-07T19:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 246: 7 pounds of news in a 5 pound bag",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/246/js-party-246.mp3",
            "length": "63867527",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMbp",
          "author": "Adam Stacoviak",
          "description": "After more than half a decade (6+ years), Mastodon.technology is shutting down. The reason? One person is responsible (Ash Furrow) and they’ve hit their limit personally and technically.\nA member of my family was very recently diagnosed with a terminal illness. I am doing everything I can to support them.\nLast week, with yet more Elon Musk and Twitter news, the fediverse generally experienced extra traffic with an influx of new users. I woke up to mastodon.technology downtime alerts. In the midst of supporting my family, I had to ssh into a server and fiddle with settings.\nI am exhausted.\nThe server has also gotten too large and too complex for me to administer. I’ve always been keen to learn the next new skill I need to be an effective admin. But I just don’t have it in me anymore. The monitoring that I have in place is insufficient to solve the current problems and I have zero bandwidth to invest in learning the skills to diagnose and fix the issue.\nAges ago (4 years) we talked with Eugen Rochko on The Changelog (the creator of Mastodon) about the “absolute freedom in how people can run their servers,”  and how the “incentives are usually ideological” when running a Mastodon server.\nYes, we talked about the costs of running a server, but from my recollection that seemed to be purely from a monetary perspective. The costs of running a server are also quite time intensive and those costs needs to be factored in as well.\nDiscuss on Changelog News",
          "link": "https://ashfurrow.com/blog/mastodon-technology-shutdown/",
          "publishedOn": "2022-10-07T16:22:13.000Z",
          "wordCount": null,
          "title": "Mastodon.technology is shutting down",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZodW",
          "author": "Jerod Santo",
          "description": "This is a solid primer on git rebase and the many ways it’s useful.\nIn Git, a rebase is a very versatile and useful tool to rework commits. Use it to achieve a workflow with high-quality changes proposed in high-quality commits and merge requests. It makes your developers and reviewers more efficient. Code reviews and debugging also become easier and more effective.\nDiscuss on Changelog News",
          "link": "https://about.gitlab.com/blog/2022/10/06/take-advantage-of-git-rebase/",
          "publishedOn": "2022-10-07T15:31:00.000Z",
          "wordCount": null,
          "title": "Take advantage of git rebase",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1863",
          "author": null,
          "description": "Join Mat Ryer on his journey to Berlin for GopherCon EU 2022. Along the way he chats with Egon Elbre, Ale Kennedy, Ole Bulbuk, Christian Haas, Bill Kennedy & Ron Evans. Danke!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nEgon Elbre – Twitter, GitHub, LinkedIn\nAle Kennedy – Twitter\nOle Bulbuk – Twitter, GitHub, Website\nChristian Haas – Twitter, GitHub\nBill Kennedy – Twitter, GitHub, Website\nRon Evans – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nGopherCon EU\nGophers Say! GopherCon EU Edition\nTinyGo\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/250",
          "publishedOn": "2022-10-07T14:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 250: Mat's GopherCon EU diary",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/250/go-time-250.mp3",
            "length": "63472965",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qpbd",
          "author": "Adam Stacoviak",
          "description": "This working implementation of text-to-3D (powered by Stable Diffusion) didn’t take six months, like Simon predicted it would. Although I will concede that it’s not a 3D environment that can then go into in a game engine, but I’m sure that’s just a few more weeks away this point.\nFrom the readme:\nThis project is a work-in-progress, and contains lots of differences from the paper. Also, many features are still not implemented now. The current generation quality cannot match the results from the original paper, and many prompts still fail badly!\nDiscuss on Changelog News",
          "link": "https://github.com/ashawkey/stable-dreamfusion",
          "publishedOn": "2022-10-06T17:10:22.000Z",
          "wordCount": null,
          "title": "Dreamfusion! Text-to-3D model powered by Stable Diffusion",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1795",
          "author": null,
          "description": "Matias Pan is a Staff Software Engineer at Lemon Cash, a crypto startup based in Argentina. Lemon infrastructure runs digital wallets & physical cards, which technically makes them a bank. How does Matias & his team think about enabling developers get code from their workstations into production? Remember, we are talking about a bank - a bad deploy is a big deal. And when a bad database migration goes out, what happens then?\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. …",
          "link": "https://changelog.com/shipit/73",
          "publishedOn": "2022-10-06T14:40:00.000Z",
          "wordCount": null,
          "title": "Ship It! 73: A modern bank infrastructure",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/73/ship-it-73.mp3",
            "length": "77029757",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8lrO",
          "author": "Jerod Santo",
          "description": "run npm install -g easy-sharing\nrun sharing /directory-or-file-to-share\nscan the QR code with your phone\n\nDiscuss on Changelog News",
          "link": "https://github.com/parvardegr/sharing",
          "publishedOn": "2022-10-06T13:59:00.000Z",
          "wordCount": null,
          "title": "A CLI to share files directly with iOS and Android devices",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njqo",
          "author": "Jerod Santo",
          "description": "You’re cordially invited to the “Best Booth in the Building”! We’ll be giving away stickers & t-shirts, recording shows, playing video games & awarding one lucky/skilled listener with a FREE Nintendo Switch 🕹\n\nDiscuss on Changelog News",
          "link": "https://youtu.be/Z8DEo4DSoHY",
          "publishedOn": "2022-10-05T20:38:00.000Z",
          "wordCount": null,
          "title": "Come see us at All Things Open!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/oj4l",
          "author": "Jerod Santo",
          "description": "Tapajyoti Bose draws our attention to some obscure-but-useful elements: meter & progress, sup & sub, datalist, map & area, details & summary, object, and abbr\nDiscuss on Changelog News",
          "link": "https://scribe.rip/7-cool-html-elements-nobody-uses-436598d85668",
          "publishedOn": "2022-10-05T17:28:00.000Z",
          "wordCount": null,
          "title": "Cool HTML elements nobody uses",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MbGD",
          "author": "Jerod Santo",
          "description": "If Stable Diffusion has you using metaphors like wizardry, spell casting, and the like, maybe this excellent, illustrated explainer by Jay Alammar will help you distinguish it from magic. 🪄\nDiscuss on Changelog News",
          "link": "https://jalammar.github.io/illustrated-stable-diffusion/",
          "publishedOn": "2022-10-05T16:40:00.000Z",
          "wordCount": null,
          "title": "A gentle introduction to how Stable Diffusion works",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXD9",
          "author": "Jerod Santo",
          "description": "Podinfo is a tiny web application made with Go that showcases best practices of running microservices in Kubernetes.\nThis is used by CNCF projects like Flux and Flagger for end-to-end testing as well as workshops.\nDiscuss on Changelog News",
          "link": "https://github.com/stefanprodan/podinfo",
          "publishedOn": "2022-10-05T15:44:00.000Z",
          "wordCount": null,
          "title": "Podinfo – A Go microservice template for Kubernetes",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lew",
          "author": "Jerod Santo",
          "description": "Diagrams are faster and compact way for knowledge transfer. It’s much easier to convey system architecture with a diagram compared to writing an essay on it.\nDiagrams are especially useful in providing high level overview of software design. Following are the most-widely used diagrams by engineering teams…\nDiscuss on Changelog News",
          "link": "https://github.com/shubhamgrg04/awesome-diagramming",
          "publishedOn": "2022-10-05T14:42:00.000Z",
          "wordCount": null,
          "title": "A collection of diagramming tools used by software engineering teams",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3LeJ",
          "author": "Jerod Santo",
          "description": "When we had Mike Riley on the show back in May, one major deterrent to his pitch that we can/should “run our homes on a Raspberry Pi” is that, well, you couldn’t buy one anywhere.\nIt’s six months later and you still can’t buy one! In this post, Jeff Geerling dives into the why behind that unfortunate fact, gets an official response from RPi, and lays out a few alternatives. One alternative even pleasantly surprised him…\nDiscuss on Changelog News",
          "link": "https://www.jeffgeerling.com/blog/2022/you-cant-buy-raspberry-pi-right-now",
          "publishedOn": "2022-10-04T16:10:00.000Z",
          "wordCount": null,
          "title": "You can't buy a Raspberry Pi right now. Why?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7DR",
          "author": "Oleksii Trekhleb",
          "description": "Minimalistic data structure sketches with links to the code examples on JavaScript\n\nDiscuss on Changelog News",
          "link": "https://okso.app/showcase/data-structures",
          "publishedOn": "2022-10-04T15:22:00.000Z",
          "wordCount": null,
          "title": "Data Structure Sketches",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2leV",
          "author": "Jerod Santo",
          "description": "No, not that Matrix, although I’m sure you could pull this off there as well…\n\nDiscuss on Changelog News",
          "link": "https://github.com/joschuck/matrix-webcam",
          "publishedOn": "2022-10-04T14:28:00.000Z",
          "wordCount": null,
          "title": "Take your next video conference from within the Matrix",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlDy",
          "author": "Jerod Santo",
          "description": "The GNU Debugger is powerful, but it can also be inscrutable at times. Maybe this GUI will help?\n\nDiscuss on Changelog News",
          "link": "https://github.com/epasveer/seer",
          "publishedOn": "2022-10-03T18:36:00.000Z",
          "wordCount": null,
          "title": "Seer – a GUI frontend to gdb",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1864",
          "author": null,
          "description": "Digital Ocean kicks off Hacktoberfest 2022, Divam Gupta releases DiffusionBee 1.0 with “Image To Image” support, Zeno Rocha open sources Dracula UI for React, GitX gets brought back from the brink & Prerender.io engineers save a bundle by moving off AWS.\nOh, and join us at All Things Open in early November!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nHacktoberfest 2022\n\ngithub.com/thechangelog/transcripts\ngithub.com/thechangelog/show-notes\nDiffusionBee\n\n🎧 Mentioned on The Changelog #506\nSource on GitHub\nDracula UI\n\n🎧 Zeno on The Changelog #405\n🎧 Zeno on The Changelog #4248\ngithub.com/gitx/gitx\nPrerender moving away from AWS\n💚 Join us at All Things Open 2022!\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-10-03",
          "publishedOn": "2022-10-03T17:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Hacktoberfest is ON, DiffusionBee is 1.0, Dracula UI is out, GitX is undead, Prerender is off AWS & we'll be at ATO!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-10-03/the-changelog-news-2022-10-03.mp3",
            "length": "11967396",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/dq5E",
          "author": "Jerod Santo",
          "description": "Johannes Schuck holds the opinion that state machines are underrated. So he wrote this:\nThe goal of this list of facts is not to teach you what state machines are or how to use them; there are plenty of other resources for that. Rather, the goal here is to motivate their usage and to highlight things about them that are frequently overlooked, but nonetheless relevant.\nDiscuss on Changelog News",
          "link": "https://github.com/cpressey/Facts-about-State-Machines",
          "publishedOn": "2022-10-03T13:43:00.000Z",
          "wordCount": null,
          "title": "Facts about state machines",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qMDp",
          "author": "Jerod Santo",
          "description": "Tobias Bieniek:\nHave you ever worked with JavaScript? Have you been annoyed by the three hundred copies of left-pad in all of the node_modules folders on your disk? Would you prefer if all of your projects shared their node_modules folders instead of each getting their own copy?\nThe single character that saved him all that space? The p in pnpm…\nDiscuss on Changelog News",
          "link": "https://mainmatter.com/blog/2022/09/29/pnpm",
          "publishedOn": "2022-09-30T20:49:00.000Z",
          "wordCount": null,
          "title": "node_modules: How one character saved 50 GB of disk space",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1833",
          "author": null,
          "description": "This week we turn the mics on ourselves, kind of. Lars Wikman joins the show to give us a guided tour through ID3 esoterica and the shiny new open source Elixir library he developed for us. We talk about what ID3 is, its many versions, what it aims to be and what it could have been, how our library project got started, all the unique features and failed dreams of the ID3v2 spec, how ID3v2 and Podcast 2.0 are solving the problem differently, and how all of this maps back to us giving you (our listeners) a better experience while listening to our shows.\nDiscuss on Changelog News\nChangelog++ members get a bonus 15 minutes at the end of this episode and zero ads. Join today!\nSponsors\nInfluxData – The time series platform for building and operating time series applications — InfluxDB empowers d…",
          "link": "https://changelog.com/podcast/508",
          "publishedOn": "2022-09-30T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 508: A guided tour through ID3 esoterica",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/508/the-changelog-508.mp3",
            "length": "79685048",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/jqDl",
          "author": "Jerod Santo",
          "description": "Jean Yang:\nThere’s clearly a lot of programmer pain. But why we don’t see more tech transfer of these “deep” technologies from research into industry is something I have been thinking about since I was in college, when I decided I wanted to spend my life making programmers’ lives better. Many other fields, from robotics to databases, have clearer paths to commercialization. But when it comes to new programming languages or software analyses, the path of tech transfer is often decades-long, if it exists at all.\nShe goes on to describe a few factors that are in the way of “deep tech” dev tools investing, how some of those things are changing, and how others still need to change.\nDiscuss on Changelog News",
          "link": "https://www.akitasoftware.com/blog-posts/why-arent-there-more-programming-languages-startups",
          "publishedOn": "2022-09-30T19:50:00.000Z",
          "wordCount": null,
          "title": "Why aren't there more programming languages startups?",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1853",
          "author": null,
          "description": "Patformatic co-founders Matteo Collina & Luca Maraschi join Amal & Chris to discuss their just-announced (and we mean just announced) open source database tool: Platformatic DB!\nIt’s a daemon that can turn any PostgreSQL, MySQL, MariaDB, or SQLite database into a REST and GraphQL endpoint. What makes it special is that it allows massive customization thanks to the flexibility of Fastify plugins.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nFeaturing\nMatteo Collina – Twitter, GitHub, Website\nLuca Maraschi – Twitter, GitHub\nAmal Hussein – Twitter, GitHub\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\n🎧 JS Party #197: Fastify served with a refreshing Pino 🍷\nOur first Open Source tool: Platformatic DB\nPlatformatic on GitHub\n@databases\nAdventures in Nodeland\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/245",
          "publishedOn": "2022-09-30T18:20:00.000Z",
          "wordCount": null,
          "title": "JS Party 245: Launching Platformatic DB 🚀",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/245/js-party-245.mp3",
            "length": "60400760",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1808",
          "author": null,
          "description": "We did an episode on functional programming in Go with Aaron Schlesinger back in 2019… But that was before generics were a thing. Let’s revisit the topic and discuss the pros and cons now that we have generics. What’s changed? What hasn’t?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nAaron Schlesinger – Twitter, GitHub, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nGo Time #87: Functional programming?\nDylan Meeus’s GopherCon 2020\nAaron’s GopherCon 2017\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/249",
          "publishedOn": "2022-09-30T16:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 249: Functional programming with generics?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/249/go-time-249.mp3",
            "length": "51999278",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1mJ",
          "author": "Jerod Santo",
          "description": "Dracula UI is a dark-first collection of UI patterns and components. Key features:\nBuilt for Dark Mode:  Most templates are built using light colors and later on adapted to dark colors. Dark themes shouldn’t be an afterthought, they should be a top priority.\nDesigner Friendly: Speed up the prototyping phase by using a highly configurable Design System. Collaborate easily by taking advantage of a carefully crafted Figma file.\nGreat Developer Experience: Don’t worry about class names, just use the Visual Studio Code snippets. You can take advantage of autocomplete and also access the entire documentation right from your code editor.\nDiscuss on Changelog News",
          "link": "https://twitter.com/zenorocha/status/1575476765228560384",
          "publishedOn": "2022-09-30T16:09:00.000Z",
          "wordCount": null,
          "title": "Dracula UI is now free and open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE71",
          "author": "AJ Kerrigan",
          "description": "This is a neat little CLI utility from Kelly Brazil that parses the output of common Unix system commands into JSON/YAML. We’re linking to the latest version (1.22.0) which adds new magic parsers for /proc files. This handy glue-type tool gets one click neater every release!\n\nDiscuss on Changelog News",
          "link": "https://blog.kellybrazil.com/2022/09/27/jc-version-1-22-0-released/",
          "publishedOn": "2022-09-29T19:24:00.000Z",
          "wordCount": null,
          "title": "JC converts the output of popular commands to JSON for easier parsing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgpn",
          "author": "Jerod Santo",
          "description": "Point Refurb at your Python code to see how bad good it is. Here’s the author’s motivation:\nI love doing code reviews: I like taking something and making it better, faster, more elegant, and so on. Lots of static analysis tools already exist, but none of them seem to be focused on making code more elegant, more readable, or more modern. That is where Refurb comes in.\nDiscuss on Changelog News",
          "link": "https://github.com/dosisod/refurb",
          "publishedOn": "2022-09-29T18:37:00.000Z",
          "wordCount": null,
          "title": "A tool for refurbishing and modernizing Python codebases",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2549",
          "author": "Lars Wikman",
          "description": "The podcast moguls of Changelog Media have been keen to introduce chapters into their podcast episodes and they reached out to me for a hand. And would you know, now they have chapters and the Elixir community has a shiny new ID3 tag library.\nChapters are neat, they let you see a Table of Contents, jump to specific parts and similar. The changelog.com site is an open source project built in Elixir. I love working with Elixir. It is a steadily growing but still somewhat niche language and it doesn’t have every library under the sun, only most of them. It hasn’t had a fully fledged ID3v2 library so far. There are a few libraries that let you parse a tag in one specific way, targeting a subset. I haven’t found any that allow writing a tag. To create podcast chapters you need to update the ID3…",
          "link": "https://changelog.com/posts/id3vx-a-library-for-parsing-and-encoding-id3-tags",
          "publishedOn": "2022-09-29T14:30:40.000Z",
          "wordCount": null,
          "title": "Id3vx – a library for parsing and encoding ID3 tags",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1790",
          "author": null,
          "description": "One of our listeners, Andrew Welker, suggested that we talk about Klustered, so a few hours before David Flanagan was about to do his workshop at Container Days, we recorded this episode. We talked about all the weird and wonderful Kubernetes debugging sessions on Klustered, a YouTube playlist with 43 videos and counting.\nWe then talked about Rawkode Academy, and we finished with conferences. Good thing we did, because David almost forgot about KubeHuddle, the conference that he is co-organising next week. Gerhard is looking forward to talking at it! No, seriously, check it out at kubehuddle.com.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly w…",
          "link": "https://changelog.com/shipit/72",
          "publishedOn": "2022-09-29T13:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 72: Klustered & Rawkode Academy",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/72/ship-it-72.mp3",
            "length": "64734951",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/rXZ9",
          "author": "Jerod Santo",
          "description": "MNT Research… is going small for its next project. The MNT Pocket Reform has a seven-inch screen with a clamshell design that, when closed, will be less than five centimeters thick. If its perky purple facade looks a bit retro, that’s no surprise; the Pocket’s inspirations read like a ‘greatest hits’ list of pocketable computers.\nThey’re taking open source seriously:\nMNT’s open-source promise is not limited to an open source operating system or select internal components The Pocket Reform, as with MNT’s full-size Reform laptop, will provide mainboard schematics, 3D models for physical components, and open source drivers, among other things.\nComing soon to a crowd fund near you.\n\nDiscuss on Changelog News",
          "link": "https://spectrum.ieee.org/meet-an-open-source-pc-that-can-fit-in-your-pocket",
          "publishedOn": "2022-09-28T18:27:00.000Z",
          "wordCount": null,
          "title": "MNT's Reform is an open source PC that fits in your pocket",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lVw",
          "author": "Jerod Santo",
          "description": "Zsot Varga explains how Prerender saved $800k annually by removing their reliance on AWS and building in-house infrastructure to handle traffic and cached data. This was no minor migration, and it took months to pull off, but it’s a solid lesson in testing your assumptions.\nThe cloud (which is AWS in most cases) is the default for most businesses today. That’s a good starting place for many reasons, but once you get up and going you may find it’s not the best choice for your business, like the folks at Prerender learned.\nDiscuss on Changelog News",
          "link": "https://scribe.rip/how-we-reduced-our-annual-server-costs-by-80-from-1m-to-200k-by-moving-away-from-aws-2b98cbd21b46",
          "publishedOn": "2022-09-28T17:07:00.000Z",
          "wordCount": null,
          "title": "We reduced our server costs 80% by moving away from AWS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lVw",
          "author": "Jerod Santo",
          "description": "Zsot Varga explains how Prerender saved $800k annually by removing their reliance on AWS and building in-house infrastructure to handle traffic and cached data. This was no minor migration, and it took months to pull off, but it’s a solid lesson in testing your assumptions.\nThe cloud (which is AWS in most cases) is the default for most businesses today. That’s a good starting place for many reasons, but once you get up and going you may find it’s not the best choice for your business, like the folks at Prerender learned.\nDiscuss on Changelog News",
          "link": "https://levelup.gitconnected.com/how-we-reduced-our-annual-server-costs-by-80-from-1m-to-200k-by-moving-away-from-aws-2b98cbd21b46",
          "publishedOn": "2022-09-28T17:07:00.000Z",
          "wordCount": null,
          "title": "We reduced our server costs 80% by moving away from AWS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwoR",
          "author": "Stefan",
          "description": "It’s Hacktoberfest again, but you don’t know where to find interesting projects? This CLI will help you find participating projects based on your starred repositories. Simply run:\nnpx hacktoberfest-hunt\n\nDiscuss on Changelog News",
          "link": "https://github.com/stefanbuck/hacktoberfest-hunt",
          "publishedOn": "2022-09-28T16:21:00.000Z",
          "wordCount": null,
          "title": "Hacktoberfest-hunt CLI",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3LDJ",
          "author": "Jerod Santo",
          "description": "I love that people are bringing HTML back to the forefront:\nOur mission is to enable anyone to build multi-page dynamic web apps while staying as close to the platform as possible. Enhance fills in the gaps to make building for the backend, and the browser a seamless experience for web authors and consumers.\nModern JavaScript frameworks bring more problems than they solve; recreating native web platform features adding unnecessary weight and complexity, which is challenging to unravel.\nEnhance provides a dependable foundation built on standards-based web platform features, allowing developers to create web applications that are lightweight, flexible, and future-proof.\nDiscuss on Changelog News",
          "link": "https://enhance.dev/docs/",
          "publishedOn": "2022-09-27T20:26:00.000Z",
          "wordCount": null,
          "title": "Enhance is a web standards-based HTML framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1860",
          "author": null,
          "description": "It’s one thing to gather some labels for your data. It’s another thing to integrate data labeling into your workflows and infrastructure in a scalable, secure, and useful way. Mark from Xelex joins us to talk through some of what he has learned after helping companies scale their data annotation efforts. We get into workflow management, labeling instructions, team dynamics, and quality assessment. This is a super practical episode!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMark Christensen – LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nXelex.ai\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/195",
          "publishedOn": "2022-09-27T19:40:00.000Z",
          "wordCount": null,
          "title": "Practical AI 195: Production data labeling workflows",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/195/practical-ai-195.mp3",
            "length": "30685243",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7YJQ",
          "author": "Jerod Santo",
          "description": "Vivian Qu states her case as to why Apple’s decision to remove outdated apps from the App Store is dumb, especially for indies like her.\nNever mind the fact that my app has a 5-star rating and was still being downloaded, with no complaints from any of my users. Also disregard the fact that I had other highly-rated apps up on the App Store, some of which had been updated much more recently than July 2019, clearly showing that I have not abandoned these apps entirely. If there had been an actual reviewer who checked my outdated app, they would have discovered that I architected the app from the beginning to dynamically scale the UI so it resizes to fit the latest iPhone devices. All these could be signals that indicate to Apple that this is not a garbage-filled scam app that is lowering the quality of their App Store.\nShe goes on to tell the entire saga that she (and others) were put through to keep their apps on the store. Sometimes an app isn’t outdated, it’s just complete. Ya know?\nDiscuss on Changelog News",
          "link": "https://vivqu.com/blog/2022/09/25/outdated-apps/",
          "publishedOn": "2022-09-27T19:27:00.000Z",
          "wordCount": null,
          "title": "In defense of apps that don’t need updates",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2lkV",
          "author": "Jerod Santo",
          "description": "Michael Knyszek:\nSince our last blog post about the Go GC in 2018 the Go GC, and the Go runtime more broadly, has been steadily improving. We’ve tackled some large projects, motivated by real-world Go programs and real challenges facing Go users. Let’s catch you up on the highlights!\nLots of invisible changes/improvements, but Michael focuses in on a new knob that he’s encouraging gophers to play with: the soft memory limit\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/go119runtime",
          "publishedOn": "2022-09-27T15:04:00.000Z",
          "wordCount": null,
          "title": "4 years of progress on the Go runtime",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rQn",
          "author": "Jerod Santo",
          "description": "This is a great starter snippet for any web page:\nmain {\n  max-width: 38rem;\n  padding: 2rem;\n  margin: auto;\n}\n\nThe linked post explains the why behind these rules and expands with a 100 byte alternative and the comments have a bunch of variants and conversation about each specific rule.\nDiscuss on Changelog News",
          "link": "https://gist.github.com/JoeyBurzynski/617fb6201335779f8424ad9528b72c41",
          "publishedOn": "2022-09-26T16:45:00.000Z",
          "wordCount": null,
          "title": "58 bytes of CSS to look great nearly everywhere",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1859",
          "author": null,
          "description": "Mozilla says Firefox will continue to support current content blockers, Nabeel Suleiman thinks NATS is great and recommends you check it out, InfoQ breaks down Uber’s recent security breach, Klemen Sever explained OAuth2 by drawing cute shapes & Jorge Manrubia reflects back as an aging programmer.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nFirefox will continue to support current content blockers\nNats: You Need it Now!\n\nDwayne Bradley’s comment\nMulti-Factor Authentication Fatigue Key Factor in Uber Breach\nOAuth2 explained with cute shapes\n\n🎧 [Aaron Parecki on The Changelog #456])(https://changelog.fm/456)\nA nice Twitter review\nAging programmer\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-26",
          "publishedOn": "2022-09-26T15:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Firefox supports blockers, NATS is great, Uber's MFA fatigue, OAuth2 drawn in cute shapes & an aging programmer",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-26/the-changelog-news-2022-09-26.mp3",
            "length": "5456100",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lO8m",
          "author": "Daniele Scasciafratte",
          "description": "This book is my condensed personal experience in the last 12 years in various projects, communities and roles in Open Source. Including my best practice, tips and a lot of examples and resources.\nAfter 2 years a new edition is here with new stuff and also available on Amazon Kindle.\nDiscuss on Changelog News",
          "link": "https://daniele.tech/2022/09/contribute-to-open-source-the-right-way-3rd-edition/",
          "publishedOn": "2022-09-26T13:32:00.000Z",
          "wordCount": null,
          "title": "Contribute to open source: the right way 3rd edition (Free 📘)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jz1",
          "author": "Jerod Santo",
          "description": "This project is a web implementation of the raining green code seen in the Matrix franchise. It’s built right on top of the upcoming graphics API WebGPU, but falls back to the functional WebGL wrapper, REGL; its previous Three.js version is maintained in a separate branch.\nI used to spend countless hours in college scouring the web for the best digital rain screen saver for my laptop. Sounds like the author is with me on that:\nThe number of implementations out there of this effect is a testament to the size of the film’s impact on popular culture. For decades, I’ve enjoyed searching for and comparing them from time to time. That’s probably how you arrived here— it’s fun to see what kinds of solutions different people come up with to a problem, when the process is purely recreational and its success is subjective.\nThis one’s really nice and even has a 3D mode. The README says it’s “made with love”, but from what I can tell it’s almost entirely JavaScript. 😜\n\nDiscuss on Changelog News",
          "link": "https://github.com/Rezmason/matrix",
          "publishedOn": "2022-09-26T12:42:00.000Z",
          "wordCount": null,
          "title": "A web-based implementation of The Matrix's digital rain",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1844",
          "author": null,
          "description": "This week we’re talking about product development structures as systems with Lucas da Costa. The last time we had Lucas on the show he was living the text-mode only life, and now we’re more than 3 years later, Lucas has doubled down on all things text mode. Today’s conversation with Lucas maps several ideas he’s shared recently on his blog. We talk about deadlines being pointless, trajectory vs roadmap and the downfall of long-term planning, the practices of daily stand-ups and what to do instead, measuring queues not cycle time, and probably the most controversial of them all — actually talking to your customers. Have you heard? It’s this newly disruptive Agile framework that seems to be working well.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this e…",
          "link": "https://changelog.com/podcast/507",
          "publishedOn": "2022-09-23T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 507: Product development structures as systems",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/507/the-changelog-507.mp3",
            "length": "84133443",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqJ2",
          "author": "Jerod Santo",
          "description": "This looks awesome:\nWe are a group of programmers helping each other build new things, whether it be writing complex encryption programs, or simple ciphers. Our goal is to work together to document and model beautiful, helpful and interesting algorithms using code.\nWe are an open-source community - anyone can contribute. We check each other’s work, communicate and collaborate to solve problems. We strive to be welcoming, respectful, yet make sure that our code follows the latest programming guidelines.\nDiscuss on Changelog News",
          "link": "https://the-algorithms.com/",
          "publishedOn": "2022-09-23T19:16:00.000Z",
          "wordCount": null,
          "title": "Algorithms & data structures implemented in many programming languages",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1842",
          "author": null,
          "description": "We’re back with another 🌶️ spicy YepNope debate! This time, Amelia and KBall are arguing that there’s real value to (continue) using React in 2022, while Amal and special guest (and author of the post which stemmed the whole debate) Josh Collinsworth argue that React’s time leading innovation has passed. Of course, the stance each panelist is taking is assigned ahead of time. Is that how they really feel? Tune in and find out!\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs,…",
          "link": "https://changelog.com/jsparty/244",
          "publishedOn": "2022-09-23T18:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 244: The spicy React debate show 🌶️🌶️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/244/js-party-244.mp3",
            "length": "61050176",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJRR",
          "author": "Jerod Santo",
          "description": "We recently logged jqq (an interactive wrapper around jq), but Ruby means installing it can be a burden. jqp wraps gojq, so it compiles to a universal binary and the UI is pretty compelling as well.\n\nDiscuss on Changelog News",
          "link": "https://github.com/noahgorstein/jqp",
          "publishedOn": "2022-09-23T15:34:00.000Z",
          "wordCount": null,
          "title": "A TUI playground for exploring jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1kJ",
          "author": "Jerod Santo",
          "description": "Unlike the alternatives, Rocketry’s scheduler is statement-based. Rocketry natively supports the same scheduling strategies as the other options, including cron and task pipelining, but it can also be arbitrarily extended using custom scheduling statements.\nThat’s pretty useful! I used to struggle to shove conditionals in to my cron jobs. Example time:\nfrom rocketry.conds import daily, time_of_week\nfrom pathlib import Path\n\n@app.cond()\ndef file_exists(file):\n    return Path(file).exists()\n\n@app.task(daily.after(\"08:00\") & file_exists(\"myfile.csv\"))\ndef do_work():\n    ...\n\nDiscuss on Changelog News",
          "link": "https://github.com/Miksus/rocketry",
          "publishedOn": "2022-09-23T14:46:00.000Z",
          "wordCount": null,
          "title": "A statement-based scheduling framework for Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZokW",
          "author": "Jerod Santo",
          "description": "PyScript is a Pythonic alternative to Scratch, JSFiddle, and other “easy to use” programming frameworks, with the goal of making the web a friendly, hackable place where anyone can author interesting and interactive applications.\nLots of code examples of various apps (clock, repl, todos, etc) here. I love the why behind this effort:\nAs an industry, we have focussed on making the impossible possible, rather than focussing on making the possible accessible to all.\nThey want to bring programming to the 99%. Somebody’s gotta do it…\nDiscuss on Changelog News",
          "link": "https://pyscript.net/",
          "publishedOn": "2022-09-22T19:12:00.000Z",
          "wordCount": null,
          "title": "Create rich Python apps in the browser with HTML",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdlG",
          "author": "Nabeel Sulieman",
          "description": "If you are running Kubernetes, or really any kind of microservice architecture, you will eventually run into challenges with communication and synchronization between your instances. To solve this, I recommend deploying an instance of NATS as part of your initial infrastructure setup.\nNATS is great! I tell you why in this blog post.\nDiscuss on Changelog News",
          "link": "https://nabeel.dev/2022/09/17/nats",
          "publishedOn": "2022-09-22T18:10:00.000Z",
          "wordCount": null,
          "title": "NATS: you need it now!",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1800",
          "author": null,
          "description": "In this episode, we will be exploring interviewing as a Software Engineer. Tips, tricks, and gotchas, as well as potentially some interviewing horror stories and red flags to avoid at all costs. We’re joined by Emma Draper, Engineering Manager at the New York Times based in Arizona, and Kate Jonas, goes by Jonas, Technical Enablement Manager at Datadog based in Denver.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFeaturing\nEmma Draper – GitHub, LinkedIn\nJonas – Twitter, LinkedIn\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/248",
          "publishedOn": "2022-09-22T17:20:00.000Z",
          "wordCount": null,
          "title": "Go Time 248: Engineering interview tips & tricks",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/248/go-time-248.mp3",
            "length": "59508146",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2548",
          "author": "Jerod Santo",
          "description": "Adam and I have wanted our podcasts to have chapters for a looooong time.\nLike, multiple years long.\nThey’re such a great way to navigate and explore an episode. You can skip directly to the subjects that interest you, skip past the ones that don’t, and even discover new parts of the show1 that pique your interest.\nI’m a big chapters user myself; have been ever since the feature was added to my podcast app of choice and some podcasts I listen to added them. But we never put in the work to chapter our podcasts because of various challenges in our way.\nThe challenges\nWe’ve self-hosted (and self-content-managed) our podcasts since 2016. To get that done, we built our own web app because, well, we’re software developers2 and as the saying goes:\nhaters gonna hate, liars gonna lie, developers go…",
          "link": "https://changelog.com/posts/a-new-chapter-for-changelog-podcasts",
          "publishedOn": "2022-09-22T14:47:12.000Z",
          "wordCount": null,
          "title": "A new chapter for Changelog podcasts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jg4n",
          "author": "Jerod Santo",
          "description": "They’re really putting the Open in OpenAI with this one…\nWhisper is an automatic speech recognition (ASR) system trained on 680,000 hours of multilingual and multitask supervised data collected from the web. We show that the use of such a large and diverse dataset leads to improved robustness to accents, background noise and technical language. Moreover, it enables transcription in multiple languages, as well as translation from those languages into English. We are open-sourcing models and inference code to serve as a foundation for building useful applications and for further research on robust speech processing.\nWe might need to give this a spin on our transcripts. Who knows, maybe our next big innovation could be The Changelog in German, French, Spanish, etc!\nDiscuss on Changelog News",
          "link": "https://openai.com/blog/whisper/",
          "publishedOn": "2022-09-22T14:38:00.000Z",
          "wordCount": null,
          "title": "OpenAI introduces Whisper (open source speech recognition)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qpkd",
          "author": "Jerod Santo",
          "description": "Nick Nisi hasn’t played it yet, but he’s already declared TDungon to be the “Game of the Year”…\n\nDiscuss on Changelog News",
          "link": "https://github.com/cassiozen/TDungeon",
          "publishedOn": "2022-09-22T13:52:00.000Z",
          "wordCount": null,
          "title": "A text adventure game that runs on TypeScript's type system",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1600",
          "author": null,
          "description": "Dave Farley, co-author of Continuous Delivery, is back to talk about his latest book, Modern Software Engineering, a Top 3 Software Engineering best seller on Amazon UK this September. Shipping good software starts with you giving yourself permission to do a good job. It continues with a healthy curiosity, admitting that you don’t know, and running many experiments, safely, without blowing everything up. And then there is scope creep…\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear u…",
          "link": "https://changelog.com/shipit/71",
          "publishedOn": "2022-09-21T17:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 71: Modern Software Engineering",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/71/ship-it-71.mp3",
            "length": "79449270",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1ko",
          "author": "Jerod Santo",
          "description": "Dave Rupert brainstorms some new CSS organization acronyms.\nI’m not anti-BEM nor anti-roboclasses, but as we enter a new era for CSS I think we have an opportunity to rethink best practices around architecting CSS. Before we get lost rethinking the wheel, let’s hold on to some good principles from the past decade or so:\nWe want to author in components\nWe generally want low-specificity to avoid collisions\nWe want a bucket of global utility classes/variables for ad-hoc composition or customizations\nWith those principles, let’s dive into some CSS architecture alternatives.\nHe goes on to describe CUBE, HECS, WILS, GPC, and other systems that haven’t even been named yet 😆\nDiscuss on Changelog News",
          "link": "https://daverupert.com/2022/08/modern-alternatives-to-bem/",
          "publishedOn": "2022-09-21T17:07:01.000Z",
          "wordCount": null,
          "title": "Modern alternatives to BEM",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4983",
          "author": "Jerod Santo",
          "description": "iliana etaoin:\nThere is a lot of attention on securing “software supply chains.” The usual approach is that you want to try to avoid security issues in your underlying components from impacting customers of your product; and when they do, you want to be able to respond quickly to fix the issue. The people who care about this class of problem are often software companies. The class of components that are most concerning these companies are ones where unpaid hobbyist maintainers wrote something for themselves with no maintenance plan.\nThis is where the supply chain metaphor — and it is just that, a metaphor — breaks down…\nI think we all know this intrinsically, but it’s easy to forget. iliana goes on to describe feelings I’ve heard expressed by a few maintainers recently:\nI just want to publish software that I think is neat so that other hobbyists can use and learn from it, and I otherwise want to be left the hell alone. I should be allowed to decide if something I wrote is “done”. The focus on securing the “software supply chain” has made it even more likely that releasing software for others to use will just mean more work for me that I don’t benefit from. I reject the idea that a concept so tenuous can be secured in the first place.\nDiscuss on Changelog News",
          "link": "https://iliana.fyi/blog/software-supply-chain/",
          "publishedOn": "2022-09-21T14:16:00.000Z",
          "wordCount": null,
          "title": "There is no “software supply chain”",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM6L",
          "author": "Jerod Santo",
          "description": "The picture below explains it better than I can with words. 👇\n\nDiscuss on Changelog News",
          "link": "https://github.com/dalibo/pg_activity",
          "publishedOn": "2022-09-21T13:28:00.000Z",
          "wordCount": null,
          "title": "pg_activity is like htop for Postgres activity monitoring",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1849",
          "author": null,
          "description": "WeightWatcher, created by Charles Martin, is an open source diagnostic tool for analyzing Neural Networks without training or even test data! Charles joins us in this episode to discuss the tool and how it fills certain gaps in current model evaluation workflows. Along the way, we discuss statistical methods from physics and a variety of practical ways to modify your training runs.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nCharles Martin – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nWeightWatcher\nTalk from the Silicon Valley ACM meetup\nA deep dive into the theory behind WeightWatcher (a talk from ENS)\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/194",
          "publishedOn": "2022-09-20T19:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 194: Evaluating models without test data",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/194/practical-ai-194.mp3",
            "length": "43329620",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/QpLE",
          "author": "Travis Turner",
          "description": "This essential guide is designed to be useful for pretty much any team member: find out why your project would benefit from a shared set of practices and patterns between designers and frontend engineers.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/5-signs-your-project-needs-a-design-system",
          "publishedOn": "2022-09-20T15:53:00.000Z",
          "wordCount": null,
          "title": "5 signs your project needs a design system",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1ld",
          "author": "Adam Stacoviak",
          "description": "Here’s Paul Graham with some wise advice he’s learned from YC’s users — this also tees up a large conversation on this Friday’s episode of The Changelog (talk to your users).\nI recently told applicants to Y Combinator that the best advice I could give for getting in, per word, was. Explain what you’ve learned from users.\nHere’s why that makes sense.\nThat tests a lot of things: whether you’re paying attention to users, how well you understand them, and even how much they need what you’re making.\nBut giving this advice made Paul consider what he has learned from YC’s users (the startups they’ve funded). This one is almost cliché at this point, but still quite true.\nFocus is doubly important for early stage startups, because not only do they have a hundred different problems, they don’t have anyone to work on them except the founders. If the founders focus on things that don’t matter, there’s no one focusing on the things that do.\nDiscuss on Changelog News",
          "link": "http://paulgraham.com/users.html",
          "publishedOn": "2022-09-20T15:04:27.000Z",
          "wordCount": null,
          "title": "What I've learned from users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7oJ",
          "author": "Klemen Sever",
          "description": "We’re currently refurbishing 🙃 our authentication stack at Back Market, and we need to onboard our developers and teams to various OAuth2 concepts. Here’s our take on OAuth2 (with cute shapes.\n\nDiscuss on Changelog News",
          "link": "https://engineering.backmarket.com/oauth2-explained-with-cute-shapes-7eae51f20d38",
          "publishedOn": "2022-09-20T14:35:00.000Z",
          "wordCount": null,
          "title": "OAuth2 explained with cute shapes",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/dev-speed/",
          "author": null,
          "description": "Lest we stagnate",
          "link": "https://blog.comma.ai/dev-speed/",
          "publishedOn": "2022-10-11T00:00:00.000Z",
          "wordCount": 1341,
          "title": "Development speed over everything"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/around-the-globe/google-africa/how-ai-is-helping-african-communities-and-businesses/",
          "author": null,
          "description": "Editor’s note: Last week Google hosted the annual Google For Africa eventas part of our commitment to make the internet more useful in Africa, and to support the communities and businesses that will power Africa’s economic growth. This commitment includes our investment in research. Since announcing the Google AI Research Center in Accra, Ghanain 2018, we have made great strides in our mission to use AI for societal impact. In May we made several exciting announcements aimed at expanding these commitments.\nYossi Matias, VP of Engineering and Research, who oversees research in Africa, spoke with Jeff Dean, SVP of Google Research, who championed the opening of the AI Research Center, about the potential of AI in Africa.\nJeff: It's remarkable how far we've come since we opened the center in A…",
          "link": "https://blog.google/around-the-globe/google-africa/how-ai-is-helping-african-communities-and-businesses/",
          "publishedOn": "2022-10-12T16:00:00.000Z",
          "wordCount": 1537,
          "title": "How  AI is helping African communities and businesses"
        },
        {
          "id": "https://blog.google/technology/health/machine-learning-to-understand-proteins/",
          "author": null,
          "description": "When most people think of proteins, their mind typically goes to protein-rich foods such as steak or tofu. But proteins are so much more. They’re essential to how living things operate and thrive, and studying them can help improve lives. For example, insulin treatments are life-changing for people with diabetes that are based on years of studying proteins.\nThere is a world of information yet to discover when it comes to proteins — from helping people get the healthcare they need to finding ways to protect plant species. Teams at Google are focused on studying proteins so we can realize Google Health’s mission to help billions of people live healthier lives.\nBack in March, we published apost about a model we developed at Google that predicts protein function and a tool that allows scientis…",
          "link": "https://blog.google/technology/health/machine-learning-to-understand-proteins/",
          "publishedOn": "2022-10-11T18:15:00.000Z",
          "wordCount": 1545,
          "title": "How we’re using machine learning to understand proteins"
        },
        {
          "id": "https://blog.google/around-the-globe/google-africa/how-mapping-the-worlds-buildings-makes-a-difference/",
          "author": null,
          "description": "In Lamwo district, in northern Uganda, providing access to electricity is a challenge. In a country where only about 24% of the population has a power supply to their home from the national grid, the rate in Lamwo is even lower. This is partly due to lack of information: The government doesn’t have precise data about where settlements are located, what types of buildings there are, and what the buildings’ electricity needs might be. And canvassing the area isn’t practical, because the roads require four-wheel-drive vehicles and are impassable in the rain.\nErnest Mwebaze leads Sunbird AI, a Ugandan nonprofit that uses data technology for social good. They’re assessing areas in Lamwo district to support planning at the Ministry of Energy in Uganda. “There are large areas to plan for,” explai…",
          "link": "https://blog.google/around-the-globe/google-africa/how-mapping-the-worlds-buildings-makes-a-difference/",
          "publishedOn": "2022-10-11T12:00:00.000Z",
          "wordCount": 1494,
          "title": "How mapping the world’s buildings makes a difference"
        },
        {
          "id": "https://blog.google/outreach-initiatives/google-org/world-mental-health-day-2022/",
          "author": null,
          "description": "The World Health Organization (WHO) estimates that nearly 1 billion people are living with a mental disorder, worldwide. During the global pandemic, the world saw a 25% increase in the prevalence of anxiety and depression. There was even a corresponding spike in searches on Google for mental health resources — which is a trend that continues to climb each year. To help people connect with timely, life-saving information and resources and to empower them to take action on their mental health needs, teams of Googlers are working — inside and outside of the company — to make sure everyone has access to mental health support.\n\n\nConnecting people to resources on Search and YouTube\nBefore we can connect people to timely information and resources, we need to understand their intent when they turn…",
          "link": "https://blog.google/outreach-initiatives/google-org/world-mental-health-day-2022/",
          "publishedOn": "2022-10-10T16:00:00.000Z",
          "wordCount": 1430,
          "title": "Meeting global mental health needs, with technology's help"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=20153",
          "author": "Daniel Stenberg",
          "description": "I am happy to announce that curl receives funding from The Sovereign Tech Fund. This funding is directed towards three specific projects that we have identified as interesting and worthwhile to push forward as ways to improve curl and the life of curl users. This “investment” will fund two developers to work on curl over … Continue reading Funded curl improvements →",
          "link": "https://daniel.haxx.se/blog/2022/10/19/funded-curl-improvements/",
          "publishedOn": "2022-10-19T06:59:35.000Z",
          "wordCount": 1333,
          "title": "Funded curl improvements"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20422",
          "author": "Daniel Stenberg",
          "description": "tldr: we do not particular keep track nor document curl’s exact spec compliance. I cannot fathom how we could. Today, in October 2022, curl and libcurl combined consist of nearly 150,000 lines of source code (not counting blank lines). 19% of those are comments. This source code pile was carefully crafted with the sole purpose … Continue reading Deviating from specs →",
          "link": "https://daniel.haxx.se/blog/2022/10/18/deviating-from-specs/",
          "publishedOn": "2022-10-18T12:19:33.000Z",
          "wordCount": 1401,
          "title": "Deviating from specs"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20379",
          "author": "Daniel Stenberg",
          "description": "To celebrate the hubris-infested comment from a few years ago, I created this book cover mock up. Turned out very popular on Twitter.",
          "link": "https://daniel.haxx.se/blog/2022/10/14/rewriting-curl-in-three-days/",
          "publishedOn": "2022-10-14T11:52:11.000Z",
          "wordCount": 268,
          "title": "Rewriting curl in three days"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20387",
          "author": "Daniel Stenberg",
          "description": "An HTTP cookie, is just a name + value pair sent from the server to the client. That pair is stored and is sent back to the server in subsequent requests when conditions match. Cookies were first invented and used in the 1990s. Sources seem to agree that the first browser to support them, was … Continue reading There is a tab in my cookie →",
          "link": "https://daniel.haxx.se/blog/2022/10/14/there-is-a-tab-in-my-cookie/",
          "publishedOn": "2022-10-14T08:06:09.000Z",
          "wordCount": 1475,
          "title": "There is a tab in my cookie"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19536",
          "author": "Daniel Stenberg",
          "description": "Already when the first version of curl shipped in 1998, I had plans and ideas in the back of my head to turn it to a library at some point. I had already before worked on providing libraries with APIs for applications and I appreciated their powers. During the summer of 2000 I refactored the … Continue reading The first 300 setopts →",
          "link": "https://daniel.haxx.se/blog/2022/09/28/the-first-300-setopts/",
          "publishedOn": "2022-09-28T11:55:36.000Z",
          "wordCount": 1011,
          "title": "The first 300 setopts"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20284",
          "author": "Daniel Stenberg",
          "description": "Tldr; test and verify as much as possible also in the documentation. I’m a sloppy typist. When I write several words in a row, like for example when creating complete sentences for something like a blog post, one or two of the words end up slightly misspelled. Sure, many editors and systems have runtime spellchecks … Continue reading Taking curl documentation quality up one more notch →",
          "link": "https://daniel.haxx.se/blog/2022/09/22/taking-curl-documentation-quality-up-one-more-notch/",
          "publishedOn": "2022-09-22T07:27:14.000Z",
          "wordCount": 1821,
          "title": "Taking curl documentation quality up one more notch"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-10-16T12:22:09.700Z",
          "wordCount": 1274,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-10-16T12:22:09.681Z",
          "wordCount": 884,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2022-10-15T12:22:17.516Z",
          "wordCount": 1708,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-10-12T12:25:35.704Z",
          "wordCount": 825,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-10-06T12:25:35.675Z",
          "wordCount": 1326,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-10-05T12:23:35.422Z",
          "wordCount": 1606,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-10-03T12:27:22.391Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-10-01T12:22:12.675Z",
          "wordCount": 1488,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-09-21T12:25:03.166Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-09-20T12:26:13.738Z",
          "wordCount": 1356,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47924",
          "author": "Gabriele Svelto",
          "description": "If you're running Firefox on macOS you might have noticed that its responsiveness has improved significantly in version 103, especially if you've got a lot of tabs, or when your machine is busy running other applications at the same time. This improvement was achieved via a small change in how locking is implemented within Firefox's memory allocator.\nThe post Improving Firefox responsiveness on macOS appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/10/improving-firefox-responsiveness-on-macos/",
          "publishedOn": "2022-10-10T15:13:02.000Z",
          "wordCount": 1557,
          "title": "Improving Firefox responsiveness on macOS"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=67904",
          "author": "Taylor Blau",
          "description": "Upgrade your local installation of Git, especially when cloning with --recurse-submodules from untrusted repositories, or if you use git shell interactive mode.",
          "link": "https://github.blog/2022-10-18-git-security-vulnerabilities-announced/",
          "publishedOn": "2022-10-18T17:11:45.000Z",
          "wordCount": 960,
          "title": "Git security vulnerabilities announced"
        },
        {
          "id": "https://github.blog/?p=67900",
          "author": "Hirsch Singhal",
          "description": "Fine-grained personal access tokens offer enhanced security to developers and organization owners, to reduce the risk to your data of compromised tokens.",
          "link": "https://github.blog/2022-10-18-introducing-fine-grained-personal-access-tokens-for-github/",
          "publishedOn": "2022-10-18T15:35:02.000Z",
          "wordCount": 1610,
          "title": "Introducing fine-grained personal access tokens for GitHub"
        },
        {
          "id": "https://github.blog/?p=67882",
          "author": "Mala Kumar",
          "description": "Read about how the GitHub Social Impact, Tech for Social Good and Policy teams participated in the 77th session of the United Nations General Assembly, including events we hosted with the World Health Organization and the UN Development Programme.",
          "link": "https://github.blog/2022-10-17-github-at-the-77th-united-nations-general-assembly/",
          "publishedOn": "2022-10-17T17:00:54.000Z",
          "wordCount": 1527,
          "title": "GitHub at the 77th United Nations General Assembly"
        },
        {
          "id": "https://github.blog/?p=67859",
          "author": "Laura Paine",
          "description": "Having a robust security plan is key to innovation. These tips will empower you to gain the upper hand on cyberattacks, so you can ship quickly and innovate with ease.",
          "link": "https://github.blog/2022-10-17-5-tips-for-embedding-security-into-your-workflows/",
          "publishedOn": "2022-10-17T15:00:47.000Z",
          "wordCount": 1252,
          "title": "5 tips for embedding security into your workflows"
        },
        {
          "id": "https://github.blog/?p=67815",
          "author": "Mike Linksvayer",
          "description": "GitHub is sponsoring Open Source Initiative’s Deep Dive: AI because we think it’s important for the community to unpack how open source software, process, and principles can help best deliver on the promise of AI.",
          "link": "https://github.blog/2022-10-14-osis-deep-dive-is-an-essential-discussion-on-the-future-of-ai-and-open-source/",
          "publishedOn": "2022-10-14T16:00:41.000Z",
          "wordCount": 1849,
          "title": "OSI’s Deep Dive is an essential discussion on the future of AI and open source"
        },
        {
          "id": "https://github.blog/?p=67795",
          "author": "Daniel Shanahan",
          "description": "Learn about using GitHub Advanced Security (GHAS) alerts with Security Information and Events Management (SIEM) tools. Check out the integrations, and read more about getting started.",
          "link": "https://github.blog/2022-10-13-introducing-github-advanced-security-siem-integrations-for-security-professionals/",
          "publishedOn": "2022-10-13T19:25:03.000Z",
          "wordCount": 1407,
          "title": "Introducing GitHub Advanced Security SIEM integrations for security professionals"
        },
        {
          "id": "https://github.blog/?p=67767",
          "author": "Derrick Stolee",
          "description": "New to Git v2.38, Scalar is a built-in repository manager for large repos. Here, we’ll tell the story of how Scalar went from a rough VFS for Git successor to a fully-integrated Git tool, with all of the engineering lessons learned in the process.",
          "link": "https://github.blog/2022-10-13-the-story-of-scalar/",
          "publishedOn": "2022-10-13T15:00:12.000Z",
          "wordCount": 4629,
          "title": "The Story of Scalar"
        },
        {
          "id": "https://github.blog/?p=67730",
          "author": "Laura Lindeman",
          "description": "Explore 80+ content sessions delivered by over 120 different speakers, across two days and four content tracks, all designed to level up your skills.",
          "link": "https://github.blog/2022-10-11-the-github-universe-2022-agenda-is-live/",
          "publishedOn": "2022-10-11T19:39:36.000Z",
          "wordCount": 1446,
          "title": "The GitHub Universe 2022 agenda is live"
        },
        {
          "id": "https://github.blog/?p=67648",
          "author": "Brittany O'Shea",
          "description": "Developers can now view GitHub code scanning findings directly in VS Code and GitHub Codespaces. The new Microsoft SARIF Viewer extension gives developers direct access to their code scanning results, making remediating vulnerabilities easier than ever.",
          "link": "https://github.blog/2022-10-11-view-github-code-scanning-findings-directly-in-vs-code-and-github-codespaces/",
          "publishedOn": "2022-10-11T19:10:12.000Z",
          "wordCount": 972,
          "title": "View GitHub code scanning findings directly in VS Code and GitHub Codespaces"
        },
        {
          "id": "https://github.blog/?p=67715",
          "author": "Candy Ho",
          "description": "Stay connected and up to date on your work with GitHub Projects on GitHub Mobile, now in public beta.",
          "link": "https://github.blog/2022-10-11-on-the-go-with-github-projects-on-github-mobile-public-beta/",
          "publishedOn": "2022-10-11T16:00:52.000Z",
          "wordCount": 905,
          "title": "On the go with GitHub Projects on GitHub Mobile (public beta)"
        },
        {
          "id": "https://github.blog/?p=67632",
          "author": "Peter Cihon",
          "description": "We’re excited that the World Intellectual Property Organization (WIPO) has launched the 2022 edition of its Global Innovation Index (GII) with an indicator of developer creative outputs based on GitHub commits.",
          "link": "https://github.blog/2022-10-06-developers-are-now-included-in-the-wipo-global-innovation-index/",
          "publishedOn": "2022-10-06T21:00:36.000Z",
          "wordCount": 714,
          "title": "Developers are now included in the WIPO Global Innovation Index"
        },
        {
          "id": "https://github.blog/?p=67596",
          "author": "Eric Tooley",
          "description": "Cross-platform apps built with the popular Flutter toolkit can now benefit from Dependabot alerts.",
          "link": "https://github.blog/2022-10-06-githubs-supply-chain-security-features-now-support-dart/",
          "publishedOn": "2022-10-06T18:00:44.000Z",
          "wordCount": 970,
          "title": "GitHub’s supply chain security features now support Dart"
        },
        {
          "id": "https://github.blog/?p=67439",
          "author": "Lee Reilly",
          "description": "The eleventh annual js13kGames coding competition, challenging participants to create games in 13kB or less of JavaScript in a month, just wrapped up. This post highlights the top thirteen entries.",
          "link": "https://github.blog/2022-10-06-js13k-2022-winners/",
          "publishedOn": "2022-10-06T07:01:42.000Z",
          "wordCount": 1231,
          "title": "js13kGames 2022 winners 🏆"
        },
        {
          "id": "https://github.blog/?p=67546",
          "author": "Brittany O'Shea",
          "description": "Learn how you can seamlessly define trusted custom secret patterns to detect secrets unique to your organization with GitHub Advanced Security.",
          "link": "https://github.blog/2022-10-05-detect-secrets-in-your-code-more-accurately-with-dry-runs-for-custom-patterns/",
          "publishedOn": "2022-10-05T18:00:51.000Z",
          "wordCount": 1104,
          "title": "Detect secrets in your code more accurately with dry runs for custom patterns now available in GitHub Advanced Security"
        },
        {
          "id": "https://github.blog/?p=67485",
          "author": "Jakub Oleksy",
          "description": "In September, we experienced one incident that resulted in degraded performance across GitHub services. We also experienced one incident resulting in significant impact to Codespaces. We are still investigating that incident and will include it in next month’s report. This report also sheds light into an incident that impacted Codespaces in August and an incident that impacted Actions in August.",
          "link": "https://github.blog/2022-10-05-github-availability-report-september-2022/",
          "publishedOn": "2022-10-05T16:00:34.000Z",
          "wordCount": 1387,
          "title": "GitHub Availability Report: September 2022"
        },
        {
          "id": "https://github.blog/?p=67540",
          "author": "Ashley Bass",
          "description": "Develop your design and collaboration skills to get your clever intentions off the ground.",
          "link": "https://github.blog/2022-10-05-working-on-a-creative-project-unleash-your-originality-and-start-to-tinker-with-the-aspiring-creatives-experience/",
          "publishedOn": "2022-10-05T15:00:22.000Z",
          "wordCount": 697,
          "title": "Working on a creative project? Unleash your originality and start to tinker with the Aspiring Creatives Experience"
        },
        {
          "id": "https://github.blog/?p=67515",
          "author": "Laura Lindeman",
          "description": "GitHub Universe is back and more robust than ever, with two great ways to engage with everything this global developer event has to offer.",
          "link": "https://github.blog/2022-10-05-two-ways-you-can-experience-github-universe/",
          "publishedOn": "2022-10-05T13:01:44.000Z",
          "wordCount": 1440,
          "title": "Two ways you can experience GitHub Universe"
        },
        {
          "id": "https://github.blog/?p=67479",
          "author": "Abby Cabunoc Mayes",
          "description": "Give back to open source projects during the month of October! This year, we’re encouraging more than code contributions: writing, design, advocacy, and financial donations.",
          "link": "https://github.blog/2022-10-04-expand-your-open-source-contributions-during-hacktoberfest-2022/",
          "publishedOn": "2022-10-04T12:00:20.000Z",
          "wordCount": 726,
          "title": "Expand your open source contributions during Hacktoberfest 2022"
        },
        {
          "id": "https://github.blog/?p=67386",
          "author": "Taylor Blau",
          "description": "Another new release of Git is here! Take a look at some of our highlights on what's new in Git 2.38.",
          "link": "https://github.blog/2022-10-03-highlights-from-git-2-38/",
          "publishedOn": "2022-10-03T18:01:04.000Z",
          "wordCount": 2724,
          "title": "Highlights from Git 2.38"
        },
        {
          "id": "https://github.blog/?p=67361",
          "author": "Shelley McKinley",
          "description": "Access to the open internet is essential to defending human rights, and developers have an important role in promoting freedom of expression and transparency. GitHub is committed to keeping Iranians connected to the global developer community.",
          "link": "https://github.blog/2022-09-29-github-supports-internet-freedom-and-global-availability-in-iran/",
          "publishedOn": "2022-09-29T19:11:29.000Z",
          "wordCount": 1014,
          "title": "GitHub supports internet freedom and global availability in Iran"
        },
        {
          "id": "https://github.blog/?p=67322",
          "author": "Klint Finley",
          "description": "Tech can be a tricky industry (to say the least). We talked with three tech professionals who share why they stay, what has helped them the most, and the power of switching things up.",
          "link": "https://github.blog/2022-09-29-after-the-offer-staying-in-tech-long-term/",
          "publishedOn": "2022-09-29T16:00:27.000Z",
          "wordCount": 2821,
          "title": "After the offer: staying in tech long-term"
        },
        {
          "id": "https://github.blog/?p=67292",
          "author": "Kevin Alwell",
          "description": "Learn best practices on how to roll out centrally managed, developer-centric application security with a third party CI/CD system like Jenkins or ADO.",
          "link": "https://github.blog/2022-09-28-best-practices-on-rolling-out-code-scanning-at-enterprise-scale/",
          "publishedOn": "2022-09-28T16:00:38.000Z",
          "wordCount": 1891,
          "title": "Best practices on rolling out code scanning at enterprise scale"
        },
        {
          "id": "https://github.blog/?p=67265",
          "author": "Ashley Bass",
          "description": "Three new Campus Experts are joining the fall 2022 batch of the MLH Fellowship to work with open source maintainers and get real-world experience.",
          "link": "https://github.blog/2022-09-23-meet-the-github-campus-experts-selected-for-the-fall-2022-mlh-fellowship-cohort-powered-by-github/",
          "publishedOn": "2022-09-23T16:56:19.000Z",
          "wordCount": 1476,
          "title": "Meet the GitHub Campus Experts selected for the fall 2022 MLH Fellowship Cohort, powered by GitHub"
        },
        {
          "id": "https://github.blog/?p=67240",
          "author": "Garrett Wood",
          "description": "We’re launching GitHub for Startups to give your startup the tools needed to go from idea to unicorn status on the world's largest developer platform.",
          "link": "https://github.blog/2022-09-22-github-for-startups-is-generally-available/",
          "publishedOn": "2022-09-22T16:00:13.000Z",
          "wordCount": 922,
          "title": "GitHub for Startups is generally available"
        },
        {
          "id": "https://github.blog/?p=67209",
          "author": "Alexis Wales",
          "description": "On September 16, GitHub Security learned that threat actors were targeting GitHub users with a phishing campaign by impersonating CircleCI to harvest user credentials and two-factor codes. While GitHub itself was not affected, the campaign has impacted many victim organizations.",
          "link": "https://github.blog/2022-09-21-security-alert-new-phishing-campaign-targets-github-users/",
          "publishedOn": "2022-09-21T21:49:50.000Z",
          "wordCount": 939,
          "title": "Security alert: new phishing campaign targets GitHub users"
        },
        {
          "id": "https://github.blog/?p=67194",
          "author": "Toya East",
          "description": "Students have the opportunity to connect with GitHub employees at GitHub Universe 2022 through Micro-Mentoring sessions hosted by GitHub Social Impact.",
          "link": "https://github.blog/2022-09-21-applications-for-micro-mentoring-at-github-universe-2022-are-now-live/",
          "publishedOn": "2022-09-21T16:00:36.000Z",
          "wordCount": 950,
          "title": "Applications for micro-mentoring at GitHub Universe 2022 are now live"
        },
        {
          "id": "https://github.blog/?p=67221",
          "author": "Robb Mapp",
          "description": "The ReadME Project & Podcast evolve with community expert voices and topics to stoke discussion about the culture and craft of software development.",
          "link": "https://github.blog/2022-09-21-the-readme-project-built-for-you/",
          "publishedOn": "2022-09-21T14:00:21.000Z",
          "wordCount": 951,
          "title": "The ReadME Project: Built for you!"
        },
        {
          "id": "https://github.blog/?p=67225",
          "author": "Shelley McKinley",
          "description": "As the home for developers, we understand the key role our communities play in steering digital transformation and maintaining societal infrastructure. That's why we choose to drive and support policies and initiatives like the Copenhagen Pledge on Tech for Democracy. We're committed to working with like-minded organizations, governments, and civil society to make digital technologies work for democracy and human rights, and we encourage you to join us in this pledge.",
          "link": "https://github.blog/2022-09-21-why-we-signed-the-copenhagen-pledge-on-tech-for-democracy/",
          "publishedOn": "2022-09-21T13:30:32.000Z",
          "wordCount": 838,
          "title": "Why we signed the Copenhagen Pledge on Tech for Democracy"
        },
        {
          "id": "https://github.blog/?p=67153",
          "author": "Chris Reddington",
          "description": "Go beyond knowing GitHub as the home of open source and explore how GitHub Enterprise can help you transform your software engineering organization and practices.",
          "link": "https://github.blog/2022-09-20-transform-your-software-engineering-practices-with-github-enterprise/",
          "publishedOn": "2022-09-20T18:00:31.000Z",
          "wordCount": 1707,
          "title": "Transform your software engineering practices with GitHub Enterprise"
        },
        {
          "id": "https://github.blog/?p=67102",
          "author": "Jon Evans",
          "description": "GitHub this month installed a massive steel vault, etched with striking AI-generated art, deep within an Arctic mountain, finalizing its Arctic Code Vault. This vault contains the 188 reels of hardened archival film which will preserve the 02/02/202 snapshot of every active public GitHub repository for 1,000 years. It also now includes a Tech Tree, a human-readable selection of works describing software, computers, and their foundational technologies, along with full-text copies of Wikipedia, Stack Overflow, and other data sources.",
          "link": "https://github.blog/2022-09-20-if-you-dont-make-it-beautiful-its-for-sure-doomed-putting-the-vault-in-githubs-arctic-code-vault/",
          "publishedOn": "2022-09-20T16:00:50.000Z",
          "wordCount": 1135,
          "title": "“If you don’t make it beautiful, it’s for sure doomed”: putting the Vault in GitHub’s Arctic Code Vault"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19498",
          "author": "Georgia Anunciação - Technical Writer at Nubank",
          "description": "Clojure’s history is beautiful and simple in code. Nubank has a lot of reasons to say: happy birthday, Clojure!\nThe post Clojure 15th Anniversary: A Retrospective appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/clojure-15th-anniversary-a-retrospective/",
          "publishedOn": "2022-10-17T18:25:07.000Z",
          "wordCount": 3969,
          "title": "Clojure 15th Anniversary: A Retrospective"
        },
        {
          "id": "https://building.nubank.com.br/?p=19483",
          "author": "Tutz Dias - Senior UX Research at Nubank",
          "description": "UX Researcher helps the design and business teams to learn from our clients, and uses this data and knowledge to design the best products.\nThe post What is it like to be an UX Researcher at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/ux-researcher-at-nubank/",
          "publishedOn": "2022-10-14T16:52:52.000Z",
          "wordCount": 3292,
          "title": "What is it like to be an UX Researcher at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19326",
          "author": "Gabriel Assis - Business Analytics Manager at Nubank",
          "description": "Business Analysts are people passionate about immersing themselves into numbers and helping define the company's next steps. Find out about the daily routine of this career in this article.\nThe post What is it like being a Business Analyst at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/business-analyst-at-nubank/",
          "publishedOn": "2022-10-07T21:49:05.000Z",
          "wordCount": 3207,
          "title": "What is it like being a Business Analyst at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19288",
          "author": "Sócrates Lopes - Engineering Manager at Nubank",
          "description": "Nubank has joined Open Finance, a Central Bank system that allows customers to share their data from one institution to another in a secure and efficient way, among other applications.\nThe post Building Open Finance at Nubank: a view behind the scenes  appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/building-open-finance-at-nubank/",
          "publishedOn": "2022-10-05T19:08:17.000Z",
          "wordCount": 3868,
          "title": "Building Open Finance at Nubank: a view behind the scenes"
        },
        {
          "id": "https://building.nubank.com.br/?p=19184",
          "author": "Ana Martinazzo - Sr. Machine Learning Engineer",
          "description": "A mini roadmap on when and how to build real-time machine learning systems\nThe post Real-time machine learning models in real life appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/real-time-machine-learning-models-in-real-life/",
          "publishedOn": "2022-09-23T15:14:59.000Z",
          "wordCount": 4420,
          "title": "Real-time machine learning models in real life"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/meeting-mediation-team-h1-702",
          "author": "HackerOne",
          "description": "Hello world, we are the Mediation Team.\nFor those who don’t know what we do - we are here to help the ethical hacking community and custome",
          "link": "https://www.hackerone.com/hackerone-community-blog/meeting-mediation-team-h1-702",
          "publishedOn": "2022-10-18T15:28:58.000Z",
          "wordCount": 1031,
          "title": "Meeting the Mediation Team at H1-702"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/introducing-hackerone-assets",
          "author": "Naz Bozdemir",
          "description": "Understanding where the critical flaws lie within your organization's attack surface is critical—but complicated. After all, your attack surface includes your infrastructure, network, software, applications, devices, and the extended supply chain. But it doesn’t stop there. Digital transformation, cloud adoption, the shift to remote work, mergers and acquisitions (M&A), and shadow IT further muddy the waters for today’s security leaders.",
          "link": "https://www.hackerone.com/vulnerability-management/introducing-hackerone-assets",
          "publishedOn": "2022-10-13T16:00:00.000Z",
          "wordCount": 1015,
          "title": "Introducing HackerOne Assets"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/corb3nik-introduces-his-tool-caido",
          "author": "jesse@hackerone.com",
          "description": "So, who is Corb3nik?\nMy name is Ian, also known as Corb3nik on social media. I’m a long time CTF enthusiast and bug bounty hunter. Currentl",
          "link": "https://www.hackerone.com/hackerone-community-blog/corb3nik-introduces-his-tool-caido",
          "publishedOn": "2022-10-13T15:38:07.000Z",
          "wordCount": 1181,
          "title": "Corb3nik Introduces His Tool: Caido"
        },
        {
          "id": "https://hackerone.com/ethical-hacker/thank-you-hacker-community-hackerone",
          "author": "HackerOne",
          "description": "When I joined HackerOne last year, the vitality of the hacker community drew me to this organization. And as Chief Hacking Officer, I see the impact t",
          "link": "https://www.hackerone.com/ethical-hacker/thank-you-hacker-community-hackerone",
          "publishedOn": "2022-10-11T15:00:00.000Z",
          "wordCount": 1271,
          "title": "A Thank You to the Hacker Community, From HackerOne"
        },
        {
          "id": "https://hackerone.com/bounty/tiktok-celebrates-two-years-bug-bounty",
          "author": "HackerOne",
          "description": "TikTok, a social media giant with more than 1 billion active monthly users, understands the importance of a global community, be that community TikTokers or ethical hackers!  In 2020, TikTok launched its public bug bounty program on HackerOne. In the two years since, they’ve taken many steps to maintain a partnership with the global hacker community that’s rewarding and inviting.",
          "link": "https://www.hackerone.com/bounty/tiktok-celebrates-two-years-bug-bounty",
          "publishedOn": "2022-10-11T14:00:00.000Z",
          "wordCount": 1242,
          "title": "TikTok Celebrates Two Years of Bug Bounty"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/lets-celebrate-hacker-community",
          "author": "HackerOne",
          "description": "October is Cybersecurity Awareness Month, but at HackerOne, we’ve decided it should be Hacker Awareness Month. We want to spend October celebratin",
          "link": "https://www.hackerone.com/hackerone-community-blog/lets-celebrate-hacker-community",
          "publishedOn": "2022-10-04T13:00:00.000Z",
          "wordCount": 685,
          "title": "Let’s Celebrate the Hacker Community"
        },
        {
          "id": "https://hackerone.com/bounty/announcing-results-hack-us",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/bounty/announcing-results-hack-us",
          "publishedOn": "2022-09-29T13:00:00.000Z",
          "wordCount": 609,
          "title": "Announcing the Results of Hack U.S."
        },
        {
          "id": "https://hackerone.com/pentests/use-hackerones-enhanced-pentest-service-streamline-security-testing",
          "author": "Sean Ryan",
          "description": "New capabilities improve pentesting to increase attack resistance\nThe enhanced features drive robust security testing practices with the ability to",
          "link": "https://www.hackerone.com/pentests/use-hackerones-enhanced-pentest-service-streamline-security-testing",
          "publishedOn": "2022-09-27T23:00:00.000Z",
          "wordCount": 1084,
          "title": "Use Hackerone’s Enhanced Pentest as a Service to Streamline Security Testing"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/rise-internet-bug-bounty",
          "author": "jesse@hackerone.com",
          "description": "Are you a veteran hacker, someone who loves code review, or looking to get your first CVE? Then, I have something to share with you. Let's talk abou",
          "link": "https://www.hackerone.com/hackerone-community-blog/rise-internet-bug-bounty",
          "publishedOn": "2022-09-23T17:23:23.000Z",
          "wordCount": 997,
          "title": "Rise of Internet Bug Bounty"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/aaa2b41b800c",
          "author": "Netflix Technology Blog",
          "description": "by Jun He, Akash Dwivedi, Natallia Dzenisenka, Snehal Chennuru, Praneeth Yenugutala, Pawan Dixit",
          "link": "https://netflixtechblog.com/orchestrating-data-ml-workflows-at-scale-with-netflix-maestro-aaa2b41b800c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-18T20:43:36.000Z",
          "wordCount": 2953,
          "title": "Orchestrating Data/ML Workflows at Scale With Netflix Maestro"
        },
        {
          "id": "https://medium.com/p/6253603880a6",
          "author": "Netflix Technology Blog",
          "description": "A conversation between Travis Brooks, Netflix Product Manager for Experimentation Platform, and George Khachatryan, OfferFit CEO",
          "link": "https://netflixtechblog.com/how-product-teams-can-build-empathy-through-experimentation-6253603880a6?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-12T20:56:33.000Z",
          "wordCount": 1858,
          "title": "How Product Teams Can Build Empathy Through Experimentation"
        },
        {
          "id": "https://medium.com/p/1abf249ba95f",
          "author": "Netflix Technology Blog",
          "description": "by Kostas Christidis",
          "link": "https://netflixtechblog.com/timestone-netflixs-high-throughput-low-latency-priority-queueing-system-with-built-in-support-1abf249ba95f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-09-28T15:40:35.000Z",
          "wordCount": 2309,
          "title": "Timestone: Netflix’s High-Throughput, Low-Latency Priority Queueing System with Built-in Support…"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}