{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/02/mitigating-kernel-risks-on-32-bit-arm.html",
          "author": null,
          "description": "Posted by Ard Biesheuvel, Google Open Source Security Team \n\nLinux kernel support for the 32-bit ARM architecture was contributed in the late 90s, when there was little corporate involvement in Linux development, and most contributors were students or hobbyists, tinkering with development boards, often without much in the way of documentation.\n\n\nNow 20+ years later, 32-bit ARM's maintainer has downgraded its support level to 'odd fixes,' while remaining active as a kernel contributor. This is a common pattern for aging and obsolete architectures: corporate funding for Linux kernel development has tremendously increased the pace of development, but only for architectures with a high return on investment. As a result, the 32-bit ARM port of Linux is essentially in maintenance-only mode, and …",
          "link": "http://security.googleblog.com/2022/02/mitigating-kernel-risks-on-32-bit-arm.html",
          "publishedOn": "2022-02-23T17:00:00.012Z",
          "wordCount": 1805,
          "title": "Mitigating kernel risks on 32-bit ARM"
        },
        {
          "id": "http://security.googleblog.com/2022/02/roses-are-red-violets-are-blue-giving.html",
          "author": null,
          "description": "Posted by Eduardo Vela, Vulnerability Matchmaker \n\nUntil December 31 2022 we will pay 20,000 to 91,337 USD for exploits of vulnerabilities in the Linux Kernel, Kubernetes, GKE or kCTF that are exploitable on our test lab.\nWe launched an expansion of kCTF VRP on November 1, 2021 in which we paid 31,337 to 50,337 USD to those that are able to compromise our kCTF cluster and obtain a flag. We increased our rewards because we recognized that in order to attract the attention of the community we needed to match our rewards to their expectations. We consider the expansion to have been a success, and because of that we would like to extend it even further to at least until the end of the year (2022).\nDuring the last three months, we received 9 submissions and paid over 175,000 USD so far. The sub…",
          "link": "http://security.googleblog.com/2022/02/roses-are-red-violets-are-blue-giving.html",
          "publishedOn": "2022-02-14T17:07:00.001Z",
          "wordCount": 1561,
          "title": "🌹 Roses are red, Violets are blue 💙 Giving leets 🧑‍💻 more sweets 🍭 All of 2022!"
        },
        {
          "id": "http://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html",
          "author": null,
          "description": "Posted by Sarah Jacobus, Vulnerability Rewards Team \n\n\nLast year was another record setter for our Vulnerability Reward Programs (VRPs). Throughout 2021, we partnered with the security researcher community to identify and fix thousands of  vulnerabilities – helping keep our users and the internet safe. \n\nThanks to these incredible researchers, Vulnerability Reward Programs across Google continued to grow, and we are excited to report that in 2021 we awarded a record breaking $8,700,000 in vulnerability rewards – with researchers donating over $300,000 of their rewards to a charity of their choice. \n\nWe also launched bughunters.google.com in 2021, a public researcher portal dedicated to keeping Google products and the internet safe and secure. This new platform brings all of our VRPs (Googl…",
          "link": "http://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html",
          "publishedOn": "2022-02-10T17:00:00.001Z",
          "wordCount": 3694,
          "title": "Vulnerability Reward Program: 2021 Year in Review"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/14/1572",
          "author": null,
          "description": "In this week’s episode Cameron Dutro, a software engineer at GitHub, Ship It listener and someone with an extraordinary attention to detail, joins us to talk about Kuby, a convention-over-configuration approach to deploying Rails apps.\nThe question that we will be trying to answer is what happened to Rails Active Deployment. The path to that promise land is paved with good intentions, but it’s complicated.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nShortcut – The first project management platform for software development that brings every team across the org together to build better products. More than 10,000 companies from all over the world use Shortcut to plan, collaborate, and build better softw…",
          "link": "https://changelog.com/shipit/43",
          "publishedOn": "2022-03-09T16:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 43: Rails Active Deployment",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/43/ship-it-43.mp3",
            "length": "63962486",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Z3RL",
          "author": "Jerod Santo",
          "description": "All the details of the National Science Foundation’s “big bet” are in the article, but here’s the money quote:\nIf you are working on an open source project that might benefit from this kind of funding, check it out here. Phase I applications are due May 12, 2022, and Phase II applications are due October 21, 2022.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/22/3/national-science-foundation-open-source",
          "publishedOn": "2022-03-09T15:36:00.000Z",
          "wordCount": null,
          "title": "The NSF announces $21 million to fund open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJOP",
          "author": "Jerod Santo",
          "description": "Say good bye to learning new tools just to work with a different data format.\nDasel uses a standard selector syntax no matter the data format. This means that once you learn how to use dasel you immediately have the ability to query/modify any of the supported data types without any additional tools or effort.\n\nDiscuss on Changelog News",
          "link": "https://github.com/TomWright/dasel",
          "publishedOn": "2022-03-09T14:45:00.000Z",
          "wordCount": null,
          "title": "One tool to rule wrangle them all (JSON, XML, CSV, etc.)",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1604",
          "author": null,
          "description": "Daniel and Chris talk with Lukas Egger, Head of Innovation Office and Strategic Projects at SAP Business Process Intelligence.  Lukas describes what it takes to bring a culture of innovation into an organization, and how to infuse product development with that innovation culture.  He also offers suggestions for how to mitigate challenges and blockers.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nLukas Egger – Twitter, LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nSAP BPI\nPioneers, Settlers, Town Planners\nMore with LeSS\nThe Fifth Discipline: The Art & Practice of The Learning Organization\nKaizen | Wikipedia\nStratechery\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/170",
          "publishedOn": "2022-03-08T19:35:00.000Z",
          "wordCount": null,
          "title": "Practical AI 170: Creating a culture of innovation",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/170/practical-ai-170.mp3",
            "length": "50714323",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Q5nE",
          "author": "Jerod Santo",
          "description": "Jean Yang:\nShould you move to serverless? Is GraphQL the answer to your API woes? Should you follow the latest DevOps playbook to increase your system reliability? In the world of tech tools, there’s a lot of buzz. But it doesn’t always reflect the daily reality of programmers.\nAs the founder of a developer tools startup, I’ve talked with hundreds, if not thousands, of software developers over the last few years in the course of routine user research. The common theme in these conversations, even bigger than the need for the product we were building, was an overarching need that is currently underserved: building for real developers, or what I like to call the 99% Developers.\nGood stuff to be reminded of. That reminds me: You are not Google/Amazon/LinkedIn.\nDiscuss on Changelog News",
          "link": "https://future.a16z.com/software-development-building-for-99-developers/",
          "publishedOn": "2022-03-08T17:00:00.000Z",
          "wordCount": null,
          "title": "Building for the 99% Developers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4E2M",
          "author": "Jerod Santo",
          "description": "Rich Burroughs:\nWhen you hear the phrase “cloud native,” is Kubernetes the first thing that comes to your mind? It is for me, and I expect I’m not alone. Kubernetes is now the second-largest open source project after Linux, and it’s the big fish in the cloud native pond. But there are many other projects in the CNCF landscape and the broader cloud native community.\nSo, I thought I’d list some cloud native tools that can be very useful for teams that aren’t using Kubernetes or aren’t using it for every workload. Here are 7 of them that I like a lot.\nIf Rich’s name rings a bell, that’s because he was just on Ship It! last week. 😉\nDiscuss on Changelog News",
          "link": "https://loft.sh/blog/7-open-source-cloud-native-tools-that-aren-t-kubernetes/",
          "publishedOn": "2022-03-08T16:11:00.000Z",
          "wordCount": null,
          "title": "7 open source cloud native tools that aren’t Kubernetes",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zg2D",
          "author": "Jerod Santo",
          "description": "It’s possible to pair well simply by avoiding pairing poorly.\nI’ve never thought about it that way, but yeah, makes sense. What follows is a list of things not to do when pairing. Things for navigators, things for drivers, and things for both.\nThis is just one page from Tuple’s pair programming guide, which looks excellent all-around.\nDiscuss on Changelog News",
          "link": "https://tuple.app/pair-programming-guide/antipatterns",
          "publishedOn": "2022-03-07T16:00:00.000Z",
          "wordCount": null,
          "title": "Pair programming antipatterns",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8OeO",
          "author": "Jerod Santo",
          "description": "Thanks to Jim Nielsen, TIL that:\ndefaults write NSGlobalDomain WebKitDeveloperExtras -bool true\ndefaults write -g WebKitDeveloperExtras -bool YES\n\nLets you trigger Safari’s Web Inspector on different system views that are built with web tech. Nifty!\n\nDiscuss on Changelog News",
          "link": "https://blog.jim-nielsen.com/2022/inspecting-web-views-in-macos/",
          "publishedOn": "2022-03-07T15:13:00.000Z",
          "wordCount": null,
          "title": "Inspecting web views in macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5do",
          "author": "Jerod Santo",
          "description": "Samuel Berthe:\nThis project have started as an experiment to discover generics implementation. It may look like Lodash in some aspects. I used to code with the awesome go-funk package, but it uses reflection and therefore is not typesafe.\nAs expected, benchmarks demonstrate that generics will be much faster than implementations based on reflect stdlib package. Benchmarks also shows similar performances to pure for loops.\nDiscuss on Changelog News",
          "link": "https://github.com/samber/lo",
          "publishedOn": "2022-03-07T14:27:00.000Z",
          "wordCount": null,
          "title": "A Lodash-style Go library using generics",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1537",
          "author": null,
          "description": "This week we have the pleasure of Rich Burroughs, Senior Developer Advocate at Loft Labs and host of the Kube Cuddle podcast.\nWe talk about multitenancy in Kubernetes and how to run Kubernetes in Kubernetes with vcluster. If you are using KiND, you will find this episode interesting, and maybe even helpful.\nWe also talk about the role that Kelsey Hightower played in Rich joining the CNCF ecosystem. The key take-away is that people make all the difference.\nADHD is something that Rich thinks about often. Gerhard was curious about the difference between ADHD and burnout, as well as this Twitter thread on re-reading sent emails.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happ…",
          "link": "https://changelog.com/shipit/42",
          "publishedOn": "2022-03-05T15:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 42: Kubernetes in Kubernetes",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/42/ship-it-42.mp3",
            "length": "60960681",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1559",
          "author": null,
          "description": "Kent and our panelists dive deep on the hottest new React framework: Remix. What it does today, what makes it special, how it lured Kent away from a lucrative independent teaching career, and what’s coming up next.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “JS Party” to receive an extra 5,000 video minutes.\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFeaturing\nKent C. Dodds – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nDivya – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nRemix Vs Next\nFly.io\nJSParty #119 Redwood brings full-stack to the JAMstack\nRemix Quickstart\nRemix Deep Dive\nRemix Discord\nReact Server Components and Remix\nA better idea would be to replace / improve the fetch spec\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/215",
          "publishedOn": "2022-03-04T19:40:00.000Z",
          "wordCount": null,
          "title": "JS Party 215: Remix helps bridge the network chasm",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/215/js-party-215.mp3",
            "length": "70477151",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/038D",
          "author": "Jerod Santo",
          "description": "Bhupesh Varshney:\nA lot of folks looking how to get started on open source are given very generic advice on how to approach their first contribution. In this newsletter issue I share one specific actionable item.\nHis secret tip? Solve static analyzer issues. There, I saved you a click. Unless you’re not sure what he means by that or want his advice on how to actually get that done…\nDiscuss on Changelog News",
          "link": "https://buttondown.email/bhupesh/archive/one-secret-tip-for-first-time-oss-contributors/",
          "publishedOn": "2022-03-04T15:50:00.000Z",
          "wordCount": null,
          "title": "One secret tip for first-time OSS contributors 🤫",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3YJJ",
          "author": "Jerod Santo",
          "description": "So Argc is a little Rust program that your bash scripts can use to make handling command-line parameters easy. You describe the options, parameters, and subcommands in comments like this:\n# @describe A demo cli\n\n# @cmd Upload a file\n# @arg target!                      File to upload\nupload() {\n    echo \"cmd                       upload\"\n    echo \"arg:  target              $argc_target\"\n}\n\nThen you trust Argc to parse that and do the heavy lifting:\neval \"$(argc -e $0 \"$@\")\"\n\nThe only drawback (aside from potential parsing bugs) to this approach is your script now depends on having argc in the machine’s executable path. i.e. – it’s not portable.\nWhat’d be even cooler, IMHO, would be to instead use argc as a pre-processor of sorts that spits out a pure-bash implementation from your input script. Regardless, a cool idea!\nDiscuss on Changelog News",
          "link": "https://github.com/sigoden/argc",
          "publishedOn": "2022-03-04T15:01:00.000Z",
          "wordCount": null,
          "title": "A handy way to handle sh/bash CLI parameters",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1594",
          "author": null,
          "description": "Let’s talk about the concept of immutable databases, the problems they target, and why you’d want to build one in Go.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “Go Time” to receive an extra 5,000 video minutes.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nBartlomiej Święcki – Twitter, GitHub\nJeronimo Irazabal – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\nimmudb\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/219",
          "publishedOn": "2022-03-03T18:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 219: Why immutable databases?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/219/go-time-219.mp3",
            "length": "55666924",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/13zQ",
          "author": "Jerod Santo",
          "description": "Chris Ferdinandi:\nFor years, a trend in our industry has been to build single-page apps, or SPAs.\nWith an SPA, the entire site or app lives in a single HTML file. After the initial load, everything about the app is handled with JavaScript. This is, in theory, supposed to result in web apps that feel as fast and snappy as native apps.\nToday, I want to explore why that’s nonsense. Let’s dig in!\nI built one of the first big SPAs (remember Grooveshark?), but I’ve shied away from them ever since. I do think there are cases when they make sense (Trello and GMail come to mind), but overall I think too many people chose the architecture too many times because it was the it thing to do vs it was actually the best decision for their circumstance.\nHeck, even Chris’s disclaimer of ‘when SPAs make sense’ section at the top is easily defeated by our Turbolinks implementation. But I digress… read this post it’s a good one for sure.\nDiscuss on Changelog News",
          "link": "https://gomakethings.com/spas-were-a-mistake/",
          "publishedOn": "2022-03-03T15:07:01.000Z",
          "wordCount": null,
          "title": "SPAs were a mistake",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gdmz",
          "author": "Jerod Santo",
          "description": "Install SingleFile on any major browser and then just:\nWait until the page is fully loaded.\nClick on the SingleFile button in the extension toolbar to save the page.\nYou can click again on the button to cancel the action when processing a page.\n\nDiscuss on Changelog News",
          "link": "https://github.com/gildas-lormeau/SingleFile",
          "publishedOn": "2022-03-03T14:14:00.000Z",
          "wordCount": null,
          "title": "A web extension that saves a complete web page as a single HTML file",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/wkJ0",
          "author": "Jerod Santo",
          "description": "Derek Sivers:\nI write almost everything important in my life: thoughts, plans, notes, diaries, correspondence, code, articles, and entire books.\nThey are my extended memory — my noted self — my organized thoughts. I refer to them often. I search them, update them, and learn from them. I convert them into HTML to make websites, or LaTeX to make books.\nMy written words are my most precious asset. They are also a history of my life. That’s why I only use plain text files. They are the most reliable, flexible, and long-lasting option. Here’s why.\nDiscuss on Changelog News",
          "link": "https://sive.rs/plaintext",
          "publishedOn": "2022-03-02T15:58:00.000Z",
          "wordCount": null,
          "title": "Write plain text files",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Dzm1",
          "author": "Ciprian Dorin Craciun",
          "description": "An argument in support of software packages that come in the form of a single binary executable (statically linked or portable), that one can just copy anywhere in ${PATH} and execute, without needing sudo, or downloading half the distribution’s packages as dependencies.\nDiscuss on Changelog News",
          "link": "https://notes.volution.ro/v1/2022/01/notes/fbf3f06c/",
          "publishedOn": "2022-03-02T15:08:00.000Z",
          "wordCount": null,
          "title": "In support of single binary executable packages",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/d36E",
          "author": "Jerod Santo",
          "description": "One of the things we discussed with Paul Copplestone from Supabase was what, exactly, might a cloud native Postgres look like? Well, perhaps it will look like OrioleDB:\nA new storage engine for PostgreSQL, bringing a modern approach to database capacity, capabilities and performance to the world’s most-loved database platform.\nOrioleDB consists of an extension, building on the innovative table access method framework and other standard Postgres extension interfaces. By extending and enhancing the current table access methods, OrioleDB opens the door to a future of more powerful storage models that are optimized for cloud and modern hardware architectures.\nDiscuss on Changelog News",
          "link": "https://github.com/orioledb/orioledb",
          "publishedOn": "2022-03-02T14:17:00.000Z",
          "wordCount": null,
          "title": "Building a cloud native storage engine for Postgres",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1569",
          "author": null,
          "description": "This week we’re joined by the “mad scientist” himself, Feross Aboukhadijeh…and we’re talking about the launch of Socket — the next big thing in the fight to secure and protect the open source supply chain.\nWhile working on the frontlines of open source, Feross and team have witnessed firsthand how supply chain attacks have swept across the software community and have damaged the trust in open source. Socket turns the problem of securing open source software on its head, and asks…“What if we assume all open source may be malicious?” So, they built a system that proactively detects indicators of compromised open source packages and brings awareness to teams in real-time. We cover the whys, the hows, and what’s next for this ambitious and very much needed project.\nDiscuss on Changelog News\nCh…",
          "link": "https://changelog.com/podcast/482",
          "publishedOn": "2022-03-01T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 482: Securing the open source supply chain",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/482/the-changelog-482.mp3",
            "length": "85049137",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1598",
          "author": null,
          "description": "Alon from Greeneye and Moses from ClearML blew us away when they said that they are training 1000’s of models a year that get deployed to Kubernetes clusters on tractors. Yes… we said tractors, as in farming! This is a super cool discussion about MLOps solutions at scale for interesting use cases in agriculture.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nAlon Klein Orback – Twitter\nMoses Guttmann – \nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nGreeneye\nGreeneye Blog\nClearML\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/169",
          "publishedOn": "2022-03-01T19:50:00.000Z",
          "wordCount": null,
          "title": "Practical AI 169: Deploying models (to tractors 🚜)",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/169/practical-ai-169.mp3",
            "length": "49585826",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EQm2",
          "author": "Jerod Santo",
          "description": "Designed by Cambridge engineers and computer scientists, Raspberry Pi has sold more than 40 million units, and created a market worth $1 billion… is used in tens of thousands of commercial applications in a variety of industries across the world… has created a whole new class of computing device, transforming the way engineers design control systems… has supported more than 26,000 teachers in the UK…\nAnd the list goes on. Quite the accomplishment! Reminds me of that Bill Gates quote: “Most people overestimate what they can do in one year and underestimate what they can do in ten years.”\nDiscuss on Changelog News",
          "link": "https://www.cam.ac.uk/stories/raspberrypi",
          "publishedOn": "2022-03-01T17:32:00.000Z",
          "wordCount": null,
          "title": "Ten years of Raspberry Pi",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/o97l",
          "author": "Jerod Santo",
          "description": "Vikram Rangnekar:\nGraphJin gives you an instant secure and fast GraphQL API without code. GraphQL is automagically compiled into an efficient SQL query. Use either as a library or a standalone service. Build your backend APIs 100X faster.\nI have to zonk him for that “automagically”, but still looks like a cool project.\nDiscuss on Changelog News",
          "link": "https://github.com/dosco/graphjin",
          "publishedOn": "2022-03-01T16:46:00.000Z",
          "wordCount": null,
          "title": "GraphJin – an instant GraphQL to SQL compiler",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2mR",
          "author": "Austin Gil",
          "description": "I came across an interesting use case for edge compute the other day: cookie management at the edge. It probably won’t be super relevant to a ton of people, but it’s an interesting use case I wanted to share, nonetheless.\nDiscuss on Changelog News",
          "link": "https://austingil.com/cookies-at-the-edge/",
          "publishedOn": "2022-03-01T15:59:00.000Z",
          "wordCount": null,
          "title": "Cookies at the edge (not a baking blog post)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Lp2D",
          "author": "Jerod Santo",
          "description": "Almond.CSS helps in two ways: it normalizes the CSS styles to provide similar experience cross-browser, and it spices things a little by adding custom styles (that can be personalized!)\nUse the different HTML5 semantic tags on your website, include the library in your project, and let CSS and the browser work their magic. Just combine your HTML and Almond CSS (no JavaScript needed.)\nDemo here. Looks like a great starter for simple side projects and the like.\nDiscuss on Changelog News",
          "link": "https://github.com/alvaromontoro/almond.css",
          "publishedOn": "2022-03-01T14:57:00.000Z",
          "wordCount": null,
          "title": "A collection of class-less CSS styles to make simple websites look better",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3NW",
          "author": "Jerod Santo",
          "description": "JSON support in SQLite has been in the works for awhile now, but prior to this release you had to opt in to it. Now it’s on by default and this is a great rundown of using the query features.\nDiscuss on Changelog News",
          "link": "https://tirkarthi.github.io/programming/2022/02/26/sqlite-json-improvements.html",
          "publishedOn": "2022-02-28T16:10:00.000Z",
          "wordCount": null,
          "title": "JSON improvements in SQLite 3.38.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJyX",
          "author": "Jerod Santo",
          "description": "For many software folk, we prefer our networking to have TCP handshakes, not literal (or even virtual) handshakes. If that’s you, this guide might help you get over the hump:\nHere’s the truth: you can get what you need from these events without being awkward or creepy. Whether that’s job leads or important connections, there is a well-defined, time-tested way to accomplish this. It will push your limits, but it won’t leave you feeling gross inside. And the more you do it, the better you’ll get at it.\nDiscuss on Changelog News",
          "link": "https://www.samjulien.com/shy-dev-networking",
          "publishedOn": "2022-02-28T15:12:00.000Z",
          "wordCount": null,
          "title": "The painfully shy developer's guide to networking for a better job",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykVq",
          "author": "Jerod Santo",
          "description": "This diagram by Nived Velayudhan and Seth Kenlon might help you better understand Kubernetes by looking at the 10 steps that take place when you create a pod or a deployment.\n\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/22/3/visual-map-kubernetes-deployment",
          "publishedOn": "2022-02-28T14:12:00.000Z",
          "wordCount": null,
          "title": "A visual map of a Kubernetes deployment",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1571",
          "author": null,
          "description": "This week we’re talking to Toby Padilla, Co-Founder at Charm — where they build tools to make the command line glamorous. We talk about the state of the art, the next big thing happening on the command line and in ssh-land. They have an array of open source tooling to build great apps for the terminal and Charm Cloud to power a new generation of CLI apps. We talk through all their tooling, where things are headed for CLI apps, the focus and attention of their team, and what’s to come in bringing glamor to the command line.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building…",
          "link": "https://changelog.com/podcast/481",
          "publishedOn": "2022-02-26T00:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 481: Making the command line glamorous",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/481/the-changelog-481.mp3",
            "length": "89552644",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1558",
          "author": null,
          "description": "Anthony Fu && Matias “Patak” Capeletto from the Vite core team join Jerod && Nick to discuss Vitest – a blazing fast unit-test framework powered by Vite, && Slidev – presentation slides for developers.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nGatsbyConf 2022 – (March 2nd and 3rd) this conference is totally free and totally virtual so everyone can join. Day 1 is talks and day 2 is workshops —hear from Gatsby co-founders and leadership on speed improvements to the build system, incremental architecture, the latest on Gatsby Cloud, announcements and more. Chris Coyier kicks off day 1 with the Keynote. Register at gatsbyconf.com\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nFeaturing\nAnthony Fu – Twitter, GitHub, Website\nPatak – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nNotes and Links\nVite\nEvan You on JS Party\nVitest\nSlidev\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/214",
          "publishedOn": "2022-02-25T18:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 214: Vitest && Slidev",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/214/js-party-214.mp3",
            "length": "52962133",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/13yR",
          "author": "Martin Heinz",
          "description": "Before any new feature, change or improvement makes it into Python, there needs to be a Python Enhancement Proposal, also knows as PEP, outlining the proposed change. These PEPs are a great way of getting the freshest info about what might be included in the upcoming Python releases. So, in this article we will go over all the proposals that are going to bring some exciting new Python features in a near future!\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/67",
          "publishedOn": "2022-02-25T15:14:00.000Z",
          "wordCount": null,
          "title": "Upcoming Python features brought to you by PEPs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/n72o",
          "author": "Jerod Santo",
          "description": "George Mathew:\nFor a software engineer, the hardest thing about developing Machine Learning functionality should be finding clean and representative ground-truth data, but it often isn’t. If you already have a source of good quality data (perhaps because it is already gathered by your application), here are some obstacles that still lay ahead of you\nFrom the difficult to grasp concepts to the varied (and variable quality) software you’ll need to explore and manage the data, there’s still a lot of obstacles in our path before we can put a model to good use.\nDiscuss on Changelog News",
          "link": "https://www.nyckel.com/blog/ml-too-hard-for-software-developers/",
          "publishedOn": "2022-02-25T14:28:00.000Z",
          "wordCount": null,
          "title": "Machine learning is still too hard for software engineers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MdkD",
          "author": "Jerod Santo",
          "description": "Jim Nielsen:\nIt’s easy, in hindsight, to critique things CSS got wrong or should’ve prioritized differently. But I want to take a moment to marvel at the things they got right.\nIt’s incredibly difficult to build APIs that solve today’s problems while anticipating an unknown future. In some cases, I think the original CSS authors did precisely that.\nDiscuss on Changelog News",
          "link": "https://blog.jim-nielsen.com/2022/things-the-css-spec-folks-got-right/",
          "publishedOn": "2022-02-24T20:47:00.000Z",
          "wordCount": null,
          "title": "Things the CSS spec folks got right",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rl29",
          "author": "Jerod Santo",
          "description": "SQLite and Python strike me as particularly complementary tools.\nDiscuss on Changelog News",
          "link": "https://sqlite-utils.datasette.io/en/stable/index.html",
          "publishedOn": "2022-02-24T18:54:00.000Z",
          "wordCount": null,
          "title": "A CLI & utility functions for manipulating SQLite databases from Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9Oyw",
          "author": "Jerod Santo",
          "description": "ngrok rocks, but it’s 2nd version is famously closed source*, so many open source alternatives have been developed over the years. So many, in fact, that they now have their own awesome list.\nThe purpose of this list is to track and compare tunneling solutions. This is primarily targeted toward self-hosters and developers who want to do things like exposing a local webserver via a public domain name, with automatic HTTPS, even if behind a NAT or other restricted network.\n*We spoke with Alan Shreve about this decision back when he made it, if you’re curious about his thinking.\nDiscuss on Changelog News",
          "link": "https://github.com/anderspitman/awesome-tunneling",
          "publishedOn": "2022-02-24T18:06:00.000Z",
          "wordCount": null,
          "title": "An awesome list of ngrok alternatives & other tunneling solutions",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1553",
          "author": null,
          "description": "Mark Sandstrom and Ben Kraft join Jon and Mat to talk about GraphQL. What exactly is it this query language everyone has been talking about? How does it work? What Go libraries are out there, and where should you get started?\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nMark Sandstrom – Twitter\nBen Kraft – Twitter, GitHub, Website\nJon Calhoun – Twitter, GitHub, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nResources to learn GraphQL\nGitHub GraphQL API\ngenqlient - Khan Academy’s open source GraphQL client library\ngraphql - Another GraphQL client library written in Go\ngqlgen - A codegen tool for creating Go GraphQL servers\ngraphql-go-tools - A toolkit for building GraphQL proxies, gateways, caches, etc\ngqlparser - A GraphQL parser, written to mirror the graphql-js reference implementation as closely while remaining idiomatic and easy to use.\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/218",
          "publishedOn": "2022-02-24T17:20:00.000Z",
          "wordCount": null,
          "title": "Go Time 218: Going with GraphQL",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/218/go-time-218.mp3",
            "length": "55588341",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Gb65",
          "author": "Jerod Santo",
          "description": "I love this idea by Simon Willison:\nI think I’ve come up with a novel hack for the challenge of getting your company to financially support the open source projects that it uses: reach out to the maintainers and offer them generous speaking fees for remote talks to your engineering team.\nIt won’t work for every person and situation, but we should add it to our arsenal of ways to return economic value back to the maintainers of our open source infrastructure.\nDiscuss on Changelog News",
          "link": "https://simonwillison.net/2022/Feb/23/support-open-source/",
          "publishedOn": "2022-02-23T22:27:00.000Z",
          "wordCount": null,
          "title": "Support open source that you use by paying the maintainers to talk to your team",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eZ01",
          "author": "Jerod Santo",
          "description": "Last year, TikTokker Avery Steeves posted a video asking why no one talks about how there’s an entire generation of teenage girls who taught themselves to code HTML on Tumblr. “People are like, ‘Oh, there’s no girls in STEM,’” she says, imitating the faceless internet mob. “No, there were! They were just making pale blogs.”\nOK so we don’t usually link to Mashable (first time ever?), but this was cool news to me, so I thought it was worth passing along. Long live HTML!\nDiscuss on Changelog News",
          "link": "https://mashable.com/article/tumblr-girl-learn-code",
          "publishedOn": "2022-02-23T21:38:00.000Z",
          "wordCount": null,
          "title": "How Tumblr taught young women to code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RR7g",
          "author": "Jerod Santo",
          "description": "Straight from the NGINX team:\nWhen we help NGINX users who are having problems, we often see the same configuration mistakes we’ve seen over and over in other users’ configurations – sometimes even in configurations written by fellow NGINX engineers! In this blog we look at 10 of the most common errors, explaining what’s wrong and how to fix it.\nDiscuss on Changelog News",
          "link": "https://www.nginx.com/blog/avoiding-top-10-nginx-configuration-mistakes/",
          "publishedOn": "2022-02-23T20:51:00.000Z",
          "wordCount": null,
          "title": "Avoiding the top NGINX configuration mistakes",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1549",
          "author": null,
          "description": "In today’s episode, Gerhard is talking to Mauricio Salatino (@salaboy) about the Continuous Delivery for Kubernetes book that he is currently writing.\nMauricio is a Staff Engineer at VMware where he spends most of his time contributing to Knative, an open source platform for running serverless workloads on Kubernetes. Gerhard & Mauricio spent a few months in 2021 working on Knative Eventing, and they both appreciate shipping great software continuously. Mauricio helped ship Knative 1.0.\nThe from-monolith-to-k8s application used throughout this book has been a few years in the making. It doubles-up as a workshop-style guide for rearchitecting a Java monolith to a Cloud Native architecture running in Kubernetes.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode bec…",
          "link": "https://changelog.com/shipit/41",
          "publishedOn": "2022-02-23T12:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 41: Continuous Delivery for Kubernetes",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/41/ship-it-41.mp3",
            "length": "63617911",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/137Q",
          "author": "Jerod Santo",
          "description": "Said root access is achieved on DevOops – a medium-rated, retired machine on HackTheBox. The hack begins with a web server that hosts XML file uploads and ends with… well, I won’t spoiler it for you. Follow along and try to get root for yourself!\nDiscuss on Changelog News",
          "link": "https://kaizoku.dev/htb-devoops",
          "publishedOn": "2022-02-22T17:52:00.000Z",
          "wordCount": null,
          "title": "A pentester gains root access (step-by-step)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gd5z",
          "author": "Jerod Santo",
          "description": "Knut Melvær with a thoughtful attack on one of my all-time favorite tools:\nMarkdown is a signifier for the developer and text-tinkerer culture. But since its introduction, the world of digital content has also changed. While Markdown is still fine for some things, I don’t believe it’s should be the go-to for content anymore.\nThere are two main reasons for this:\nMarkdown wasn’t designed to meet today’s needs of content.\nMarkdown holds editorial experience back.\nNow, I did say it’s a thoughtful atttack and it’s also a long one (30 minute read). Knut does the work, diving deep into Markdown’s history and John Gruber’s desires for it:\nI want to build my advice against Markdown by looking back on why it was introduced in the first place, and by going through some of the major developments of content on the web. For many of us, I suspect Markdown is something we just take for granted as a “thing that exists.” But all technology has a history and is a product of human interaction. This is important to remember when you, the reader, develop technology for others to use.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/02/thoughts-on-markdown/",
          "publishedOn": "2022-02-22T16:06:00.000Z",
          "wordCount": null,
          "title": "Thoughts against Markdown",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X6QM",
          "author": "Jerod Santo",
          "description": "In their own words:\nGrist is a modern relational spreadsheet. It combines the flexibility of a spreadsheet with the robustness of a database to organize your data and make you more productive.\nSince so many people make the Airtable comparison that I did in the headline, the team behind Grist has written up a comparison of the two offerings.\nDiscuss on Changelog News",
          "link": "https://github.com/gristlabs/grist-core",
          "publishedOn": "2022-02-22T15:15:00.000Z",
          "wordCount": null,
          "title": "Grist is a lot like Airtable, but open source and more customizable",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/d3nl",
          "author": "Jerod Santo",
          "description": "Why create another form library? Here’s what Fomir’s author says to that:\nI have tried many form libraries, like redux-form, formik, final-form, react-hook-form… None of them suit my taste. I would expect a forms library with these features:\nUsing schema\nEasy to update form state\nHigh Performance\nMore abstract\nFomir create form by passing a form schema which is a JSON tree. the form schema is very flexible, you can create any form by the schema.\nI could see this as especially useful for form builders and similar tools where you’re providing a graphical way to build forms because your backend would just have to emit the correct JSON and let Fomir take it from there.\nDiscuss on Changelog News",
          "link": "https://github.com/forsigner/fomir",
          "publishedOn": "2022-02-21T17:24:00.000Z",
          "wordCount": null,
          "title": "Fomir – a schema-first library for building forms",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/j5wl",
          "author": "Jerod Santo",
          "description": "Douglas Vaghetti:\nIt is a good time to be in tech right now: soaring salaries, daily LinkedIn recruiter spam, people bootcamping their way into career switches to tech, remote work allowing you to work for a major tech company making triple digit salaries from the beach. It really feels like every single company is trying to recruit programmers nowadays, and doing whatever they can to get them.\nI’m certainly happy with the current state of affairs, but I can’t help but wonder: How does it end?\nWill supply go up via a mass influx of people switching careers? Will demand go down via AI and newly created no-code/low-code alternatives? Time will tell. But for now, some food for thought.\nDiscuss on Changelog News",
          "link": "https://vaghetti.dev/posts/times-are-great/",
          "publishedOn": "2022-02-21T16:35:00.000Z",
          "wordCount": null,
          "title": "Times are great for programmers now. How does it end?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQl2",
          "author": "Jerod Santo",
          "description": "Jujutsu (jj at your CLI) combines features from popular distributed version controls systems (Git, Mercurial, Darcs) with features not found in any of them, such as:\nworking-copy-as-commit\nundo functionality\nautomatic rebase\nsafe replication via rsync/Dropbox/etc\nAnd since it’s Git-compatible, adoption should be a breeze.\nJujutsu has two backends. One of them is a Git backend (the other is a native one). This lets you use Jujutsu as an alternative interface to Git. The commits you create will look like regular Git commits. You can always switch back to Git.\nI’ve often wondered what will come next after Git. I’m not saying this is that thing, but it’s cool to see people working on the problem.\nDiscuss on Changelog News",
          "link": "https://github.com/martinvonz/jj",
          "publishedOn": "2022-02-21T15:46:00.000Z",
          "wordCount": null,
          "title": "A Git-compatible DVCS that is both simple and powerful",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LpND",
          "author": "Jerod Santo",
          "description": "If you agree with the notion that you need to be able to tell the difference between the absence of a value and a value itself, then this has some impacts on the code you write. If you want to keep ’em separated (so they can come out and play), then it gets you looking at your API designs in certain ways.\nThese are my reactions to some of the ways a value can be returned (or not).\nBefore you head off to read Rachel’s post, allow me to close the loop on that Offspring reference for those of us who didn’t grow up in the 90’s.\nDiscuss on Changelog News",
          "link": "https://rachelbythebay.com/w/2022/02/20/return/",
          "publishedOn": "2022-02-21T15:00:00.000Z",
          "wordCount": null,
          "title": "Returning values and errors",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JLmn",
          "author": "Jerod Santo",
          "description": "Not much has been written yet on how Go’s fuzzing system actually works, so I’ll talk a bit about that here. If you’d like to try it out, Getting started with fuzzing is a great tutorial.\nJay Conrod worked on Go 1.18’s fuzzing feature, so there’s very few people who could write a post as detailed and accurate as this. He also discussed fuzzing in detail with us on Go Time #187.\nDiscuss on Changelog News",
          "link": "https://jayconrod.com/posts/123/internals-of-go-s-new-fuzzing-system",
          "publishedOn": "2022-02-18T19:03:00.000Z",
          "wordCount": null,
          "title": "Internals of Go's new fuzzing system",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1577",
          "author": null,
          "description": "Holla! This week we’re playing Story of the Week and Today I Learned before turning our focus to Vest – a very cool validations framework created by Evyatar Alush.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGatsbyConf 2022 – (March 2nd and 3rd) this conference is totally free and totally virtual so everyone can join. Day 1 is talks and day 2 is workshops —hear from Gatsby co-founders and leadership on speed improvements to the build system, incremental architecture, the latest on Gatsby Cloud, announcements and more. Chris Coyier kicks off day 1 with the Keynote. Register at gatsbyconf.com\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to perfor…",
          "link": "https://changelog.com/jsparty/213",
          "publishedOn": "2022-02-18T18:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 213: Playing it close to the Vest",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/213/js-party-213.mp3",
            "length": "65853678",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zgYD",
          "author": "Jerod Santo",
          "description": "Regular expressions aren’t easy to write, but they’re especially hard to read. This project is yet another attempt to make them more readable and maintainable. The aim is to create a new language that compiles to regexen so we don’t have to write them directly.\nDiscuss on Changelog News",
          "link": "https://github.com/yoav-lavi/melody",
          "publishedOn": "2022-02-18T16:29:00.000Z",
          "wordCount": null,
          "title": "Melody is a language that compiles to regular expressions",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8OJO",
          "author": "Jerod Santo",
          "description": "Connor Rigby shows us how easy it is to embed Elixir’s IEx console like they do with Nerves.\nAs is customary around these parts, we aren’t going to write much code. Just glue it together. First up, we’ll need a handful of dependencies.\nPlug, Cowboy, and extty do all the heavy lifting.\nDiscuss on Changelog News",
          "link": "https://cone.codes/posts/iex-in-a-box/",
          "publishedOn": "2022-02-18T15:34:00.000Z",
          "wordCount": null,
          "title": "IEx in a box",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4Ee3",
          "author": "Jerod Santo",
          "description": "If learning from incidents grabbed your attention, here’s a good one we can all learn from:\nIt was 5:17pm today, just as I was wrapping up work for the day, and my manager pinged me with the following chat:\n<manager>: Hi Jeremy - we have a <other team> ticket - escalated to <leader>, <leader>, etc. <principal> is on trying to advise as well. Are you available this evening if needed for diagnostics? <coworker> is on the call now\nNo obligation; just checking in to see what my availability is. Quickly thinking it over – I didn’t have any plans tonight, nothing in particular on my agenda. Why not? If I can help then someone else on the team won’t have to, and I don’t have anything better to do tonight.\nThe game is afoot. It might be a long night…\nDiscuss on Changelog News",
          "link": "https://ardentperf.com/2022/02/10/a-hairy-postgresql-incident/",
          "publishedOn": "2022-02-17T19:46:00.000Z",
          "wordCount": null,
          "title": "A hairy PostgreSQL incident",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1589",
          "author": null,
          "description": "On this episode, Michael Matloob and Daniel Martí pinky promise not to talk about Go 1.18’s two big features (fuzzing and generics). Instead, we’re focusing in on the other cool stuff that’s new!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nMichael Matloob – Twitter, GitHub\nDaniel Martí – Twitter, GitHub, LinkedIn, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nDaniel’s gofumpt library\nproposal: runtime: GC pacer redesign (#44167)\nbytes, strings: add Cut (#46336)\nnet/netip: add new IP address package, use in net (#46518)\ncmd/gofmt: format files in parallel, similar to ‘go fmt’ (#43566)\ncmd/go: stamp git/vcs current HEAD hash/commit hash/dirty bit in binaries (#37475)\ncmd/go: factor version reading into debug/buildinfo (#39301)\nall: add GOAMD64 environment variable (#45453)\ntext/template: add break and continue support (#20531)\ntext/template: make and/or operators short-circuit evaluation (#31103)\ncmd/go: add a workspace mode (#45713)",
          "link": "https://changelog.com/gotime/217",
          "publishedOn": "2022-02-17T19:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 217: The *other* features in Go 1.18",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/217/go-time-217.mp3",
            "length": "57673553",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Z3nj",
          "author": "Jerod Santo",
          "description": "A Svelte app that helps you mix, blend, modify, or just get the info on every color under the rainbow. 🌈\nDiscuss on Changelog News",
          "link": "https://hue.tools/?format=hex",
          "publishedOn": "2022-02-17T16:46:00.000Z",
          "wordCount": null,
          "title": "hue.tools – an open source toolbox for colors",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2511",
          "author": "Kevin Ball",
          "description": "As developers, we use TypeScript for a few different reasons. The self-documentation aspects are huge – being able to step into an unfamiliar function and know the shape of the objects it’s expecting is a massive boon when working on a large project. The added tooling features, with IntelliSense and its ilk, are also a big help for productivity. But to me, the most important reason to use a strongly typed system is to eliminate an entire class of runtime bugs, where a function gets passed an object it doesn’t know how to handle and fails at runtime.\nIt’s that last reason that leads to the purpose for this post. I recently handled a bug where a React component was throwing an exception at runtime. The source of the issue was a recent refactor done when internationalizing this area of our ap…",
          "link": "https://changelog.com/posts/the-react-reactnode-type-is-a-black-hole",
          "publishedOn": "2022-02-16T17:30:12.000Z",
          "wordCount": null,
          "title": "The React.ReactNode type is a black hole",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1540",
          "author": null,
          "description": "We finally did it! All our static files are served from AWS S3. This is the most significant improvement to our app’s architecture in years, and now we have unlocked the next level: multi-cloud. We talk about that at length, and how it fits in our 2022 setup. The TL;DR is that changelog.com will fly, both literally and figuratively.\nWe also address Steve’s comment that he left on our previous Kaizen episode - thanks Steve!\nTowards the end, we talk about Gerhard’s new beginnings at Dagger, where he gets to work with a world-class team and build the next-gen CI/CD. That’s right, Gerhard is now walking the Ship It talk all day, every day. If you want to watch him code live, you can do so every Thursday, in our weekly community session.\nKaizen!\nDiscuss on Changelog News\nJoin Changelog++ to sup…",
          "link": "https://changelog.com/shipit/40",
          "publishedOn": "2022-02-16T16:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 40: Kaizen! New beginnings",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/40/ship-it-40.mp3",
            "length": "73879060",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Mdnr",
          "author": "Jerod Santo",
          "description": "Steven Wittens takes us on a trip to a parallel universe where the React team made different decisions (with less legacy constraints). What might this universe look like? For starters:\nNo-hooks and Early Return\nComponent Morphing\nuseMemo vs useEffect + setState\nand some wild Yeet-Reduce results\nDiscuss on Changelog News",
          "link": "https://acko.net/blog/react-the-missing-parts/",
          "publishedOn": "2022-02-16T15:50:00.000Z",
          "wordCount": null,
          "title": "React - The Missing Parts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rlVr",
          "author": "Jerod Santo",
          "description": "If you ssh a lot, you may get some serious value out of this suite of (currently 8) related tools and shortcuts. ssh-ping checks if a host is reachable using ssh_config, ssh-diff diffs a file over SSH, etc.\nDiscuss on Changelog News",
          "link": "https://github.com/vaporup/ssh-tools",
          "publishedOn": "2022-02-16T14:59:00.000Z",
          "wordCount": null,
          "title": "A suite of tools that make SSH more convenient",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1588",
          "author": null,
          "description": "From MIT researchers who have an AI system that rapidly predicts how two proteins will attach, to Facebook’s first high-performance self-supervised algorithm that works for speech, vision, and text, Daniel and Chris survey the AI landscape for notable milestones in the application of AI in industry and research.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nThe first high-performance self-supervised algorithm that works for speech, vision, and text\nDeepMind says its new AI coding engine is as good as an average human programmer\nArtificial intelligence system rapidly predicts how two proteins will attach\nSeeing Theory",
          "link": "https://changelog.com/practicalai/168",
          "publishedOn": "2022-02-15T20:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 168: One algorithm to rule them all?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/168/practical-ai-168.mp3",
            "length": "43735616",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1578",
          "author": null,
          "description": "This week we’re joined by Annie Sexton, UX Engineer at Render, to talk about her blog post titled Git Organized: A Better Git Flow that made the internet explode when she suggested using reset instead of rebase for a better git flow. On this show we talk about the git flow she suggests and why, how this flow works for her when she’s hacking on the Render codebase (and when she uses it), the good and the bad of Git, and we also talked about the cognitive load of Git commits as you work.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resol…",
          "link": "https://changelog.com/podcast/480",
          "publishedOn": "2022-02-15T16:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 480: Git your reset on",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/480/the-changelog-480.mp3",
            "length": "67955841",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eZnD",
          "author": "Jerod Santo",
          "description": "Rands asking himself some tough questions about our “new normal” remote work environments:\nRelative to the Pandemic, the single biggest work question I’ve been asking myself for two years is: what did we lose? What is the measurable and objective loss for teams not working in close proximity? I’ve been looking for cracks. I’ve been looking for leading indicators of future doom. The Great Resignation seems like a proper crack, right? But are people quitting their jobs because they can’t work together or because their current job sucks and all this terror in the air has given them a new appreciation of what really matters?\nA sobering perspective.\nDiscuss on Changelog News",
          "link": "https://randsinrepose.com/archives/what-we-lost/",
          "publishedOn": "2022-02-15T15:45:01.000Z",
          "wordCount": null,
          "title": "What we lost (when we went remote)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRnG",
          "author": "Jerod Santo",
          "description": "Leonardo Losoviz is pretty excited that Matt Mullenweg expressed interest in having WordPress’s editor comply with the Block Protocol:\nMy excitement comes from what happened with GraphQL, where the release of servers, clients, and tools adhering to a common specification has produced a rich ecosystem; and from my own development of a plugin that could support new features through the protocol.\nDon’t fret if you’re new to this “Block Protocol” concept, like myself: Leonardo starts off this (long) article with a nice explainer before he gets into the potential outcomes of WordPress’s involvement.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/02/implications-wordpress-joining-block-protocol/",
          "publishedOn": "2022-02-15T14:55:00.000Z",
          "wordCount": null,
          "title": "Implications of Wordpress joining the Block Protocol",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73b9",
          "author": "Jerod Santo",
          "description": "Learn how sudo works by writing your own version in Python!\nOne might think that sudo is actually some binary deeply integrated into the kernel, relying on a special purpose-built system call to achieve its functionality. After all, it lets you use root without even providing the password for that account! But thanks to one bit inside file permissions, sudo can exist without any of this.\nDiscuss on Changelog News",
          "link": "https://rtpg.co/2022/02/13/your-own-sudo.html",
          "publishedOn": "2022-02-14T21:08:00.000Z",
          "wordCount": null,
          "title": "Writing your own sudo",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2nL",
          "author": "Jerod Santo",
          "description": "A brief (6 minutes to read) history of MS-DOS:\nFirst released on August 12, 1981, MS-DOS became the foundation for business computing for almost two decades. MS-DOS stood for Microsoft Disk Operating System and was often referred to simply as “DOS”. It is the software that helped build Microsoft, becoming the foundation Microsoft built the Windows operating system on. It went through 8 (and a half-ish) major revisions, with the final version being shipped with Windows ME in September, 2000.\n\nDiscuss on Changelog News",
          "link": "https://b13rg.github.io/Life-of-MS-DOS/",
          "publishedOn": "2022-02-14T15:05:00.000Z",
          "wordCount": null,
          "title": "The life of MS-DOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1484",
          "author": null,
          "description": "This week Adam is joined by Joe Percoco — the Co-CEO of Titan, a premier investment manager for everyone. Titan is an investment company, a media, and a tech company, all rolled into one. Mid last year, they closed a $58 million Series B round led by Andreessen Horowitz (a16z) at a $450 million valuation. They currently have $750 million in assets managed and more than 35,000 clients.\nWhy should Titan exist? In Joe’s words, “Wall Street ignores everyday investors, and caters only to the ultra wealthy. This divide doesn’t sit well with us. So, we built Titan.” On today’s show Joe shares the journey, the why’s, the how’s, and the sequencing it might take to get to a $1 trillion of assets managed.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and mak…",
          "link": "https://changelog.com/founderstalk/87",
          "publishedOn": "2022-02-12T00:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 87: Building an investment platform for everyone",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/founderstalk/87/founders-talk-87.mp3",
            "length": "58650594",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1586",
          "author": null,
          "description": "Simey de Klerk recenty dove head-first into our transcripts repo and coded up a super-cool feature that’s been on Jerod’s wishlist for awhile now. So, of course, we invited him Backstage to tell the tale!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nSimey de Klerk – Twitter\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nThe issue: A GitHub Action to auto-improve transcripts\nThe post: Auto-improved transcripts with GitHub Actions\nThe script: format.js\nOur survey-game repo\nEric Normand talks FP with us",
          "link": "https://changelog.com/backstage/21",
          "publishedOn": "2022-02-11T20:00:00.000Z",
          "wordCount": null,
          "title": "Backstage 21: Long-time listener, first-time code contributor",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/21/backstage-21.mp3",
            "length": "71407663",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1539",
          "author": null,
          "description": "This week we are talking to Robin Morero, the person behind fabled.se, a DevOps consultancy from Gothenburg, Sweden. Their motto is “move faster and prosper”, which Gerhard prefers to the initial “move fast and break things”.\nFabled works with startups primarily, and after 26 years, Robin has a few interesting insights to share. What do you think, are haunted codebases real? At what point do pull requests become harmful? What about k3s running on KVM as a simple starting point for production? If this reminds you of #7, and the follow-up YouTube stream with Lars, it’s no coincidence.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nShortcut – The first project management platform for software development that bring…",
          "link": "https://changelog.com/shipit/39",
          "publishedOn": "2022-02-11T18:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 39: Haunted codebases & complex ops",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/39/ship-it-39.mp3",
            "length": "62272566",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1563",
          "author": null,
          "description": "Amal and Nick load up on coffee for a not-so-vite (lame joke!) conversation with Evan You all about Vite – a batteries included next-generation frontend tooling library. Vite continues to push the ecosystem forward with even stronger defaults, super speedy local development workflows, and a highly extensible universal plugin API. Need we say more?!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/c…",
          "link": "https://changelog.com/jsparty/212",
          "publishedOn": "2022-02-11T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 212: A deep-dive on Vite",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/212/js-party-212.mp3",
            "length": "71564245",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1565",
          "author": null,
          "description": "Natalie and Johnny are joined by the co-founders of APIToolkit for a deep-dive on the topic. We discuss building them, maintaining them, how can we all be better users, and much more along the way.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSignalWire – Build what’s next in communications with video, voice, and messaging APIs powered by elastic cloud infrastructure. Try it today at signalwire.com/video and mention “JS Party” to receive an extra 5,000 video minutes.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nSmile Egbai – Twitter, GitHub\nAnthony Alaribe – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nAPIToolkit.io\nDo schools kill creativity? | Sir Ken Robinson",
          "link": "https://changelog.com/gotime/216",
          "publishedOn": "2022-02-10T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 216: Building and using APIs with Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/216/go-time-216.mp3",
            "length": "48444596",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W3no",
          "author": "Jerod Santo",
          "description": "Dave Ceddia shares his go-to list of questions that he (literally) printed and brought with him to interviews for that final 5-ish minutes at the end when you get a chance to ask your own questions. It does come with a small disclaimer, though:\nThis was years ago by the way, long before COVID, when pretty much every interview was in-person. The shock factor of pulling out 2 pages of questions wouldn’t translate so well to Zoom, haha. But still: if time runs out, you can mention that you still have a bunch of questions, and could please email them afterward.\nDiscuss on Changelog News",
          "link": "https://daveceddia.com/interview-questions-to-ask-company/",
          "publishedOn": "2022-02-10T15:18:00.000Z",
          "wordCount": null,
          "title": "Interview questions to ask your interviewer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4Eq3",
          "author": "Jerod Santo",
          "description": "PgBouncer is a popular connection pooler for Postgres. PgCat is that same functionality, only in Rust. This is alpha software and there is no worse place to run alpha software (IMHO) than in places that have direct connections to your database. Still, this is worth linking to because it’s yet another instance of open source infrastructure code getting Rusty.\nDiscuss on Changelog News",
          "link": "https://github.com/levkk/pgcat",
          "publishedOn": "2022-02-10T14:28:00.000Z",
          "wordCount": null,
          "title": "PgBouncer rewritten in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1584",
          "author": null,
          "description": "In the third of the “AI in Africa” spotlight episodes, we welcome Kathleen Siminyu, who is building Kiswahili voice tools at Mozilla. We had a great discussion with Kathleen about creating more diverse voice and language datasets, involving local language communities in NLP work, and expanding grassroots ML/AI efforts across Africa.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nKathleen Siminyu – Twitter, LinkedIn\nJoyce Nabende – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\n“Introducing myself” from Kathleen\nMasakhane\nCommon Voice\nOpen for Good Alliance",
          "link": "https://changelog.com/practicalai/167",
          "publishedOn": "2022-02-09T16:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 167: 🌍 AI in Africa - Voice & language tools",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/167/practical-ai-167.mp3",
            "length": "42118774",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/N5rd",
          "author": "Jerod Santo",
          "description": "A couple weeks back I expressed some Windows FOMO* while linking out to a very cool Swiss Army knife for developers project. Well, FOMO-be-gone! There is now a DevToys project for we Mac users.\n*I have since been informed of DevUtils.app, which is also worth a gander.\nDiscuss on Changelog News",
          "link": "https://github.com/ObuchiYuki/DevToysMac",
          "publishedOn": "2022-02-09T15:07:00.000Z",
          "wordCount": null,
          "title": "DevToys for macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/n7b2",
          "author": "Jerod Santo",
          "description": "Garage is a distributed storage solution, that automatically replicates your data on several servers. Garage takes into account the geographical location of servers, and ensures that copies of your data are located at different locations when possible for maximal redundancy, a unique feature in the landscape of distributed storage systems.\nIt has an S3-compatible API and can be used as a storage backend for things like NextCloud, Matrix, and Mastodon. It’s being built by a non-profit in France that is “working to promote self-hosting and small-scale hosting.” Why do they do this?\nself-hosting means running our own hardware at home, and providing 24/7 Internet services from there. We have many reasons for doing this. One is because this is the only way we can truly control who has access to our data. Another one is that it helps us be aware of the physical substrate of which the Internet is made: making the Internet run has an environmental cost which we want to evaluate and keep under control. The physical hardware also gives us a sense of community, calling to mind all of the people that could currently be connected and making use of our services, and reminding us of the purpose for which we are doing this.\nDiscuss on Changelog News",
          "link": "https://garagehq.deuxfleurs.fr/blog/2022-introducing-garage/",
          "publishedOn": "2022-02-09T14:20:00.000Z",
          "wordCount": null,
          "title": "Garage - a self-hosted distributed object storage solution",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0813release/",
          "author": null,
          "description": "This release is a big push on the long term stability and reliability front. We looked at the data from our previous release and fixed those bugs.",
          "link": "https://blog.comma.ai/0813release/",
          "publishedOn": "2022-02-16T00:00:00.000Z",
          "wordCount": 2421,
          "title": "openpilot 0.8.13"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/machine-learning-can-help-read-language-life/",
          "author": null,
          "description": "DNA is the language of life: our DNA forms a living record of things that went well for our ancestors, and things that didn’t. DNA tells our body (and every other organism) which proteins to produce; these proteins are tiny machines that carry out enormous tasks, from fighting off infection to helping you ace an upcoming exam in school.\n\n\nBut for about a third of all proteins that all organisms produce, we just don’t know what they do. It’s kind of like we’re in a factory where everything’s buzzing, and we’re surrounded by all these impressive tools, but we have only a vague idea of what’s going on. Understanding how these tools operate, and how we can use them, is where we think machine learning can make a big difference.\n\n\nVideo format not supported\n\nAn example of a previously-solved pro…",
          "link": "https://blog.google/technology/ai/machine-learning-can-help-read-language-life/",
          "publishedOn": "2022-03-02T20:00:00.000Z",
          "wordCount": 1192,
          "title": "Machine learning can help read the language of life"
        },
        {
          "id": "https://blog.google/technology/ai/discover-ai-in-daily-life/",
          "author": null,
          "description": "Adorable, operatic blobs. A global, online guessing game. Scribbles that transform into works of art. These may not sound like they’re part of a curriculum, but learning the basics of how artificial intelligence (AI) works doesn’t have to be complicated, super-technical or boring.\nTo celebrate Digital Learning Day, we’re releasing a new lesson from Applied Digital Skills, Google’s free, online, video-based curriculum (and part of the larger Grow with Google initiative). “Discover AI in Daily Life” was designed with middle and high school students in mind, and dives into how AI is built, and how it helps people every day.\n\nAI for anyone — and everyone\n“Twenty or 30 years ago, students might have learned basic typing skills in school,” says Dr. Patrick Gage Kelley, a Google Trust and Safety …",
          "link": "https://blog.google/technology/ai/discover-ai-in-daily-life/",
          "publishedOn": "2022-02-22T19:00:00.000Z",
          "wordCount": 1139,
          "title": "An intro to AI, made for students"
        },
        {
          "id": "https://blog.google/inside-google/googlers/laurence-moroney-every-voice-ai/",
          "author": null,
          "description": "Early in his career, Laurence Moroney was working on an equation — not something related to his job in tech, but to his bank account. “At one point, I calculated I was about three weeks away from being homeless,” Laurence says. “My motivation was to put a meal on the table and keep a roof over my head.”\nToday Laurence is a developer advocate at Google focusing on artificial intelligence (AI) and machine learning (ML). “It’s my goal to inform and inspire the world about what we can do with AI and ML, and help developers realize these possibilities.” Laurence applied at Google in 2013 after hearing then-CEO Larry Page talk about Google’s vision to make the world a better place. “I was hired on my third attempt — so yes, I failed twice!”\nNow he focuses on inviting and introducing more people …",
          "link": "https://blog.google/inside-google/googlers/laurence-moroney-every-voice-ai/",
          "publishedOn": "2022-02-17T17:00:00.000Z",
          "wordCount": 1543,
          "title": "This Googler wants to ‘add every voice’ to AI"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=17911",
          "author": "Daniel Stenberg",
          "description": "The curl project has been alive for decades. We gradually introduce new features and options into the command line tool and library over time and we work hard never to break existing behavior and keep the ABI and API stable. Still, some features and functionalities go out of style sooner or later. Versions get deprecated, … Continue reading Deprecating things in curl →",
          "link": "https://daniel.haxx.se/blog/2022/03/10/deprecating-things-in-curl/",
          "publishedOn": "2022-03-10T08:32:23.000Z",
          "wordCount": 1484,
          "title": "Deprecating things in curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18477",
          "author": "Daniel Stenberg",
          "description": "Welcome to the 206th curl release, 59 days since we shipped curl 7.81.0. The extra three days because I was away on the day the release would normally have been done. (I call it Impartial Content as a little play on the HTTP 206 response code message.) Download curl 7.82.0 from curl.se as always. Release … Continue reading curl 7.82.0 Impartial Content →",
          "link": "https://daniel.haxx.se/blog/2022/03/05/curl-7-82-0-impartial-content/",
          "publishedOn": "2022-03-05T08:55:12.000Z",
          "wordCount": 1472,
          "title": "curl 7.82.0 Impartial Content"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17826",
          "author": "Daniel Stenberg",
          "description": "I was a guest at the software at scale podcast a while ago and the recording went up recently. We talked about a lot of things curl, including: The complexity behind HTTP. What goes on behind the scenes when I make a web request? The organizational work behind internet-wide RFCs, like HTTP/3. Rust in curl. … Continue reading curl on “software at scale” →",
          "link": "https://daniel.haxx.se/blog/2022/02/25/curl-on-software-at-scale/",
          "publishedOn": "2022-02-25T07:59:52.000Z",
          "wordCount": 753,
          "title": "curl on “software at scale”"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18421",
          "author": "Daniel Stenberg",
          "description": "In the beginning of every year I jot down a couple of “larger things” I would like to work on during the year. Some of the ideas are more in the maybe category and meant to be tested on the audience and users to see what others think and want, others are features I believe … Continue reading The great curl roadmap 2022 webinar →",
          "link": "https://daniel.haxx.se/blog/2022/02/14/the-great-curl-roadmap-2022-webinar/",
          "publishedOn": "2022-02-14T17:26:39.000Z",
          "wordCount": 817,
          "title": "The great curl roadmap 2022 webinar"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18392",
          "author": "Daniel Stenberg",
          "description": "I’m the lead developer in the curl project. We make the command line tool curl and the library libcurl, for doing Internet transfers. The command line tool uses the library for all the internet transfer heavy lifting. The command line tool is somewhat of a shell binding to access libcurl. We make these things. We … Continue reading My work on tool vs library →",
          "link": "https://daniel.haxx.se/blog/2022/02/10/my-work-on-tool-vs-library/",
          "publishedOn": "2022-02-10T13:29:18.000Z",
          "wordCount": 1729,
          "title": "My work on tool vs library"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-03-08T12:15:28.819Z",
          "wordCount": 992,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2022-03-03T12:40:47.837Z",
          "wordCount": 2820,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-03-01T12:20:26.016Z",
          "wordCount": 1622,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-02-21T12:15:44.283Z",
          "wordCount": 833,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-02-21T12:15:44.256Z",
          "wordCount": 806,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2022-02-17T12:13:51.213Z",
          "wordCount": 2822,
          "title": "How we built Twitter’s highly reliable ads pacing service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2022-02-14T12:14:05.461Z",
          "wordCount": 2618,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-02-14T12:14:04.880Z",
          "wordCount": 1677,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "author": null,
          "description": "This blog post shares optimization findings to speed up Transformer-based models’ CPU inference and improve computational demand in Google Cloud.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "publishedOn": "2022-02-14T08:59:12.513Z",
          "wordCount": 2672,
          "title": "Speeding up Transformer CPU inference in Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "author": null,
          "description": "How we apply machine learning techniques at Twitter to forecast SQL query resource utilization during the development and maintenance of our large-scale SQL system.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "publishedOn": "2022-02-13T12:12:33.673Z",
          "wordCount": 1917,
          "title": "Forecasting SQL query resource usage with machine learning"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-02-11T12:13:04.332Z",
          "wordCount": 2052,
          "title": "Next generation data insights using natural language queries"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html",
          "author": null,
          "description": "ol.lst-kix_p008n8rtcs1c-3.start{counter-reset:lst-ctn-kix_p008n8rtcs1c-3 0}.lst-kix_sr4t049r1bof-6>li{counter-increment:lst-ctn-kix_sr4t049r1bof-6}.lst-kix_ygk8qly5wagc-7>li:before{content:\"\\0025cb  \"}.lst-kix_p008n8rtcs1c-6>li{counter-increment:lst-ctn-kix_p008n8rtcs1c-6}.lst-kix_ygk8qly5wagc-6>li:before{content:\"\\0025cf  \"}.lst-kix_p008n8rtcs1c-7>li{counter-increment:lst-ctn-kix_p008n8rtcs1c-7}ol.lst-kix_p008n8rtcs1c-0.start{counter-reset:lst-ctn-kix_p008n8rtcs1c-0 0}.lst-kix_ygk8qly5wagc-8>li:before{content:\"\\0025a0  \"}ol.lst-kix_sr4t049r1bof-1.start{counter-reset:lst-ctn-kix_sr4t049r1bof-1 0}.lst-kix_sr4t049r1bof-5>li{counter-increment:lst-ctn-kix_sr4t049r1bof-5}.lst-kix_7tz9dwqwiu1-5>li:before{content:\"\\0025a0  \"}.lst-kix_7tz9dwqwiu1-4>li:before{content:\"\\0025cb  \"}.lst-kix_7tz9dwqwiu…",
          "link": "https://googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html",
          "publishedOn": "2022-02-10T16:58:00.000Z",
          "wordCount": 2910,
          "title": "A walk through Project Zero metrics"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47622",
          "author": "Anne van Kesteren",
          "description": "Writing high quality standards is a necessary first step to an interoperable web platform, but ensuring that browsers are consistent in their behavior requires an ongoing process. Browsers must work to ensure that they have a shared understanding of web standards, and that their implementation matches that understanding.\nInterop 2022 is a cross-browser initiative to find and address the most important interoperability pain points on the web platform. The end result is a public metric that will assess progress toward fixing these interoperability issues.\nThe post Announcing Interop 2022 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/03/interop-2022/",
          "publishedOn": "2022-03-03T17:00:02.000Z",
          "wordCount": 1151,
          "title": "Announcing Interop 2022"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47643",
          "author": "Hermina",
          "description": "If you’ve accessed the MDN website today, you probably noticed that it looks quite different. We hope it’s a good different. Let us explain!\nIn mid-2021 we started to think about modernizing MDN’s design, to create a clean and inviting website that makes navigating our 44,000 articles as easy as possible. We wanted to create a more holistic experience for our users, with an emphasis on improved navigability and a universal look and feel across all our pages. \nThe post A new year, a new MDN appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/03/a-new-year-a-new-mdn/",
          "publishedOn": "2022-03-01T14:00:24.000Z",
          "wordCount": 1321,
          "title": "A new year, a new MDN"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47607",
          "author": "Karl Dubost",
          "description": "Chrome and Firefox will reach version 100 in a couple of months. This has the potential to cause breakage on sites that rely on identifying the browser version to perform business logic.  This post covers the timeline of events, the strategies that Chrome and Firefox are taking to mitigate the impact, and how you can help.\nThe post Version 100 in Chrome and Firefox appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/02/version-100-in-chrome-and-firefox/",
          "publishedOn": "2022-02-15T18:05:20.000Z",
          "wordCount": 1166,
          "title": "Version 100 in Chrome and Firefox"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=63536",
          "author": "Scott Sanders",
          "description": "In February, we experienced one incident resulting in significant impact to multiple GitHub services.",
          "link": "https://github.blog/2022-03-02-github-availability-report-february-2022/",
          "publishedOn": "2022-03-02T23:24:53.000Z",
          "wordCount": 508,
          "title": "GitHub Availability Report: February 2022"
        },
        {
          "id": "https://github.blog/?p=63524",
          "author": "Thomas Dohmke",
          "description": "As the global response to the tragedies in Ukraine and other impacted regions continues to evolve, I wanted to share with our community an expansion of the message that I shared earlier this week with our Hubbers.",
          "link": "https://github.blog/2022-03-02-our-response-to-the-war-in-ukraine/",
          "publishedOn": "2022-03-02T21:56:01.000Z",
          "wordCount": 918,
          "title": "Our response to the war in Ukraine"
        },
        {
          "id": "https://github.blog/?p=63444",
          "author": "Ben De St Paer-Gotch",
          "description": "Explore and understand your overall GitHub-hosted Actions runner capacity with the new runner view.",
          "link": "https://github.blog/2022-02-23-new-way-understand-github-hosted-runner-capacity/",
          "publishedOn": "2022-02-23T19:54:16.000Z",
          "wordCount": 394,
          "title": "A new way to understand your GitHub-hosted runner capacity"
        },
        {
          "id": "https://github.blog/?p=63238",
          "author": "Tanmayee Kamath",
          "description": "The ability to prebuild codespaces is entering public beta. Enable fast environment creation times, regardless of the size and complexity of your repositories.",
          "link": "https://github.blog/2022-02-23-codespaces-largest-repositories-faster/",
          "publishedOn": "2022-02-23T18:10:01.000Z",
          "wordCount": 1014,
          "title": "Codespaces for the largest repositories just got faster"
        },
        {
          "id": "https://github.blog/?p=63410",
          "author": "Pulkit Agarwal",
          "description": "In-line with the other categories, workflows in the Security category will be recommended based on a repository's content.",
          "link": "https://github.blog/2022-02-22-get-started-using-security-workflows/",
          "publishedOn": "2022-02-22T17:18:57.000Z",
          "wordCount": 577,
          "title": "Get started with ease using security workflows!"
        },
        {
          "id": "https://github.blog/?p=63397",
          "author": "Kate Catlin",
          "description": "Anyone can now provide additional information to further the community’s understanding and awareness of security advisories.",
          "link": "https://github.blog/2022-02-22-github-advisory-database-now-open-to-community-contributions/",
          "publishedOn": "2022-02-22T17:00:43.000Z",
          "wordCount": 771,
          "title": "GitHub Advisory Database now open to community contributions"
        },
        {
          "id": "https://github.blog/?p=63340",
          "author": "Tiferet Gazit",
          "description": "Today we launched new code scanning analysis features powered by machine learning. The experimental analysis finds more of the most common types of vulnerabilities.",
          "link": "https://github.blog/2022-02-17-code-scanning-finds-vulnerabilities-using-machine-learning/",
          "publishedOn": "2022-02-17T18:00:03.000Z",
          "wordCount": 933,
          "title": "Code scanning finds more vulnerabilities using machine learning"
        },
        {
          "id": "https://github.blog/?p=63320",
          "author": "Tiferet Gazit",
          "description": "A behind-the-scenes peek into the machine learning framework powering new code scanning security alerts.",
          "link": "https://github.blog/2022-02-17-leveraging-machine-learning-find-security-vulnerabilities/",
          "publishedOn": "2022-02-17T17:59:19.000Z",
          "wordCount": 1982,
          "title": "Leveraging machine learning to find security vulnerabilities"
        },
        {
          "id": "https://github.blog/?p=63296",
          "author": "Kelsey Bernius",
          "description": "Tips from our developer advocates on how and why to find a mentor.",
          "link": "https://github.blog/2022-02-16-how-to-make-the-most-out-of-a-mentoring-relationship/",
          "publishedOn": "2022-02-16T18:17:15.000Z",
          "wordCount": 1637,
          "title": "How to make the most out of a mentoring relationship"
        },
        {
          "id": "https://github.blog/?p=63244",
          "author": "Jason White",
          "description": "Practical tips on how to apply OWASP Top 10 Proactive Control C4.",
          "link": "https://github.blog/2022-02-16-encoding-escaping-untrusted-data-prevent-injection-attacks/",
          "publishedOn": "2022-02-16T17:38:40.000Z",
          "wordCount": 1759,
          "title": "Encoding and escaping untrusted data to prevent injection attacks"
        },
        {
          "id": "https://github.blog/?p=63223",
          "author": "Ian Marsh",
          "description": "The GitHub Enterprise Server 3.4 release candidate delivers enhancements to make life easier and more productive, from keyboard shortcuts to auto-generated release notes!",
          "link": "https://github.blog/2022-02-15-ghes-3-4-developer-productivity-reusable-workflows-ci-cd/",
          "publishedOn": "2022-02-15T23:23:39.000Z",
          "wordCount": 1010,
          "title": "GitHub Enterprise Server 3.4 improves developer productivity and adds reusable workflows to CI/CD"
        },
        {
          "id": "https://github.blog/?p=63146",
          "author": "Anisha Pindoria",
          "description": "Over the past year, the GitHub Stars have made a tremendous impact in the community with their influence, inspiring and building communities and creating content to help everyone.",
          "link": "https://github.blog/2022-02-15-the-github-stars-in-our-eyes/",
          "publishedOn": "2022-02-15T17:17:19.000Z",
          "wordCount": 1484,
          "title": "The GitHub Stars in our eyes ⭐️"
        },
        {
          "id": "https://github.blog/?p=63095",
          "author": "Ashley Bass",
          "description": "The MLH Fellowship, powered by GitHub, is a 12-week internship alternative for aspiring software engineers. Meet the 2022 cohort!",
          "link": "https://github.blog/2022-02-15-announcing-2022-mlh-fellowship-cohort-powered-by-github/",
          "publishedOn": "2022-02-15T15:58:09.000Z",
          "wordCount": 1071,
          "title": "Announcing the 2022 MLH Fellowship Cohort, powered by GitHub"
        },
        {
          "id": "https://github.blog/?p=63053",
          "author": "Martin Woodward",
          "description": "A picture tells a thousand words. Now you can quickly create and edit diagrams in markdown using words with Mermaid support in your Markdown files.",
          "link": "https://github.blog/2022-02-14-include-diagrams-markdown-files-mermaid/",
          "publishedOn": "2022-02-14T16:57:42.000Z",
          "wordCount": 736,
          "title": "Include diagrams in your Markdown files with Mermaid"
        },
        {
          "id": "https://github.blog/?p=63029",
          "author": "Matt Butler",
          "description": "Stop context switching. Keep your team’s project planning next to your code.",
          "link": "https://github.blog/2022-02-11-getting-started-with-project-planning-on-github/",
          "publishedOn": "2022-02-11T17:30:43.000Z",
          "wordCount": 1347,
          "title": "Getting started with project planning on GitHub"
        },
        {
          "id": "https://github.blog/?p=62982",
          "author": "Brian Douglas",
          "description": "Reusable workflows offer a simple and powerful way to avoid copying and pasting workflows across your repositories.",
          "link": "https://github.blog/2022-02-10-using-reusable-workflows-github-actions/",
          "publishedOn": "2022-02-10T17:56:42.000Z",
          "wordCount": 1545,
          "title": "How to start using reusable workflows with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=62926",
          "author": "Nancy Gariché",
          "description": "A comprehensive guide for vulnerability reporters.",
          "link": "https://github.blog/2022-02-09-coordinated-vulnerability-disclosure-cvd-open-source-projects/",
          "publishedOn": "2022-02-09T20:24:56.000Z",
          "wordCount": 2526,
          "title": "Coordinated vulnerability disclosure (CVD) for open source projects"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18136",
          "author": "Matt Swann - Chief Technology Officer at Nubank",
          "description": "At Nubank, our set of engineering principles guides us towards having healthier teams and demonstrates the importance of having engineering voices over the entire development cycle\nThe post How to build and develop an engineering culture? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-to-build-and-develop-an-engineering-culture-by-matt-swann/",
          "publishedOn": "2022-03-07T18:25:50.000Z",
          "wordCount": 3594,
          "title": "How to build and develop an engineering culture?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18115",
          "author": "Nubank Press",
          "description": "The full earnings release has been made available on the Company’s Investor Relations website.\nThe post Nu Holdings Ltd. Reports Fourth Quarter and Full Year 2021 Financial Results appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/financial-results-2021/",
          "publishedOn": "2022-02-22T21:58:49.000Z",
          "wordCount": 5265,
          "title": "Nu Holdings Ltd. Reports Fourth Quarter and Full Year 2021 Financial Results"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/bounty/shifting-left-ethical-hackers-qa-gitlab",
          "author": "HackerOne",
          "description": "Secure applications start with secure code. As organizations deploy code faster than ever, implementing continuous security across the software development lifecycle (SDLC) is critical to building secure products. As a long-time HackerOne Bounty customer, GitLab knows the importance of identifying and addressing bugs as early as possible in the SDLC. We wanted to hear what they had to say about leveraging the human intelligence of ethical hackers to broadly test their attack surface and increase their ability to resist potential threats.",
          "link": "https://www.hackerone.com/bounty/shifting-left-ethical-hackers-qa-gitlab",
          "publishedOn": "2022-03-08T18:00:00.000Z",
          "wordCount": 2134,
          "title": "Shifting Left with Ethical Hackers: A Q&A with GitLab"
        },
        {
          "id": "https://hackerone.com/donating-bounties-humanitarian-efforts-ukraine",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/donating-bounties-humanitarian-efforts-ukraine",
          "publishedOn": "2022-03-04T01:35:23.000Z",
          "wordCount": 901,
          "title": "Donating Bounties to Humanitarian Efforts in Ukraine"
        },
        {
          "id": "https://hackerone.com/vulnerability-disclosure/securing-digital-transformation-vulnerability-disclosure-qa-john-deere",
          "author": "HackerOne",
          "description": "To help fortify security defenses for their customers, dealers, suppliers, and employees, John Deere recently launched a public Vulnerability Disclosure Program (VDP) with HackerOne.\n\nHackerOne recently met with James Johnson, CISO at John Deere, to learn why his security team works with ethical hackers to help identify security gaps and increase their product and data security.",
          "link": "https://www.hackerone.com/vulnerability-disclosure/securing-digital-transformation-vulnerability-disclosure-qa-john-deere",
          "publishedOn": "2022-02-09T16:00:00.000Z",
          "wordCount": 1429,
          "title": "Securing Digital Transformation with Vulnerability Disclosure: A Q&A with John Deere CISO, James Johnson"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/6deb1d2b57d1",
          "author": "Netflix Technology Blog",
          "description": "This blog post gives an overview of the Rapid Event Notification System at Netflix and shares some of the learnings gained while building it",
          "link": "https://netflixtechblog.com/rapid-event-notification-system-at-netflix-6deb1d2b57d1?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-02-18T15:30:24.000Z",
          "wordCount": 2012,
          "title": "Rapid Event Notification System at Netflix"
        },
        {
          "id": "https://medium.com/p/86525b3e21ca",
          "author": "Netflix Technology Blog",
          "description": "by Sam Setegne, Jai Balani, Olek Gorajek",
          "link": "https://netflixtechblog.com/data-pipeline-asset-management-with-dataflow-86525b3e21ca?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-02-09T17:33:22.000Z",
          "wordCount": 3155,
          "title": "Data pipeline asset management with Dataflow"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/pure-stock-portfolio-2-sales-1-buy",
          "author": "Market Radar",
          "description": "Changes to the Pure Stock Portfolio",
          "link": "https://marketradar.substack.com/p/pure-stock-portfolio-2-sales-1-buy",
          "publishedOn": "2022-03-07T17:51:34.000Z",
          "wordCount": null,
          "title": "Pure Stock Portfolio: 2 sales, 1 buy",
          "itunes": {},
          "enclosure": {
            "url": "https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/4694a29e-16cb-401a-8cdf-bdfd51f89c16_915x252.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/war-inflation-can-lead-to-stagflation",
          "author": "Market Radar",
          "description": "A real risk for the foreseeable future",
          "link": "https://marketradar.substack.com/p/war-inflation-can-lead-to-stagflation",
          "publishedOn": "2022-03-04T14:15:31.000Z",
          "wordCount": null,
          "title": "War + inflation can lead to stagflation",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F26728c10-80b6-4c1d-a6b5-83c865c3dd4c_924x661.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-0301",
          "author": "Market Radar",
          "description": "Performance check and Asset Allocation Changes",
          "link": "https://marketradar.substack.com/p/portfolio-review-0301",
          "publishedOn": "2022-03-01T18:09:21.000Z",
          "wordCount": null,
          "title": "Portfolio Review: 03.01",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa3eb3e33-87aa-471b-aded-3adc84ffe87f_591x380.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/10-portfolios-of-10-legendary-investors-ce9",
          "author": "Market Radar",
          "description": "Purchase and sales of the some of the most famous investors",
          "link": "https://marketradar.substack.com/p/10-portfolios-of-10-legendary-investors-ce9",
          "publishedOn": "2022-02-24T16:24:41.000Z",
          "wordCount": null,
          "title": "10 Portfolios of 10 Legendary Investors - Q4 '21",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F82bca483-a71d-4858-a234-3aca17f750bd_756x592.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/a-frustrating-month-for-markets",
          "author": "Market Radar",
          "description": "No signs of recovery for equities",
          "link": "https://marketradar.substack.com/p/a-frustrating-month-for-markets",
          "publishedOn": "2022-02-18T15:15:56.000Z",
          "wordCount": null,
          "title": "A frustrating month for markets",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F795b67f9-23c9-428e-b431-ec905e3d499d_944x706.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/the-pure-stocks-portfolio-rebalancing",
          "author": "Market Radar",
          "description": "Monthly purchases and a new stock ready to be bought",
          "link": "https://marketradar.substack.com/p/the-pure-stocks-portfolio-rebalancing",
          "publishedOn": "2022-02-16T16:54:31.000Z",
          "wordCount": null,
          "title": "The Pure Stocks Portfolio: Rebalancing and a new stock",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4910511e-10ae-4466-9f51-360b6f94a5b3_719x387.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/the-balanced-portfolio-rebalancing",
          "author": "Market Radar",
          "description": "Monthly purchases and changes to the asset allocation",
          "link": "https://marketradar.substack.com/p/the-balanced-portfolio-rebalancing",
          "publishedOn": "2022-02-15T17:04:53.000Z",
          "wordCount": null,
          "title": "The Balanced Portfolio: Rebalancing",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F88b8b00c-3eb8-4e21-96c4-d805d46557f8_598x387.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-1",
          "author": "Market Radar",
          "description": "Crypto, stocks and ETFs with an interesting graphic setup",
          "link": "https://marketradar.substack.com/p/charts-to-watch-1",
          "publishedOn": "2022-02-09T16:06:23.000Z",
          "wordCount": null,
          "title": "Charts to watch #1",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.substack.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff5698298-5d4d-4523-9dd6-1901f57c9dbc_953x564.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}