{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/12/app-defense-alliance-expansion.html",
          "author": null,
          "description": "Posted by Brooke Davis, Android Security and Privacy Team \nThe App Defense Alliance launched in 2019 with a mission to protect Android users from bad apps through shared intelligence and coordinated detection between alliance partners.  Earlier this year, the App Defense Alliance expanded to include new initiatives outside of malware detection and is now the home for several industry-led collaborations including Malware Mitigation, MASA (Mobile App Security Assessment) & CASA (Cloud App Security Assessment). With a new dedicated landing page at appdefensealliance.dev, the ADA has an expanded mission to protect Android users by removing threats while improving app quality across the ecosystem. Let’s walk through some of the latest program updates from the past year, including the addition o…",
          "link": "http://security.googleblog.com/2022/12/app-defense-alliance-expansion.html",
          "publishedOn": "2022-12-15T16:59:00.001Z",
          "wordCount": 1246,
          "title": "Expanding the App Defense Alliance"
        },
        {
          "id": "http://security.googleblog.com/2022/12/announcing-osv-scanner-vulnerability.html",
          "author": null,
          "description": "Posted by Rex Pan, software engineer, Google Open Source Security Team\nToday, we’re launching the OSV-Scanner, a free tool that gives open source developers easy access to vulnerability information relevant to their project. \nLast year, we undertook an effort to improve vulnerability triage for developers and consumers of open source software. This involved publishing the Open Source Vulnerability (OSV) schema and launching the OSV.dev service, the first distributed open source vulnerability database. OSV allows all the different open source ecosystems and vulnerability databases to publish and consume information  in one simple, precise, and machine readable format. \nThe OSV-Scanner is the next step in this effort, providing an officially supported frontend to the OSV database that connec…",
          "link": "http://security.googleblog.com/2022/12/announcing-osv-scanner-vulnerability.html",
          "publishedOn": "2022-12-13T18:00:00.000Z",
          "wordCount": 1278,
          "title": "Announcing OSV-Scanner: Vulnerability Scanner for Open Source"
        },
        {
          "id": "http://security.googleblog.com/2022/12/trust-in-transparency-private-compute.html",
          "author": null,
          "description": "Posted by Dave Kleidermacher, Dianne Hackborn, and Eugenio Marchiori  \nWe care deeply about privacy. We also know that trust is built by transparency. This blog, and the technical paper reference within, is an example of that commitment: we describe an important new Android privacy infrastructure called Private Compute Core (PCC). \nSome of our most exciting machine learning features use continuous sensing data — information from the microphone, camera, and screen. These features keep you safe, help you communicate, and facilitate stronger connections with people you care about. To unlock this new generation of innovative concepts, we built a specialized sandbox to privately process and protect this data.  \nAndroid Private Compute Core\n  \nPCC is a secure, isolated data processing environmen…",
          "link": "http://security.googleblog.com/2022/12/trust-in-transparency-private-compute.html",
          "publishedOn": "2022-12-08T16:59:00.001Z",
          "wordCount": 1027,
          "title": "Trust in transparency: Private Compute Core"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/7/1959",
          "author": null,
          "description": "While at EMNLP 2022, Daniel got a chance to sit down with an amazing group of researchers creating NLP technology that actually works for their local language communities. Just Zwennicker (Universiteit van Amsterdam) discusses his work on a machine translation system for Sranan Tongo, a creole language that is spoken in Suriname. Andiswa Bukula (SADiLaR), Rooweither Mabuya (SADiLaR), and Bonaventure Dossou (Lanfrica, Mila) discuss their work with Masakhane to strengthen and spur NLP research in African languages, for Africans, by Africans.\nThe group emphasized the need for more linguistically diverse NLP systems that work in scenarios of data scarcity, non-Latin scripts, rich morphology, etc. You don’t want to miss this one!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJust Zwennicker – LinkedIn\nAndiswa Bukula – Twitter\nRooweither Mabuya – Twitter\nBonaventure Dossou – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nEMNLP 2022 papers from the guests:\nTowards a general purpose machine translation system for Sranantongo\nMasakhaNER 2.0: Africa-centric Transfer Learning for Named Entity Recognition\nAfroLM: A Self-Active Learning-based Multilingual Pretrained Language Model for 23 African Languages\nOther links relevant to the discussion:\nMasakhane\nLanfrica\nThe South African Centre for Digital Language Resources (SADiLaR)\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/205",
          "publishedOn": "2023-01-03T20:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 205: NLP research by & for local communities",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/205/practical-ai-205.mp3",
            "length": "35493286",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/1Wqz",
          "author": "Jerod Santo",
          "description": "We don’t normally include how-tos in Changelog News, but I’m making an exception for this post because a) it goes deep on how Docker works on macOS, and b) this is a problem that plagues so many of us that I thought it worth pointing to a solution.\nThere’s also a nice bit about Development Containers at the end, which are quite promising, indeed.\nDiscuss on Changelog News",
          "link": "https://www.paolomainardi.com/posts/docker-performance-macos/",
          "publishedOn": "2023-01-03T16:35:00.000Z",
          "wordCount": null,
          "title": "Docker on macOS is slow and how to fix it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1a0",
          "author": "Jerod Santo",
          "description": "Very cool! Here’s the code for plotting a simple sin curve:\nimport { Mafs, CartesianCoordinates, FunctionGraph } from \"mafs\"\n\nfunction HelloFx() {\n  return (\n    <Mafs>\n      <CartesianCoordinates subdivisions={4} />\n      <FunctionGraph.OfX y={(x) => Math.sin(x)} />\n    </Mafs>\n  )\n}\n\n\nDiscuss on Changelog News",
          "link": "https://mafs.dev/",
          "publishedOn": "2023-01-03T15:46:00.000Z",
          "wordCount": null,
          "title": "React components for interactive math",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1958",
          "author": null,
          "description": "Jackson Huff’s clipboard powertool for the command line, Fernando Borretti thinks tools for thought should be unbundled, Listen Notes helps you run a microfeed on Cloudflare, Martin Rue says to be productive, be prepared & Paul Sawers takes TechCrunch readers inside Matrix and features its recent adoption wins.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nNotes and Links\nClipboard\nUnbundling Tools for Thought\nmicrofeed.org\nTo be productive, be prepared\nInside Matrix\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2023-01-02",
          "publishedOn": "2023-01-02T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Clipboard, unbundling tools for thought, microfeed, prepare to be productive & a look inside Matrix",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-01-02/the-changelog-news-2023-01-02.mp3",
            "length": "6257193",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/gw0J",
          "author": "Jerod Santo",
          "description": "Guillem Ballesteros:\nI have reached Vim nirvana with my latest setup. I can finally bring all the advantages of working within Jupyter to my favorite text editor. You get the code cells and interactive development with a fine-tuned editor and plain text files which can be put through linters and code formatters.\nHe goes on to share the plugins and config that make the nirvana happen.\nDiscuss on Changelog News",
          "link": "https://www.maxwellrules.com/misc/nvim_jupyter.html",
          "publishedOn": "2023-01-02T17:49:00.000Z",
          "wordCount": null,
          "title": "Using Jupyter Notebooks inside NeoVim",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM1D",
          "author": "Jerod Santo",
          "description": "If you’re better with words than you are with shapes, this git guide by Zach Musgrave may help you get out of the “I memorized N git commands but I have no idea how any of this works” phase.\nHere’s how Zach describes it:\nThe git commit graph and its relationship to common git workflows explained using simple English and easy to understand diagrams. Also some jokes.\nDiscuss on Changelog News",
          "link": "https://www.dolthub.com/blog/2022-12-14-wordcels-guide-to-git/",
          "publishedOn": "2023-01-02T16:59:00.000Z",
          "wordCount": null,
          "title": "The wordcel's guide to git",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X18e",
          "author": "Jerod Santo",
          "description": "You’ve probably done the whole deleted_at thing to mark records as deleted without actually deleting them from the database. That strategy is fraught for a few reasons.\nIn this post, Brandur Leach proposes an alternative strategy with the following endorsement:\nSpeaking from 30,000 feet, programming is all about tradeoffs. However, this is one of those rare places where as far as I can tell the cost/benefit skew is so disproportionate that the common platitude falls flat.\nAnytime your fellow developer can make that statement in earnest, whatever they’re talking about is worth a try…\nDiscuss on Changelog News",
          "link": "https://brandur.org/fragments/deleted-record-insert",
          "publishedOn": "2023-01-02T16:13:00.000Z",
          "wordCount": null,
          "title": "An alternative to `deleted_at` for soft record deletion",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1884",
          "author": null,
          "description": "Our 5th annual year-end wrap-up episode! Sit back, relax, pour a glass of your favorite beverage and join us for listener voice mails, our favorite episodes, some must-listens, and of course the top 5 most listened to episodes of the year. Thanks for listening! 💚\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nAdam Stacoviak – Mastodon, Twitter, GitHub, LinkedIn, Website\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nNotes and Links\nListener favs:\nGo Time #250: Mat’s GopherCon EU diary\nShip It! #44: Fundamentals with Kelsey Hightower\nThe Changelog #454: The return of Richard Hipp\nBackstage #18: Tenet with heavy spoilers\nBackstage #23: The Oban Pro with Parker Selbert\nThe Changelog #464: This insa…",
          "link": "https://changelog.com/podcast/520",
          "publishedOn": "2022-12-23T15:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 520: State of the \"log\" 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/520/the-changelog-520.mp3",
            "length": "85355570",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/13/1183",
          "author": null,
          "description": "We’re back! This is from our “lost episodes” — This is your brain…and this is your brain on burnout, any questions? OK, but seriously, burnout effects everyone, even if they/you don’t admit it. Burnout is a state of physical, emotional, and mental exhaustion caused by prolonged stress. It can affect ANYONE, but it is especially common among high-performers who push themselves to the limit. In this episode, we dive into the latest research on burnout and its effects on the brain, as well as offer practical advice for preventing and managing burnout. If you’re heading into 2023 feeling overwhelmed and drained, this episode is for you.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMireille Reece, PsyD – LinkedIn\nAdam Stacoviak – Mastodon, Twitter, GitHub, LinkedIn, Website\nNotes and Links\nBurnout and the Brain\nAlexandra Michel, MPH on Twitter\nAre you headed towards burnout?\nSimple Burnout Triage\nBrain Science #30: I’m just so stressed\nRecovering from burnout\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/brainscience/33",
          "publishedOn": "2022-12-20T21:00:00.000Z",
          "wordCount": null,
          "title": "Brain Science 33: Your brain on burnout",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/brainscience/33/brain-science-33.mp3",
            "length": "68059672",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1947",
          "author": null,
          "description": "To wrap up the year we’re talking about what’s breaking the internet, again. Yes, we’re talking about ChatGPT and we’re joined by our good friend Shawn “swyx” Wang. Between his writings on L-Space Diaries and his AI notes repo on GitHub, we had a lot to cover around the world of AI and what might be coming in 2023.\nAlso, we have one more show coming out before the end of the year — our 5th annual “State of the log” episode where Adam and Jerod look back at the year and talk through their favorite episodes of the year and feature voices from the community. So, stay tuned for that next week.\nDiscuss on Changelog News\nChangelog++ members get a bonus 16 minutes at the end of this episode and zero ads. Join today!\nSponsors\nFly.io – The home of Changelog.com — Deploy your apps and databases clos…",
          "link": "https://changelog.com/podcast/519",
          "publishedOn": "2022-12-16T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 519: GPT has entered the chat",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/519/the-changelog-519.mp3",
            "length": "72274465",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1922",
          "author": null,
          "description": "Deno creator Ryan Dahl goes one-on-one with Jerod to discuss their new npm support, why he’s so excited about JavaScript containers, Deno Deploy’s present & future, what he thinks about alternative runtimes like Bun, WinterCG, how Wasm fits into the story & more!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nLolo Code – If you’re familiar with building severless apps, think of Lolo Code as your backend with a visual editor that lets you think and build at the same time. All this without having to provision or manage servers. Use the visual editor to build your app, connect nodes, and add any npm libraries you need. You can even write your own integrations. This makes Lolo Code very Zapier-ish, but for devs. Try it free today with no credit card required at lolo.co/jsparty\n\n    \nFeaturing\nRyan Dahl – GitHub, Website\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nNotes and Links\nRyan on The Changelog #443\nDeno 1.28 announcement\nJavaScript ShadowRealms\nJavaScript Containers\nWinterCG\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/256",
          "publishedOn": "2022-12-16T18:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 256: Big news in Deno Land",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/256/js-party-256.mp3",
            "length": "52915663",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ZoQk",
          "author": "Jerod Santo",
          "description": "On Wednesday, Stability AI announced it would allow artists to remove their work from the training dataset for an upcoming Stable Diffusion 3.0 release. The move comes as an artist advocacy group called Spawning tweeted that Stability AI would honor opt-out requests collected on its Have I Been Trained website. The details of how the plan will be implemented remain incomplete and unclear, however.\nThis seems like a step in the right direction, but it appears that artists will have to proactively register and manually flag matched images in the database. Ain’t nobody got time for that!\nDiscuss on Changelog News",
          "link": "https://arstechnica.com/information-technology/2022/12/stability-ai-plans-to-let-artists-opt-out-of-stable-diffusion-3-image-training/",
          "publishedOn": "2022-12-16T15:18:00.000Z",
          "wordCount": null,
          "title": "Stability AI plans to let artists opt out of Stable Diffusion 3 image training",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1944",
          "author": null,
          "description": "Mat invites Bartłomiej Płotka, Kemal Akkoyun & Christian Simon to discuss how to make Go code more efficient through modern observability practices.\nDiscuss on Changelog News\nChangelog++ members get a bonus 12 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nBartlomiej Płotka – Mastodon, Twitter, GitHub, LinkedIn, Website\nKemal Akkoyun – Mastodon, Twitter, GitHub, LinkedIn\nChristian Simon – Twitter\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nBartek’s “Efficient Go” Book\nVitess Benchmark\nTools for Monitoring Applications Logs\nPrometheus library for Go\nProfiling Go Programs\npprof tool (also available in go tool pprof)\npkg.go.dev/net/http/pprof\npkg.go.dev/runtime/pprof\nBuilding a Go Profiler using Go\nLiz Rice on eBPF\nArena proposal\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/260",
          "publishedOn": "2022-12-15T22:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 260: Making Go more efficient",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/260/go-time-260.mp3",
            "length": "60069470",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zDmn",
          "author": "Martin Heinz",
          "description": "Python’s magic methods - also known as dunder (double underscore) methods - can be used to implement a lot of cool things. Most of the time we use them for simple stuff, such as constructors (__init__), string representation (__str__, __repr__) or arithmetic operators (__add__/__mul__). There are however many more magic methods which you probably haven’t heard about and in this article we will explore all of them (even the hidden and undocumented).\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/87",
          "publishedOn": "2022-12-15T17:07:00.000Z",
          "wordCount": null,
          "title": "Python magic methods you haven’t heard about",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgeb",
          "author": "Jerod Santo",
          "description": "If you operate an SSH server that receives connections from the public, you owe it to yourself to read this list of things you can do to lock that sucker down.\nDiscuss on Changelog News",
          "link": "https://ittavern.com/ssh-server-hardening/",
          "publishedOn": "2022-12-15T16:19:00.000Z",
          "wordCount": null,
          "title": "SSH server hardening",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qp78",
          "author": "Jerod Santo",
          "description": "sqlite-loadable-rs is a new framework for writing fast, performant, and mostly-safe SQLite extensions in Rust. These extensions are nearly as fast those written in C, with the added benefit of Rust’s memory safety features, easy access to thousands of 3rd party crates and packages on crates.io, all while maintaining a splendid developer experience.\nDiscuss on Changelog News",
          "link": "https://observablehq.com/@asg017/introducing-sqlite-loadable-rs",
          "publishedOn": "2022-12-15T15:27:00.000Z",
          "wordCount": null,
          "title": "A framework for building SQLite extensions in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1934",
          "author": null,
          "description": "Eight months ago, in 🎧 episode 49, Alex Sims (Solutions Architect & Senior Software Engineer at James & James) shared with us his ambition to help migrate a monolithic PHP app running on AWS EC2 to a more modern architecture. The idea was some serverless, some EKS, and many incremental improvements.\nSo how did all of this work out in practice? How did the improved system cope with the Black Friday peak, as well as all the following Christmas orders? Thank you Alex for sharing with us your Ship It! inspired Kaizen story. It’s a wonderful Christmas present! 🎄🎁\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFeaturing\nAlex Sims – Twitter, LinkedIn\nGerhard Lazu – Twitter, GitHub, Website\nNotes and Links\n\n\n\n  \n\n\n  \n\n\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/shipit/83",
          "publishedOn": "2022-12-15T14:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 83: 🎄 Planning for failure to ship faster 🎁",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/83/ship-it-83.mp3",
            "length": "62821957",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qM1e",
          "author": "Jerod Santo",
          "description": "Congrats to the entire Svelte team (and contributors) for this release, which culminates two years of effort:\nWe’re so excited to share this release with you. It’s the culmination of thousands of hours of work, both from the Svelte core team and the wider community, and we think it’s the most enjoyable way to build production-grade websites, whether you’re a solo developer working on a small project or part of a large team.\nDiscuss on Changelog News",
          "link": "https://svelte.dev/blog/announcing-sveltekit-1.0",
          "publishedOn": "2022-12-14T18:42:00.000Z",
          "wordCount": null,
          "title": "Announcing SvelteKit 1.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V173",
          "author": "Jerod Santo",
          "description": "Tony Parker writing on Swift’s blog:\nWhen Swift began life as an open source project, we wanted to open not just the language itself, but the ecosystem around it. Foundation has been instrumental in the success of decades of software and has been an integral part of the Swift developer experience from the beginning, and we knew it had to be included in the open source offering.\nHistorically, Apple’s open source efforts have varied in just how open they are when it comes to community. On that topic, this is an uplifting bit of prose:\nOpen source projects are at their best when the community of users can participate and become a community of developers. A new, open contribution process will be available to enable all developers to contribute new API to Foundation.\nThis new Foundation project is slated to launch on GitHub in 2023.\nDiscuss on Changelog News",
          "link": "https://www.swift.org/blog/future-of-foundation/",
          "publishedOn": "2022-12-14T16:41:00.000Z",
          "wordCount": null,
          "title": "Apple's Swift rewrite of its Foundation framework will be open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y71e",
          "author": "Jerod Santo",
          "description": "Jacob O’Bryant’s “Grand Vision For How Social Media Ought To Be”:\nthere should be a bunch of different:\npublishing services, like Substack and Ghost\nreading apps, like Gmail and Matter\ncommunity platforms, like Slack and Discord\nand we should look for ways to make these reading, publishing, and community services all play nicely together. I’m calling this model “the unbundled web,” and I think RSS should be the primary method of interop.\nWhere do I sign up? 😉\nDiscuss on Changelog News",
          "link": "https://tfos.co/p/rebuild-social-media/",
          "publishedOn": "2022-12-14T15:00:01.000Z",
          "wordCount": null,
          "title": "How to rebuild social media on top of RSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jg5d",
          "author": "Jerod Santo",
          "description": "Setting up Rails for the first time with all the dependencies necessary can be daunting for beginners. Docked Rails attempts to flatten the onboarding curve by only requiring a working Docker installation in order to get started making a new Rails application, working with that application during development, and running a basic server. All based on pre-configured commands and dependencies living in a Docker image.\nGetting started is as easy as:\ndocker volume create ruby-bundle-cache\nalias rails='docker run --rm -it -v ${PWD}:/rails -v ruby-bundle-cache:/bundle dhh37/rails'\nalias rails-server='docker run --rm -it -v ${PWD}:/rails -v ruby-bundle-cache:/bundle -p 3000:3000 dhh37/rails server -b 0.0.0.0'\n\nDiscuss on Changelog News",
          "link": "https://github.com/rails/docked",
          "publishedOn": "2022-12-14T13:57:00.000Z",
          "wordCount": null,
          "title": "Running Rails from Docker for easy start to development",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8ln6",
          "author": "Jerod Santo",
          "description": "After 5+ years working for GitLab, Brendan O’Leary is moving on to his next adventure.\nI’m so proud of what we built—and I’m still proud and awed by the remarkable people there. GitLab’s values are the gold standard for what it means to be a wonderful company—for the team-members, for the community, and for the shareholders.\nHe took a moment to write down a few things he learned while there. The bullet points follow, but you’ll have to visit his blog for all the details:\nWrite down everything\nGive and accept: ownership, agency, and responsibility\nBe transparent with a low level of shame\nDiscuss on Changelog News",
          "link": "https://blog.boleary.dev/what-i-learned-at-gitlab-that-i-dont-want-to-forget/",
          "publishedOn": "2022-12-13T20:51:00.000Z",
          "wordCount": null,
          "title": "What I learned at GitLab that I don't want to forget",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1950",
          "author": null,
          "description": "José and Ricardo joined Daniel at EMNLP 2022 to discuss state-of-the-art machine translation, the WMT shared tasks, and quality estimation. Among other things, they talk about Unbabel’s innovations in quality estimation including COMET, a neural framework for training multilingual machine translation (MT) evaluation models.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nRicardo Rei – Twitter\nJosé Souza – Twitter\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nUnbabel\nCOMET\nThe WMT workshop/ conference\nEMNLP\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/204",
          "publishedOn": "2022-12-13T19:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 204: SOTA machine translation at Unbabel",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/204/practical-ai-204.mp3",
            "length": "29454127",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1bP",
          "author": "Adam Stacoviak",
          "description": "Nick Cameron works on Rust at Microsoft. He shared these desires for Rust in 2023.\nThe core team used to call for blog posts to help plan the next year. The core team has pretty much disappeared and certainly hasn’t called for blog posts, but I’m going to write one anyway because I have opinions and I want you to hear them. Sorry. I think you should write such a post too!\nDiscuss on Changelog News",
          "link": "https://www.ncameron.org/blog/rust-in-2023/",
          "publishedOn": "2022-12-13T13:45:00.000Z",
          "wordCount": null,
          "title": "Rust in 2023",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1948",
          "author": null,
          "description": "tRPC helps you move fast and break nothing, Michael Muré embeds a bug tracker in git, Fatih Kadir Akın curates some awesome ChatGPT prompts, Mike Nikles thinks dev environments in the cloud are a half-baked solution & Georgi Gerganov ports OpenAI’s Whisper model to a lightweight, portable C/C++ program.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nNotes and Links\n📥 Subscribe to Changelog’s Weekly newsletter\ntRPC.io\nMichaelMure/git-bug\nAwesome ChatGPT Prompts\nDev environments in the cloud are a half-baked solution\nggerganov/whisper.cpp\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-12-12",
          "publishedOn": "2022-12-12T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: tRPC, a bug tracker embedded in git, awesome ChatGPT prompts, half-baked cloud dev envs & Whisper.cpp",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-12-12/the-changelog-news-2022-12-12.mp3",
            "length": "7259779",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Mbw6",
          "author": "Adam Stacoviak",
          "description": "I thouroughly enjoyed reading this. It’s interesting to think about the evolution of transport storage. To this day, the USB thumb drive has proved to be the long-term winner and something I personally use very often. Wanna install Debian or do a clean install of macOS? You’ll likely do it by creating a bootable USB thumb drive.\nBefore the invention of the thumb drive, computer users stored and transported their files using floppy disks. Developed by IBM in the 1960s, first 8-inch and later 5 ¼-inch and 3 ½-inch floppy disks replaced cassette tapes as the most practical portable storage media. Floppy disks were limited by their relatively small storage capacity—even double-sided, double-density disks could store only 1.44 MB of data. During the 1990s, as the size of files and software increased…\nWould you be surprised to learn that the supposed inventor of the thumb drive is in jail right now in Singapore? But why?\nDiscuss on Changelog News",
          "link": "https://spectrum.ieee.org/thumb-drive",
          "publishedOn": "2022-12-12T18:25:34.000Z",
          "wordCount": null,
          "title": "Who really invented the thumb drive?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXNe",
          "author": "Jerod Santo",
          "description": "SQLite has few functions compared to other database management systems. SQLite authors see this as a feature rather than a problem, because SQLite has an extension mechanism in place.\nThere are a lot of SQLite extensions out there, but they are incomplete, inconsistent and scattered across the internet. sqlean brings them together, neatly packaged into domain modules, documented, tested, and built for Linux, Windows and macOS.\nThink of it like an extended standard library for SQLite.\nDiscuss on Changelog News",
          "link": "https://github.com/nalgeon/sqlean",
          "publishedOn": "2022-12-12T15:36:00.000Z",
          "wordCount": null,
          "title": "The ultimate set of SQLlite extensions",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9l8y",
          "author": "Jerod Santo",
          "description": "Stephan Schmidt warns: “We have invited complexity through the door. But it will not leave as easily.”\nOne way to simplify your stack and reduce the moving parts, speed up development, lower the risk and deliver more features in your startup is “Use Postgres for everything”. Postgres can replace - up to millions of users - many backend technologies, Kafka, RabbitMQ, Mongo and Redis among them.\nHe then goes on to list nine things you can use Postgres for that replace more specific solutions: fulltext search, geospatial queries, etc.\nDiscuss on Changelog News",
          "link": "https://www.amazingcto.com/postgres-for-everything/",
          "publishedOn": "2022-12-12T14:48:00.000Z",
          "wordCount": null,
          "title": "Just use Postgres for everything",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1869",
          "author": null,
          "description": "This week we’re joined by Christina Warren, Senior Developer Advocate at GitHub, and a true tech and pop culture connoisseur. From her days at Mashable covering the intersections of entertainment and technology, to Gizmodo, to Microsoft, and now her current role at GitHub we talk with Christina about her journey from journalist to developer, and the latest happenings coming out of GitHub Universe.\nBTW, we’re planning to get Christina on Backstage in the new year to talk about Plex, MakeMKV, and all things that go into hosting your own media server. Drop a commment on this episode with a +1 if you want to see that happen.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nInfluxData – With its data collector…",
          "link": "https://changelog.com/podcast/518",
          "publishedOn": "2022-12-09T22:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 518: Coming home to GitHub",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/518/the-changelog-518.mp3",
            "length": "74930931",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1824",
          "author": null,
          "description": "KBall interviews CSS instructor & YouTuber extraordinaire Kevin Powell in a wide ranging discussion about CSS and how to learn it - what to start with, what to ignore, and various topics in between.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers…",
          "link": "https://changelog.com/jsparty/255",
          "publishedOn": "2022-12-09T17:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 255: Learning CSS in 2023",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/255/js-party-255.mp3",
            "length": "50880328",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/AX46",
          "author": "Jerod Santo",
          "description": "Phlex views are “plain old Ruby objects” — templates are methods and HTML tags are method calls. If you know how to define a class with a method that calls another method, you know how to use Phlex.\nWhen it comes to API usability, Ruby is so tough to beat. This looks actually fun to use!\nclass Nav < Phlex::HTML\n  def template\n    nav(class: \"main-nav\") {\n      ul {\n        li { a(href: \"/\") { \"Home\" } }\n        li { a(href: \"/about\") { \"About\" } }\n        li { a(href: \"/contact\") { \"Contact\" } }\n      }\n    }\n  end\nend\n\nDiscuss on Changelog News",
          "link": "https://www.phlex.fun/",
          "publishedOn": "2022-12-09T16:14:00.000Z",
          "wordCount": null,
          "title": "A framework for building fast, reusable, testable views in pure Ruby",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWpZ",
          "author": "Jerod Santo",
          "description": "How will large language models (LLMs) change the world?\nNo one knows. With such uncertainty, a good exercise is to look for historical analogies—to think about other technologies and ask what would happen if LLMs played out the same way.\nI like to keep things concrete, so I’ll discuss the impact of LLMs on writing. But most of this would also apply to the impact of LLMs on other fields, as well as other AI technologies like AI art/music/video/code.\nWhat follows are 13 examples of technological innovations that changed the world and description of how they affected they way people work. Here’s an example analogy of Feet and Segways:\nFirst, there was walking. Then the Segway came to CHANGE THE NATURE OF HUMAN TRANSPORT. Twenty years later, there is still walking, plus occasionally low-key alternatives like electric scooters.\nIn this analogy, LLMs work fine but just aren’t worth the trouble in most cases and society doesn’t evolve to integrate them. Domain-specific LLMs are used for some applications, but we start to associate “general” LLMs with tourists and mall cops. George W. Bush falls off an LLM on vacation and everyone loses their minds.\nDiscuss on Changelog News",
          "link": "https://dynomight.net/llms/",
          "publishedOn": "2022-12-09T15:26:00.000Z",
          "wordCount": null,
          "title": "Historical analogies for large language models",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdJM",
          "author": "Jerod Santo",
          "description": "José Valim announces Bumblebee and walks you through how to run ML modules in Livebook with just three clicks. Finally, he shows you how to embed a model into a Phoenix app. So cool!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=g3oyh3g1AtQ",
          "publishedOn": "2022-12-08T23:29:00.000Z",
          "wordCount": null,
          "title": "Bumblebee: GPT2, Stable Diffusion, and more in Elixir",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1867",
          "author": null,
          "description": "Ivan Kwiatkowski joins Natalie once again for a follow-up episode to Hacking with Go: Part 2. This time we’ll get Ivan’s perspective on the way Go’s security features are designed and used, from the user/hacker perspective. And of course we will also talk about how AI fits into all this…\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nFeaturing\nIvan Kwiatkowski – Mastodon, Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nHacking with Go: Part 1\nHacking with Go: Part 2\nPascal (programming language)\nHacking tool: IDA Pro\nHacking tool: Ghidra\nStowaway – Multi-hop Proxy Tool for pentesters\nIvan’s video on reversing a Go malware\n“Stylometry” - recognizing author by code style, talk from the CCC 2014\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/259",
          "publishedOn": "2022-12-08T22:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 259: Hacking with Go: Part 3",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/259/go-time-259.mp3",
            "length": "56055586",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1939",
          "author": null,
          "description": "Narayanan Raghavan leads the global SRE organization that runs Red Hat managed cloud services including OpenShift Dedicated, Azure Red Hat Openshift, Red Hat OpenShift Service on AWS, and Red Hat OpenShift Data Science among others across the three major cloud providers: AWS, GCP & Azure. We start with a high-level discussion about DevOps, SRE & platform engineering, and then we dig into SRE specifics, including what it takes to safely roll out updates across many tens of thousands of OpenShift clusters.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insight…",
          "link": "https://changelog.com/shipit/82",
          "publishedOn": "2022-12-08T19:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 82: Red Hat's approach to SRE",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/82/ship-it-82.mp3",
            "length": "65292874",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/O58N",
          "author": "Jerod Santo",
          "description": "Julia Evans is working on a new zine about debugging, so she took to Mastodon to ask for tips and compiled a list of the best ones (with explainers). Here’s a short list of some tips covered:\nsearch for the request’s ID\ncorrelate between different systems\ncheck that a “suspicious” error is actually new\nDiscuss on Changelog News",
          "link": "https://jvns.ca/blog/2022/12/07/tips-for-analyzing-logs/",
          "publishedOn": "2022-12-08T15:49:00.000Z",
          "wordCount": null,
          "title": "Tips for analyzing logs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1Wnn",
          "author": "Jerod Santo",
          "description": "A series of 8 free data puzzles to be released daily starting on December 18th. Created by Saul Pwanson (author of VisiData) as an analogue to the popular Advent of Code, but for data nerds who want to find answers in a dataset, rather than hack on algorithms.\nDiscuss on Changelog News",
          "link": "https://hanukkah.bluebird.sh/",
          "publishedOn": "2022-12-08T15:00:00.000Z",
          "wordCount": null,
          "title": "Hanukkah of Data",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwZG",
          "author": "Jerod Santo",
          "description": "OpenAI recently released a model for automatic speech recognition called Whisper. I decided to reimplement the inference of the model from scratch using C/C++. To achieve this I implemented a minimalistic tensor library in C and ported the high-level architecture of the model in C++. The entire code is less than 8000 lines of code and is contained in just 2 source files without any third-party dependencies.\nState of the art voice recognition without any PyTorch baggage and it’s optimized to run on Apple Silicon!\nDiscuss on Changelog News",
          "link": "https://github.com/ggerganov/whisper.cpp",
          "publishedOn": "2022-12-07T21:49:00.000Z",
          "wordCount": null,
          "title": "OpenAI's Whisper model ported to C/C++",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1946",
          "author": null,
          "description": "In this special episode, we interview some of the sponsors and teams from a recent case competition organized by Purdue University, Microsoft, INFORMS, and SIL International. 170+ teams from across the US and Canada participated in the competition, which challenged students to create AI-driven systems to caption images in three languages (Thai, Kyrgyz, and Hausa).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMatthew Lanham – Twitter, Website\nMark Tabladillo – Twitter, LinkedIn\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nPurdue University’s Krannert School of Business\nMaster the basics of Azure: AI Fundamentals\nAzure Architecture Center\nSIL International\nThe bloom-captioning dataset\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/203",
          "publishedOn": "2022-12-07T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 203: AI competitions & cloud resources",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/203/practical-ai-203.mp3",
            "length": "32788404",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X1Wp",
          "author": "Jerod Santo",
          "description": "Andrea Leopardi likens database migrations to git commits and wonders why we don’t leave them in the past and load an up-to-date SQL file instead. He also shares his approach to this in Elixir.\nDiscuss on Changelog News",
          "link": "https://andrealeopardi.com/posts/get-rid-of-your-old-database-migrations/",
          "publishedOn": "2022-12-07T16:50:00.000Z",
          "wordCount": null,
          "title": "Get rid of your old database migrations",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ml43",
          "author": "Jerod Santo",
          "description": "Wait-for-secrets GitHub Action waits for the developer to enter secrets during a workflow run. Developers can enter secrets using a web browser and use them in the workflow.\nThis seems like a good enough solution to yet another battle between security and usability.\nDiscuss on Changelog News",
          "link": "https://github.com/step-security/wait-for-secrets",
          "publishedOn": "2022-12-07T16:03:00.000Z",
          "wordCount": null,
          "title": "A way to publish from GitHub Actions using multi-factor authentication",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rnQ",
          "author": "Jerod Santo",
          "description": "I had the honor of joining the fine folks at Elixir SF awhile back to talk all about how we’ve been podcasting on Elixir for a long time now. Tune in if you’re curious about such things and/or if you’d like to take a stroll down memory lane as I show old versions of our album art and play our intro music along the way.\nThe preso is average, but the Q&A near the end is above average, if you ask me. OH! And also we got Zoom bombed twice, which was a first for me. Thankfully, it was also a last. So far, at least…\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=qech2rRMQR8",
          "publishedOn": "2022-12-06T17:26:00.000Z",
          "wordCount": null,
          "title": "Podcasting on Elixir for the better half of a decade",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jnr",
          "author": "Jerod Santo",
          "description": "Simon Willison is using this year’s Advent of Code as an opportunity to learn Rust.\nHe’s using Copilot to help him with syntax/snippets via comment-driven prompting. He’s using ChatGPT as a study partner by asking it questions about how to do things in Rust. Is it working?\nSo far I think this is working really well.\nI feel like I’m beginning to get a good mental model of how Rust works, and a lot of the basic syntax is beginning to embed itself into my muscle memory.\nThe real test is going to be if I can first make it to day 25 (with no prior Advent of Code experience I don’t know how much the increasing difficulty level will interfere with my learning) and then if I can actually write a useful Rust program after that without any assistance from these AI models.\nAnd honestly, the other big benefit here is that this is simply a lot of fun. I’m finding interacting with AIs in this way—as an actual exercise, not just to try them out—is deeply satisfying and intellectually stimulating.\nThis might be an early glimpse into the future of AI-assisted learning…\nDiscuss on Changelog News",
          "link": "https://simonwillison.net/2022/Dec/5/rust-chatgpt-copilot/",
          "publishedOn": "2022-12-06T16:04:00.000Z",
          "wordCount": null,
          "title": "Learning Rust with ChatGPT, Copilot and Advent of Code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOqd",
          "author": "Jerod Santo",
          "description": "Spotify’s annual “Wrapped” campaign is so successful we’re starting to see it copy/pasted to various other social networks. This GitHub version is by a 3rd-party, though, so they have a lot of API limitations to work around. It’s a cool service, but be prepared to see “Incomplete Data. Please refresh later to finish loading.”\nDiscuss on Changelog News",
          "link": "https://www.githubtrends.io/wrapped",
          "publishedOn": "2022-12-06T15:18:00.000Z",
          "wordCount": null,
          "title": "Reflect on your year with GitHub Wrapped",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/taco-bell/",
          "author": null,
          "description": "Delivering on our first Twitter promise!",
          "link": "https://blog.comma.ai/taco-bell/",
          "publishedOn": "2022-12-21T10:00:00.000Z",
          "wordCount": 1205,
          "title": "A drive to Taco Bell"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/inside-google/2022-at-google/",
          "author": null,
          "description": "A recap of Google’s top announcements and initiatives in 2022.",
          "link": "https://blog.google/inside-google/2022-at-google/",
          "publishedOn": "2022-12-29T17:00:00.000Z",
          "wordCount": 1768,
          "title": "Google's 2022 year in review"
        },
        {
          "id": "https://blog.google/technology/ai/helping-robots-learn-from-each-other/",
          "author": null,
          "description": "A look at how Transformers are helping robots become more useful.",
          "link": "https://blog.google/technology/ai/helping-robots-learn-from-each-other/",
          "publishedOn": "2022-12-13T15:00:00.000Z",
          "wordCount": 1505,
          "title": "Helping robots learn from each other"
        },
        {
          "id": "https://blog.google/outreach-initiatives/sustainability/startups-for-sustainable-development/",
          "author": null,
          "description": "Google's Startups for Sustainable Development program supports impact-driven startups who are building a more sustainable future.",
          "link": "https://blog.google/outreach-initiatives/sustainability/startups-for-sustainable-development/",
          "publishedOn": "2022-12-06T21:56:00.000Z",
          "wordCount": 1421,
          "title": "How startups can help build a sustainable future"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=21147",
          "author": "Daniel Stenberg",
          "description": "A generous member of the wider curl community stepped up and donated an unused Mac mini m1 model to me to be used for curl development. Today it arrived at my home. An 8C CPU/16GB/1TB/8C GPU/1GbE model as per the sticker on the box. Apple is not helping Apple has shipped and used curl in … Continue reading An m1 for curl →",
          "link": "https://daniel.haxx.se/blog/2022/12/30/an-m1-for-curl/",
          "publishedOn": "2022-12-29T23:04:26.000Z",
          "wordCount": 708,
          "title": "An m1 for curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20805",
          "author": "Daniel Stenberg",
          "description": "When a client connects to a TLS server it gets sent one or more certificates during the handshake. Those certificates are verified by the client, to make sure that the server is indeed the right one: the server the client expects it to be; no impostor and no man in the middle etc. When such … Continue reading curl -w certs →",
          "link": "https://daniel.haxx.se/blog/2022/12/28/curl-w-certs/",
          "publishedOn": "2022-12-28T08:15:50.000Z",
          "wordCount": 906,
          "title": "curl -w certs"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20286",
          "author": "Daniel Stenberg",
          "description": "Today, another 1,000 commits have been recorded as done by me in the curl source code git repository since November 2021. Out of a total of 29,608 commits to the curl source code repository, I have made 17,001. 57.42%. The most recent one was PR #10019. In 2022, I have done 56% of all the … Continue reading At 17000 curl commits →",
          "link": "https://daniel.haxx.se/blog/2022/12/27/at-17000-curl-commits/",
          "publishedOn": "2022-12-27T21:44:54.000Z",
          "wordCount": 364,
          "title": "At 17000 curl commits"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20985",
          "author": "Daniel Stenberg",
          "description": "curl supports globbing in the sense that you can provide ranges or lists in the URL that will make curl iterate, loop, over all the different variations and do a separate transfer for each. For example, get ten images in a numeric range: curl \"https://example.com/image[1-10].jpg\" -O Or get them when named after some weekdays: curl … Continue reading The curl fragment trick →",
          "link": "https://daniel.haxx.se/blog/2022/12/23/the-curl-fragment-trick/",
          "publishedOn": "2022-12-23T13:44:33.000Z",
          "wordCount": 947,
          "title": "The curl fragment trick"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19480",
          "author": "Daniel Stenberg",
          "description": "tldr: several hundred hours of dedicated scrutinizing of curl by a team of security experts resulted in two CVEs and a set of less serious remarks. The link to the reports is at the bottom of this article. Thanks to an OpenSSF grant, OSTIF helped us set up a curl security audit, which the excellent … Continue reading The 2022 curl security audit →",
          "link": "https://daniel.haxx.se/blog/2022/12/21/the-2022-curl-security-audit/",
          "publishedOn": "2022-12-21T21:57:56.000Z",
          "wordCount": 1410,
          "title": "The 2022 curl security audit"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20937",
          "author": "Daniel Stenberg",
          "description": "Numbers the 212th release5 changes56 days (total: 9,042)155 bug-fixes (total: 8,492)238 commits (total: 29,571)0 new public libcurl function (total: 91)2 new curl_easy_setopt() option (total: 302)1 new curl command line option (total: 249)83 contributors, 40 new (total: 2,771)42 authors, 20 new (total: 1,101)2 security fixes (total: 132)Bug Bounties total: 48,580 USD Release presentation At 10:00 CET … Continue reading curl 7.87.0 →",
          "link": "https://daniel.haxx.se/blog/2022/12/21/curl-7-87-0/",
          "publishedOn": "2022-12-21T07:12:49.000Z",
          "wordCount": 1491,
          "title": "curl 7.87.0"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=21134",
          "author": "Daniel Stenberg",
          "description": "In the Swiss crime comedy TV series Tschugger, season two episode two at roughly 25:20, there is a shot with a curl command line in a terminal window using an unnecessary –request option. Following the curl line is what looks like an interactive login procedure, which certainly is not something a real curl would present. … Continue reading curl sighting: Tschugger →",
          "link": "https://daniel.haxx.se/blog/2022/12/19/curl-sighting-tschugger/",
          "publishedOn": "2022-12-19T07:22:12.000Z",
          "wordCount": 400,
          "title": "curl sighting: Tschugger"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20978",
          "author": "Daniel Stenberg",
          "description": "IDN, International Domain Names, is the concept that lets us register and use international characters in domain names, and by international we of course mean characters outside of the ASCII range. Recently I have fought some battles against IDN and IDN decoding so I felt this urge to write a lot of words about it … Continue reading IDN is crazy →",
          "link": "https://daniel.haxx.se/blog/2022/12/14/idn-is-crazy/",
          "publishedOn": "2022-12-14T07:59:28.000Z",
          "wordCount": 1932,
          "title": "IDN is crazy"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20904",
          "author": "Daniel Stenberg",
          "description": "In the 2021 movie Silk Road, at around 19:23-19:26 into the film we can see Ross Ulbricht, the lead character, write a program on his laptop that uses curl. A few seconds we get a look at the screen as Ross types on the keyboard and explains to the female character who says I didn’t … Continue reading curl sighting: Silk Road →",
          "link": "https://daniel.haxx.se/blog/2022/12/10/curl-sighting-silk-road/",
          "publishedOn": "2022-12-10T16:45:53.000Z",
          "wordCount": 653,
          "title": "curl sighting: Silk Road"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20828",
          "author": "Daniel Stenberg",
          "description": "This adventure started with an issue where a user pointed out that the libcurl function for base64 encoding actually would allocate a few bytes too many at times. That turned out to be true and we fixed it fairly quickly. As I glanced at that base64 encoder function that was still loaded and showing in … Continue reading Faster base64 in curl →",
          "link": "https://daniel.haxx.se/blog/2022/12/06/faster-base64-in-curl/",
          "publishedOn": "2022-12-06T07:58:05.000Z",
          "wordCount": 2160,
          "title": "Faster base64 in curl"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-12-23T12:15:57.586Z",
          "wordCount": 1839,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2022-12-23T12:15:57.570Z",
          "wordCount": 2270,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-12-22T12:16:47.278Z",
          "wordCount": 1353,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-12-17T12:14:40.752Z",
          "wordCount": 890,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-12-17T12:14:40.738Z",
          "wordCount": 1277,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2022-12-16T12:15:55.027Z",
          "wordCount": 1708,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-12-13T12:17:39.710Z",
          "wordCount": 832,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-12-09T12:16:41.549Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-12-09T12:16:40.103Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-12-09T12:16:39.933Z",
          "wordCount": 1494,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/12/exploiting-CVE-2022-42703-bringing-back-the-stack-attack.html",
          "author": null,
          "description": "Seth Jenkins, Project Zero\n\nThis blog post details an exploit for CVE-2022-42703 (P0 issue 2351 - Fixed 5 September 2022), a bug Jann Horn found in the Linux kernel's memory management (MM) subsystem that leads to a use-after-free on struct anon_vma. As the bug is very complex (I certainly struggle to understand it!), a future blog post will describe the bug in full. For the time being, the issue tracker entry, this LWN article explaining what an anon_vma is and the commit that introduced the bug are great resources in order to gain additional context.\nSetting the scene\nSuccessfully triggering the underlying vulnerability causes folio->mapping to point to a freed anon_vma object. Calling madvise(..., MADV_PAGEOUT)can then be used to repeatedly trigger accesses to the freed anon_vma in foli…",
          "link": "https://googleprojectzero.blogspot.com/2022/12/exploiting-CVE-2022-42703-bringing-back-the-stack-attack.html",
          "publishedOn": "2022-12-08T19:04:00.000Z",
          "wordCount": 2498,
          "title": "Exploiting CVE-2022-42703 - Bringing back the stack attack"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47943",
          "author": "Francesca Minelli",
          "description": "A product is first an idea, then a project, and then a prototype. Here, at Mozilla, our awesome community is there every step of the way to support and contribute to our products. None of what we do would be possible without this multicultural, multilingual community of like-minded people working together to be a better internet. \nThe post How the Mozilla Community helps shape our products appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/12/how-the-mozilla-community-helps-to-shape-our-products/",
          "publishedOn": "2022-12-07T18:48:54.000Z",
          "wordCount": 1314,
          "title": "How the Mozilla Community helps shape our products"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=69278",
          "author": "Logan MacLaren",
          "description": "Learn about the design behind, and solutions to, several of GitHub’s CTF challenge for Ekoparty’s 2022 event!",
          "link": "https://github.blog/2022-12-30-github-and-the-ekoparty-2022-capture-the-flag/",
          "publishedOn": "2022-12-30T17:00:31.000Z",
          "wordCount": 2597,
          "title": "GitHub and the Ekoparty 2022 Capture the Flag"
        },
        {
          "id": "https://github.blog/?p=69252",
          "author": "Laura Lindeman",
          "description": "As the year winds down, we're highlighting some of the incredible work from GitHub’s engineers, product teams, and security researchers.",
          "link": "https://github.blog/2022-12-29-githubs-top-10-blog-posts-of-2022/",
          "publishedOn": "2022-12-29T17:00:44.000Z",
          "wordCount": 704,
          "title": "GitHub’s top 10 blog posts of 2022"
        },
        {
          "id": "https://github.blog/?p=69198",
          "author": "Michelle Mannering",
          "description": "What in the world do rubber ducks have to do with programming? And why were they everywhere at GitHub Universe? A lot of you asked, so I’m here to help explain.",
          "link": "https://github.blog/2022-12-23-whats-with-all-the-ducks/",
          "publishedOn": "2022-12-23T17:00:11.000Z",
          "wordCount": 811,
          "title": "What’s with all the ducks?"
        },
        {
          "id": "https://github.blog/?p=69259",
          "author": "Toya East",
          "description": "This year, we took GitHub Gives, our company-wide giving campaign, to new heights and wanted to share our learnings to provide best practices in programming a successful hybrid giving campaign for employees.",
          "link": "https://github.blog/2022-12-21-github-gives-2022-creating-positive-lasting-contributions-in-our-communities/",
          "publishedOn": "2022-12-21T16:06:49.000Z",
          "wordCount": 1394,
          "title": "GitHub Gives 2022: Creating positive, lasting contributions in our communities"
        },
        {
          "id": "https://github.blog/?p=69237",
          "author": "Jeimy Ruiz",
          "description": "Forrester's Total Economic Impact™ study dives into how GitHub Enterprise Cloud and GitHub Advanced Security help businesses drive ROI, increase developer productivity, and save time on developer onboarding.",
          "link": "https://github.blog/2022-12-20-increase-developer-productivity-save-time-on-developer-onboarding-and-drive-roi-in-2023/",
          "publishedOn": "2022-12-20T18:00:26.000Z",
          "wordCount": 1716,
          "title": "Increase developer productivity, save time on developer onboarding, and drive ROI in 2023"
        },
        {
          "id": "https://github.blog/?p=69213",
          "author": "Jessi Moths",
          "description": "GitHub Enterprise has evolved to support the needs of enterprise administrators, corporate security teams, and individual developers who contribute to open source.",
          "link": "https://github.blog/2022-12-20-emus-more-than-just-flightless-birds/",
          "publishedOn": "2022-12-20T18:00:13.000Z",
          "wordCount": 1257,
          "title": "Not just flightless birds: How EMUs secure and scale identity and access management for your GitHub Enterprise"
        },
        {
          "id": "https://github.blog/?p=69220",
          "author": "Mike Hanley",
          "description": "Our engineering and security teams have done some incredible work in 2022. Let’s take a look at how we use GitHub to be more productive, build collaboratively, and shift security left.",
          "link": "https://github.blog/2022-12-20-how-we-use-github-to-be-more-productive-collaborative-and-secure/",
          "publishedOn": "2022-12-20T17:00:33.000Z",
          "wordCount": 1682,
          "title": "How we use GitHub to be more productive, collaborative, and secure"
        },
        {
          "id": "https://github.blog/?p=69175",
          "author": "Martin Woodward",
          "description": "What’s the state of open source and how has it changed over the last decade? GitHub’s VP of Developer Relations, Martin Woodward, tackles that question and more in a 2022 keynote.",
          "link": "https://github.blog/2022-12-19-video-how-has-open-source-changed-in-the-last-10-years/",
          "publishedOn": "2022-12-19T15:14:22.000Z",
          "wordCount": 6414,
          "title": "[Video] How has open source changed in the last 10 years?"
        },
        {
          "id": "https://github.blog/?p=68919",
          "author": "Michelle Mannering",
          "description": "We promised we’d be back soon and here we are! There has been an incredible amount of open source projects shipping major version releases before the year wraps up. I can’t believe we are all saying that now. “When the year wraps up!” or “See you next year!” What happened to 2022? Well, we know […]",
          "link": "https://github.blog/2022-12-16-release-radar-nov-2022/",
          "publishedOn": "2022-12-16T19:00:22.000Z",
          "wordCount": 1698,
          "title": "Release Radar · November 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=69128",
          "author": "Mariam Sulakian",
          "description": "GitHub now allows you to track any leaked secrets in your public repository, for free. With secret scanning alerts, you can track and action on leaked secrets directly within GitHub.",
          "link": "https://github.blog/2022-12-15-leaked-a-secret-check-your-github-alerts-for-free/",
          "publishedOn": "2022-12-15T17:00:52.000Z",
          "wordCount": 978,
          "title": "Leaked a secret? Check your GitHub alerts…for free"
        },
        {
          "id": "https://github.blog/?p=69126",
          "author": "Mariam Sulakian",
          "description": "With just one click, admins in GitHub Advanced Security organizations can protect their custom patterns on push.",
          "link": "https://github.blog/2022-12-15-github-advanced-security-customers-can-now-push-protect-their-custom-patterns/",
          "publishedOn": "2022-12-15T17:00:38.000Z",
          "wordCount": 1031,
          "title": "GitHub Advanced Security customers can now push protect their custom patterns"
        },
        {
          "id": "https://github.blog/?p=69113",
          "author": "John Swanson",
          "description": "GitHub will require all users who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023. Learn more about our approach, when we’ll begin our rollout, and what you can expect as we begin requiring 2FA.",
          "link": "https://github.blog/2022-12-14-raising-the-bar-for-software-security-next-steps-for-github-com-2fa/",
          "publishedOn": "2022-12-14T17:00:15.000Z",
          "wordCount": 1149,
          "title": "Raising the bar for software security: next steps for GitHub.com 2FA"
        },
        {
          "id": "https://github.blog/?p=69101",
          "author": "Lindsey Wild",
          "description": "GitHub’s search inputs have several complex accessibility considerations. Let’s dive into what those are, how we addressed them, and talk about the standalone, reusable component that was ultimately built.",
          "link": "https://github.blog/2022-12-13-creating-an-accessible-search-experience-with-the-querybuilder-component/",
          "publishedOn": "2022-12-13T16:08:24.000Z",
          "wordCount": 2177,
          "title": "Creating an accessible search experience with the QueryBuilder component"
        },
        {
          "id": "https://github.blog/?p=69083",
          "author": "Taylor Blau",
          "description": "Another new release of Git is here to end the year! Take a look at some of our highlights on what's new in Git 2.39.",
          "link": "https://github.blog/2022-12-12-highlights-from-git-2-39/",
          "publishedOn": "2022-12-12T15:50:38.000Z",
          "wordCount": 1941,
          "title": "Highlights from Git 2.39"
        },
        {
          "id": "https://github.blog/?p=68917",
          "author": "Michelle Mannering",
          "description": "Before you say it, yes, the October Release Radar was supposed to be shared in November. But with Hackatoberfest, GitHub Universe, Turkey Day, and in real life (IRL) conferences returning to their pre-COVID frequency, we’ve all been so busy. And our community has been hustling to ship all kinds of open source projects. We wanted […]",
          "link": "https://github.blog/2022-12-09-release-radar-october-2022/",
          "publishedOn": "2022-12-09T19:00:32.000Z",
          "wordCount": 1260,
          "title": "Release Radar · October 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=69029",
          "author": "Natalie Somersall",
          "description": "How much does it really cost to buy more powerful cloud compute resources for development work? A lot less than you think.",
          "link": "https://github.blog/2022-12-08-experiment-the-hidden-costs-of-waiting-on-slow-build-times/",
          "publishedOn": "2022-12-08T18:00:02.000Z",
          "wordCount": 1984,
          "title": "Experiment: The hidden costs of waiting on slow build times"
        },
        {
          "id": "https://github.blog/?p=69019",
          "author": "Karen Bella",
          "description": "We delivered two different courses specifically designed to help students in the lowest-income neighborhood of Montevideo, Uruguay learn how to use GitHub and understand the value of open source.",
          "link": "https://github.blog/2022-12-08-git-commit-uruguay-lowering-barriers-to-make-software-development-more-inclusive-and-diverse/",
          "publishedOn": "2022-12-08T17:00:06.000Z",
          "wordCount": 859,
          "title": "Git Commit Uruguay: Lowering barriers to make software development more inclusive and diverse"
        },
        {
          "id": "https://github.blog/?p=68995",
          "author": "Inbal Shani",
          "description": "GitHub is in an exciting phase of our journey as the developer community grows significantly every day, and the needs of the community grow and change with it. Today we’re introducing our new Chief Product officer.",
          "link": "https://github.blog/2022-12-08-hello-from-githubs-new-chief-product-officer/",
          "publishedOn": "2022-12-08T16:59:59.000Z",
          "wordCount": 646,
          "title": "Hello from GitHub’s new Chief Product Officer"
        },
        {
          "id": "https://github.blog/?p=68972",
          "author": "Shuyin Zhao",
          "description": "GitHub Copilot for Business is officially here with simple license management, organization-wide policy controls, and industry-leading privacy—all for $19 USD per user per month.",
          "link": "https://github.blog/2022-12-07-github-copilot-is-generally-available-for-businesses/",
          "publishedOn": "2022-12-07T17:34:23.000Z",
          "wordCount": 1139,
          "title": "GitHub Copilot is generally available for businesses"
        },
        {
          "id": "https://github.blog/?p=68986",
          "author": "Jakub Oleksy",
          "description": "In November, we experienced two incidents that resulted in degraded performance across GitHub services. This report also sheds light into an incident that impacted Codespaces in October.",
          "link": "https://github.blog/2022-12-07-github-availability-report-november-2022/",
          "publishedOn": "2022-12-07T17:00:37.000Z",
          "wordCount": 1190,
          "title": "GitHub Availability Report: November 2022"
        },
        {
          "id": "https://github.blog/?p=68998",
          "author": "Monish Mohan",
          "description": "Now you can create tokens with fine-grained permissions for automating your publishing and organization management workflows. And a new code explorer allows you to view content of a package directly in the npm portal.",
          "link": "https://github.blog/2022-12-06-new-npm-features-for-secure-publishing-and-safe-consumption/",
          "publishedOn": "2022-12-06T17:42:23.000Z",
          "wordCount": 1360,
          "title": "New npm features for secure publishing and safe consumption"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19803",
          "author": "BU Team",
          "description": "In less than six months, a small team of 6 Software Engineers, 2 Designers, 1 Business Analyst, 1 PM, 1 PMM and 1 Tech Manager built Nubank’s first social feature.\nThe post NuBolão: How we built Nubank’s first social feature in less than six months appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-nubank-built-nubolao/",
          "publishedOn": "2022-12-21T22:35:14.000Z",
          "wordCount": 3617,
          "title": "NuBolão: How we built Nubank’s first social feature in less than six months"
        },
        {
          "id": "https://building.nubank.com.br/?p=19930",
          "author": "Felipe Almeida - Machine Learning Engineer at Nubank",
          "description": "In this post we'll go over some of the lessons we learned over the last years retraining models in an automatic fashion at Nubank.\nThe post Automatic retraining for machine learning models: tips and lessons learned appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/automatic-retraining-for-machine-learning-models/",
          "publishedOn": "2022-12-19T22:40:47.000Z",
          "wordCount": 4813,
          "title": "Automatic retraining for machine learning models: tips and lessons learned"
        },
        {
          "id": "https://building.nubank.com.br/?p=19819",
          "author": "Bruno Rodrigues - Senior Engineering Manager at Nubank",
          "description": "Find out what is a functional paradigm, how it differs from other paradigms and how we use that technology at Nubank.\nThe post What is functional programming and how do we use that technology at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/functional-programming-technology-at-nubank/",
          "publishedOn": "2022-12-16T18:30:55.000Z",
          "wordCount": 3716,
          "title": "What is functional programming and how do we use that technology at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19782",
          "author": "Victor Campanha",
          "description": "Product Designers are responsible for designing solutions that leave a positive impact using thorough understanding of the clients' and the business's needs. Check out more about this career:\nThe post What is It like being a Product Designer at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/product-designer-at-nubank/",
          "publishedOn": "2022-12-14T15:59:20.000Z",
          "wordCount": 3452,
          "title": "What is It like being a Product Designer at Nubank?"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/visualizing-live-hacking-events-hackers-break-records-h1-702",
          "author": "HackerOne",
          "description": "Checkout this infographic for a more detailed look at stats, hacker perspectives, and highlights of our event. Be sure to checkout all of our H@ckti",
          "link": "https://www.hackerone.com/hackerone-community-blog/visualizing-live-hacking-events-hackers-break-records-h1-702",
          "publishedOn": "2022-12-21T22:02:33.000Z",
          "wordCount": 590,
          "title": "Visualizing Live Hacking Events: Hackers Break Records at H1-702"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hacker-afk-jason-haddix",
          "author": "HackerOne",
          "description": "Today's hacker Jason Haddix \nJXoaT: So, what was your first experience with the word hacker? \nJason: My first exposure was similar to ot",
          "link": "https://www.hackerone.com/hackerone-community-blog/hacker-afk-jason-haddix",
          "publishedOn": "2022-12-15T16:34:28.000Z",
          "wordCount": 2014,
          "title": "Hacker AFK: Jason Haddix"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-drsniper",
          "author": "HackerOne",
          "description": "What made you want to become an ambassador?  \nI love meeting and getting to know new people. Regarding cybersecurity, it is fun talking to peop",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-drsniper",
          "publishedOn": "2022-12-10T03:05:02.000Z",
          "wordCount": 1612,
          "title": "Ambassador Spotlight: DrSniper"
        },
        {
          "id": "https://hackerone.com/application-security/how-human-testers-improve-application-security",
          "author": "HackerOne",
          "description": "A suite of DevSecOps tools is available to automate reviews, audits, tests, and scans throughout the development pipeline, which have become standard",
          "link": "https://www.hackerone.com/application-security/how-human-testers-improve-application-security",
          "publishedOn": "2022-12-10T01:00:00.000Z",
          "wordCount": 859,
          "title": "How Human Testers Improve Application Security"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}