{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2023/04/celebrating-slsa-v10-securing-software.html",
          "author": null,
          "description": "Bob Callaway, Staff Security Engineer, Google Open Source Security team\n\n\nLast week the Open Source Security Foundation (OpenSSF) announced the release of SLSA v1.0, a framework that helps secure the software supply chain. Ten years of using an internal version of SLSA at Google has shown that it’s crucial to warding off tampering and keeping software secure. It’s especially gratifying to see SLSA reaching v1.0 as an open source project—contributors have come together to produce solutions that will benefit everyone. \n\nSLSA for safer supply chains \nU.S. Executive Order on Cybersecurity and the associated NIST Secure Software Development Framework (SSDF) to guide national standards for software used by the U.S. government, as well as the Network and Information Security (NIS2) Directive in t…",
          "link": "http://security.googleblog.com/2023/04/celebrating-slsa-v10-securing-software.html",
          "publishedOn": "2023-04-26T15:00:00.003Z",
          "wordCount": 1114,
          "title": "Celebrating SLSA v1.0: securing the software supply chain for everyone"
        },
        {
          "id": "http://security.googleblog.com/2023/04/google-authenticator-now-supports.html",
          "author": null,
          "description": "Christiaan Brand, Group Product Manager\n\n\n\n\n\n\n\n\n\n\nWe are excited to announce an update to Google Authenticator, across both iOS and Android, which adds the ability to safely backup your one-time codes (also known as one-time passwords or OTPs) to your Google Account.\n\n\n\nAcross all of your online accounts, signing in is the front door to your personal information. It’s also the primary entry point for risks, making it important to protect.\n\n\n\nWe make signing into Google, and all the apps and services you love, simple and secure with built-in authentication tools like Google Password Manager and Sign in with Google, as well as automatic protections like alerts when your Google Account is being accessed from a new device. \n\n\n\nWe released Google Authenticator in 2010 as a free and easy way for…",
          "link": "http://security.googleblog.com/2023/04/google-authenticator-now-supports.html",
          "publishedOn": "2023-04-24T16:00:00.001Z",
          "wordCount": 1168,
          "title": "Google Authenticator now supports Google Account synchronization"
        },
        {
          "id": "http://security.googleblog.com/2023/04/securely-hosting-user-data-in-modern.html",
          "author": null,
          "description": "Posted by David Dworken, Information Security Engineer, Google Security Team\n\n\nMany web applications need to display user-controlled content. This can be as simple as serving user-uploaded images (e.g. profile photos), or as complex as rendering user-controlled HTML (e.g. a web development tutorial). This has always been difficult to do securely, so we’ve worked to find easy, but secure solutions that can be applied to most types of web applications. \n\nClassical Solutions for Isolating Untrusted Content\n“sandbox domains”. The basic idea is that if your application's main domain is example.com, you could serve all untrusted content on exampleusercontent.com. Since these two domains are cross-site, any malicious content on exampleusercontent.com can’t impact example.com. \n\n\nThis approach can…",
          "link": "http://security.googleblog.com/2023/04/securely-hosting-user-data-in-modern.html",
          "publishedOn": "2023-04-18T16:00:00.001Z",
          "wordCount": 2225,
          "title": "Securely Hosting User Data in Modern Web Applications"
        },
        {
          "id": "http://security.googleblog.com/2023/04/supply-chain-security-for-go-part-1.html",
          "author": null,
          "description": "Posted by Julie Qiu, Go Security & Reliability and Oliver Chang, Google Open Source Security Team\n\n\nHigh profile open source vulnerabilities have made it clear that securing the supply chains underpinning modern software is an urgent, yet enormous, undertaking. As supply chains get more complicated, enterprise developers need to manage the tidal wave of vulnerabilities that propagate up through dependency trees. Open source maintainers need streamlined ways to vet proposed dependencies and protect their projects. A rise in attacks coupled with increasingly complex supply chains means that supply chain security problems need solutions on the ecosystem level. \n\n\nOne way developers can manage this enormous risk is by choosing a more secure language. As part of Google’s commitment to advancing…",
          "link": "http://security.googleblog.com/2023/04/supply-chain-security-for-go-part-1.html",
          "publishedOn": "2023-04-13T16:00:00.001Z",
          "wordCount": 1584,
          "title": "Supply chain security for Go, Part 1: Vulnerability management"
        },
        {
          "id": "http://security.googleblog.com/2023/04/announcing-depsdev-api-critical.html",
          "author": null,
          "description": "Posted by Jesper Sarnesjo and Nicky Ringland, Google Open Source Security Team\n\n\nToday, we are excited to announce the deps.dev API, which provides free access to the deps.dev dataset of security metadata, including dependencies, licenses, advisories, and other critical health and security signals for more than 50 million open source package versions.\n\n\nSoftware supply chain attacks are increasingly common and harmful, with high profile incidents such as Log4Shell, Codecov, and the recent 3CX hack. The overwhelming complexity of the software ecosystem causes trouble for even the most diligent and well-resourced developers. \n\n\nWe hope the deps.dev API will help the community make sense of complex dependency data that allows them to respond to—or even prevent—these types of attacks. By integ…",
          "link": "http://security.googleblog.com/2023/04/announcing-depsdev-api-critical.html",
          "publishedOn": "2023-04-11T16:05:00.001Z",
          "wordCount": 1546,
          "title": "Announcing the deps.dev API: critical dependency data for secure supply chains"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/1/2026",
          "author": null,
          "description": "This week Adam talks with Andy Klein from Backblaze about hard drive reliability at scale.\nLeave us a comment\nChangelog++ members get a bonus 15 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nDevCycle – Build better software with DevCycle. Feature flags, without the tech debt. DevCycle is a Feature Flag Management platform designed to help you build maintainable code at scale.\n\nSentry – See the untested code causing errors - or whether it’s partially or fully covered - directly in your stack trace, so you can avoid similar errors from happening in the future. Use the code CHANGELOG and get the team plan free for three months.\n\nPostman – Build APIs together — More than 20 million developers use Postman for building and using APIs. Postman simplifies each step of …",
          "link": "https://changelog.com/podcast/537",
          "publishedOn": "2023-04-26T21:00:00.000Z",
          "wordCount": null,
          "title": "Changelog Interviews 537: Hard drive reliability at scale",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/537/the-changelog-537.mp3",
            "length": "97115701",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/2061",
          "author": null,
          "description": "With all the LLM hype, it’s worth remembering that enterprise stakeholders want answers to “why” questions. Enter causal inference. Paul Hünermund has been doing research and writing on this topic for some time and joins us to introduce the topic. He also shares some relevant trends and some tips for getting started with methods including double machine learning, experimentation, difference-in-difference, and more.\nLeave us a comment\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy you…",
          "link": "https://changelog.com/practicalai/220",
          "publishedOn": "2023-04-25T16:35:00.000Z",
          "wordCount": null,
          "title": "Practical AI 220: Causal inference",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/220/practical-ai-220.mp3",
            "length": "40858338",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/16/2060",
          "author": null,
          "description": "The dataset wars are heating up, Bark is a transformer-based text-to-audio model that can generate highly realistic, multilingual speech as well as other audio, Kent Beck needs to recalibrate after using ChatGPT, the team behind Stable Diffusion release a new open source language model & Mitchel Hashimoto weighs in on prompt engineering.\nLeave us a comment\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code CHANGELOG and get the team plan free for three months.\n\n\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\nAll links mentioned in this episode of Changelog News (and more) are in its companion newsletter.\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:47) - Dataset wars\n(02:05) - Bark\n(03:07) - Kent Beck\n(04:12) - StableLM\n(05:05) - Sponsor: Sentry\n(06:10) - Blind prompting\n(07:12) - Outro",
          "link": "https://changelog.com/news/41",
          "publishedOn": "2023-04-24T19:25:00.000Z",
          "wordCount": null,
          "title": "Changelog News 41: Dataset wars, Bark, Kent Beck needs to recalibrate, StableLM & blind prompting is not prompt engineering",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/news/41/changelog-news-41.mp3",
            "length": "7998519",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/2051",
          "author": null,
          "description": "Feross and his team at Socket recently shipped a wrapper library for the ubiquitous npm package manager’s command-line interface that brings enhanced security when you need it most: before executing any code\nBradly Farias lead this effort, so Jerod & Chris invited him on the show to learn all about it.\nLeave us a comment\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (…",
          "link": "https://changelog.com/jsparty/272",
          "publishedOn": "2023-04-21T17:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 272: Making \"safe npm\"",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/272/js-party-272.mp3",
            "length": "60074418",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/4/2059",
          "author": null,
          "description": "This week Adam is joined by Alex Gallego, Founder & CEO at Redpanda Data, to share his builder journey to create the Redpanda streaming data platform.\nLeave us a comment\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nSentry – Session Replay! Rewind and replay every step of the user’s journey before and after they encountered an issue. Eliminate the guesswork and get to the root cause of an issue, faster. Use the code CHANGELOG and get the team plan free for three months.\n\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at developer.squareup.com to dive into the docs, APIs, SDKs and to create y…",
          "link": "https://changelog.com/founderstalk/95",
          "publishedOn": "2023-04-20T21:30:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 95: Builder journey to streaming data platform",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/founderstalk/95/founders-talk-95.mp3",
            "length": "67707772",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/2057",
          "author": null,
          "description": "Large Language Model (LLM) capabilities have reached new heights and are nothing short of mind-blowing! However, with so many advancements happening at once, it can be overwhelming to keep up with all the latest developments. To help us navigate through this complex terrain, we’ve invited Raj - one of the most adept at explaining State-of-the-Art (SOTA) AI in practical terms - to join us on the podcast.\nRaj discusses several intriguing topics such as in-context learning, reasoning, LLM options, and related tooling. But that’s not all! We also hear from Raj about the rapidly growing data science and AI community on TikTok.\nLeave us a comment\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fa…",
          "link": "https://changelog.com/practicalai/219",
          "publishedOn": "2023-04-19T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 219: Capabilities of LLMs 🤯",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/219/practical-ai-219.mp3",
            "length": "36758004",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/2002",
          "author": null,
          "description": "This week we’re joined by Zach Latta, the Founder of Hack Club. At 16, Zach tested out of high school and moved to SF to join Yo as their first engineer. After playing a key role at Yo, he founded Hack Club to help teen hackers start coding clubs around the world. Today, teen hackers can meet IRL, online, at a hackathon, or leverage Hack Club Bank a fiscal sponsor to create their own organization. Hack Club is the program Zach wished he had in high school.\nLeave us a comment\nChangelog++ members save 10 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nDevCycle – Build better software with DevCycle. Feature flags, without the tech debt. DevCycle is a Feature Flag Management platform designed to help you build maintainable code at scale.\n\nPostman – Build …",
          "link": "https://changelog.com/podcast/536",
          "publishedOn": "2023-04-19T18:15:00.000Z",
          "wordCount": null,
          "title": "Changelog Interviews 536: How do you do, fellow Hack Clubbers?",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/536/the-changelog-536.mp3",
            "length": "89601347",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/16/2055",
          "author": null,
          "description": "Kara Deloss announces GitHub Accelerator’s 2023 cohort, Databricks releases the first open source, instruction-following LLM, fine-tuned on a human-generated instruction dataset licensed for research and commercial use, Mihai Parparita writes how he improved Tailscale thanks to Apple’s open source & Neal Fennimore asks and answers the question: Passkeys: what the heck and why?!\nLeave us a comment\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nPostman – Build APIs together — More than 20 million developers use Postman for building and using APIs. Postman simplifies each step of the API lifecycle and streamlines collaboration so you can create better APIs—faster.\n\n\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\nAll links mentioned in this episode of Changelog News (and more) are in its companion newsletter.\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:32) - GitHub's first Accelerator\n(01:29) - Databricks frees Dolly!\n(03:11) - Improving Tailscale via OSS\n(04:20) - Sponsor: Postman\n(05:56) - What the heck are passkeys?\n(07:28) - Outro",
          "link": "https://changelog.com/news/40",
          "publishedOn": "2023-04-17T19:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News 40: Free Dolly, GitHub Accelerator's cohort, improving Tailscale via Apple’s open source & what the heck are passkeys?!",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/news/40/changelog-news-40.mp3",
            "length": "8349517",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/2050",
          "author": null,
          "description": "The panel dives into a topic that makes most software developers cringe: Professional networking. Starting with a definition - what does it even mean? - they go into hacks they’ve found for getting more comfortable with networking, building your network in person or online, and then using your network to find new job opportunities or consulting work.\nLeave us a comment\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run y…",
          "link": "https://changelog.com/jsparty/271",
          "publishedOn": "2023-04-14T19:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 271: I'd like to add you to my professional network",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/271/js-party-271.mp3",
            "length": "48453746",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1852",
          "author": null,
          "description": "This week we’re talking with Cory Doctorow (this episode contains explicit language) about his newest book Chokepoint Capitalism, which he co-autored with Rebecca Giblin. Chokepoint Capitalism is about how big tech and big content have captured creative labor markets and the ways we can win them back. We talk about chokepoints creating chickenized reverse-centaurs, paying for your robot boss (think Uber, Doordash, Amazon Drivers), the chickenization that’s climbing the priviledge gradient from the most blue collar workers to the middle-class. There are chokepoints in open source, AI generative art, interoperability, music, film, and media. To quote Cory, “We’re all fighting the same fight.”\nLeave us a comment\nChangelog++ members save 8 minutes on this episode because they made the ads disa…",
          "link": "https://changelog.com/podcast/535",
          "publishedOn": "2023-04-14T17:00:00.000Z",
          "wordCount": null,
          "title": "Changelog Interviews 535: Examining capitalism's chokepoints",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/535/the-changelog-535.mp3",
            "length": "84175162",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/2020",
          "author": null,
          "description": "Matthew Boyle, the author of Domain-Driven Design with Golang, sits down with Jon & Mat to talk about (you guessed it!) DDD with Go.\nLeave us a comment\nChangelog++ members get a bonus 6 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nMatthew Boyle – Twitter, GitHub, Website\nJon Calhoun – Twitter, GitHub, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\n\nShow Notes:\n\nMatt’s book on DDD w/ Go\nJon on DDD\nThe big blue book; the famous DDD book that started it all.\nThe big red book\nMartin Fowler on CQRS\nSnactiv\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:44) - Welcoming Matt to the show\n(02:34) - What is domain-driven design?\n(09:57) - DDD? FML!\n(13:39) - Little DDD wins\n(17:57) - DDD scorecards\n(22:17) - Identifying DDD code\n(25:13) - Sponsor: Changelog++\n(26:09) - DDD for monoliths?\n(32:56) - DDD overhead\n(34:43) - DDD and gRPC\n(39:43) - A thought experiment\n(47:47) - What about databases?\n(57:56) - It's time for Unpopular Opinions!\n(58:21) - Matt's unpop\n(1:06:55) - Mat's unpop\n(1:09:54) - Gotta Go!\n(1:10:16) - Outro (Changelog++ bonus!)",
          "link": "https://changelog.com/gotime/273",
          "publishedOn": "2023-04-13T22:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 273: Domain-driven design with Go",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/273/go-time-273.mp3",
            "length": "69542040",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/2054",
          "author": null,
          "description": "What can art historians and computer scientists learn from one another? Actually, a lot! Amanda Wasielewski joins us to talk about how she discovered that computer scientists working on computer vision were actually acting like rogue art historians and how art historians have found machine learning to be a valuable tool for research, fraud detection, and cataloguing. We also discuss the rise of generative AI and how we this technology might cause us to ask new questions like: “What makes a photograph a photograph?”\nLeave us a comment\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nTypesense – Lightning fast, globally distributed Search-as-a-Service that runs in memory. You iterlly can’t get any faster!\n\n\nFeaturing:\n\nAmanda Wasielewski – Twitter, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\n\nShow Notes:\n\nComputational Formalism Art History and Machine Learning\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:42) - Amanda Wasielewski\n(04:28) - What is art history?\n(10:00) - Integrating artworks for ML?\n(13:47) - How are art historians adaption to ML?\n(19:16) - Art models and the Tank Classifier\n(24:27) - What ML devs can learn from art history\n(32:06) - Deep learning paradoxes\n(38:12) - Where is the field going?\n(42:21) - Outro",
          "link": "https://changelog.com/practicalai/218",
          "publishedOn": "2023-04-12T13:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 218: Computer scientists as rogue art historians",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/218/practical-ai-218.mp3",
            "length": "41759533",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/16/2053",
          "author": null,
          "description": "Ken Thompson’s 75-year-project is a jukebox for the ages, Tabby is a self-hosted AI coding assistant, Codeberg is a collaboration platform and Git hosting for open source software, content and projects, TheSequence explains The LLama Effect & Paul Orlando writes about Ghosts, Guilds and Generative AI.\nLeave us a comment\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\nLinks for all episodes of Changelog News are in the companion newsletter.\nSomething missing or broken? PRs welcome!\nTimestamps:\n(02:23) - Ken Thompson\n(03:53) - Tabby\n(04:47) - Codeberg\n(05:15) - The LLama Effect\n(06:13) - Facing the inevitable\n(07:23) - Outro",
          "link": "https://changelog.com/news/39",
          "publishedOn": "2023-04-10T21:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News 39: Ken Thompson's keynote, Tabby, The LLama Effect, Codeberg & facing the inevitable",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/news/39/changelog-news-39.mp3",
            "length": "7959941",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/2019",
          "author": null,
          "description": "This week we’re talking about LLMs with Simon Willison. We can not avoid this topic. Last time it was Stable Diffusion breaking the internet. This time it’s LLMs breaking the internet. Large Language Models, ChatGPT, Bard, Claude, Bing, GitHub Copilot X, Cody…we cover it all.\nLeave us a comment\nChangelog++ members get a bonus 18 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nDevCycle – Build better software with DevCycle. Feature flags, without the tech debt. DevCycle is a Feature Flag Management platform designed to help you build maintainable code at scale.\n\nPostman – Build APIs together — More than 20 million developers use Postman for building and using APIs. Postman simplifies each step of the API lifecycle and streamlines collaboration so you can create be…",
          "link": "https://changelog.com/podcast/534",
          "publishedOn": "2023-04-07T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 534: LLMs break the internet",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/534/the-changelog-534.mp3",
            "length": "98878111",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/2045",
          "author": null,
          "description": "Grab a comfy seat and a hot cup of joe, because it’s time for some coffee talk with Nick & KBall! Special guest Thomas Eckert joins the party and brings a bunch of questions for us to discuss.\nWho wins in a fist fight: Tailwind CSS people or “real” CSS people? Is Agile overrated? What’s the longest bug you’ve ever chased? How about some underrated libraries/packages that people should know about? And more!\nLeave us a comment\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nThomas Eckert – Twitter, GitHub, LinkedIn\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\n\nShow Notes:\n\nJoin the JS Party community Slack!\nSomething missing or broken? PRs welcome!\nTimestamps:\n(01:04) - Welcoming Thomas to the show?\n(03:58) - Who wins in a fist fight?\n(06:53) - Is Agile overrated?\n(12:31) - How do you find stuff?\n(13:52) - A deep-dive on docs?\n(26:52) - Your longest bug chase?\n(38:13) - How much backend should frontends know?\n(44:50) - Sponsor: Changelog++?\n(45:45) - Any underrated packages?\n(55:44) - Final words?\n(1:01:40) - Next up on the pod?",
          "link": "https://changelog.com/jsparty/270",
          "publishedOn": "2023-04-07T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 270: Nick & KBall's \"Coffee Talk\"",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/270/js-party-270.mp3",
            "length": "60941167",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Zor2",
          "author": "Jerod Santo",
          "description": "TIL that four corporate publishers have sued the Internet Archive for copyright infringement.\nWhen Julius Caesar burned the Library of Alexandria, it was hard to imagine a greater destruction of scholarship. Now, 2,000 years later, some petty, litigious schmucks are ready to deal an even bigger blow to the literary canon.\nLeave us a comment",
          "link": "https://www.sbstatesman.com/2023/04/04/if-we-lose-the-internet-archive-were-screwed/",
          "publishedOn": "2023-04-07T14:47:00.000Z",
          "wordCount": null,
          "title": "If we lose the Internet Archive, we're screwed",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1r1",
          "author": "Jerod Santo",
          "description": "Andy Baio with the eagle eyes 🦅\nWhile trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018.\nI’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them. The file is found in every version of macOS from Mojave (10.14.0) to the current version, Ventura (13.3), but isn’t in High Sierra (10.13) or earlier.\nWell that’s a fun bit of trivia! But why?\nIs there a secret Bitcoin maxi working at Apple? The filename is “simpledoc.pdf” and it’s only 184 KB. Maybe it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\nDiscuss on Changelog News",
          "link": "https://waxy.org/2023/04/the-bitcoin-whitepaper-is-hidden-in-every-modern-copy-of-macos/",
          "publishedOn": "2023-04-06T21:14:00.000Z",
          "wordCount": null,
          "title": "The Bitcoin whitepaper is hidden in every modern copy of macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7mk",
          "author": "Jerod Santo",
          "description": "There’s always at least one new thing I’ve never come across in every one of these kind of lists.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/23/4/linux-terminal-fonts",
          "publishedOn": "2023-04-06T20:24:00.000Z",
          "wordCount": null,
          "title": "An entirely subjective list of some fun fonts for your Linux console",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/2041",
          "author": null,
          "description": "Mat & Johnny interview everyone’s favorite LLM (Natalie with a special hat on) to see if it’d make a good hire as a Go dev. Also, Mat tries to turn it into his very own creepy robot by asking personal questions about his co-hosts. Things get weird. In a good way?\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the worl…",
          "link": "https://changelog.com/gotime/272",
          "publishedOn": "2023-04-06T19:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 272: The biggest job interview of GPT-4's life",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/272/go-time-272.mp3",
            "length": "65295919",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qpro",
          "author": "Jerod Santo",
          "description": "Courtland Allen:\nExactly six years ago (to the day!), Stripe acquired Indie Hackers to help us grow and inspire millions of people building online businesses.\nToday, I’m happy to announce that @channingallen and I are indie hackers again!\nSo what now?\nWell, if we want to survive and thrive, we’re going to have to generate revenue just like any other business! I’m an entrepreneur at heart and always have been. In fact, working at Stripe was my first and only salaried job.\nRight now we’re sitting at exactly $0 in MRR, so the journey is just now (re)starting.\nWelcome back to the club, guys! Exciting times 💯\nDiscuss on Changelog News",
          "link": "https://www.indiehackers.com/product/indie-hackers/indie-hackers-is-indie-again--NSIAlb7LggSjzTavQZb",
          "publishedOn": "2023-04-06T14:30:00.000Z",
          "wordCount": null,
          "title": "Indie Hackers is indie again!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDX4",
          "author": "Jerod Santo",
          "description": "+10x engineers may be mythical, but -10x engineers exist. To become a -10x engineer, simply waste 400 engineering hours per week. Combine the following strategies:\nI know the 10x developer is a myth and all, but one thing we don’t talk about very often is that it is sometimes easy to out-pace other devs simply by moving forward at a decent clip.\nThis is because there are easy (yet non-obvious) ways to make negative progress as a developer. It’s not hard to move orders of magnitude faster than someone who’s headed in the wrong direction.\nDiscuss on Changelog News",
          "link": "https://taylor.town/-10x",
          "publishedOn": "2023-04-06T13:36:00.000Z",
          "wordCount": null,
          "title": "How to be a -10x Engineer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8loj",
          "author": "Jerod Santo",
          "description": "I’ve quit Elixir’s REPL by hitting Ctrl-C twice a zillion times, but I’ve never stopped to play with the BREAK menu provided between the Ctrl-C’s.\nBREAK: (a)bort (A)bort with dump (c)ontinue (p)roc info (i)nfo\n       (l)oaded (v)ersion (k)ill (D)b-tables (d)istribution\n\nThis article is a nice explainer of all the options and what you can do with each.\nDiscuss on Changelog News",
          "link": "https://blog.sequin.io/between-the-ctrl-cs/",
          "publishedOn": "2023-04-05T19:30:01.000Z",
          "wordCount": null,
          "title": "Exploring Elixir's BREAK menu",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1MO",
          "author": "Jerod Santo",
          "description": "Use any model from OpenAI, Anthropic, Cohere, Forefront, HuggingFace, Aleph Alpha, and llama.cpp.\nFull playground UI, including history, parameter tuning, keyboard shortcuts, and logprops.\nCompare models side-by-side with the same prompt, individually tune model parameters, and retry with different paramaters.\nTry the hosted version if you prefer…\nDiscuss on Changelog News",
          "link": "https://github.com/nat/openplayground",
          "publishedOn": "2023-04-05T18:44:00.000Z",
          "wordCount": null,
          "title": "An LLM playground you can run on your laptop",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/2048",
          "author": null,
          "description": "Daniel and Chris explore the intersection of Kaggle and real-world data science in this illuminating conversation with Christof Henkel, Senior Deep Learning Data Scientist at NVIDIA and Kaggle Grandmaster.  Christof offers a very lucid explanation into how participation in Kaggle can positively impact a data scientist’s skill and career aspirations.  He also shared some of his insights and approach to maximizing AI productivity uses GPU-accelerated tools like RAPIDS and DALI.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Lear…",
          "link": "https://changelog.com/practicalai/217",
          "publishedOn": "2023-04-04T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 217: Accelerated data science with a Kaggle grandmaster",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/217/practical-ai-217.mp3",
            "length": "42345189",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbeR",
          "author": "Jerod Santo",
          "description": "Running live demos can be stressful. You know what you want to say and show. You prepare the CLI commands you want to run to best showcase what you’ve built, but then you waste time typing long commands; you make typos; the commands fail or take way too long to complete. Maybe they depend on external system (network, APIs, cloud, …) and of course it’s not cooperating while you’re running your live demo.\nHere’s how you can avoid all of the above by scripting, automating and recording your demos, so that you never have to stress about showcasing ever again…\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/94",
          "publishedOn": "2023-04-04T14:41:00.000Z",
          "wordCount": null,
          "title": "Make your CLI demos a breeze with zero stress and zero mistakes",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqPN",
          "author": "Tom Burns",
          "description": "By modifying a classical neural network, we introduced a new model inspired by biology which shows improved memory performance. It helps modeling brain processes and may eventually improve AI-based language tools such as ChatGPT.\nDiscuss on Changelog News",
          "link": "https://www.oist.jp/news-center/news/2023/3/7/what-makes-neural-network-remember",
          "publishedOn": "2023-04-04T13:55:00.000Z",
          "wordCount": null,
          "title": "What makes a neural network remember?",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2047",
          "author": null,
          "description": "Twitter publishes (some of) its recommendation algorithm, Toran Bruce Richards puts GPT-4 on autopilot, Simon Willison shares a good way for us to think about LLMs, Eric Elliot creates a powerful pseudocode programming language for LLMs & I define and demystify the term “stochastic parrot”.\nLeave us a comment\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nTwitter’s algorithm\n\nRowan Cheung\nAuto-GPT\nThink of an LLM as a “calculator for words”\nA Powerful Pseudocode Programming Language for LLMs\n\nSpec\nWhat is a stochastic parrot?\n\nOn the Dangers of Stochastic Parrots: Can Language Models Be Too Big?\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:16) - Twitter algorithm\n(02:29) - Yo LLM so fat\n(03:14) - Auto-GPT\n(03:45) - LLMs are \"calculators for words\"\n(04:33) - SudoLang\n(05:16) - Stochastic parrots\n(07:13) - Outro",
          "link": "https://changelog.com/news/38",
          "publishedOn": "2023-04-03T20:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News 38: Twitter's open algorithm, Auto-GPT, LLMs as \"calculators for words\", SudoLang & stochastic parrots",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/news/38/changelog-news-38.mp3",
            "length": "7649386",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/2047",
          "author": null,
          "description": "Twitter publishes (some of) its recommendation algorithm, Toran Bruce Richards puts GPT-4 on autopilot, Simon Willison shares a good way for us to think about LLMs, Eric Elliot creates a powerful pseudocode programming language for LLMs & I define and demystify the term “stochastic parrot”.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing:\n\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\n\nShow Notes:\n\nTwitter’s algorithm\n\nRowan Cheung\nAuto-GPT\nThink of an LLM as a “calculator for words”\nA Powerful Pseudocode Programming Language for LLMs\nWhat is a stochastic parrot?\n\nOn the Dangers of Stochastic Parrots: Can Language Models Be Too Big?\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:16) - Twitter algorithm\n(02:29) - Yo LLM so fat\n(03:14) - Auto-GPT\n(03:45) - LLMs are \"calculators for words\"\n(04:33) - SudoLang\n(05:16) - Stochastic parrots\n(07:13) - Outro",
          "link": "https://changelog.com/podcast/news-2023-04-03",
          "publishedOn": "2023-04-03T20:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Twitter's open algorithm, Auto-GPT, LLMs as \"calculators for words\", SudoLang & stochastic parrots",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2023-04-03/the-changelog-news-2023-04-03.mp3",
            "length": "7649386",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9lbJ",
          "author": "Jerod Santo",
          "description": "This app uses Apple’s Core ML Stable Diffusion implementation to achieve maximum performance and speed on Apple Silicon based Macs while reducing memory requirements. (Also runs on Intel based Macs.)\n\nDiscuss on Changelog News",
          "link": "https://github.com/godly-devotion/MochiDiffusion",
          "publishedOn": "2023-04-03T17:05:00.000Z",
          "wordCount": null,
          "title": "Run Stable Diffusion on Mac natively",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWk6",
          "author": "Dan McClain",
          "description": "Emilio Cobos Álvarez:\nfew  patches that completely removed XUL layout from the Firefox codebase.\n\n\n This means that (modulo a few exceptions documented below) all the Firefox UI is using regular web technology to render (mostly CSS flexbox).\n\n\n This was a rather big effort (first filed 9 years ago in bug 1033225), and I wanted to document some of the things that I learned during the process, some of the things and decisions that made it possible, and some of the things that I would’ve maybe done differently.\n\n\n\n\n\nDiscuss on Changelog News",
          "link": "https://crisal.io/words/2023/03/30/xul-layout-is-gone.html",
          "publishedOn": "2023-04-03T16:08:00.000Z",
          "wordCount": null,
          "title": "XUL layout is gone (in Firefox)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQeN",
          "author": "Jerod Santo",
          "description": "Daniel Stenberg’s new tool for parsing & manipulating URLs might fit nicely into HTTP your utility belt.\nURLs are tricky to parse and there are numerous security problems in software because of this. trurl wants to help soften this problem by taking away the need for script and command line authors everywhere to re-invent the wheel over and over.\nDiscuss on Changelog News",
          "link": "https://daniel.haxx.se/blog/2023/04/03/introducing-trurl/",
          "publishedOn": "2023-04-03T15:22:00.000Z",
          "wordCount": null,
          "title": "trurl manipulates URLs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/PpMm",
          "author": "Jerod Santo",
          "description": "Tyler Cipriani:\nGitHub private repos lull us into lazy thinking.\nWe cram our secrets into git, then shove it off to the most expansive code forge in the history of humanity, and most of the time: everything’s fine.\nBut GitHub’s ssh host key leak last week demonstrates that private repos are, at best, private-ish.\nDiscuss on Changelog News",
          "link": "https://tylercipriani.com/blog/2023/03/31/private-ish-github-repos/",
          "publishedOn": "2023-04-03T14:34:00.000Z",
          "wordCount": null,
          "title": "GitHub private repos considered private-­ish",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WQl",
          "author": "Jerod Santo",
          "description": "A solid pre-flight checklist by PG aficionado Craig Kerstiens. It covers all the essentials: backups, high-availability, logging, statement timeouts & connection pooling.\nDiscuss on Changelog News",
          "link": "https://www.crunchydata.com/blog/is-your-postgres-ready-for-production",
          "publishedOn": "2023-03-31T18:30:00.000Z",
          "wordCount": null,
          "title": "Is your Postgres ready for production?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1mj",
          "author": "Jerod Santo",
          "description": "After two years of work, Kirby Ferguson has combined his four part series into a single, hour-long video. I haven’t even watched it yet (it’s queued up), but I know this is absolutely deserving of an hour of your time this weekend.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=X9RYuvPCQUA",
          "publishedOn": "2023-03-31T16:00:00.000Z",
          "wordCount": null,
          "title": "Everything is a Remix (Complete Updated 2023 Edition)",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/2032",
          "author": null,
          "description": "Jerod & the gang catch you up on what’s new and poppin’ in the web development world. We go deep on GitHub Copilot X and the latest AI advancements, take a bathroom break while Nick talks about TypeScript 5 & continue the debate about the future of React.\nDiscuss on Changelog News\nChangelog++ members save 1 minute on this episode because they made the ads disappear. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops…",
          "link": "https://changelog.com/jsparty/269",
          "publishedOn": "2023-03-31T15:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 269: See you later, humans!",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/269/js-party-269.mp3",
            "length": "67678640",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Rder",
          "author": "Jerod Santo",
          "description": "Taxy uses GPT-4 to control your browser and perform repetitive actions on your behalf. Currently it allows you to define ad-hoc instructions. In the future it will also support saved and scheduled workflows.\nTaxy’s current status is research preview. Many workflows fail or confuse the agent. If you’d like to hack on Taxy to make it better or test it on your own workflows, follow the instructions below to run it locally. If you’d like to know once it’s available for wider usage, you can sign up for our waitlist.\nOk that’s cool… 🤯\nHere it is using Google Calendar with the prompt “Schedule standup tomorrow at 10am. Invite david@taxy.ai”\n\nDiscuss on Changelog News",
          "link": "https://github.com/TaxyAI/browser-extension",
          "publishedOn": "2023-03-31T12:00:00.000Z",
          "wordCount": null,
          "title": "Automate your browser with GPT-4",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3Lyy",
          "author": "Jerod Santo",
          "description": "Alex Schepanovski:\nI always thought of 1+N as a thing that you just keep in your head, catch on code reviews or via performance regressions. This worked well for a long time, however, the less control we have over our SQL queries the more likely it will sneak through those guards…\nI tumbled on a couple of 1+Ns while reading a project code for an unrelated reason and it got me thinking – do I ever want Django to do that lazy loading stuff? And the answer was never.\nTurns out the implementation of this is quite easy. ~15 loc for the naive version and ~35 for a more robust version. Give it a try if you, like Alex, never want to allow a 1+N in your Django app again.\nDiscuss on Changelog News",
          "link": "https://suor.github.io/blog/2023/03/26/ban-1-plus-n-in-django/",
          "publishedOn": "2023-03-30T22:46:00.000Z",
          "wordCount": null,
          "title": "Ban 1+N in Django",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/2017",
          "author": null,
          "description": "We’re joined by the creators of Wails and Fyne to dig into writing Go code for different architectures and operating systems.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nFastly – Our bandwidth partner. Fastly powers fast, secure, and scalable digital experiences. Move beyond your content delivery network to their powerful edge cloud platform. Learn more at fastly.com\n\nFly.io – The home of Changelog.com — Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with extended episodes, make the ads disappear, and increment your audio quality with higher bitrate mp3s. Let’s do this!\n\n\nFeaturing:\n\nLea Anthony – Twitter, GitHub\nAndy Williams – Twitter, GitHub, LinkedIn, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\n\nShow Notes:\n\nWails\nFyne\nXbar\nTaskfile\nGo GUI developer survey\nSomething missing or broken? PRs welcome!\nTimestamps:\n(00:57) - Welcoming our guests\n(02:53) - Gooey Team\n(07:28) - Intro to Wails\n(10:12) - Intro to Fyne\n(15:43) - Lea's repo bands\n(16:51) - Frontend code in Fyne\n(19:05) - Frontend code in Wails\n(20:30) - Building cross-platform tools\n(28:36) - Will generics make things easier?\n(32:42) - Sponsor: Changelog++\n(33:37) - Things they'd do differently\n(44:09) - Accounting for taste\n(49:19) - The smallest possible API\n(52:45) - It's time for Unpopular Opinions!\n(53:28) - Anthony's unpop\n(56:41) - Andy's unpop\n(1:00:48) - Natalie's unpop\n(1:02:44) - Mat's unpop\n(1:05:16) - Gotta Go!\n(1:07:01) - Outro (Changelog++ bonus)",
          "link": "https://changelog.com/gotime/271",
          "publishedOn": "2023-03-30T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 271: Cross-platform graphical user interfaces",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/271/go-time-271.mp3",
            "length": "66424549",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwrJ",
          "author": "Jerod Santo",
          "description": "This open letter by the Future of Life institute has been signed by 1380 people (so far) including notable technologists such as Steve Wozniak, Stuart Russell, Emad Mostaque (Stability AI) & Elon Musk.\nPowerful AI systems should be developed only once we are confident that their effects will be positive and their risks will be manageable. This confidence must be well justified and increase with the magnitude of a system’s potential effects. OpenAI’s recent statement regarding artificial general intelligence, states that “At some point, it may be important to get independent review before starting to train future systems, and for the most advanced efforts to agree to limit the rate of growth of compute used for creating new models.” We agree. That point is now.\nTherefore, we call on all AI labs to immediately pause for at least 6 months the training of AI systems more powerful than GPT-4. This pause should be public and verifiable, and include all key actors. If such a pause cannot be enacted quickly, governments should step in and institute a moratorium.\nDiscuss on Changelog News",
          "link": "https://futureoflife.org/open-letter/pause-giant-ai-experiments/",
          "publishedOn": "2023-03-30T14:12:00.000Z",
          "wordCount": null,
          "title": "A petition to pause all AI experiments for at least 6 months",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwe0",
          "author": "Jerod Santo",
          "description": "The team behind this took LLaMA and trained it on ~800k GPT-3.5-Turbo responses. The result is a sophisticated assistant you can easily run on your laptop by downloading a 4GB file and cloning the repo.\n\nDiscuss on Changelog News",
          "link": "https://github.com/nomic-ai/gpt4all",
          "publishedOn": "2023-03-30T13:24:00.000Z",
          "wordCount": null,
          "title": "GPT4ALL takes LLaMA to the next level",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlrj",
          "author": "Jerod Santo",
          "description": "k8sgpt is a tool for scanning your Kubernetes clusters, diagnosing and triaging issues in simple english. It has SRE experience codified into it’s analyzers and helps to pull out the most relevant information to enrich it with AI.\nDiscuss on Changelog News",
          "link": "https://github.com/k8sgpt-ai/k8sgpt",
          "publishedOn": "2023-03-29T14:59:00.000Z",
          "wordCount": null,
          "title": "Giving Kubernetes SRE superpowers to everyone",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/2003",
          "author": null,
          "description": "After years of working for Google on the Go Team, Filippo Valsorda quit last year to experiment with more sustainable paths for open source maintainers. Good news, it worked! Filippo is now a full-time open source maintainer and he joins Jerod on this episode to tell everyone exactly how he’s making the equivalent to his total compensation package at Google in open source.\nDiscuss on Changelog News\nChangelog++ members get a bonus 7 minutes at the end of this episode and zero ads. Join today!\nSponsors:\n\n  \nPostman – Build APIs together — More than 20 million developers use Postman for building and using APIs. Postman simplifies each step of the API lifecycle and streamlines collaboration so you can create better APIs—faster.\n\nSentry – Session Replay! Rewind and replay every step of the user…",
          "link": "https://changelog.com/podcast/533",
          "publishedOn": "2023-03-29T13:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 533: A new path to full-time open source",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/533/the-changelog-533.mp3",
            "length": "62048117",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/dumb-questions/",
          "author": null,
          "description": "We get these questions over and over, and I figured it was worth writing a blog post to address them. Then, instead of reanswering them, we can just link to this blog post.",
          "link": "https://blog.comma.ai/dumb-questions/",
          "publishedOn": "2023-04-25T18:00:00.000Z",
          "wordCount": 968,
          "title": "Dumb Questions"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/code-with-bard/",
          "author": null,
          "description": "Bard can now help with programming and software development tasks, across more than 20 programming languages.",
          "link": "https://blog.google/technology/ai/code-with-bard/",
          "publishedOn": "2023-04-21T13:00:00.000Z",
          "wordCount": 1179,
          "title": "Bard now helps you code"
        },
        {
          "id": "https://blog.google/technology/ai/april-ai-update/",
          "author": null,
          "description": "We announced some changes that will accelerate our progress in AI and help us develop more capable AI systems more safely and responsibly.",
          "link": "https://blog.google/technology/ai/april-ai-update/",
          "publishedOn": "2023-04-20T18:04:00.000Z",
          "wordCount": 1101,
          "title": "Google DeepMind: Bringing together two world-class AI teams"
        },
        {
          "id": "https://blog.google/inside-google/googlers/ask-a-techspert/what-is-generative-ai/",
          "author": null,
          "description": "A Google AI expert answers common questions about generative AI, large language models, machine learning and more.",
          "link": "https://blog.google/inside-google/googlers/ask-a-techspert/what-is-generative-ai/",
          "publishedOn": "2023-04-11T13:00:00.000Z",
          "wordCount": 1748,
          "title": "Ask a Techspert: What is generative AI?"
        },
        {
          "id": "https://blog.google/technology/ads/katie-couric-future-ready-youtube-google/",
          "author": null,
          "description": "Katie Couric hosts Future Ready by Think with Google, a new interview series featuring experts in AI, cybersecurity and psychology.",
          "link": "https://blog.google/technology/ads/katie-couric-future-ready-youtube-google/",
          "publishedOn": "2023-03-30T14:00:00.000Z",
          "wordCount": 1085,
          "title": "Watch Katie Couric and Think with Google’s new interview series"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=22214",
          "author": "Daniel Stenberg",
          "description": "Let me tell you a story about how Windows users are deleting files from their installation and as a consequence end up in tears. Background The real and actual curl tool has been shipped as part of Windows 10 and Windows 11 for many years already. It is called curl.exe and is located in the … Continue reading deleting system32\\curl.exe →",
          "link": "https://daniel.haxx.se/blog/2023/04/24/deleting-system32curl-exe/",
          "publishedOn": "2023-04-24T09:31:25.000Z",
          "wordCount": 954,
          "title": "deleting system32\\curl.exe"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=22160",
          "author": "Daniel Stenberg",
          "description": "I am honored to yet again receive a peer bonus award from Google. This is a Google program for which persons like me can be nominated by Googlers and as a result receive grants. I previously receive such an award in 2020. Update A few people noticed and have commented on the fact that this … Continue reading Google Open Source Peer Bonus award 2023 →",
          "link": "https://daniel.haxx.se/blog/2023/04/23/google-open-source-peer-bonus-award-2023/",
          "publishedOn": "2023-04-23T21:14:54.000Z",
          "wordCount": 335,
          "title": "Google Open Source Peer Bonus award 2023"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=22248",
          "author": "Daniel Stenberg",
          "description": "In September 2013 we merged the first code into curl that made it capable of using HTTP/2: HTTP version 2. This version of HTTP changed a lot of previous presumptions when it comes to transfers, which introduced quite a few challenges to HTTP stack authors all of the world. One of them being that with … Continue reading curl speaks HTTP/2 with proxy →",
          "link": "https://daniel.haxx.se/blog/2023/04/14/curl-speaks-http-2-with-proxy/",
          "publishedOn": "2023-04-14T14:00:45.000Z",
          "wordCount": 746,
          "title": "curl speaks HTTP/2 with proxy"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=22157",
          "author": "Daniel Stenberg",
          "description": "trurl is a tool in a similar spirit of tr but for URLs. Here, tr stands for translate or transpose. trurl is a small command line tool that parses and manipulates URLs, designed to help shell script authors everywhere. URLs are tricky to parse and there are numerous security problems in software because of this. … Continue reading trurl manipulates URLs →",
          "link": "https://daniel.haxx.se/blog/2023/04/03/introducing-trurl/",
          "publishedOn": "2023-04-03T06:59:14.000Z",
          "wordCount": 790,
          "title": "trurl manipulates URLs"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=22065",
          "author": "Daniel Stenberg",
          "description": "In 2011 I started to send “pre-notifications” about pending curl security vulnerabilities to the distros mailing list (back then it was still called linux-distros). For several years we also asked them for CVE IDs for the new vulnerabilities that we were about to publish to the world. By notifying the distros ahead of time, the … Continue reading Pre-notification dilemmas →",
          "link": "https://daniel.haxx.se/blog/2023/03/29/pre-notification-dilemmas/",
          "publishedOn": "2023-03-29T12:17:56.000Z",
          "wordCount": 1207,
          "title": "Pre-notification dilemmas"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2023-04-26T12:15:52.080Z",
          "wordCount": 2277,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/constraint-management-for-cluster-operation-safety-and-reliability-at-twitter",
          "author": null,
          "description": "As any team and its infrastructure grows, the risk of an unplanned service outage and potential data loss will grow.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/constraint-management-for-cluster-operation-safety-and-reliability-at-twitter",
          "publishedOn": "2023-04-23T12:15:35.610Z",
          "wordCount": 1985,
          "title": "Constraint Management for cluster operation safety and reliability at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2023-04-20T12:15:56.887Z",
          "wordCount": 890,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2023-04-19T12:16:20.146Z",
          "wordCount": 1708,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "author": null,
          "description": "At Twitter, our on premise data centers contain hundreds of thousands of hardware servers and millions of server hardware components.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/how-twitter-uses-rasdaemon-for-hardware-reliability",
          "publishedOn": "2023-04-13T12:16:08.507Z",
          "wordCount": 991,
          "title": "How Twitter uses rasdaemon for hardware reliability"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "author": null,
          "description": "As any team and its infrastructure grows, the risk of an unplanned service outage and potential data loss will grow.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2023/the-data-platform-cluster-operator-service-for-hadoop-cluster-management",
          "publishedOn": "2023-04-12T12:16:25.204Z",
          "wordCount": 1103,
          "title": "The data platform cluster operator service for Hadoop cluster management"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2023/twitter-recommendation-algorithm",
          "author": null,
          "description": "Twitter Apache Thrift is an open-source, standalone, lightweight, data encoding library. In this blog post, we share the library we built so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2023/twitter-recommendation-algorithm",
          "publishedOn": "2023-04-01T12:14:09.444Z",
          "wordCount": 1757,
          "title": "Twitter's Recommendation Algorithm"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2023/04/technical-report-into-intel-tdx.html",
          "author": null,
          "description": "ol{margin:0;padding:0}table td,table th{padding:0}.RqhFbizZKN-c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:\"Arial\";font-style:normal}.RqhFbizZKN-c2{padding-top:0pt;padding-bottom:0pt;line-height:1.5;orphans:2;widows:2;text-align:left}.RqhFbizZKN-c4{text-decoration-skip-ink:none;-webkit-text-decoration-skip:none;color:#1155cc;text-decoration:underline}.RqhFbizZKN-c1{padding-top:0pt;padding-bottom:0pt;line-height:1.0;text-align:left}.RqhFbizZKN-c7{background-color:#ffffff;max-width:468pt;padding:72pt 72pt 72pt 72pt}.RqhFbizZKN-c5{color:inherit;text-decoration:inherit}.RqhFbizZKN-c3{border:1px solid black;margin:5px}.RqhFbizZKN-c6{height:11pt}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:\"Arial\";l…",
          "link": "https://googleprojectzero.blogspot.com/2023/04/technical-report-into-intel-tdx.html",
          "publishedOn": "2023-04-24T16:27:00.000Z",
          "wordCount": 611,
          "title": "Release of a Technical Report into Intel Trust Domain Extensions"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47993",
          "author": "Greg Stoll",
          "description": "In Firefox 110, users now have the ability to control which third-party DLLs are allowed to load into Firefox processes. Let’s talk about what this means and when it might be useful.\nThe post Letting users block injected third-party DLLs in Firefox appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2023/03/letting-users-block-injected-third-party-dlls-in-firefox/",
          "publishedOn": "2023-03-30T18:41:16.000Z",
          "wordCount": 2799,
          "title": "Letting users block injected third-party DLLs in Firefox"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=71491",
          "author": "Kedasha Kerr",
          "description": "Learn some tips, tricks, and tools for mastering the command line from GitHub’s own developers.",
          "link": "https://github.blog/2023-04-26-cli-tricks-every-developer-should-know/",
          "publishedOn": "2023-04-26T16:00:18.000Z",
          "wordCount": 1891,
          "title": "CLI tricks every developer should know"
        },
        {
          "id": "https://github.blog/?p=71479",
          "author": "Taylor Blau",
          "description": "A new set of Git releases were published to address a variety of security vulnerabilities. All users are encouraged to upgrade. Take a look at GitHub’s view of the latest round of releases.",
          "link": "https://github.blog/2023-04-25-git-security-vulnerabilities-announced-4/",
          "publishedOn": "2023-04-25T17:13:36.000Z",
          "wordCount": 1244,
          "title": "Git security vulnerabilities announced"
        },
        {
          "id": "https://github.blog/?p=71475",
          "author": "Abby Cabunoc Mayes",
          "description": "Are you looking for ways to support open source maintainers? Maintainer Month is the perfect opportunity!",
          "link": "https://github.blog/2023-04-25-gearing-up-for-maintainer-month-this-may/",
          "publishedOn": "2023-04-25T16:00:30.000Z",
          "wordCount": 687,
          "title": "Gearing up for Maintainer Month this May!"
        },
        {
          "id": "https://github.blog/?p=71471",
          "author": "Kyle Daigle",
          "description": "GitHub is driving the future of software development and, after 10 years as a Hubber, I’m more energized than ever as I take on the role of COO to help bring our vision to life.",
          "link": "https://github.blog/2023-04-25-shaping-the-github-of-the-future-as-coo/",
          "publishedOn": "2023-04-25T14:00:50.000Z",
          "wordCount": 680,
          "title": "Shaping the GitHub of the future as COO"
        },
        {
          "id": "https://github.blog/?p=71427",
          "author": "Brian Randell",
          "description": "Create and share your own deployment protection rules, or use the rules from our great partners, like Datadog, Honeycomb, New Relic, NodeSource, Sentry, and ServiceNow, to control your deployments with more confidence. And the API is open for the community to build their own rules to make GitHub Enterprise Cloud even better.",
          "link": "https://github.blog/2023-04-20-announcing-github-actions-deployment-protection-rules-now-in-public-beta/",
          "publishedOn": "2023-04-20T16:00:09.000Z",
          "wordCount": 1700,
          "title": "Announcing GitHub Actions Deployment Protection Rules, now in public beta"
        },
        {
          "id": "https://github.blog/?p=71418",
          "author": "Eric Tooley",
          "description": "Open source maintainers and security researchers embrace a new best practice to report and fix vulnerabilities.",
          "link": "https://github.blog/2023-04-19-private-vulnerability-reporting-now-generally-available/",
          "publishedOn": "2023-04-19T16:00:41.000Z",
          "wordCount": 1113,
          "title": "Private vulnerability reporting now generally available"
        },
        {
          "id": "https://github.blog/?p=71408",
          "author": "Brian DeHamer",
          "description": "How to verifiably link npm packages to their source repository and build instructions.",
          "link": "https://github.blog/2023-04-19-introducing-npm-package-provenance/",
          "publishedOn": "2023-04-19T16:00:18.000Z",
          "wordCount": 2040,
          "title": "Introducing npm package provenance"
        },
        {
          "id": "https://github.blog/?p=71390",
          "author": "Mike Linksvayer",
          "description": "GitHub is proud to join 40 companies endorsing the Cybersecurity Tech Accord principles limiting offensive operations in cyberspace.",
          "link": "https://github.blog/2023-04-18-github-joins-industry-commitment-to-curb-cyber-mercenaries/",
          "publishedOn": "2023-04-18T16:26:11.000Z",
          "wordCount": 610,
          "title": "GitHub joins industry commitment to curb cyber mercenaries"
        },
        {
          "id": "https://github.blog/?p=71365",
          "author": "Walker Chabbott",
          "description": "We’ve gotten great feedback on default setup, a simple way to set up code scanning on your repository. Now, you have the ability to use default setup across your organization's repositories, in just one click.",
          "link": "https://github.blog/2023-04-17-multi-repository-enablement-effortlessly-scale-code-scanning-across-your-repositories/",
          "publishedOn": "2023-04-17T18:13:41.000Z",
          "wordCount": 1475,
          "title": "Multi-repository enablement: effortlessly scale code scanning across your repositories"
        },
        {
          "id": "https://github.blog/?p=71361",
          "author": "Mark Paulsen",
          "description": "Explore how migrating your source code and collaboration history to GitHub can lead to some surprising benefits.",
          "link": "https://github.blog/2023-04-14-3-benefits-of-migrating-and-consolidating-your-source-code/",
          "publishedOn": "2023-04-14T17:48:51.000Z",
          "wordCount": 1544,
          "title": "3 benefits of migrating and consolidating your source code"
        },
        {
          "id": "https://github.blog/?p=71337",
          "author": "Damian Brady",
          "description": "Rapid advancements in generative AI coding tools like GitHub Copilot are accelerating the next wave of software development. Here’s what you need to know.",
          "link": "https://github.blog/2023-04-14-how-generative-ai-is-changing-the-way-developers-work/",
          "publishedOn": "2023-04-14T15:15:50.000Z",
          "wordCount": 3180,
          "title": "How generative AI is changing the way developers work"
        },
        {
          "id": "https://github.blog/?p=71321",
          "author": "Shaker Gilbert",
          "description": "How GitHub Enterprise ensures secure and compliant developer workflows for highly regulated industries.",
          "link": "https://github.blog/2023-04-13-ensuring-compliance-in-developer-workflows/",
          "publishedOn": "2023-04-13T16:04:37.000Z",
          "wordCount": 1613,
          "title": "Ensuring compliance in developer workflows"
        },
        {
          "id": "https://github.blog/?p=71292",
          "author": "Kara Sowles",
          "description": "Meet the projects that make up the first GitHub Accelerator cohort and learn about how GitHub is helping bring their visions to reality.",
          "link": "https://github.blog/2023-04-12-github-accelerator-our-first-cohort-and-whats-next/",
          "publishedOn": "2023-04-12T16:00:46.000Z",
          "wordCount": 1233,
          "title": "GitHub Accelerator: our first cohort and what’s next"
        },
        {
          "id": "https://github.blog/?p=71281",
          "author": "Chrissy Nasi",
          "description": "From dog bowl bottles to fanny packs, explore the latest and greatest GitHub merchandise.",
          "link": "https://github.blog/2023-04-11-introducing-the-newest-github-shop-collection/",
          "publishedOn": "2023-04-11T19:22:01.000Z",
          "wordCount": 688,
          "title": "Introducing the newest GitHub Shop collection"
        },
        {
          "id": "https://github.blog/?p=71276",
          "author": "Mark Paulsen",
          "description": "Explore how generative AI may soon help enable optimizing some of the foundational components of compliance.",
          "link": "https://github.blog/2023-04-11-generative-ai-enabled-compliance-for-software-development/",
          "publishedOn": "2023-04-11T16:36:40.000Z",
          "wordCount": 1391,
          "title": "Generative AI-enabled compliance for software development"
        },
        {
          "id": "https://github.blog/?p=71263",
          "author": "Mark Paulsen",
          "description": "Explore how creating a great developer experience can help provide a more inclusive financial services environment.",
          "link": "https://github.blog/2023-04-10-how-enabling-developers-can-help-drive-financial-inclusion/",
          "publishedOn": "2023-04-11T02:00:26.000Z",
          "wordCount": 1412,
          "title": "How enabling developers can help drive financial inclusion"
        },
        {
          "id": "https://github.blog/?p=71216",
          "author": "Damian Brady",
          "description": "Generative AI has been dominating the news lately—but what exactly is it? Here’s what you need to know, and what it means for developers.",
          "link": "https://github.blog/2023-04-07-what-developers-need-to-know-about-generative-ai/",
          "publishedOn": "2023-04-07T15:00:32.000Z",
          "wordCount": 3516,
          "title": "What developers need to know about generative AI"
        },
        {
          "id": "https://github.blog/?p=71087",
          "author": "Lee Reilly",
          "description": "Game Bytes is our monthly series taking a peek at the world of gamedev on GitHub—featuring game engine updates, game jam details, open source games, mods, maps, and more. Game on!",
          "link": "https://github.blog/2023-04-07-game-bytes-april-2023/",
          "publishedOn": "2023-04-07T14:32:11.000Z",
          "wordCount": 1669,
          "title": "Game Bytes · April 2023"
        },
        {
          "id": "https://github.blog/?p=71204",
          "author": "Adam Hess",
          "description": "Since the beginning, GitHub.com has been a Ruby on Rails monolith. Today, the application is nearly two million lines of code and more than 1,000 engineers collaborate on it daily. We deploy as often as 20 times a day, and nearly every week one of those deploys is a Rails upgrade. Upgrading Rails weekly Every […]",
          "link": "https://github.blog/2023-04-06-building-github-with-ruby-and-rails/",
          "publishedOn": "2023-04-06T18:05:43.000Z",
          "wordCount": 1620,
          "title": "Building GitHub with Ruby and Rails"
        },
        {
          "id": "https://github.blog/?p=71167",
          "author": "Man Yue Mo",
          "description": "In this post, I’ll look at a security-related change in version r40p0 of the Arm Mali driver that was AWOL in the January update of the Pixel bulletin, where other patches from r40p0 was applied, and how these two lines of changes can be exploited to gain arbitrary kernel code execution and root from a malicious app. This highlights how treacherous it can be when backporting security changes.",
          "link": "https://github.blog/2023-04-06-pwning-pixel-6-with-a-leftover-patch/",
          "publishedOn": "2023-04-06T16:00:48.000Z",
          "wordCount": 6228,
          "title": "Pwning Pixel 6 with a leftover patch"
        },
        {
          "id": "https://github.blog/?p=71142",
          "author": "Melody Mileski",
          "description": "With enterprise accounts for all, your organization can take advantage of all that GitHub Enterprise has to offer, from GitHub Actions and GitHub Advanced Security, to Copilot.",
          "link": "https://github.blog/2023-04-05-bring-your-enterprise-together-with-enterprise-accounts-for-all/",
          "publishedOn": "2023-04-05T17:00:48.000Z",
          "wordCount": 699,
          "title": "Bring your enterprise together with enterprise accounts for all"
        },
        {
          "id": "https://github.blog/?p=71107",
          "author": "Jakub Oleksy",
          "description": "In March, we experienced six incidents that resulted in degraded performance across GitHub services. This report also sheds light into a February incident that resulted in degraded performance for GitHub Codespaces.",
          "link": "https://github.blog/2023-04-05-github-availability-report-march-2023/",
          "publishedOn": "2023-04-05T16:00:48.000Z",
          "wordCount": 1264,
          "title": "GitHub Availability Report: March 2023"
        },
        {
          "id": "https://github.blog/?p=71110",
          "author": "Chris Reddington",
          "description": "Many of us are aware of the benefits that a strong focus on automation can bring, particularly in our development workflow and DevOps lifecycle. But silos across businesses can lead to duplication of effort, and potential to lose out on best practices. In this post, we’ll explore how CI/CD can be shared across your entire organization alongside policies, for a well-governed experience with GitHub Actions.",
          "link": "https://github.blog/2023-04-05-building-organization-wide-governance-and-re-use-for-ci-cd-and-automation-with-github-actions/",
          "publishedOn": "2023-04-05T15:00:36.000Z",
          "wordCount": 2774,
          "title": "Building organization-wide governance and re-use for CI/CD and automation with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=71068",
          "author": "Jessica Lord",
          "description": "GitHub Sponsors is now generally available for organizations. Also, new tooling for bulk sponsorships and an update on how we’re ensuring sustainability for GitHub Sponsors.",
          "link": "https://github.blog/2023-04-04-whats-new-with-github-sponsors/",
          "publishedOn": "2023-04-04T16:07:30.000Z",
          "wordCount": 1308,
          "title": "What’s new with GitHub Sponsors"
        },
        {
          "id": "https://github.blog/?p=71053",
          "author": "Jim Boyle",
          "description": "A high-quality audit log is an essential tool for enterprises to ensure compliance, maintain security, investigate issues, and promote accountability.",
          "link": "https://github.blog/2023-04-03-level-up-monitoring-and-reporting-for-your-enterprise/",
          "publishedOn": "2023-04-03T19:00:21.000Z",
          "wordCount": 1790,
          "title": "Level up monitoring and reporting for your enterprise"
        },
        {
          "id": "https://github.blog/?p=71030",
          "author": "Abby Cabunoc Mayes",
          "description": "We are building a private space for maintainers to connect with peers, preview features, and learn from each other!",
          "link": "https://github.blog/2023-04-03-calling-all-open-source-maintainers/",
          "publishedOn": "2023-04-03T16:00:18.000Z",
          "wordCount": 555,
          "title": "Calling all open source maintainers"
        },
        {
          "id": "https://github.blog/?p=71012",
          "author": "Sylwia Budzynska",
          "description": "Learn more about static analysis and how to use it for security research!\r\nIn this blog post series, we will take a closer look at static analysis concepts, present GitHub’s static analysis tool CodeQL, and teach you how to leverage static analysis for security research by writing custom CodeQL queries.",
          "link": "https://github.blog/2023-03-31-codeql-zero-to-hero-part-1-the-fundamentals-of-static-analysis-for-vulnerability-research/",
          "publishedOn": "2023-03-31T17:19:39.000Z",
          "wordCount": 5025,
          "title": "CodeQL zero to hero part 1: the fundamentals of static analysis for vulnerability research"
        },
        {
          "id": "https://github.blog/?p=70902",
          "author": "Robert Marsh",
          "description": "These changes will improve the experience for custom query authors and enable better precision in some of our standard queries. Learn how to enable them for your custom queries.",
          "link": "https://github.blog/2023-03-30-improvements-to-codeqls-data-flow-library-for-c/",
          "publishedOn": "2023-03-30T16:00:23.000Z",
          "wordCount": 1430,
          "title": "Improvements to CodeQL’s data flow library for C++"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=20630",
          "author": "Nubank Editorial",
          "description": "Find out what happened on the first episode of The Hammock by Building Nu here!\nThe post A stylish debut: Nubank’s new tech podcast invites Vitor Olivier, the company CTO appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/the-hammock-nubank-new-podcast-about-technology/",
          "publishedOn": "2023-04-04T17:20:45.000Z",
          "wordCount": 3698,
          "title": "A stylish debut: Nubank’s new tech podcast invites Vitor Olivier, the company CTO"
        },
        {
          "id": "https://building.nubank.com.br/?p=20618",
          "author": "Nubank Editorial",
          "description": "Developed in partnership with Meio & Mensagem, the ranking measures the corporate reputation of brands. Nubank is the only financial brand to be on the overall top 10.\nThe post Nubank is the financial company that Brazilians trust the most, according to ranking appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-financial-company-brazilians-trust-the-most/",
          "publishedOn": "2023-03-31T21:24:50.000Z",
          "wordCount": 3069,
          "title": "Nubank is the financial company that Brazilians trust the most, according to ranking"
        },
        {
          "id": "https://building.nubank.com.br/?p=20603",
          "author": "Heloisa Carbone - Senior Software Engineer at Nubank",
          "description": "How does Nubank onboard engineers so fast and so well, with such a different stack? Find more information in this article\nThe post Engineer Onboarding at Nubank appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/engineer-onboarding-at-nubank/",
          "publishedOn": "2023-03-31T21:03:55.000Z",
          "wordCount": 3981,
          "title": "Engineer Onboarding at Nubank"
        },
        {
          "id": "https://building.nubank.com.br/?p=20597",
          "author": "Nubank Editorial",
          "description": "Nubank is the 5th most innovative company in the world, according to Fast Company \nThe post Nubank is the 5th most innovative company in the world, according to Fast Company  appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-most-innovative-company-in-the-world/",
          "publishedOn": "2023-03-31T20:49:23.000Z",
          "wordCount": 3492,
          "title": "Nubank is the 5th most innovative company in the world, according to Fast Company"
        },
        {
          "id": "https://building.nubank.com.br/?p=20585",
          "author": "Nubank Editorial",
          "description": "For the first time, Nubank was mentioned on the list of most valuable companies in Brazil, conducted by the consulting firm Interbrand.\nThe post Nubank joins the list of 25 most valuable brands in Brazil appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-joins-the-list-of-25-most-valuable-brands-in-brazil/",
          "publishedOn": "2023-03-31T20:27:39.000Z",
          "wordCount": 3262,
          "title": "Nubank joins the list of 25 most valuable brands in Brazil"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/evolution-hackerones-live-hacking-events",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/evolution-hackerones-live-hacking-events",
          "publishedOn": "2023-04-27T00:47:32.000Z",
          "wordCount": 651,
          "title": "The Evolution of HackerOne's Live Hacking Events"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/best-practice-makes-perfect",
          "author": "Chris Evans",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/best-practice-makes-perfect",
          "publishedOn": "2023-04-24T19:09:35.000Z",
          "wordCount": 2444,
          "title": "(Best) Practice Makes Perfect"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/getting-started-high-school-bug-hunter-cubeds-hacker-afk",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/getting-started-high-school-bug-hunter-cubeds-hacker-afk",
          "publishedOn": "2023-04-21T18:31:07.000Z",
          "wordCount": 2030,
          "title": "Getting Started as a High School Bug Hunter: Cubed's Hacker AFK"
        },
        {
          "id": "https://hackerone.com/policy-and-advocacy/hackerone-responds-review-uks-computer-misuse-act-cma",
          "author": "Ilona Cohen",
          "description": "",
          "link": "https://www.hackerone.com/policy-and-advocacy/hackerone-responds-review-uks-computer-misuse-act-cma",
          "publishedOn": "2023-04-20T04:00:00.000Z",
          "wordCount": 956,
          "title": "HackerOne Responds To The Review of The UK’s Computer Misuse Act (CMA)"
        },
        {
          "id": "https://hackerone.com/ceo/make-your-cybersecurity-dollars-last-longer",
          "author": "Mårten Mickos",
          "description": "",
          "link": "https://www.hackerone.com/ceo/make-your-cybersecurity-dollars-last-longer",
          "publishedOn": "2023-04-18T22:00:00.000Z",
          "wordCount": 1713,
          "title": "Make Your Cybersecurity Dollars Last Longer"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/bench-time-results-ambassador-world-cups-first-round",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/bench-time-results-ambassador-world-cups-first-round",
          "publishedOn": "2023-04-17T22:10:58.000Z",
          "wordCount": 1293,
          "title": "Bench Time: Results from the Ambassador World Cup’s First Round"
        },
        {
          "id": "https://hackerone.com/penetration-testing/ten-practical-tips-high-value-pentest-engagements",
          "author": "Spencer Chin",
          "description": "",
          "link": "https://www.hackerone.com/penetration-testing/ten-practical-tips-high-value-pentest-engagements",
          "publishedOn": "2023-04-13T16:00:00.000Z",
          "wordCount": 2093,
          "title": "Ten Practical Tips For High-Value Pentest Engagements"
        },
        {
          "id": "https://hackerone.com/application-security/how-optimistic-can-security-professionals-afford-be-2023",
          "author": "Mahesh Chukkapali",
          "description": "Cyber attackers are increasingly well-resourced and elusive. Yet, CyberEdge's 2023 Cyberthreat Defense Report found IT and security professionals are feeling optimistic about their ability to handle cybersecurity risk.",
          "link": "https://www.hackerone.com/application-security/how-optimistic-can-security-professionals-afford-be-2023",
          "publishedOn": "2023-04-12T18:00:00.000Z",
          "wordCount": 1615,
          "title": "How Optimistic Can Security Professionals Afford to Be in 2023?"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-awc-edition-remonsec",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-awc-edition-remonsec",
          "publishedOn": "2023-04-12T03:44:22.000Z",
          "wordCount": 1425,
          "title": "Ambassador Spotlight AWC Edition: remonsec"
        },
        {
          "id": "https://hackerone.com/application-security/100-conversations-start-security-leaders",
          "author": "Chris Campbell",
          "description": "",
          "link": "https://www.hackerone.com/application-security/100-conversations-start-security-leaders",
          "publishedOn": "2023-04-11T18:00:00.000Z",
          "wordCount": 1546,
          "title": "100 Conversations with Start-up Security Leaders"
        },
        {
          "id": "https://hackerone.com/ceo/why-economic-downturns-put-innovation-risk-and-threaten-cybersafety",
          "author": "Mårten Mickos",
          "description": "",
          "link": "https://www.hackerone.com/ceo/why-economic-downturns-put-innovation-risk-and-threaten-cybersafety",
          "publishedOn": "2023-04-07T00:01:00.000Z",
          "wordCount": 1297,
          "title": "Why Economic Downturns Put Innovation at Risk And Threaten Cybersafety"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/how-hackers-are-finding-advocacy-top-hacker-cdl-speaks-his-experience",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/how-hackers-are-finding-advocacy-top-hacker-cdl-speaks-his-experience",
          "publishedOn": "2023-04-06T14:12:05.000Z",
          "wordCount": 2069,
          "title": "How Hackers Are Finding Advocacy: Top Hacker cdl Speaks on His Experience in the Hacker Success Program"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hackerones-next-million-dollar-hacker-chad-jahpeety",
          "author": "HackerOne",
          "description": "",
          "link": "https://www.hackerone.com/hackerone-community-blog/hackerones-next-million-dollar-hacker-chad-jahpeety",
          "publishedOn": "2023-04-01T14:25:40.000Z",
          "wordCount": 978,
          "title": "HackerOne's Next Million Dollar Hacker Chad Jahpeety"
        },
        {
          "id": "https://hackerone.com/security-compliance/cyber-regulations-can-make-our-nation-safer",
          "author": "Ilona Cohen",
          "description": "",
          "link": "https://www.hackerone.com/security-compliance/cyber-regulations-can-make-our-nation-safer",
          "publishedOn": "2023-03-29T21:00:00.000Z",
          "wordCount": 1112,
          "title": "Cyber Regulations Can Make Our Nation Safer"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": []
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}