{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Suzanne Frey, VP, Product, Android & Play Security and Privacy\n\nWe introduced Android’s Private Compute Core in Android 12 Beta. Today, we're excited to announce a new suite of services that provide a privacy-preserving bridge between Private Compute Core and the cloud.   \nRecap: What is Private Compute Core? \nAndroid’s Private Compute Core is an open source, secure environment that is isolated from the rest of the operating system and apps. With each new Android release we’ll add more privacy-pre…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/Omu-IejlSFU/introducing-androids-private-compute.html",
          "publishedOn": "2021-09-09T17:00:00.000Z",
          "wordCount": 813,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Android’s Private Compute Services"
        },
        {
          "description": "Posted by Eric Brewer and Dan Lorenc\n\n\nYesterday, we were honored to participate in President Biden’s White House Cyber Security Summit where we shared recommendations to advance the administration’s cybersecurity agenda. This included our commitment to invest $10 billion over the next five years to expand zero-trust programs, help secure the software supply chain, and enhance open-source security.\nAt Google, we’ve long advocated for securing the software supply chain both through our internal best practice…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/xpVcMI4qIOQ/updates-on-our-continued-collaboration.html",
          "publishedOn": "2021-08-26T17:47:00.003Z",
          "wordCount": 1448,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Updates on our continued collaboration with NIST to secure the Software Supply Chain"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "On this special edition of The Changelog, we’re talking with Cory Wilkerson, Senior Director of Engineering at GitHub, about GitHub Codespaces. For years now, the possibility of coding in the cloud seemed so close, yet so far away for a number of reasons. According to Cory, the raw ingredients to make coding in the cloud a reality have been there for years. The challenge has really been how the industry thinks, and we are now at a place where the skepticism in cloud based workflows is “non-existent.”\nAfter …",
          "link": "https://changelog.com/podcast/459",
          "publishedOn": "2021-09-11T04:00:00.000Z",
          "wordCount": 439,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 459: Coding in the cloud with Codespaces"
        },
        {
          "description": "This looks great for those of us who haven’t memorized the command-line flags yet.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jely2002/youtube-dl-gui",
          "publishedOn": "2021-09-10T19:28:00.000Z",
          "wordCount": 1069,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "youtube-del gets an Electron-based GUI"
        },
        {
          "description": "Migrating off jQuery? So was Sachin Neravath:\nMost of the projects use only 15% to 20% or less than 30% of the jquery methods And in most of the cases, I didn’t want to support all the edge cases or legacy browsers. The hardest part was finding the jQuery methods in the existing project and writing the alternative vanilla js methods without making much changes in the codebase. So I wrote this library which automatically finds jquery methods in any particular JavaScript file and generates readable, chainable…",
          "link": "https://github.com/sachinchoolur/replace-jquery",
          "publishedOn": "2021-09-10T18:36:00.000Z",
          "wordCount": 2214,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Auto-generate vanilla JS alternatives for jQuery methods"
        },
        {
          "description": "Your favorite web dev podcasts join forces for a super collab that’ll knock you frontend off! Amelia joins Chris Coyier and Dave Rupert from ShopTalk Show while Divya teams up with Wes Box &amp; Scott Tolinski from Syntax. Let the FEUDing begin!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool For Startups – More and more startups are using Retool to focus their time on their core product. That’s exactly why Retool launched …",
          "link": "https://changelog.com/jsparty/192",
          "publishedOn": "2021-09-10T16:15:00.000Z",
          "wordCount": 492,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 192: Frontend Feud: ShopTalk vs Syntax"
        },
        {
          "description": "Amazon EKS Anywhere is a new deployment option for Amazon EKS that enables you to easily create and operate Kubernetes clusters on-premises with your own virtual machines. It brings a consistent AWS management experience to your data center, building on the strengths of Amazon EKS Distro, the same distribution of Kubernetes that powers EKS on AWS. Its goal is to include full lifecycle management of multiple Kubernetes clusters that are capable of operating completely independently of any AWS services.\nDiscu…",
          "link": "https://github.com/aws/eks-anywhere",
          "publishedOn": "2021-09-10T13:41:00.000Z",
          "wordCount": 999,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "You can now run Amazon EKS on your own infra"
        },
        {
          "description": "In this episode, Gerhard talks to David and Marques from Equinix Metal about the importance of bare metal for steady workloads. Terraform, Kubernetes and Tinkerbell come up, as does Crossplane - this conversation is a partial follow-up to episode 15.\nDavid Flanagan, a.k.a. Rawkode, needs no introduction. Some of you may remember Marques Johansson from The new changelog.com setup for 2019. Marques was behind the Linode Terraforming that we used at the time, and our infrastructure was simpler because of it!\nT…",
          "link": "https://changelog.com/shipit/18",
          "publishedOn": "2021-09-09T21:00:00.000Z",
          "wordCount": 579,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 18: Bare metal meets Kubernetes"
        },
        {
          "description": "Building software is difficult and time consuming, but the maintenance of software is where we spend the majority of our time. In this episode, Ian and sam join Johnny and Kris to discuss how to build actually maintainable software, the features of Go that make it good for writing maintainable software, and different ways that we might define the term “maintenance”.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Telepo…",
          "link": "https://changelog.com/gotime/196",
          "publishedOn": "2021-09-09T15:00:00.000Z",
          "wordCount": 416,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 196: Building actually maintainable software"
        },
        {
          "description": "You gently face-palm and let out a groan. Your bug is so obvious now. How did you miss it before? Thank goodness you didn’t blame Bob publicly.\nIn this blog post we will look at how to get unstuck with things you do not understand (yet). It’s a methodical approach to solving insight problems - problems where all the information is known but you need to see it a different light to solve it. We start from writing down the problem and move through increasingly more esoteric phases such as changing location to …",
          "link": "https://www.iamjonas.me/2021/08/i-dont-understand-this-yet.html",
          "publishedOn": "2021-09-09T14:50:00.000Z",
          "wordCount": 2352,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I don't understand this (yet)"
        },
        {
          "description": "Should you use small or large instances in a Kubernetes cluster? It depends. You should consider a few factors when selecting an instance type:\nWhat kind of workloads you deploy (i.e. memory and CPU requirements).\nThe blast radius you can tolerate.\nHow you design your HA strategy.\nHow many resources are available to the pods.\nThis calculator helps you select what’s right from over 700 instances from the major cloud providers.\nDiscuss on Changelog News",
          "link": "https://learnk8s.io/kubernetes-instance-calculator",
          "publishedOn": "2021-09-09T14:04:00.000Z",
          "wordCount": 2072,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Kubernetes instance calculator"
        },
        {
          "description": "Emma Hyde:\nI have seen a staggering amount of Ruby is Dead missives in the last few years, and a decline, or at least, an often discussed decline, of the language’s popularity and ranking. But what makes Ruby so much worse than other languages?\nShe goes on to discuss how Ruby 3.0 addresses two of the most criticized elements of Ruby: its ability to handle processes simultaneously and and its overall performance.\nDiscuss on Changelog News",
          "link": "https://medium.com/retention-science/ruby-is-still-a-diamond-b789d2661266",
          "publishedOn": "2021-09-09T13:15:00.000Z",
          "wordCount": 3408,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ruby is still a diamond"
        },
        {
          "description": "This is a ~15 minute presentation (with transcript) by Álvaro Hernández at a Data on Kubernetes Community event about why he believes Kubernetes solves a big problem with running Postgres in production.\nRunning a Postgres installation, with or without containers, is trivial. However, setting up a production environment is a whole different matter. Postgres is not by itself a production-ready software: it requires a set of side tools to complement its functionality: connection pooling, monitoring, backup too…",
          "link": "https://dok.community/blog/deploying-postgres-on-kubernetes/",
          "publishedOn": "2021-09-08T19:43:00.000Z",
          "wordCount": 4073,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why you should be deploying Postgres primarily on Kubernetes"
        },
        {
          "description": "git-cliff can generate changelog files from the Git history by utilizing conventional commits as well as regex-powered custom parsers. The changelog template can be customized with a configuration file to match the desired format.\n\nDiscuss on Changelog News",
          "link": "https://github.com/orhun/git-cliff",
          "publishedOn": "2021-09-08T14:03:00.000Z",
          "wordCount": 3121,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Generate a changelog from your conventional git commits"
        },
        {
          "description": "This week we’re bringing JS Party to The Changelog — Nick Nisi and Christopher Hiller had an awesome conversation with Luis Villa, co-founder and General Counsel at Tidelift. They discuss GitHub Copilot and the implications of an AI pair programmer and fair use from a legal perspective.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nGitpod – Spin up fresh, ephemeral automated dev environments, in the cloud, in seconds. Their free…",
          "link": "https://changelog.com/podcast/458",
          "publishedOn": "2021-09-08T12:00:00.000Z",
          "wordCount": 522,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 458: We ask a lawyer about GitHub Copilot"
        },
        {
          "description": "htmlq uses CSS selectors to extract bits of content from HTML files. Mozilla’s MDN has a good reference for CSS selector syntax.\nThis looks super handy. Examples!\n// Find part of a page by ID\ncurl --silent https://www.rust-lang.org/ | htmlq '#get-help'\n\n// Find all links in a page\ncurl --silent https://www.rust-lang.org/ | htmlq --attribute href a\n\n// Get the text content of a post\ncurl --silent https://nixos.org/nixos/about.html | htmlq  --text .main\n\nDiscuss on Changelog News",
          "link": "https://github.com/mgdm/htmlq",
          "publishedOn": "2021-09-07T19:04:00.000Z",
          "wordCount": 924,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tool like jq, but for HTML"
        },
        {
          "description": "Yonatan Geifman of Deci makes Daniel and Chris buckle up, and takes them on a tour of the ideas behind his amazing new inference platform.  It enables AI developers to build, optimize, and deploy blazing-fast deep learning models on any hardware.  Don’t blink or you’ll miss it!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipe…",
          "link": "https://changelog.com/practicalai/148",
          "publishedOn": "2021-09-07T18:00:00.000Z",
          "wordCount": 382,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 148: Stellar inference speed via AutoNAS"
        },
        {
          "description": "Problem: TODOs as comments are too often forgotten or neglected\nSolution: TODOs as code that triggers compile errors based on set criteria\n// trigger a compile error if we're past a certain date\ntodo_or_die::after_date!(3000, 1, 1); // its the year 3000!\n\n// or a GitHub issue has closed\ntodo_or_die::issue_closed!(&quot;rust-lang&quot;, &quot;rust&quot;, 44265); // GATs are here!\n\n// or the latest version of a crate matches some expression\ntodo_or_die::crates_io!(&quot;serde&quot;, &quot;&gt;1.0.9000&quot;);…",
          "link": "https://github.com/davidpdrsn/todo-or-die",
          "publishedOn": "2021-09-07T16:06:00.000Z",
          "wordCount": 588,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "These TODOs will self-destruct in 10... 9..."
        },
        {
          "description": "I’ve often wondered this as well. My conclusion, after not thinking too deeply about the issue, was that it’s a combination of the difficulty in match making and poor tooling. (There are many startups trying to solve those problems, but it doesn’t seem like anybody has cracked the nut yet).\nThere’s lots of wisdom in this post by Curt Corginia:\nA wise, mature person would treat the software engineer interview process as a pure learning experience. He, or she, would enjoy learning about companies out there fo…",
          "link": "https://betterprogramming.pub/if-software-engineering-is-in-demand-why-is-it-so-hard-to-get-a-software-engineering-job-c043a964e463",
          "publishedOn": "2021-09-07T15:19:00.000Z",
          "wordCount": 1892,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An attempt to answer the question, “If software engineering is in demand, why is it so hard to get a software engineering job?”"
        },
        {
          "description": "Ars Technica gave some of our favorite command-line tools the deep-dive they deserve:\nInstead of giving you encyclopedic listings of every possible argument and use case for each of these ubiquitous commands, we’re going to teach you how to think about them—and how to easily, productively incorporate them in your own daily command-line use.\nDiscuss on Changelog News",
          "link": "https://arstechnica.com/gadgets/2021/08/linux-bsd-command-line-101-using-awk-sed-and-grep-in-the-terminal/",
          "publishedOn": "2021-09-07T14:33:00.000Z",
          "wordCount": 1331,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Learn to think in sed, awk, and grep"
        },
        {
          "description": "This is an article about exploring Inlets, a cloud native tunnel, with various use cases (including the Apple Silicon RC version of inlets-pro) in my home lab along with its surrounding open source ecosystem. Also some tips about using inlets-operator and MetalLB at the same time, and what could be done in a Kubernetes cluster.\nDiscuss on Changelog News",
          "link": "https://blog.zespre.com/inlets-the-cloud-native-tunnel.html",
          "publishedOn": "2021-09-07T13:45:00.000Z",
          "wordCount": 2381,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tour of Inlets (a tunnel built for the cloud)"
        },
        {
          "description": "Today Adam is joined by Kurt Mackey, co-founder and CEO of Fly.io — a platform for running full stack apps and databases close to users. This conversation with Kurt talks through his journey as a developer and entrepreneur, fundraising, getting into Y Combinator (twice), and how they’ve iterated on the Fly platform since 2017 to get to where they are right now.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The Zero DevO…",
          "link": "https://changelog.com/founderstalk/80",
          "publishedOn": "2021-09-03T20:00:00.000Z",
          "wordCount": 449,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 80: Iterating to globally distributed apps and databases"
        },
        {
          "description": "Amal, KBall, and Nick welcome David Khourshid to the show to talk about his project, XState. XState brings state management to a new level using finite state machines and is compatible with your stack. We talk about how the idea came to fruition, its practical uses, and where it’s going.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool For Startups – More and more startups are using Retool to focus their time on their core p…",
          "link": "https://changelog.com/jsparty/191",
          "publishedOn": "2021-09-03T16:40:00.000Z",
          "wordCount": 469,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 191: X gon' State it to ya"
        },
        {
          "description": "In the recent months there’s been a lot of noise in the area of supply chain security because of increase in attacks, with notable ones like Microsoft Exchange Server or SolarWinds breach. These attacks could have been prevented with proper tools in place, yet finding the right tool for the job might be difficult as this area is hard to navigate and most of us - developers - aren’t security experts. There’s however a project that can solve this. Its name is sigstore and in this article we will look at what …",
          "link": "https://martinheinz.dev/blog/55",
          "publishedOn": "2021-09-03T15:47:00.000Z",
          "wordCount": 15,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A solution to software supply chain security"
        },
        {
          "description": "What Vercel has enabled teams to do with Next.js is next level, and it’s truly evident when you read stories like this one from Cory Etzkorn on Notion migrating their marketing site to Next.js.\nWe rebuilt our entire marketing site from scratch, choosing to go with a statically generated architecture over our former purely client-rendered approach. Two months and 109 React components later, we’ve now fully migrated to our framework of choice, Next.js, and couldn’t be happier with our decision. Here’s how we …",
          "link": "https://www.notion.so/blog/migrating-notion-marketing-to-next-js",
          "publishedOn": "2021-09-03T15:01:01.000Z",
          "wordCount": 2485,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Notion's journey to Next.js"
        },
        {
          "description": "Ultra is a web framework that leans hard into your browser’s native features. Embrace the future of ES Modules, Import Maps, and Web Streams. All while supporting some of the non-standards that many normal people love for some reason (JSX and TypeScript).\nDiscuss on Changelog News",
          "link": "https://ultrajs.dev/",
          "publishedOn": "2021-09-03T14:52:00.000Z",
          "wordCount": 48,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno + React: No build, no bundle, all streaming"
        },
        {
          "description": "I’m Gerhard Lazu, host of Ship It! A show with weekly episodes about getting your best ideas into the world and seeing what happens. We talk about code, ops, infrastructure, and the people that make it happen.\nLike Charity Majors from Honeycomb… clip from episode #11\nAnd Dave Farley, one of the founders of Continuous Delivery… clip from episode #5\nWe even experiment on our own open source podcasting platform so that you can see how we implement specific tools and services within changelog.com.\nWhat works an…",
          "link": "https://changelog.com/shipit/trailer-1",
          "publishedOn": "2021-09-03T14:00:00.000Z",
          "wordCount": 273,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! Let's Ship It!"
        },
        {
          "description": "The news is in the headline on this one, but here’s a bit more meat from the article:\nUsing rigorous and detailed scientific analysis, the study concluded that upon testing 1,692 programs generated in 89 different code-completion scenarios, 40 percent were found to be vulnerable.\n\nDiscuss on Changelog News",
          "link": "https://www.theinsaneapp.com/2021/09/github-copilot-generated-40-percent-insecure-code.html",
          "publishedOn": "2021-09-03T13:19:00.000Z",
          "wordCount": 876,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "GitHub Copilot generated insecure code in 40% of circumstances"
        },
        {
          "description": "Ain was born out of the frustration of working with many API endpoints in GUI clients.\nWhile pretty, I could’t use any shell-scripts or commands such as uuidgen as input to the endpoints without copy pasting from a terminal. And I had to copy-paste the resulting output back into the terminal to further slice and dice it.\nI had become a human pipe and my ctrl+c, ctrl+v fingers were hurting. By using curl and/or httpie for the heavy lifting, Ain removes you from the piping of input and output. With Ain, you c…",
          "link": "https://github.com/jonaslu/ain",
          "publishedOn": "2021-09-02T20:34:00.000Z",
          "wordCount": 2638,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ain is a terminal API client (alternative to Postman, Paw, Insomnia)"
        },
        {
          "description": "Here’s their pitch:\nDo you have a home server you want to run a few apps on, but don’t want everything to\nDo you have a work server that you want to run a few small services on, but don’t want\nHarbormaster is for you.\nYou create a YAML config file with all the git repos you want it to include and it’ll watch them for changes (on a timer) and do the necessary cloning/pulling, service restarting, etc. that needs doing to make it all run. Simple. Neat!\nDiscuss on Changelog News",
          "link": "https://gitlab.com/stavros/harbormaster",
          "publishedOn": "2021-09-02T19:47:00.000Z",
          "wordCount": 215,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Harbormaster – easily deploy many Docker-Compose apps on a single host"
        },
        {
          "description": "To build or to buy, that’s a constant question we ask ourselves as software engineers. In this episode we dig into the nuance of these options and the space between them with an eye toward both the building of software and its eventual maintenance.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any computing resource anywhere. Engineers and security teams can unify access to SSH se…",
          "link": "https://changelog.com/gotime/195",
          "publishedOn": "2021-09-02T16:00:00.000Z",
          "wordCount": 12494,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 195: To build, or to buy, that is the question"
        },
        {
          "description": "From Niels Leenheer:\nIt is not difficult to find some incredibly shitty takes on Electron, and every time it boils down to: It’s slow. Downloads are huge, and it uses a lot of memory. Electron apps are just websites. Developers that are using Electron are taking the lazy or easy approach to cross-platform development. Native apps are just better in every single way.\nAnd somehow, these arguments often come from Apple fans when they discover one of their apps isn’t “native” or when a macOS favourite is consid…",
          "link": "https://nielsleenheer.com/articles/2021/why-electron-apps-are-fine/",
          "publishedOn": "2021-09-02T13:57:20.000Z",
          "wordCount": 1160,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why Electron apps are fine"
        },
        {
          "description": "Big news from Deno today.\nToday we are releasing Deploy Beta 2. This is the second in a series of beta releases that will be made over the coming months. Each release will add features and refine the programming model. The releases will culminate in a General Availability announcement that we estimate will happen in Q4 2021.\nOver the past eight months, we have been quietly designing this hosted service to supplement workflows with the open source Deno CLI. Deploy does not run on AWS Lambda nor does it use C…",
          "link": "https://deno.com/blog/deploy-beta2",
          "publishedOn": "2021-09-01T17:25:31.000Z",
          "wordCount": 578,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno Deploy Beta 2"
        },
        {
          "description": "Routing might be implemented in a number of ways: it’s sometimes code running on a server that maps a path to files on disk, or logic in a single-page app that waits for changes to the current location and creates a corresponding piece of DOM to display.\nBuggy routing (and breaking your browser’s Back button) has been the achilles heel of SPAs since forver. Hopefully better tooling like this URLPattern proposal will help developers better handle the need.\nI like what I see from the linked write-up. The feat…",
          "link": "https://web.dev/urlpattern/",
          "publishedOn": "2021-09-01T16:48:00.000Z",
          "wordCount": 2300,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "URLPattern brings routing to the web platform"
        },
        {
          "description": "The resulting maps are quite varied and absolutely stunning. 🤩\n\nDiscuss on Changelog News",
          "link": "https://github.com/marceloprates/prettymaps",
          "publishedOn": "2021-09-01T16:01:00.000Z",
          "wordCount": 986,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A small set of Python functions to draw pretty maps from OpenStreetMap"
        },
        {
          "description": "On this week’s episode, Gerhard is joined by Kathy Korevec, former Senior Director of Product at GitHub, and now Vercel’s Head of Product. Docs play an essential role in GitHub Actions, and Gerhard’s experience has proven that. Building, testing, and shipping code with GitHub Actions works better because of their excellent docs. However, the docs that Kathy pictures are not what you are imagining. She explains it best in her post, Maybe it’s time we re-think docs, which is what started this whole conversati…",
          "link": "https://changelog.com/shipit/17",
          "publishedOn": "2021-09-01T15:15:00.000Z",
          "wordCount": 505,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 17: Docs are not optional"
        },
        {
          "description": "Yes, to all of this! Dave Bailey, author of The Founder Coach, shared ten useful patterns to help nurture more generous interpretations of others’ behaviors.\nReading this makes me really miss producing Brain Science.\nWhen we encounter emotions and behaviours that don’t make sense to us, it’s often because we don’t have all the information. And in the absence of information, we tend to assume the worst.\n‘Emotional generosity’ is the ability to see past behaviours that we don’t understand and proactively look…",
          "link": "https://medium.dave-bailey.com/the-art-of-not-taking-things-personally-b7a8395ce172",
          "publishedOn": "2021-09-01T14:51:39.000Z",
          "wordCount": 1715,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The art of not taking things personally"
        },
        {
          "description": "In this episode, Peter Wang from Anaconda joins us again to go over their latest “State of Data Science” survey. The updated results include some insights related to data science work during COVID along with other topics including AutoML and model bias. Peter also tells us a bit about the exciting new partnership between Anaconda and Pyston (a fork of the standard CPython interpreter which has been extensively enhanced to improve the execution performance of most Python programs).\nDiscuss on Changelog News\n…",
          "link": "https://changelog.com/practicalai/147",
          "publishedOn": "2021-09-01T14:40:00.000Z",
          "wordCount": 7858,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 147: Anaconda + Pyston and more"
        },
        {
          "description": "From Shruti Kapoor on PayPal’s technology blog:\nWe started our GraphQL adoption journey by building our checkout experience. We saw tremendous benefits in adopting GraphQL when our checkout app built with GraphQL became our guiding light.We built more apps, provided infrastructure support, launched a public GraphQL API, and provided trainings and learning materials across the company. We also set up a standards body, provided a GraphQL tools fanny pack, and built sample apps to help teams get started.\nToday…",
          "link": "https://medium.com/paypal-tech/graphql-at-paypal-an-adoption-story-b7e01175f2b7",
          "publishedOn": "2021-09-01T14:33:07.000Z",
          "wordCount": 3153,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The story of PayPal's adoption of GraphQL"
        },
        {
          "description": "This week Neovim core maintainer TJ DeVries joins Jerod and guest co-host Nick Nisi (from JS Party) to follow-up on our Vim episode with a conversation dedicated to Neovim. TJ tells us why Neovim was created in the first place, how it differs from Vim, why Lua is awesome for configuration and plugins, what LSPs are all about, the cool tech inside tree-sitter, and how he’s writing his own fuzzy file finder for Neovim called Telescope.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer…",
          "link": "https://changelog.com/podcast/457",
          "publishedOn": "2021-08-31T21:30:00.000Z",
          "wordCount": 12763,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 457: Why Neovim?"
        },
        {
          "description": "We had a lot of fun recording the Vim with me series alongside episode 450, so I thought, “Hey, let’s keep it going!” We have Nick Nisi for you today. Nick is a regular panelist on JS Party, co-hosted our upcoming Neovim episode of The Changelog, and is personally responsible for the #vimparty channel of Changelog’s community Slack.\n(If you have any requests of people you’d like to see Vimming with me, let us know in the comments!)\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=W9Bd0FmKgMI",
          "publishedOn": "2021-08-31T20:21:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Vimming with Nick Nisi"
        },
        {
          "description": "Jina calls itself a “cloud-native neural search framework”. What is neural search, exactly?\nThe core idea of neural search is to leverage state-of-the-art deep neural networks to build every component of a search system. In short, neural search is deep neural network-powered information retrieval. In academia, it’s often called neural IR.\nAnd what can it do for you?\nThanks to recent advances in deep neural networks, a neural search system can go way beyond simple text search. It enables advanced intelligenc…",
          "link": "https://github.com/jina-ai/jina/",
          "publishedOn": "2021-08-31T15:41:00.000Z",
          "wordCount": 1430,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Jina – build search-as-a-service powered by deep learning in just minutes"
        },
        {
          "description": "NVUI looks like it’s still rough around the edges (lots of rendering/crashing issues opened over the last few days, no build instructions, etc.) but it looks pretty sweet!\n\nDiscuss on Changelog News",
          "link": "https://github.com/rohit-px2/nvui",
          "publishedOn": "2021-08-31T14:51:00.000Z",
          "wordCount": 600,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A modern frontend for Neovim"
        },
        {
          "description": "This is a solid primer on the usefulness of jq (a lightweight, command-line JSON processor.)\nIn this article, I’m going to go over the basics building blocks of jq in enough depth that you will be able to understand how jq works. Of course, you still might occasionally need to head to google to find a function name or check your syntax, but at least you’ll have a firm grounding in the basics.\nDiscuss on Changelog News",
          "link": "https://earthly.dev/blog/jq-select/",
          "publishedOn": "2021-08-31T14:04:00.000Z",
          "wordCount": 3863,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Getting to know JQ"
        },
        {
          "description": "JavaScript-free and built (poetically) on top of XP.css (whence Longhorn Vista?)\n\nDiscuss on Changelog News",
          "link": "https://github.com/khang-nd/7.css",
          "publishedOn": "2021-08-30T14:49:00.000Z",
          "wordCount": 781,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A tiny CSS framework for building faithful recreations of the windows 7 UI"
        },
        {
          "description": "Get Google search results, but without any ads, javascript, AMP links, cookies, or IP address tracking. Easily deployable in one click as a Docker app, and customizable with a single config file. Quick and simple to implement as a primary search engine replacement on both desktop and mobile.\nIncludes quick deployment to Heroku, Replit, and Fly. Or you can run it locally, of course via standard Python tooling or Docker.\nDiscuss on Changelog News",
          "link": "https://github.com/benbusby/whoogle-search",
          "publishedOn": "2021-08-30T14:00:00.000Z",
          "wordCount": 3855,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A self-hosted, ad-free, privacy-respecting metasearch engine"
        },
        {
          "description": "After months of talking about and planning this episode, we decided near the very end to invite Paul from Heavy Spoilers to join us for a deep, spoiler filled, discussion on the movie Tenet, which was directed by Christopher Nolan and released September 2020. If you’re a fan of Tenet, you’ll love this episode.\nWarning: This episode literally includes heavy spoilers. So come back after you’ve watched the film, or proceed if that doesn’t bother you.\nDiscuss on Changelog News\nJoin Changelog++ to support our wo…",
          "link": "https://changelog.com/backstage/18",
          "publishedOn": "2021-08-27T21:30:00.000Z",
          "wordCount": 15562,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Backstage 18: Tenet with heavy spoilers"
        },
        {
          "description": "Alex Page &amp; Sam Rose from Shopify’s Polaris team join Jerod &amp; Divya to discuss their open research into finding and selecting a viable alternative for Sass at the company. Six solutions enter, but which one will walk away with the 🌹?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors a…",
          "link": "https://changelog.com/jsparty/190",
          "publishedOn": "2021-08-27T19:00:00.000Z",
          "wordCount": 10979,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 190: Replacing Sass at Shopify"
        },
        {
          "description": "From Axios:\nApple said Thursday it will relax some App Store rules in order to settle a class-action lawsuit brought by U.S.-based developers over its store terms.\n…Apple will let developers communicate with users about alternative payment methods outside of the App Store. It will also set up a $100 million fund for small developers and make some other changes to its practices, but it’s keeping its overall commission structure.\nThis settlement is not yet approved by Judge Yvonne Gonzalez Rogers.\nDiscuss on …",
          "link": "https://www.axios.com/apple-settles-developer-class-action-c13bb308-daf3-4231-a399-ffd48b6b2c52.html",
          "publishedOn": "2021-08-27T13:35:00.000Z",
          "wordCount": 1685,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Apple makes app store concessions to settle developer suit"
        },
        {
          "description": "Bryan Boreham (Grafana Labs) and Jordan Lewis (Cockroach Labs) join Mat and Jon to talk about memory management in Go. We learn about the heap, the stack, and the garbage collector. There are also some absolute gems of wisdom scattered throughout this episode, don’t miss it.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourcegraph is universal code search for every developer and team. Easily search across all the …",
          "link": "https://changelog.com/gotime/194",
          "publishedOn": "2021-08-26T21:00:00.000Z",
          "wordCount": 11228,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 194: Don't forget about memory management"
        },
        {
          "description": "From Den Delimarsky:\nWe are truly living in an era of user-hostile software, and when I say “user-hostile” I mean it as “software that doesn’t really care about the needs of the user but rather about the needs of the developer.” And this is not a problem that is bound to a specific operating system (or version thereof) or class or computers. It’s literally cross-platform, and it follows customers from home, to office, to their commute.\nLet me give you some examples from my own experience…\nA common offender …",
          "link": "https://den.dev/blog/user-hostile-software/",
          "publishedOn": "2021-08-26T16:54:00.000Z",
          "wordCount": 1831,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The rise of user-hostile software"
        },
        {
          "description": "This one is for Jerod since he’s such a Nick Miller fan 🤣\nMiller is like awk, sed, cut, join, and sort for name-indexed data such as CSV, TSV, and tabular JSON\n\nDiscuss on Changelog News",
          "link": "https://github.com/johnkerl/miller",
          "publishedOn": "2021-08-26T16:02:22.000Z",
          "wordCount": 1508,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Miller is like awk, sed, cut, join, and sort for name-indexed data"
        },
        {
          "description": "This comment on HN does a great job summarizing Bashly.\n…think of this as an argparse equivalent for Bash. You provide a YAML file listing commands, subcommands, arguments, and flags, and it automatically generates a Bash script that can parse and validate them, provide help messages, and run your code for each command.\nIt also lets you keep the actual code for each command and subcommand in separate files, which are merged together into one distributable Bash script at generation time. It’s basically a tem…",
          "link": "https://github.com/DannyBen/bashly",
          "publishedOn": "2021-08-26T15:20:07.000Z",
          "wordCount": 915,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Bashly - Bash CLI Framework and Generator"
        },
        {
          "description": "Thank you for sharing this Maya. These pull-quotes resonated with me.\nI don’t think I noticed I was burnt out until early February 2021, almost six months later. Honestly, realizing it was kind of a relief. I hadn’t noticed how bad it had gotten. A few weeks later, I quit my job. And then a new, different kind of struggle started. Not knowing what to do with myself, or how to recover.\nSo why did I burn out? I don’t know. It’s not a single thing - like a specific work stressor - that caused my burnout. It wa…",
          "link": "https://mayakaczorowski.com/blogs/burnout",
          "publishedOn": "2021-08-26T15:04:59.000Z",
          "wordCount": 2523,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Burning out and quitting"
        },
        {
          "description": "On today’s show Adam is joined by John Nunemaker (an old friend). For some of you listening you might remember John’s appearance on The Changelog #11, which was basically forever ago. Or his company Ordered List — they made Gauges, Harmony, and Speaker Deck which was quite popular in its time — so much so that they attracted the attention of Chris Wanstrath, one of the co-founders of GitHub to acquire Ordered List. The rest as they say is history. Today, John and I go back through that history to see what i…",
          "link": "https://changelog.com/founderstalk/79",
          "publishedOn": "2021-08-26T11:00:00.000Z",
          "wordCount": 15782,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 79: The acquisition of a lifetime"
        },
        {
          "description": "Codex is a descendant of GPT-3 – its training data contains both natural language and billions of lines of source code from publicly available sources, including code in public GitHub repositories.\n“We see this as a tool to multiply programmers,” OpenAI’s CTO and co-founder Greg Brockman told The Verge. “Programming has two parts to it: you have ‘think hard about a problem and try to understand it,’ and ‘map those small pieces to existing code, whether it’s a library, a function, or an API.’” The second par…",
          "link": "https://www.theverge.com/2021/8/10/22618128/openai-codex-natural-language-into-code-api-beta-access",
          "publishedOn": "2021-08-25T21:57:22.000Z",
          "wordCount": 1794,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "OpenAI Codex translates english into code"
        },
        {
          "description": "Redis is awesome, but Redis commands are not always fun. Pottery is a Pythonic way to access Redis. If you know how to use Python dicts, then you already know how to use Pottery. Pottery is useful for accessing Redis more easily, and also for implementing microservice resilience patterns; and it has been battle tested in production at scale.\nDiscuss on Changelog News",
          "link": "https://github.com/brainix/pottery",
          "publishedOn": "2021-08-25T16:57:00.000Z",
          "wordCount": 4204,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Pottery — Redis for humans."
        },
        {
          "description": "In this episode, Gerhard follows up on The Changelog #375, which is the last time that he spoke Crossplane with Dan and Jared. Many things changed since then, such as abstractions and compositions, as well as using Crossplane to build platforms, which were mostly ideas.\nFast forward 18 months, 2k changes, as well as a major version, and Crossplane is now an easy choice - some would say the best choice - for platform teams to declare what infrastructure means to them. You can now use Crossplane to define you…",
          "link": "https://changelog.com/shipit/15",
          "publishedOn": "2021-08-18T16:30:00.000Z",
          "wordCount": 563,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 15: Assemble all your infrastructure"
        },
        {
          "description": "I’ve been test-driving Neovim (episode coming soon!) and I’m impressed at how hacker its community is. Should use NvChad directly? I dunno, but it can surely be relied upon for inspiration and cherry-picking.\n\nDiscuss on Changelog News",
          "link": "https://github.com/NvChad/NvChad",
          "publishedOn": "2021-08-18T15:30:00.000Z",
          "wordCount": 1176,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An attempt to make Neovim as functional as an IDE"
        },
        {
          "description": "This is an excellent post that takes you along on the author’s journey to build a simple, collaborative (desktop-like interactions and realtime collaborations, such as Notion, Discord, Figma, etc.) todo app:\nWith the help of many great tools, we’ve successfully built a fast, collaborative todo app. More importantly, we’ve worked out a reasonably simple approach to building similar web apps. As the user base and feature set grow, this approach shall scale well in both performance and complexity.\nBoth the res…",
          "link": "https://zjy.cloud/posts/collaborative-web-apps",
          "publishedOn": "2021-08-18T14:19:00.000Z",
          "wordCount": 2531,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A simple way to build collaborative web apps"
        },
        {
          "description": "There was a glorious (albeit too short) period on the web when we were mashing up APIs from various startups and tech companies to create cool stuff. Then things changed. The web grew up, became Serious Business™️, and free/public APIs got harder and harder to find. Turns out, there’s still a bunch of good ones out there!\nThis repo has collected them in one long, categorized list for us to reference. 👏\nDiscuss on Changelog News",
          "link": "https://github.com/public-api-lists/public-api-lists",
          "publishedOn": "2021-08-18T13:30:00.000Z",
          "wordCount": 8232,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A collection of free/public APIs you can use to build awesome stuff"
        },
        {
          "description": "PlayCover lets you sideload iOS apps and games onto your Mac and run them like any other app. Simply drag-n-drop the .ipa file and wait for PlayCover to convert and launch the app. Here’s a video of it in action playing Genshin Impact.\nDiscuss on Changelog News",
          "link": "https://github.com/Letscoder/PlayCover",
          "publishedOn": "2021-08-17T18:15:00.000Z",
          "wordCount": 755,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Run iOS apps on your M1 Mac with mouse, keyboard, and controller support"
        },
        {
          "description": "Sherloq is a personal research project about implementing a fully integrated environment for digital image forensics. It is not meant as an automatic tool that decide if an image is forged or not (that tool probably will never exist…), but as a companion in experimenting with various algorithms found in the latest research papers and workshops.\nThe original version was written in C++ in 2015, but a port to Python is in the works. It looks super useful, but buyer beware:\nI’m happy to share my code and get in…",
          "link": "https://github.com/GuidoBartoli/sherloq",
          "publishedOn": "2021-08-17T17:24:00.000Z",
          "wordCount": 1971,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A digital image forensic toolset"
        },
        {
          "description": "In Kenya, 33% of maternal deaths are caused by delays in seeking care, and 55% of maternal deaths are caused by delays in action or inadequate care by providers. Jacaranda Health is employing NLP and dialogue system techniques to help mothers experience childbirth safely and with respect and to help newborns get a safe start in life. Jay and Sathy from Jacaranda join us in this episode to discuss how they are using AI to prioritize incoming SMS messages from mothers and help them get the care they need.\nDis…",
          "link": "https://changelog.com/practicalai/145",
          "publishedOn": "2021-08-17T14:30:00.000Z",
          "wordCount": 458,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 145: NLP to help pregnant mothers in Kenya"
        },
        {
          "description": "Brett Cannon:\n… over 3 years ago I set out to re-implement the Python Launcher for Unix in Rust. On July 24, 2021, I launched 1.0.0 of the Python Launcher for Unix… This gives you a py command on Unix which will always use the newest version of Python.\nHe goes on to describe some workflow niceties that a built in and also what this project is not about:\nThe Launcher is purely a convenience and not meant to be The Launcher For All Things; this should never end up in a Docker container.\nDiscuss on Changelog N…",
          "link": "https://snarky.ca/introducing-the-python-launcher-for-unix/",
          "publishedOn": "2021-08-16T14:33:00.000Z",
          "wordCount": 1231,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Introducing the Python launcher for  Unix"
        },
        {
          "description": "Matt Rickard shares 31 reflections after putting his time 10k hours in programming:\nThese are reflections only about pure coding — no lessons sum up to “programming is about people” or “how to be a senior technical leader” (arguably more important to a career, but not the topic of this post).\nThese reflections are just about deliberately writing code for 10,000 hours. Most don’t apply to beginners. These reflections are not career advice. Think of them as lessons on being a technical guitarist, not about be…",
          "link": "https://matt-rickard.com/reflections-on-10-000-hours-of-programming/",
          "publishedOn": "2021-08-16T13:39:00.000Z",
          "wordCount": 934,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reflections on 10,000 hours of programming"
        },
        {
          "description": "Ned Batchelder, after reading some code to termine whether or not it was “Pythonic”:\nMy first response was that I don’t like this code, because I had to read it with my eyebrows. That is, I furrow my brow, and read slowly, and scowl at the code as I puzzle through it. This code is dense and tricky.\nIs it Pythonic? I guess in the sense that it uses a number of Python-specific constructs and tools, yes. But not in the sense of Python code being clear and straightforward. It uses Python thoroughly, but misses …",
          "link": "https://nedbatchelder.com/blog/202108/pythonic_monotonic.html",
          "publishedOn": "2021-08-13T18:43:00.000Z",
          "wordCount": 2209,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "On reading code with your eyebrows"
        },
        {
          "description": "Henrik Fricke:\nIndiepen lets you embed HTML, CSS, and JS code examples on a website. We built it because we wanted to embed code examples on our  blog, but many existing solutions set cookies, have a ton of features or just come with a bad performance.\n😎 No cookies, no tracking, no external requests\nCongrats, Henrik, on shipping your first open source project! 👏\nDiscuss on Changelog News",
          "link": "https://indiepen.tech/",
          "publishedOn": "2021-08-13T17:54:00.000Z",
          "wordCount": 341,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Indiepen – a  privacy-friendly solution to present your code to people"
        },
        {
          "description": "It’s 22 months since I found myself frustrated with writing boilerplate instructions to install simple, but necessary software in every tutorial I wrote for clients and for my own open source work.\nIn this article post I’ll walk you through the journey of the past two years from the initial creation, through to growing the community, getting the first sponsored app and what’s next. There will be code snippets, and technical details, but there should be something for everyone as we celebrate the two year ann…",
          "link": "https://blog.alexellis.io/kubernetes-marketplace-two-year-update/",
          "publishedOn": "2021-08-13T17:07:00.000Z",
          "wordCount": 3295,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building an open source marketplace for Kubernetes (2 years later)"
        },
        {
          "description": "Luis Villa of Tidelift joins the show to discuss GitHub Copilot and the implications of an AI pair programmer from a legal perspective.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to …",
          "link": "https://changelog.com/jsparty/188",
          "publishedOn": "2021-08-13T16:20:00.000Z",
          "wordCount": 446,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 188: We ask a lawyer about GitHub Copilot"
        },
        {
          "description": "Fossil deliberately omits a “rebase” command because the original designer of Fossil (and original author of this article) considers rebase to be an anti-pattern to be avoided. This article attempts to explain that point of view.\nRead this article by SQLite/Fossil creator Richard Hipp to prep for next week’s episode of The Changelog. 😉\nDiscuss on Changelog News",
          "link": "https://www.fossil-scm.org/home/doc/trunk/www/rebaseharm.md",
          "publishedOn": "2021-08-13T13:51:00.000Z",
          "wordCount": 3599,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Rebase considered harmful"
        },
        {
          "description": "This week Adam is joined by Eugenio Pace, co-founder and CEO of Auth0. Auth0 is a for developers, by developers identity, access, security, and authentication platform built for the cloud that secures billions of logins every year. Mid 2020 they raised $120 million at a $1.92 billion valuation after being told no several times. Then, earlier this year in March they announced they were being acquired by Okta for $6.5 billion, in a bold and future-thinking all stock deal. This episode is full of wisdom, inspi…",
          "link": "https://changelog.com/founderstalk/78",
          "publishedOn": "2021-08-13T11:00:00.000Z",
          "wordCount": 490,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 78: Leading Auth0 to a $6.5 billion acquisition"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": []
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "There’s a lot to love about online shopping: It’s fast, it’s easy and there are a ton of options to choose from. But there’s one obvious challenge — you can’t try anything on. This is something Google product manager Debbie Biswas noticed, as a tech industry veteran and startup founder herself. “Historically, the fashion industry only celebrates people of a certain size and skin color,” she says. “This was something I wanted to change.”\nDebbie grew up in India and moved to the U.S. after she graduated colle…",
          "link": "https://blog.google/technology/ai/this-googlers-team-is-making-shopping-more-inclusive/",
          "publishedOn": "2021-09-01T15:00:00.000Z",
          "wordCount": 1288,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "This Googler’s team is making shopping more inclusive"
        },
        {
          "description": "“Farmers feed the entire world — so how might we support them to be resilient and build sustainable systems that also support global food security?” It’s a question that Diana Akrong found herself asking last year. Diana is a UX researcher based in Accra, Ghana, and the founding member of Google’s Accra UX team.\nAcross the world, her manager Dr. Courtney Heldreth, was equally interested in answering this question. Courtney is a social psychologist and a staff UX researcher based in Seattle, and both women w…",
          "link": "https://blog.google/technology/ai/researchers-make-sure-ai-works-for-farmers/",
          "publishedOn": "2021-08-23T15:00:00.000Z",
          "wordCount": 1927,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "These researchers are bringing AI to farmers"
        },
        {
          "description": "Before the pandemic, Alicia Chang was working on a new project. “I was experimenting with non-traditional ways to help teach Googlers the AI Principles,” she says. Alicia is a technical writer on the Engineering Education team focused on designing learning experiences to help Googlers learn about our AI Principles and how to apply them in their own work.\nThe challenge for Alicia would be how many people she needed to educate. “There are so many people spread over different locations, time zones, countries!”…",
          "link": "https://blog.google/technology/ai/crossword-puzzle-big-purpose/",
          "publishedOn": "2021-08-18T16:00:00.000Z",
          "wordCount": 1272,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "A crossword puzzle with a big purpose"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "Here are six requirements that I have on a project for it to reach my gold approval for stellar docs. Then something about what I&#8217;ve done recently to further improve the docs for curl. Your docs belong in the code repository It needs to be next to the code so that authors and contributors can &#8230; Continue reading Making world-class docs takes effort &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/04/making-world-class-docs-takes-effort/",
          "publishedOn": "2021-09-04T09:30:11.000Z",
          "wordCount": 2329,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Making world-class docs takes effort"
        },
        {
          "description": "SVT is the Swedish national public television. They recently announced their new series Det svenska spelundret, which translated to &#8220;The Swedish game wonder&#8221; or something. It is a five episode documentary series about the history behind and the creation of the flourishing Swedish computer game industry. In Swedish and the only subtitles available are also &#8230; Continue reading Early me caught on TV &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/08/19/early-me-caught-on-tv/",
          "publishedOn": "2021-08-19T07:54:53.000Z",
          "wordCount": 1047,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Early me caught on TV"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "In this post, we will discuss our recent work on neural graph diffusion networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "publishedOn": "2021-09-10T12:25:27.270Z",
          "wordCount": 2883,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Graph Neural Networks as Neural Diffusion PDEs"
        },
        {
          "description": "As part of this year’s DEFCON AI Village, we’re trying something radical by introducing the industry’s first algorithmic bias bounty competition.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-09-10T12:25:24.016Z",
          "wordCount": 888,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter’s first algorithmic bias bounty challenge"
        },
        {
          "description": "Sharing learnings from the first algorithmic bias bounty challenge",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-09-10T09:47:55.991Z",
          "wordCount": 1408,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings from the first algorithmic bias bounty challenge"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-08-14T12:17:11.190Z",
          "wordCount": 2221,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-08-14T12:17:09.228Z",
          "wordCount": 3228,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-08-14T12:17:09.196Z",
          "wordCount": 2278,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-08-14T12:17:08.430Z",
          "wordCount": 1457,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan",
          "publishedOn": "2021-08-14T12:17:08.416Z",
          "wordCount": 2260,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2021-08-14T12:17:08.396Z",
          "wordCount": 2396,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Logging at Twitter: Updated"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-08-14T12:17:08.350Z",
          "wordCount": 1790,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2021-08-13T12:17:53.542Z",
          "wordCount": 1282,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Applying flame graphs outside of performance analysis"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "ul.lst-kix_w3t1hchiy4w5-6{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-1{list-style-type:none}ul.lst-kix_w3t1hchiy4w5-5{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-0{list-style-type:none}ul.lst-kix_w3t1hchiy4w5-4{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-3{list-style-type:none}ul.lst-kix_w3t1hchiy4w5-3{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-2{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-5{list-style-type:none}ul.lst-kix_a73fbzj8zqo2-4{list-style-type:none}ul.lst-kix_w3t1hchiy4w5-8{list-style-type:…",
          "link": "https://googleprojectzero.blogspot.com/2021/08/understanding-network-access-windows-app.html",
          "publishedOn": "2021-08-19T16:37:00.000Z",
          "wordCount": 8386,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "Understanding Network Access in Windows AppContainers"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Are you curious about the best vulnerability assessment tools? We detail some of the popular tools, what they do, and their pros and cons.",
          "link": "https://www.hackerone.com/vulnerability-management/vulnerability-assessment-tools-top-tools-what-they-do",
          "publishedOn": "2021-08-30T17:00:00.000Z",
          "wordCount": 1589,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Assessment Tools [Top Tools & What They Do]"
        },
        {
          "description": "Over the last year, DeFi has grown significantly with billions of dollars of cryptocurrency locked into blockchain contracts. With this growth comes increased risk and DeFi funds are lucrative targets for malicious actors. Learn how a HackerOne hacker helps protect DeFi funds and mitigate this risk.",
          "link": "https://www.hackerone.com/ethical-hacker/hacker-powered-security-and-defi-how-human-intelligence-improves-cryptocurrency",
          "publishedOn": "2021-08-28T00:00:00.000Z",
          "wordCount": 1603,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hacker-Powered Security and DeFi: How Human Intelligence Improves Cryptocurrency Security"
        },
        {
          "description": "HackerOne announces new capabilities for AWS customers looking to improve security in their cloud applications. These include vulnerability pentests specific to AWS environments, an AWS Security Hub integration for fast, effective security actions, and AWS Certified hackers. AWS customers can now identify and fix vulnerabilities quickly and develop a better understanding of their cloud application security profile.",
          "link": "https://www.hackerone.com/penetration-testing/hackerone-announces-hacker-powered-cloud-security-capabilities-aws-customers",
          "publishedOn": "2021-08-25T13:00:00.000Z",
          "wordCount": 1243,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "HackerOne Announces Hacker-Powered Cloud Security Capabilities for AWS Customers"
        },
        {
          "description": "HackerOne announced an integration with AWS Security Hub that exchanges vulnerability findings and streamlines workflows to accelerate security actions. The integration consolidates and routes vulnerability intelligence from HackerOne to AWS Security Hub, delivering greater visibility into crucial gaps that could lead to a cyberattack.",
          "link": "https://www.hackerone.com/company-news/how-new-hackerone-integration-aws-security-hub-accelerates-vulnerability-remediation",
          "publishedOn": "2021-08-25T12:50:00.000Z",
          "wordCount": 1144,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How a New HackerOne Integration with AWS Security Hub Accelerates Vulnerability Remediation Time"
        },
        {
          "description": "One of the primary missions of the Defense Counterintelligence and Security Agency (DCSA) is to provide critical technology protection to the Defense Industrial Base (DIB). Given the recent increase in cyber incidents affecting the DIB, DCSA views the DIB-VDP Pilot as a promising way to identify and stop attempts at stealing our Nation’s secrets.",
          "link": "https://www.hackerone.com/vulnerability-disclosure/dod-improves-their-security-posture-through-dib-vdp",
          "publishedOn": "2021-08-20T12:00:00.000Z",
          "wordCount": 1496,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "The DOD Improves Their Security Posture Through the DIB-VDP"
        },
        {
          "description": "Hyatt’s three-year-old bug bounty program has reached a significant milestone: $500,000 in bounties paid to hackers. As the first organization in the hospitality industry to embrace hacker-powered security, Hyatt’s milestone today demonstrates its long-term commitment to setting the highest standard for cybersecurity.  We sat down with Robert Lowery, Senior Analyst at Hyatt, to learn more about the history of Hyatt’s bug bounty program and their most recent $500,000 milestone. Read on to see what Robert sha…",
          "link": "https://www.hackerone.com/bounty/hyatts-bug-bounty-program-update-qa-senior-analyst-robert-lowery",
          "publishedOn": "2021-08-18T16:00:00.000Z",
          "wordCount": 1547,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hyatt's Bug Bounty Program Update: Q&A with Senior Analyst Robert Lowery"
        },
        {
          "description": "Hyatt’s three-year-old bug bounty program has reached a significant milestone: $500,000 in bounties paid to hackers. As the first organization in the hospitality industry to embrace hacker-powered security, Hyatt’s milestone today demonstrates its long-term commitment to setting the highest standard for cybersecurity.  We sat down with Robert Lowery, Senior Analyst at Hyatt, to learn more about the history of Hyatt’s bug bounty program and their most recent $500,000 milestone. Read on to see what Robert sha…",
          "link": "https://www.hackerone.com/blog/bounty/hyatts-bug-bounty-program-update-qa-senior-analyst-robert-lowery",
          "publishedOn": "2021-08-18T16:00:00.000Z",
          "wordCount": 1555,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hyatt's Bug Bounty Program Update: Q&A with Senior Analyst Robert Lowery"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "Release time comes around so quickly! This month we have quite a few CSS updates, along with the new Object.hasOwn() static method for JavaScript.\nThe post Time for a review of Firefox 92 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/09/time-for-a-review-of-firefox-92/",
          "publishedOn": "2021-09-08T15:17:15.000Z",
          "wordCount": 558,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Time for a review of Firefox 92"
        },
        {
          "description": "Last month we removed a bunch of content from MDN. MDN is 16 years old (and yes it can drink in some countries), all that time ago it was a great place for all of Mozilla to document all of their things. As MDN evolved and the web reference became our core content, other areas became less relevant to the overall site. We have ~11k active pages on MDN, so keeping them up to date is a big task and we feel our focus should be there.\nThe post Spring cleaning MDN: Part 2 appeared first on Mozilla Hacks - the Web…",
          "link": "https://hacks.mozilla.org/2021/08/spring-cleaning-mdn-part-2/",
          "publishedOn": "2021-08-18T15:05:06.000Z",
          "wordCount": 453,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Spring cleaning MDN: Part 2"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "GitHub Enterprise Server 3.2 is available today as a release candidate. With this release, we’re shipping over 70 new features and changes to improve the developer experience and deliver new security capabilities for our customers.",
          "link": "https://github.blog/2021-09-09-github-enterprise-server-3-2-color-modes-security/",
          "publishedOn": "2021-09-09T17:26:30.000Z",
          "wordCount": 886,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.2 brings new color modes and added security capabilities"
        },
        {
          "description": "We put out a call to open source developers and security researchers to talk about the security vulnerability disclosure process. Here's what we found.",
          "link": "https://github.blog/2021-09-09-analysis-developer-security-researcher-interactions-vulnerability-disclosure/",
          "publishedOn": "2021-09-09T17:23:06.000Z",
          "wordCount": 2417,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "An analysis on developer-security researcher interactions in the vulnerability disclosure process"
        },
        {
          "description": "Between July 21, 2021 and August 13, 2021 we received reports through one of our private security bug bounty programs from researchers regarding vulnerabilities in tar and @npmcli/arborist.",
          "link": "https://github.blog/2021-09-08-github-security-update-vulnerabilities-tar-npmcli-arborist/",
          "publishedOn": "2021-09-08T16:00:32.000Z",
          "wordCount": 2282,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub security update: Vulnerabilities in tar and @npmcli/arborist"
        },
        {
          "description": "How GitHub uses code scanning to increase developer happiness, and how you can too.",
          "link": "https://github.blog/2021-09-07-increasing-developer-happiness-github-code-scanning/",
          "publishedOn": "2021-09-07T16:10:42.000Z",
          "wordCount": 974,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Increasing developer happiness with GitHub code scanning"
        },
        {
          "description": "The end of financial year is complete, tax time is over, and everyone is back to shipping awesome projects. During August, our community has been super busy shipping lots of new updates. These new releases",
          "link": "https://github.blog/2021-09-03-release-radar-aug-2021/",
          "publishedOn": "2021-09-03T21:00:55.000Z",
          "wordCount": 1297,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · August 2021 Edition"
        },
        {
          "description": "Applications are now open for the MLH Fellowship: GitHub Externship Track. Apply by September 13.",
          "link": "https://github.blog/2021-09-02-introducing-the-mlh-fellowship-github-externship-track/",
          "publishedOn": "2021-09-02T20:18:04.000Z",
          "wordCount": 643,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing the MLH Fellowship: GitHub Externship Track"
        },
        {
          "description": "In August, we experienced two distinct incidents resulting in significant impact and degraded state of availability for Git operations, API requests, webhooks, issues, pull requests, GitHub Pages, GitHub Packages, and GitHub Actions services.",
          "link": "https://github.blog/2021-09-01-github-availability-report-august-2021/",
          "publishedOn": "2021-09-01T17:30:56.000Z",
          "wordCount": 846,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: August 2021"
        },
        {
          "description": "We’re changing which keys are supported in SSH and removing unencrypted Git protocol. Only users connecting via SSH or git:// will be affected. If your Git remotes start with https://, nothing in this post will affect you. If you’re an SSH user, read on for the details and timeline.",
          "link": "https://github.blog/2021-09-01-improving-git-protocol-security-github/",
          "publishedOn": "2021-09-01T17:00:12.000Z",
          "wordCount": 1622,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Improving Git protocol security on GitHub"
        },
        {
          "description": "Calling all students! Get the most out of your GitHub Education experience by joining the GitHub student community on our new digital campus.",
          "link": "https://github.blog/2021-09-01-introducing-github-global-campus/",
          "publishedOn": "2021-09-01T16:00:29.000Z",
          "wordCount": 651,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing GitHub Global Campus"
        },
        {
          "description": "Ensuring that software copyright allegations are specific and actionable benefits the entire developer ecosystem. That’s why GitHub submitted a “friend of the court” brief in the SAS Institute, Inc. v. World Programming Ltd. case before a Federal Court of Appeals.",
          "link": "https://github.blog/2021-08-31-vague-infringement-allegations-considered-harmful/",
          "publishedOn": "2021-08-31T18:42:55.000Z",
          "wordCount": 849,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Vague infringement allegations considered harmful"
        },
        {
          "description": "GitHub Discussions is now out of beta, with features that include labels, Discussions GraphQL API and webhooks, and mobile functionality.",
          "link": "https://github.blog/2021-08-17-github-discussions-out-of-beta/",
          "publishedOn": "2021-08-17T19:59:33.000Z",
          "wordCount": 884,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Discussions is out of beta"
        },
        {
          "description": "The open source Git project just released Git 2.33, with features and bug fixes from over 74 contributors. Here's a look at some of the most interesting features and changes.",
          "link": "https://github.blog/2021-08-16-highlights-from-git-2-33/",
          "publishedOn": "2021-08-16T23:15:27.000Z",
          "wordCount": 3754,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Highlights from Git 2.33"
        },
        {
          "description": "The benefits of multifactor authentication are widely documented, and there are a number of options for using 2FA on GitHub.",
          "link": "https://github.blog/2021-08-16-securing-your-github-account-two-factor-authentication/",
          "publishedOn": "2021-08-16T18:00:51.000Z",
          "wordCount": 761,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Securing your GitHub account with two-factor authentication"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "The Bug Bounty program rewards cybersecurity researchers who find potential vulnerabilities in our systems.\nThe post Nubank launches reward program for ethical hackers in partnership with HackerOne appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-launches-reward-program-for-ethical-hackers-in-partnership-with-hackerone/",
          "publishedOn": "2021-09-09T13:03:12.000Z",
          "wordCount": 3093,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank launches reward program for ethical hackers in partnership with HackerOne"
        },
        {
          "description": "\"Yes, She Codes\" 3rd edition seeks to recruit new talents, in addition to promoting the exchange of experiences among candidates\nThe post Yes, She Codes! Nubank&#8217;s software engineering women&#8217;s hiring program appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/yes-she-codes-hiring-program-2021/",
          "publishedOn": "2021-08-30T23:19:25.000Z",
          "wordCount": 3381,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Yes, She Codes! Nubank’s software engineering women’s hiring program"
        },
        {
          "description": "How Nubank deals with technical incidents in a healthy and simple way\nThe post How we deal with technical incidents appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-we-deal-with-incidents/",
          "publishedOn": "2021-08-24T18:32:19.000Z",
          "wordCount": 4020,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "How we deal with technical incidents"
        },
        {
          "description": "The lack of financial education represents a central reason for the discontents and anguish in contemporary culture. How can Nubank, as a customer-focused organization, help with this problem? \nThe post The Personal Financial Management team is born at Nubank appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/the-personal-financial-management-team-is-born/",
          "publishedOn": "2021-08-17T22:36:07.000Z",
          "wordCount": 3528,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "The Personal Financial Management team is born at Nubank"
        },
        {
          "description": "Machine learning (ML) models are very sensitive pieces of software; their successful use needs careful monitoring to make sure they are working correctly.\nThe post ML Model Monitoring &#8211; 9 Tips From the Trenches appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/ml-model-monitoring-9-tips-from-the-trenches/",
          "publishedOn": "2021-08-16T17:48:43.000Z",
          "wordCount": 5168,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "ML Model Monitoring – 9 Tips From the Trenches"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}