{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/06/sbom-in-action-finding-vulnerabilities.html",
          "author": null,
          "description": "Posted by Brandon Lum and Oliver Chang, Google Open Source Security Team\n\n\n\nThe past year has seen an industry-wide effort to embrace Software Bills of Materials (SBOMs)—a list of all the components, libraries, and modules that are required to build a piece of software. In the wake of the 2021 Executive Order on Cybersecurity, these ingredient labels for software became popular as a way to understand what’s in the software we all consume. The guiding idea is that it’s impossible to judge the risks of particular software without knowing all of its components—including those produced by others. This increased interest in SBOMs saw another boost after the National Institute of Standards and Technology (NIST) released its Secure Software Development Framework, which requires SBOM information t…",
          "link": "http://security.googleblog.com/2022/06/sbom-in-action-finding-vulnerabilities.html",
          "publishedOn": "2022-06-14T16:00:00.002Z",
          "wordCount": 2179,
          "title": "SBOM in Action: finding vulnerabilities with a Software Bill of Materials"
        },
        {
          "id": "http://security.googleblog.com/2022/06/announcing-winners-of-2021-gcp-vrp-prize.html",
          "author": null,
          "description": "Posted by Harshvardhan Sharma, Information Security Engineer, Google \n\n2021 was another record-breaking year for our Vulnerability Rewards Program (VRP). We paid a total of $8.7 million in rewards, our highest amount yet. 2021 saw some amazing work from the security research community. It is worth noting that a significant portion of the reports we received were for findings in Google Cloud Platform (GCP) products. It is heartening to see an increasing number of talented researchers getting involved in cloud security.\nWe first announced the GCP VRP Prize in 2019 to encourage security researchers to focus on the security of GCP, in turn helping us make GCP more secure for our users, customers, and the internet at large. Even 3 years into the program, the submissions we are getting never cea…",
          "link": "http://security.googleblog.com/2022/06/announcing-winners-of-2021-gcp-vrp-prize.html",
          "publishedOn": "2022-06-03T19:03:00.002Z",
          "wordCount": 1081,
          "title": "Announcing the winners of the 2021 GCP VRP Prize"
        },
        {
          "id": "http://security.googleblog.com/2022/05/retrofitting-temporal-memory-safety-on-c.html",
          "author": null,
          "description": "Posted by Anton Bikineev, Michael Lippautz and Hannes Payer, Chrome security team\n\n\n\nMemory safety in Chrome is an ever-ongoing effort to protect our users. We are constantly experimenting with different technologies to stay ahead of malicious actors. In this spirit, this post is about our journey of using heap scanning technologies to improve memory safety of C++.\n\n\n\n\nLet’s start at the beginning though. Throughout the lifetime of an application its state is generally represented in memory. Temporal memory safety refers to the problem of guaranteeing that memory is always accessed with the most up to date information of its structure, its type. C++ unfortunately does not provide such guarantees. While there is appetite for different languages than C++ with stronger memory safety guarantee…",
          "link": "http://security.googleblog.com/2022/05/retrofitting-temporal-memory-safety-on-c.html",
          "publishedOn": "2022-05-26T17:00:00.001Z",
          "wordCount": 5358,
          "title": "Retrofitting Temporal Memory Safety on C++"
        },
        {
          "id": "http://security.googleblog.com/2022/05/privileged-pod-escalations-in.html",
          "author": null,
          "description": "Posted by GKE and Anthos Platform Security Teams \n\n\n\nAt the KubeCon EU 2022 conference in Valencia, security researchers from Palo Alto Networks presented research findings on “trampoline pods”—pods with an elevated set of privileges required to do their job, but that could conceivably be used as a jumping off point to gain escalated privileges.\nThe research mentions GKE, including how developers should look at the privileged pod problem today, what the GKE team is doing to minimize the use of privileged pods, and actions GKE users can take to protect their clusters.\nPrivileged pods within the context of GKE security\n\nWhile privileged pods can pose a security issue, it’s important to look at them within the overall context of GKE security. To use a privileged pod as a “trampoline” in GKE, …",
          "link": "http://security.googleblog.com/2022/05/privileged-pod-escalations-in.html",
          "publishedOn": "2022-05-18T13:03:00.000Z",
          "wordCount": 1227,
          "title": "Privileged pod escalations in Kubernetes and GKE"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/AX0y",
          "author": "Jerod Santo",
          "description": "Just copy/paste these SVGs into your HTML and you’re good to go!\n\nDiscuss on Changelog News",
          "link": "https://github.com/n3r4zzurr0/svg-spinners",
          "publishedOn": "2022-06-15T17:25:00.000Z",
          "wordCount": null,
          "title": "A collection of free SVG loading spinners ♻️",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE9J",
          "author": "Jerod Santo",
          "description": "Kinda like Product Hunt, but focused on side projects. Post yours to see if people think it rocks (or not). Maybe you’ll find some motivation to continue working on it or feedback on what to work on next.\nDiscuss on Changelog News",
          "link": "https://mysideproject.rocks/",
          "publishedOn": "2022-06-15T14:07:00.000Z",
          "wordCount": null,
          "title": "A site for sharing your early-stage side projects with the world 🤘",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2513",
          "author": "Gerhard Lazu",
          "description": "Now that everyone is back after KubeCon EU 2022, and all caught up with their notifications, it’s time for one more story of people, tech & upcoming #shipit episodes:\nKubeCon + CloudNativeCon Europe 2022 in 7by7 format \n\nThere are no words that would do justice to the amount of talented, hard-working & humble people that came together in the welcoming Valencia, Spain. The pictures above still fall short. There are 4k+ other pictures here that do a better job. This is my attempt to capture a fraction of the delight that was KubeCon CloudNativeCon EU 2022.\nI will start by focusing on the people that went above and beyond. You are the reason why the Cloud Native community thrives and goes from strength to strength. All your hard work and passion make this conference the best one in the world …",
          "link": "https://changelog.com/posts/kubecon-cloudnativecon-europe-2022",
          "publishedOn": "2022-06-15T13:21:47.000Z",
          "wordCount": null,
          "title": "The best bits from KubeCon EU 2022",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1673",
          "author": null,
          "description": "Could we create a digital human that processes data in a variety of modalities and detects emotions? Well, that’s exactly what NTT DATA Services is trying to do, and, in this episode, Theresa Kushner joins us to talk about their motivations, use cases, current systems, progress, and related ethical issues.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nTheresa Kushner – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDigital Humans videos:\nKia Showroom\nLearning Assistant\nTelco Retail\nKia, in car\nJapan Concierge\nVirtual Learning Buddy teaching kids to read:\nRelated blog post\nMore information about NTT DATA’s work with MIT Media Lab\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/181",
          "publishedOn": "2022-06-14T18:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 181: Digital humans & detecting emotions",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/181/practical-ai-181.mp3",
            "length": "41056628",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kw94",
          "author": "Jerod Santo",
          "description": "Total Cookie Protection is Firefox’s strongest privacy protection to date, confining cookies to the site where they were created, thus preventing tracking companies from using these cookies to track your browsing from site to site.\n\nDiscuss on Changelog News",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-rolls-out-total-cookie-protection-by-default-to-all-users-worldwide/",
          "publishedOn": "2022-06-14T15:52:00.000Z",
          "wordCount": null,
          "title": "Firefox rolls out Total Cookie Protection by default to all users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwbA",
          "author": "Jerod Santo",
          "description": "Sid and the GitLab team continue to enjoy their Rails-based “modular monolith”\nA modular monolith is the exact opposite of a distributed ball of mud: a well-structured, well-architected, highly modular program that runs as a single process and is as boring as possible.\nSid doesn’t pull any punches. No regrets!\nWouldn’t it be better to have a proper plugin interface? Or better yet, a services interface modeled on microservices? In a word: no. Not only do these approaches impose deployment and integration hurdles that go far beyond “I made a small change to the source code,” they often enforce architectural constraints too rigidly. Anticipating all the future extension points is a fool’s errand, one that we luckily did not embark on and do not have to.\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/why-were-sticking-with-ruby-on-rails-at-gitlab/",
          "publishedOn": "2022-06-14T15:04:00.000Z",
          "wordCount": null,
          "title": "Why we’re sticking with Ruby on Rails at GitLab",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9wz",
          "author": "Jerod Santo",
          "description": "Fresh is in the “SSR with client-side progressive enhancement” camp. I have to admit their list of ‘stand out’ features are quite appealing:\nNo JS is shipped to the client by default\nNo build step\nNo configuration required\nTypeScript support out of the box\nIf you’re feeling some JavaScript and/or Framework Fatigue, this won’t help. But competition pushes everyone (Next, Remix, etc) to improve. So, whether you check Fresh out or not, hopefully it’ll have a positive impact on your work.\nDiscuss on Changelog News",
          "link": "https://fresh.deno.dev/",
          "publishedOn": "2022-06-13T14:16:00.000Z",
          "wordCount": null,
          "title": "Fresh - a next-gen web framework for Deno",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqV0",
          "author": "Jerod Santo",
          "description": "dns.toys is a DNS server that takes creative liberties with the DNS protocol to offer handy utilities and services that are easily accessible via the command line.\nProvides world time, unit conversion, weather and more. All over DNS.\nDiscuss on Changelog News",
          "link": "https://www.dns.toys/",
          "publishedOn": "2022-06-13T13:23:00.000Z",
          "wordCount": null,
          "title": "Useful utilities and services over DNS",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1660",
          "author": null,
          "description": "This week Jesse Grosjean joins us to talk about his career as a solo indie Mac dev. Since 2004 Jesse has been building Mac apps under the company name Hog Bay Software producing hits such as WriteRoom, Taskpaper, and now Bike. We talk through the evolution of his apps, how he considers new features and improvements, why he chose and continues to choose the Mac platform, his business model and pricing for his apps, and what it takes to build his business around macOS and the driving force of the App Store.\nDiscuss on Changelog News\nChangelog++ members get a bonus 10 minutes at the end of this episode and zero ads. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the und…",
          "link": "https://changelog.com/podcast/492",
          "publishedOn": "2022-06-10T17:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 492: Two decades as a solo indie Mac dev",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/492/the-changelog-492.mp3",
            "length": "90146687",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1665",
          "author": null,
          "description": "KBall, Ali & Nick explore a new type of segment: “WTFJS” talking about wild and wooly “it’s not a bug it’s a feature” examples in the JavaScript language. They also dive into code maintainability, and end by discussing the whiplash shift in the tech industry from “hottest market for engineers in history” to “oh noes everything is stopping!”\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nwww.jsfuck.com\nCross Browser Crazy\n0.30000000000000004.com/\nSandi Metz’s rules for developers\nInterview with Michael Chan on DRY\nCode Owners on Github\nYC “plan for the worst” memo\nSequoia “Adapting To Endure” deck\nlayoffs.fyi\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/229",
          "publishedOn": "2022-06-10T16:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 229: WTF, JS?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/229/js-party-229.mp3",
            "length": "61869558",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2514",
          "author": "Jerod Santo",
          "description": "I won’t call SQLite’s current moment a comeback, because the most used database engine in the world doesn’t have anything to come back from. I’m going with “renaissance”, because despite its already mass adoption, there has been something of a rebirth of interest from one software sector that had previously relegated it to dev & test environments1: web apps\nWe asked SQLite creator Richard Hipp about his database’s gap in penetration back when we first told the story of SQLite’s success in 2016:\nNow for a website where you’ve got a lot of write concurrency, you need to move to a client-server database engine because you need that server process there to coordinate the concurrency… There’s just no way to do that in a serverless database like SQLite. So for so many things you don’t have that …",
          "link": "https://changelog.com/posts/sqlite-web-renaissance",
          "publishedOn": "2022-06-10T14:04:00.000Z",
          "wordCount": null,
          "title": "SQLite's web renaissance",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jq4w",
          "author": "Jerod Santo",
          "description": "Nolan Lawson:\nAnyone who’s worked in the tech industry for long enough, especially at larger organizations, has seen it before. A legacy system exists: it’s big, it’s complex, and no one fully understands how it works. Architects are brought in to “fix” the system. They might wheel out a big whiteboard showing a lot of boxes and arrows pointing at other boxes, and inevitably, their solution is… to add more boxes and arrows. Nobody can subtract from the system; everyone just adds.\nNolan posits the center cannot hold and the current market shift from bull to bear might help bring the collapse of complex software. But it’s never that simple, is it?\nOne thing working in complexity’s favor, though, is that engineers like complexity. Admit it: as much as we complain about other people’s complexity, we love our own. We love sitting around and dreaming up new architectural diagrams that can comfortably sit inside our own heads – it’s only when these diagrams leave our heads, take shape in the real world, and outgrow the size of any one person’s head that the problems begin.\nDiscuss on Changelog News",
          "link": "https://nolanlawson.com/2022/06/09/the-collapse-of-complex-software/",
          "publishedOn": "2022-06-10T13:55:00.000Z",
          "wordCount": null,
          "title": "The collapse of complex software",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1663",
          "author": null,
          "description": "We’re trying something new this week: discussing the news! Natalie, Kris & Ian weigh in on GopherCon’s move to Chicago, Google DDoSing SourceHut, reflections on Go’s success, and a new/old proposal for anonymous function syntax.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes …",
          "link": "https://changelog.com/gotime/233",
          "publishedOn": "2022-06-09T21:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 233: Going through the news",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/233/go-time-233.mp3",
            "length": "59900500",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1oX",
          "author": "Jerod Santo",
          "description": "DALL-E can generate some amazing results, but we’re still in a phase of AI’s progress where having humans involved in the process is just better. Here’s how the authors of this workflow explain it:\nGenerative art is a creative process. While recent advances of DALL·E unleash people’s creativity, having a single-prompt-single-output UX/UI locks the imagination to a single possibility, which is bad no matter how fine this single result is. DALL·E Flow is an alternative to the one-liner, by formalizing the generative art as an iterative procedure.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jina-ai/dalle-flow",
          "publishedOn": "2022-06-09T17:57:00.000Z",
          "wordCount": null,
          "title": "A human-in-the-loop workflow for creating HD images from text",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/49W4",
          "author": "Jerod Santo",
          "description": "mirrord works by letting you select a pod to mirror traffic from. It launches a privileged pod on the same node which enters the namespace of the selected pod and captures traffic from it.\nI was more excited before I realized this is a K8s thing, but still cool. Both a VS Code extension and a CLI.\nDiscuss on Changelog News",
          "link": "https://github.com/metalbear-co/mirrord",
          "publishedOn": "2022-06-09T17:08:00.000Z",
          "wordCount": null,
          "title": "mirrord lets you easily mirror traffic from prod to dev",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoqM",
          "author": "Jerod Santo",
          "description": "GitHub will archive all projects under the Atom org on December 15, 2022. Why?\nAtom has not had significant feature development for the past several years, though we’ve conducted maintenance and security updates during this period to ensure we’re being good stewards of the project and product. As new cloud-based tools have emerged and evolved over the years, Atom community involvement has declined significantly. As a result, we’ve decided to sunset Atom so we can focus on enhancing the developer experience in the cloud with GitHub Codespaces.\nAtom was co-founder and long-time CEO Chris Wanstrath’s baby. We first heard its story from project lead Nathan Sobo on The Changelog back in 2017. Here’s what he had to say about the end of Atom’s era:\nAs Atom’s sun sets, Zed’s sun is rising. We’re not done here.\nDiscuss on Changelog News",
          "link": "https://github.blog/2022-06-08-sunsetting-atom/",
          "publishedOn": "2022-06-09T14:49:00.000Z",
          "wordCount": null,
          "title": "GitHub officially says farewell to Atom",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1651",
          "author": null,
          "description": "Today we are talking with Maikel Vlasman, technical lead for a large Dutch machine construction company, and a cloud engineer by heart. We cover self-updating GitLab & ArgoCD, Maikel’s thinking behind dev environment setup and a Kubernetes workshop that he is preparing for his team. The goal is to function as a true DevOps team with shared responsibilities.\nThis conversation started as a thread in our community Slack - link in the show notes. Thank you Maikel for being a long-time Changelog listener and for reaching out to us - we enjoyed telling this story.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD an…",
          "link": "https://changelog.com/shipit/56",
          "publishedOn": "2022-06-08T17:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 56: DevOps teams with shared responsibilities",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/56/ship-it-56.mp3",
            "length": "56668332",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qp3Q",
          "author": "Jerod Santo",
          "description": "One of the more interesting discussions that attracted some attention during KubeCon + CloudNativeCon was how, due to its design, WebAssembly (also known as Wasm) can replace Docker in many circumstances.\nWe were just discussing this with Swyx on JS Party. What an unexpected turn of events!\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/when-webassembly-replaces-docker/",
          "publishedOn": "2022-06-08T15:43:00.000Z",
          "wordCount": null,
          "title": "When WebAssembly replaces Docker",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zD4V",
          "author": "Jerod Santo",
          "description": "dot (aka Deepfake Offensive Toolkit) makes real-time, controllable deepfakes ready for virtual cameras injection. dot is created for performing penetration testing against e.g. identity verification and video conferencing systems, for the use by security analysts, Red Team members, and biometrics researchers.\nWhat’s crazy is dot deepfakes don’t require any additional training. 🤯\n\nDiscuss on Changelog News",
          "link": "https://github.com/sensity-ai/dot",
          "publishedOn": "2022-06-08T14:51:00.000Z",
          "wordCount": null,
          "title": "The Deepfake Offensive Toolkit",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Rb",
          "author": "Jerod Santo",
          "description": "Lars Wikman on the history of ID3 tags:\nIf you were a Winamp user back in the day, or curate an MP3 collection currently, you might recognize the humble ID3 tag. It is what the metadata in the MP3 file is made up of. First it was pretty limited in the version later dubbed ID3v1. Like any good 2.0 they added a ton more fields, features, removed character limits and it was suddenly ID3v2. The latest spec is ID3v2.4 while the most commonly adopted one seems to be ID3v2.3. I recently found myself having a reason to dig into this specification.\nI wonder what reason he might have to dig into this spec? Could it be for a soon-to-be-announced collab with his friends at Changelog? 😏\nThis post is not about the technical intricacies of the format… This is about a simpler time, where people saw the wild possibilities of music on computers and when people cared about files, damnit. This is about some of the most interesting and entertaining things I’ve run across while reading the spec.\nDiscuss on Changelog News",
          "link": "https://underjord.io/id3-specification-and-speculation.html",
          "publishedOn": "2022-06-07T19:36:00.000Z",
          "wordCount": null,
          "title": "What ID3v2 could have been",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njn8",
          "author": "Jerod Santo",
          "description": "One of the smaller (but big for webdevs) announcements from yesterday’s WWDC keynote was Web Push coming to Safari. It’s built on three web standards all working together. What does it do, well it enables websites to “notify their users of time-sensitive or high-priority events, even if the user does not currently have the site open.”\nAs long as you’ve coded your web application to the standards you will be able to reach Safari 16 users on macOS Ventura. You don’t need to join the Apple Developer Program to send Web Push notifications.\nThat’s good news, but is this feature something users want? I can think of zero websites that I’ve allowed to send me notifications even when Safari is open, let alone when I’m not even browsing the web.\nJen Simmons posted a nice thread on Twitter alongside the announcement and fielded many people’s questions/concerns along the way.\nDiscuss on Changelog News",
          "link": "https://webkit.org/blog/12945/meet-web-push/",
          "publishedOn": "2022-06-07T17:08:00.000Z",
          "wordCount": null,
          "title": "Meet Web Push",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1Xl",
          "author": "Jerod Santo",
          "description": "Collection of thinking tools and frameworks to help you solve problems, make decisions and understand systems.\nMinto Pyramid? Abstraction laddering? A lot of these are new to me (and very well explained).\nDiscuss on Changelog News",
          "link": "https://untools.co/",
          "publishedOn": "2022-06-07T16:09:00.000Z",
          "wordCount": null,
          "title": "Tools for better thinking",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1670",
          "author": null,
          "description": "In this “fully connected” episode of the podcast, we catch up on some recent developments in the AI world, including a new model from DeepMind called Gato. This generalist model can play video games, caption images, respond to chat messages, control robot arms, and much more. We also discuss the use of AI in the entertainment industry (e.g., in new Top Gun movie).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDeepMind’s Gato:\nDeepMind article\nTNW article\nIceman’s voice in Top Gun:\nVariety article\nSonantic - the company behind the synthetic voice\nResponsible AI review processes: From a developer’s point of view\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/180",
          "publishedOn": "2022-06-07T15:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 180: Generalist models & Iceman's voice",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/180/practical-ai-180.mp3",
            "length": "39998966",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbYG",
          "author": "Jerod Santo",
          "description": "It uses IPFS for file storage and the Ethereum Name Service for discovery and syndication. Planet is a Mac app that makes managing such a setup reasonable. It also acts like an RSS reader app, letting you subscribe to other decentralized sites running on the network.\nDiscuss on Changelog News",
          "link": "https://www.planetable.xyz/",
          "publishedOn": "2022-06-07T14:21:00.000Z",
          "wordCount": null,
          "title": "Planet – decentralized blogs & websites powered by IPFS & ENS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LpMA",
          "author": "Jerod Santo",
          "description": "Christopher Meiklejohn has been working for two years on developing an automated resilience testing tool called Filibuster and was able to test it out at DoorDash during his research internship:\nAccess to DoorDash’s real-world industrial microservice application was extremely valuable both to ensure that Filibuster’s design matches how microservice applications are developed today and to influence future features that I would not have identified in a lab setting.\nThe results were pretty good! Maybe we won’t need chaos monkeys as tools like Filibuster advance?\nIn short, Filibuster can identify many of the technical resilience issues that exist in applications earlier, at the time of development, without testing in production as required in more traditional chaos engineering techniques.\nDiscuss on Changelog News",
          "link": "https://doordash.engineering/2022/04/25/using-fault-injection-testing-to-improve-doordash-reliability/",
          "publishedOn": "2022-06-06T21:50:00.000Z",
          "wordCount": null,
          "title": "Filibuster – automating resilience testing of microservice applications",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3Yz",
          "author": "Travis Turner",
          "description": "Pretty much any developer or engineer uses professional tools at work: code editors, graphic designers, word processors, and so on. But designing UIs for these kinds of tools is quite a different beast from the UI design involved with software and applications intended for “everyday” audiences.\nIn this article, we undertake a high-level analysis on some of those differences, and examine some do’s and don’t’s for designing developer tool interfaces.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/devs-in-mind-how-to-design-interfaces-for-developer-tools",
          "publishedOn": "2022-06-06T21:04:00.000Z",
          "wordCount": null,
          "title": "Designing interfaces for developer tools",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Pp2g",
          "author": "Jerod Santo",
          "description": "Built using second-generation 5-nanometer technology, M2 takes the industry-leading performance per watt of M1 even further with an 18 percent faster CPU, a 35 percent more powerful GPU, and a 40 percent faster Neural Engine.1 It also delivers 50 percent more memory bandwidth compared to M1, and up to 24GB of fast unified memory.\nI pity the fool who upgraded last Fall and can think of zero good reasons to spend another pile of cash at the Apple Store right now no matter how hard he tries to drum up literally any valid reason why that would be a wise decision but if he could think of one he totally would do it and now maybe he’s just waiting for someone else to come up with some sort of justification for doing exactly that. I pity that fool 😉\nDiscuss on Changelog News",
          "link": "https://www.apple.com/newsroom/2022/06/apple-unveils-m2-with-breakthrough-performance-and-capabilities/",
          "publishedOn": "2022-06-06T20:18:00.000Z",
          "wordCount": null,
          "title": "Apple's M2 announcement makes your M1-based laptop suddenly \"feel sluggish\"",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE4J",
          "author": "Jerod Santo",
          "description": "Victor Engmark thinks we should start test names with “should” for a handful of reasons, here’s a few:\nIt removes redundancy, because the function name should already be in the call stack.\nIt is falsifiable, a person reviewing the test can decide to which degree the name agrees with the actual test.\nIt encourages testing one property of the function per test\nI don’t disagree, but I like to take it a step further: Let the “should” be implied by the rest of the test name.\nInstead of: should replace children when updating instance\nI prefer: replaces children when updating instances\nInstead of: should apply discount when total cost exceeds 100 dollars\nI prefer: applies discount when total cost exceeds 100 dollars\nMost of Victor’s reasons for using “should” still apply with this format, but it’s less verbose and more accurately describes the software working as expected when the tests pass.\nDiscuss on Changelog News",
          "link": "https://paperless.blog/start-test-names-with-should",
          "publishedOn": "2022-06-06T14:51:00.000Z",
          "wordCount": null,
          "title": "Start test names with “should”",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Rd61",
          "author": "Jerod Santo",
          "description": "It’s packed full of useful features, to help you build your perfect dashboard. Including status checks, keyboard shortcuts, dynamic widgets, auto-fetched favicon icons and font-awesome support, built-in authentication, tons of themes, an interactive config editor, many display layouts plus loads more.\nCheck out the live demo to see Dashy in action.\n\nDiscuss on Changelog News",
          "link": "https://dashy.to",
          "publishedOn": "2022-06-06T13:33:00.000Z",
          "wordCount": null,
          "title": "Dashy is a self-hosted dashboard for your homelab",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1669",
          "author": null,
          "description": "Adam was invited by our friends at Square to interview Jack Dorsey as part of their annual developer conference called Square Unboxed. Jack Dorsey is one of the most prolific CEOs out there — he’s a hacker turned CEO and is often working at the very edge of what’s to come (at scale). Jack is focused on what the future has to offer, he’s considered an innovator by many. He’s also a Bitcoin maximalist and has positioned himself and Block long on Bitcoin.\nWhat you’re about to hear is the fireside chat Adam had with Jack at Square Unboxed 2022. Jack and Adam discuss the vision Square has for the developer platform and why it’s so central to the company’s strategy.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSpons…",
          "link": "https://changelog.com/founderstalk/91",
          "publishedOn": "2022-06-03T19:30:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 91: Fireside chat with Jack Dorsey",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/91/founders-talk-91.mp3",
            "length": "42293729",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1662",
          "author": null,
          "description": "Ali & Divya recorded seven (!) awesome conversations all about Remix and the web ecosystem live on-stage at the first-ever Remix Conf after-party!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nKent C. Dodds – Twitter, GitHub, Website\nHenri Helvetica – Twitter\nArisa Fukuzaki – Twitter, GitHub\nAnthony Frehner – Twitter, GitHub\nEmily Kauffman – Twitter, GitHub\nAaron Saunders – Twitter, GitHub, LinkedIn\nMichael Jackson – Twitter, GitHub, Website\nDivya – Twitter, GitHub, LinkedIn, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nKent talks Remix on JS Party #215\nStoryblok\nShopify Hydrogen\nAaron’s YouTube channel\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/228",
          "publishedOn": "2022-06-03T16:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 228: Live from Remix Conf!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/228/js-party-228.mp3",
            "length": "76428941",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlbR",
          "author": "Jerod Santo",
          "description": "Connect’s creators call it a “better gRPC”, but I am in no position to evaluate that claim so I will leave it as an exercise for you. Here’s what they have to say about it:\nConnect is production-ready — focused, simple, and debuggable — and it’s fully compatible with gRPC clients and servers. If you’re frustrated by the complexity and instability of today’s gRPC libraries, we think you’ll find Connect a breath of fresh air.\nGo library out now. Connect for TypeScript is “coming soon”\nDiscuss on Changelog News",
          "link": "https://buf.build/blog/connect-a-better-grpc",
          "publishedOn": "2022-06-03T14:37:00.000Z",
          "wordCount": null,
          "title": "A slim library for building browser and gRPC-compatible HTTP APIs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9Oz",
          "author": "Jerod Santo",
          "description": "Did you know VS Code has a proprietary license?\nMicrosoft’s vscode source code is open source (MIT-licensed), but the product available for download (Visual Studio Code) is licensed under this not-FLOSS license and contains telemetry/tracking.\nThe VSCodium project exists so that you don’t have to download+build from source. This project includes special build scripts that clone Microsoft’s vscode repo, run the build commands, and upload the resulting binaries for you to GitHub releases. These binaries are licensed under the MIT license. Telemetry is disabled.\nThey also have various package managers covered, so you can brew install --cask vscodium, etc.\nDiscuss on Changelog News",
          "link": "https://vscodium.com/",
          "publishedOn": "2022-06-03T13:48:00.000Z",
          "wordCount": null,
          "title": "VSCodium – open source binaries of VS Code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqA0",
          "author": "Jerod Santo",
          "description": "I entered Rust four years ago. To this moment, I co-authored teloxide and dptree, wrote several publications and translated a number of language release announcements. I also managed to write some production code in Rust, and had a chance to speak at one online meetup dedicated to Rust. Still, from time to time I find myself disputing with Rust’s borrow checker and type system for no practical reason. Yes, I am no longer stupefied by such errors as cannot return reference to temporary value – over time, I developed multiple heuristic strategies to cope with lifetimes…\nBut one recent situation has made me to fail ignominiously.\n\nDiscuss on Changelog News",
          "link": "https://hirrolot.github.io/posts/rust-is-hard-or-the-misery-of-mainstream-programming.html",
          "publishedOn": "2022-06-03T12:58:00.000Z",
          "wordCount": null,
          "title": "Rust is hard, or: the misery of mainstream programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rjg",
          "author": "Jerod Santo",
          "description": "A reasoned critique of the often lauded with keyword that can be summarized as:\nReturn values from different expressions in a with block can only be distinguished by the shape of the data returned. This creates ambiguity in with’s else clauses that make code harder to understand and more challenging to modify correctly.\nThe author describes the problem in detail and even provides two alternatives to with..else that avoid the resulting ambiguity.\nDiscuss on Changelog News",
          "link": "http://stratus3d.com/blog/2022/06/01/the-problem-with-elixirs-with/",
          "publishedOn": "2022-06-02T19:13:00.000Z",
          "wordCount": null,
          "title": "The problem with Elixir’s `with`",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1661",
          "author": null,
          "description": "During a conversation in the #gotime channel of Gopher Slack, Jerod mentioned that some people paint with a blank canvas while others paint by numbers. In this 8th episode of the maintenance series, we’re talking about maintaining our knowledge. With Jerod’s analogy and a little help from a Leslie Lamport interview, our panel discusses the myth of incremental progress.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them mov…",
          "link": "https://changelog.com/gotime/232",
          "publishedOn": "2022-06-02T18:20:00.000Z",
          "wordCount": null,
          "title": "Go Time 232: The myth of incremental progress",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/232/go-time-232.mp3",
            "length": "71166254",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/04wk",
          "author": "Jerod Santo",
          "description": "Bozhidar Batsov:\nEvery now and again I come across some discussion on making Emacs “modern”.1 The argument always go more or less like this - Emacs doesn’t look and behave like  and the world will end if we don’t copy something “crucial” from it…\nIf you ask me - there’s pretty much nothing we can do that would suddenly make Emacs as popular as VS Code. But you know what - that’s perfectly fine. After all there are plenty of “modern” editors that are even less popular than Emacs, so clearly being “modern” doesn’t make you popular. And there’s also our “arch-nemesis” vim, that’s supposedly as “dated” as Emacs, but is extremely popular.\nDiscuss on Changelog News",
          "link": "https://batsov.com/articles/2022/06/01/who-needs-modern-emacs/",
          "publishedOn": "2022-06-02T15:54:00.000Z",
          "wordCount": null,
          "title": "Who needs modern Emacs?",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1655",
          "author": null,
          "description": "Today we are talking how to optimise sociotechnical systems with Ben Ford, founder & CEO of Mission Control. The correct order is: people, process & technology. The tools are important, and we talk about specific ones in the second half of this episode, but there are rules and principles that govern how people interact, and we need to start there.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/cod…",
          "link": "https://changelog.com/shipit/55",
          "publishedOn": "2022-06-02T15:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 55: Optimising sociotechnical systems",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/55/ship-it-55.mp3",
            "length": "100148258",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pj03",
          "author": "Jerod Santo",
          "description": "Cheeky title, but they’re talking about cheat, which is different than man and info in that it’s entirely example based and community maintained.\nThe cheat system cuts to the chase. You don’t have to piece together clues about how to use a command. You just follow the examples. Of course, for complex commands, it’s not a shortcut for a thorough study of the actual documentation, but for quick reference, it’s as fast as it gets.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/22/6/linux-cheat-command",
          "publishedOn": "2022-06-02T14:36:01.000Z",
          "wordCount": null,
          "title": "The only Linux command you need to know",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bJGe",
          "author": "Jerod Santo",
          "description": "When we had Paul Copplestone from Supabase on The Changelog I asked him what a cloud native Postgres would look like. He replied,\nDecoupled compute and storage. So the idea is that you should be able to attach the compute part of it to a storage, hopefully like an infinite storage; you know, anything that is infinitely scalable. If you can do this, and in particular, if the compute can start up very fast, maybe in, say, a hundred milliseconds via some sort of HTTP response, then that’s cloud native, yeah.\nEnter Neon, which sells itself as:\nThe multi-cloud fully managed Postgres with a generous free tier. We separated storage and compute to offer autoscaling, branching, and bottomless storage.\nBehind this new business from MemSQL co-founder Nikita Shamgunov is the linked (Apache-licensed) server written in Rust.\nDiscuss on Changelog News",
          "link": "https://github.com/neondatabase/neon",
          "publishedOn": "2022-06-01T14:57:00.000Z",
          "wordCount": null,
          "title": "An open source alternative to AWS Aurora",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/4934",
          "author": "Jerod Santo",
          "description": "Simply run git log --full-history --date=short --pretty=format:\"%ad,%an\" > gitlog.csv and upload the resulting file. Here’s what changelog.com’s looks like (10+ commits only to keep it tight) 👇\n\nDiscuss on Changelog News",
          "link": "https://www.preceden.com/git",
          "publishedOn": "2022-05-31T20:19:00.000Z",
          "wordCount": null,
          "title": "Visualize contributions to any codebase that uses Git",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qMzN",
          "author": "Jerod Santo",
          "description": "Spoiler alert: it’s a Pi-hole\nHow does the Pi Hole work though? The Pi Hole answers your computer’s DNS queries and if it is a domain on the blacklist, it sends the request to the Pi Web server.  This Web server just serves up a blank page.  So instead of loading the ad from the real domain, the blank page from the Pi is downloaded, thus “blocking” the ad or metric.\nHow effective is the setup, in practice?\nStatistically speaking our household is averaging 15% of queries blocked and a spike over a bad weather weekend of 30% blocked. It is scary and incredible to think the number of ads and metrics forced upon us, and this number continues to increase. I am delighted with the Pi Hole project and am recommending it to all.\nDiscuss on Changelog News",
          "link": "https://brianchristner.io/how-a-single-raspberry-pi-made-my-home-network-faster/",
          "publishedOn": "2022-05-31T19:31:00.000Z",
          "wordCount": null,
          "title": "How a single Raspberry Pi made my home network faster",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1664",
          "author": null,
          "description": "Hugging Face is increasingly becomes the “hub” of AI innovation. In this episode, Merve Noyan joins us to dive into this hub in more detail. We discuss automation around model cards, reproducibility, and the new community features. If you are wanting to engage with the wider AI community, this is the show for you!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMerve Noyan – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nThe Hugging Face hub\nNew Hugging Face community features\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/179",
          "publishedOn": "2022-05-31T18:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 179: 🤗 The AI community building the future",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/179/practical-ai-179.mp3",
            "length": "45591866",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V1oZ",
          "author": "Jerod Santo",
          "description": "Dragonfly is a modern in-memory datastore, fully compatible with Redis and Memcached APIs. Dragonfly implements novel algorithms and data structures on top of a multi-threaded, shared-nothing architecture. As a result, Dragonfly reaches x25 performance compared to Redis and supports millions of QPS on a single instance.\n\nDiscuss on Changelog News",
          "link": "https://github.com/dragonflydb/dragonfly",
          "publishedOn": "2022-05-31T13:54:00.000Z",
          "wordCount": null,
          "title": "Dragonfly – a cost-effective, high-performing, and easy-to-use Redis replacement",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/QpwQ",
          "author": "Jerod Santo",
          "description": "Here we will collect information about awesome useful and awesome experimental tools that simplify working with databases for DBA, DevOps, Developers and mere mortals.\nFeel free to add information about your own db-tools or your favorite third-party db-tools.\nDiscuss on Changelog News",
          "link": "https://github.com/mgramin/awesome-db-tools",
          "publishedOn": "2022-05-30T14:25:00.000Z",
          "wordCount": null,
          "title": "Tools that make working with databases easier",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1653",
          "author": null,
          "description": "Nick and Chris welcome back Mik and Bret to discuss logging and error handling in Node and JavaScript and the subtleties and intricacies that extend far beyond console.log!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nBret Comnes – Twitter, GitHub, Website\nMikola Lysenko – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\nJS Party #219 - Making moves on supply chain security\nFullStory\npino\ngrafana\nDataDog RUM\nReact Suspense: Async Rendering in React\nMatomo\nAbort Signal\nSemaphore\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/227",
          "publishedOn": "2022-05-27T15:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 227: JS logging & error handling",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/227/js-party-227.mp3",
            "length": "70969142",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1659",
          "author": null,
          "description": "This week we’re peeking into the future again — this time we’re looking at the future of modern code review and workflows around pull requests. Jerod and Adam were joined by two of the co-founders of Graphite — Tomas Reimers and Greg Foster.\nGraphite is an open-source CLI and code review dashboard built for engineers who want to write and review smaller pull requests, stay unblocked, and ship faster. We cover all the details – how they got started, how this product emerged from another idea they were working on, the state of adoption, why stacking changes is the way of the future, how it’s just Git under the hood, and what they’re doing with the $20M in funding they just got from a16z.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero a…",
          "link": "https://changelog.com/podcast/491",
          "publishedOn": "2022-05-27T15:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 491: Stacked diffs for fast-moving code review",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/491/the-changelog-491.mp3",
            "length": "76936789",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/493D",
          "author": "Jerod Santo",
          "description": "Last week I logged the very impressive Imagen project, which smarter people than me have said is the SOTA for text-to-image synthesis. Now a WIP implementation is just a pip install imagen-pytorch away.\nArchitecturally, it is actually much simpler than DALL-E2. It consists of a cascading DDPM conditioned on text embeddings from a large pretrained T5 model (attention network). It also contains dynamic clipping for improved classifier free guidance, noise level conditioning, and a memory efficient unet design.\nDiscuss on Changelog News",
          "link": "https://github.com/lucidrains/imagen-pytorch",
          "publishedOn": "2022-05-27T15:02:00.000Z",
          "wordCount": null,
          "title": "Imagen (Google's text-to-image neural net) implemented in Pytorch",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qMzD",
          "author": "Jerod Santo",
          "description": "Kev Quirk:\nDuckDuckGo, the privacy centric search firm have been found to be allowing Microsoft trackers through their browser. It’s dishonest, and I’m really disappointed.\nNoteworthy: this is the DDG browser, which I’ve never used. Not the search engine. But still, this is concerning like Kev says:\nDuckDuckGo tout themselves as being highly transparent and privacy respecting in everything they do. So to discover that they have been keeping this tidbit of information from their users — one that goes against the very fibre of the company — is a little concerning for me.\nDiscuss on Changelog News",
          "link": "https://kevq.uk/is-duckduckgo-duckduckdone/",
          "publishedOn": "2022-05-27T14:01:00.000Z",
          "wordCount": null,
          "title": "Is DuckDuckGo, DuckDuckDone?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Zowk",
          "author": "Jerod Santo",
          "description": "Richard Hipp, announcing SQLite version 3.39.0 in their forums:\nIf you prefer, you can experiment with the latest 3.39.0 code directly in your web-browser and without having to download or install anything by visiting sqlite.org/fiddle/. (The page name is by analogy to sites like “JSFiddle” and “SQLFiddle”.)\nThe page runs a WASM-compiled copy of a recent 3.39.0 build in a sandbox in your web browser. Using controls on that page, you can import database files from your local machine (assuming they aren’t too big), work with them, then export any changes back to your desktop.\nWebAssembly FTW!\nDiscuss on Changelog News",
          "link": "https://sqlite.org/forum/forumpost/5cfd681451",
          "publishedOn": "2022-05-26T22:25:00.000Z",
          "wordCount": null,
          "title": "Run the latest SQLite beta directly in your web browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/73kz",
          "author": "Marko Milojevic",
          "description": "Unreproducible issues, although rare, are typical for each project, sooner or later. They can affect different system parts and make us many causes for investigating and fixing them.\nIn this article, I try to share some of the techniques I have used in such investigations, which gave me great help in such scenarios. I hope they are helpful to you (if you did not use them already). And, if you have techniques of your own, share them!\nDiscuss on Changelog News",
          "link": "https://hindenbug.io/two-techniques-for-solving-unreproducible-random-bugs-97e03ac02eb9",
          "publishedOn": "2022-05-26T20:23:00.000Z",
          "wordCount": null,
          "title": "Two techniques for solving unreproducible (random) bugs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1oQ",
          "author": "Jerod Santo",
          "description": "Ken Kantzer was part of ~20 code audits of companies that had just raised their A or B rounds of funding:\nIt was fascinating work – we dove deep on a great cross-section of stacks and architectures, across a wide variety of domains. We found all sorts of security issues, ranging from catastrophic to just plain interesting. And we also had a chance to chat with senior engineering leadership and CTOs more generally about the engineering and product challenges they were facing as they were just starting to scale.\nIn this post he shares some of the more surprising things he’s learned from the experience. There’s a lot to digest in this post, but I’ll highlight my favorite to whet your whistle:\nSimple Outperformed Smart. As a self-admitted elitist, it pains me to say this, but it’s true: the startups we audited that are now doing the best usually had an almost brazenly ‘Keep It Simple’ approach to engineering. Cleverness for cleverness sake was abhorred. On the flip side, the companies where we were like ”woah, these folks are smart as hell” for the most part kind of faded.\nDiscuss on Changelog News",
          "link": "https://kenkantzer.com/learnings-from-5-years-of-tech-startup-code-audits/",
          "publishedOn": "2022-05-26T19:37:00.000Z",
          "wordCount": null,
          "title": "Learnings from 5 years of tech startup code audits",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1644",
          "author": null,
          "description": "The Berlin tech ecosystem was all about PHP/Python for a long time. In the recent years it became a tech hub and an early adopter of Go. In this conversation we’ll see how this reflects in the 10+ years old Go meetup, with the meetup organizing team.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at…",
          "link": "https://changelog.com/gotime/231",
          "publishedOn": "2022-05-26T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 231: Berlin's transition to Go",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/231/go-time-231.mp3",
            "length": "60430300",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JgDb",
          "author": "Jerod Santo",
          "description": "This excellent “pragmatic guide to getting things done” distills down many of the teachings in David Allen’s best-selling book that popularized the system.\n\nDiscuss on Changelog News",
          "link": "https://hamberg.no/gtd",
          "publishedOn": "2022-05-26T14:18:00.000Z",
          "wordCount": null,
          "title": "GTD in 15 minutes",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1637",
          "author": null,
          "description": "This is the post-KubeCon CloudNativeCon EU 2022 week. Gerhard is talking to Matt Moore, founder & CTO of Chainguard about all things Knative and Sigstore.\nThe most important topic is swag, because none has better stickers than Chainguard.\nThe other topic is the equivalent of Let’s Encrypt for securing software.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD and enterprise services to the cloud or on premise. They’re inviting our listeners to join the closed beta at akuity.io/changelog. The platform is a versatile Kubernetes operator for handling cluster deployments the GitOps way. Deploy your apps instantly…",
          "link": "https://changelog.com/shipit/54",
          "publishedOn": "2022-05-25T15:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 54: Knative, Sigstore & swag (KubeCon EU 2022)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/54/ship-it-54.mp3",
            "length": "47213776",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/njO0",
          "author": "Jerod Santo",
          "description": "YouTubeDrive is a Wolfram Language (aka Mathematica) package that encodes/decodes arbitrary data to/from simple RGB videos which are automatically uploaded to/downloaded from YouTube. Since YouTube imposes no limits on the total number or length of videos users can upload, this provides an effectively infinite but extremely slow form of file storage.\nFiled under: ways-no-youtube-engineer-ever-imagined-people-would-use-their-software\nDiscuss on Changelog News",
          "link": "https://github.com/dzhang314/YouTubeDrive",
          "publishedOn": "2022-05-25T14:46:00.000Z",
          "wordCount": null,
          "title": "Store files as YouTube videos == infinite disk space",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y161",
          "author": "Jerod Santo",
          "description": "Billy Wilcosky:\nFlat file web software is about having a set up which doesn’t use a “traditional” database. Instead it uses plain text files, other files, and/or maybe something like a json feed to store the data.\nIn this post, he explains why he thinks flat file web software is on the come up (again):\nFlat file software can be powerful. Depending on what you need. And I think with the right developers and brain power behind the movement it can be more scalable and secure. The sky’s the limit. When I hear a developer saying, no, flat file isn’t good because… really all I’m hearing is they don’t want to change the way web software works. Because what I’ve found is most anything is possible.\nHere’s a couple of flat file platforms which are incredible. One is a CMS/blog, the other a forum. Yes, a flat file forum.\nA somewhat-related categorical question: Does SQLite count?\nDiscuss on Changelog News",
          "link": "https://www.wilcosky.com/d/51-smaller-is-better-the-rise-fall-and-rise-of-flat-file-software",
          "publishedOn": "2022-05-25T13:56:00.000Z",
          "wordCount": null,
          "title": "Smaller is better (the rise, fall, and rise of flat file software)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9l5N",
          "author": "Jerod Santo",
          "description": "Google researchers are giving DALL-E a run for its money:\nOur key discovery is that generic large language models (e.g. T5), pretrained on text-only corpora, are surprisingly effective at encoding text for image synthesis: increasing the size of the language model in Imagen boosts both sample fidelity and image-text alignment much more than increasing the size of the image diffusion model.\n\nDiscuss on Changelog News",
          "link": "https://gweb-research-imagen.appspot.com/",
          "publishedOn": "2022-05-24T15:33:00.000Z",
          "wordCount": null,
          "title": "A text-to-image diffusion model with an unprecedented degree of photorealism",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQ11",
          "author": "Jerod Santo",
          "description": "TIL that Pong was built using hardware circuitry. Fascinating! Here’s the original schematics from Atari 👇\n\nDiscuss on Changelog News",
          "link": "https://www.reddit.com/r/EngineeringPorn/comments/ul49zt/the_original_pong_video_game_had_no_code_and_was/",
          "publishedOn": "2022-05-24T14:39:00.000Z",
          "wordCount": null,
          "title": "The original Pong video game had no code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3VN",
          "author": "Jerod Santo",
          "description": "This package wraps the graphql-go/graphql implementation to provide a “fluent” pattern for constructing GraphQL queries in Go. This can be valuable in situations where dynamic queries are desired: when the fields of a GraphQL query (or mutation) are not known until runtime. For most other use cases, plain query strings or a helper library such as this should be sufficient.\nI wonder if this would change Mislav’s unpopular GraphQL/Go opinion…\nDiscuss on Changelog News",
          "link": "https://github.com/mergestat/fluentgraphql",
          "publishedOn": "2022-05-23T21:16:00.000Z",
          "wordCount": null,
          "title": "A fluent GraphQL library for Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5Ye",
          "author": "Zhi Qu",
          "description": "Testing microservice architecture locally is difficult. At Nylas, we’ve created a local development environment using Minikube and Tilt. In this article, I walk you through how we do it.\nDiscuss on Changelog News",
          "link": "https://www.nylas.com/blog/how-we-test-microservices-locally-at-nylas/",
          "publishedOn": "2022-05-23T20:07:00.000Z",
          "wordCount": null,
          "title": "How we test microservices locally at Nylas",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EQ0R",
          "author": "Jerod Santo",
          "description": "Ignoring progressive enhancement could be seriously hurting your conversions. This article will show you how to build resiliency into your apps.\nDiscuss on Changelog News",
          "link": "https://austingil.com/resilient-applications-progressive-enhancement/",
          "publishedOn": "2022-05-23T14:22:00.000Z",
          "wordCount": null,
          "title": "Make resilient web apps with progressive enhancement",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GbjA",
          "author": "Jerod Santo",
          "description": "Chris Kiehl hits his hammer right on the head of this common sentiment in software circles:\nDevelopers from certain languages [Java] have learned to wield this design principle with more power than many others. It’s how we end up with so much stuff in code bases that’s just… there. Existing. Superficially it appears unused, but silently and stoically, we know it protects us from the turbulent future change which lurks ever ahead.\nThe antithesis of one of my favorite design principles: YAGNI\nDiscuss on Changelog News",
          "link": "https://chriskiehl.com/article/the-tyranny-of-what-if-it-changes",
          "publishedOn": "2022-05-23T13:32:00.000Z",
          "wordCount": null,
          "title": "The mindless tyranny of 'what if it changes?' as a software design principle",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O27w",
          "author": "Jerod Santo",
          "description": "If you’ve ever wondered how the Linux kernel does its thing:\nThe goal is simple - to share my modest knowledge about the insides of the linux kernel and help people who are interested in linux kernel insides, and other low-level subject matter. Feel free to go through the book Start here\nDiscuss on Changelog News",
          "link": "https://github.com/0xAX/linux-insides",
          "publishedOn": "2022-05-21T11:47:00.000Z",
          "wordCount": null,
          "title": "A book-in-progress about the Linux kernel and its insides",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1650",
          "author": null,
          "description": "This week we’re talking with Bruce Schneier — cryptographer, computer security professional, privacy specialist, and writer (of many books). He calls himself a “public-interest technologist”, a term he coined himself, and works at the intersection of security, technology, and people.\nBruce has been writing about security issues on his blog since 2004, his monthly newsletter has been going since 1998, he’s a fellow and lecturer at Harvard’s Kennedy School, a board member of the EFF, and the Chief of Security Architecture at Inrupt. Long story short, Bruce has credentials to back up his opinions and on today’s show we dig into the state of cyber-security, security and privacy best practices, his thoughts on Bitcoin (and other crypto-currencies), Tim Berners-Lee’s Solid project, and of course…",
          "link": "https://changelog.com/podcast/490",
          "publishedOn": "2022-05-20T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 490: Schneier on security for tomorrow’s software",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/490/the-changelog-490.mp3",
            "length": "72684939",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1636",
          "author": null,
          "description": "Today we are at KubeCon CloudNativeCon EU 2022, talking to Adolfo García Veytia about securing Kubernetes releases. Adolfo is a Staff Software Engineer at Chainguard, and one of the technical leads for SIG release, meaning that he helps ship Kubernetes. You most likely know him as Puerco, and have seen first-hand his passion for securing software via SBOMs, cosign and SLSA. Puerco’s love for bikes and Chainguard are a great match 🚴‍♂️\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nMongoDB – An integrated suite of cloud database and services — They have a FREE forever tier, so you can prove to yourself and to your team that they have everything you need. Check it out today at mongodb.com/changelog\n\n    …",
          "link": "https://changelog.com/shipit/53",
          "publishedOn": "2022-05-20T17:10:00.000Z",
          "wordCount": null,
          "title": "Ship It! 53: Securing K8s releases (KubeCon EU 2022)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/53/ship-it-53.mp3",
            "length": "65230045",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1652",
          "author": null,
          "description": "In 2020, Shawn (swyx) Wang wrote:\nEvery 10 years there is a changing of the guard in JavaScript. I think we have just started a period of accelerated change that could in thge future be regarded as the Third Age of JavaScript.\nWe’re now in year three of this third age and Swyx joins us to look back at what he missed, look around at what’s happening today, and look forward at what might be coming next.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from t…",
          "link": "https://changelog.com/jsparty/226",
          "publishedOn": "2022-05-20T16:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 226: The third year of the third age of JS",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/226/js-party-226.mp3",
            "length": "59755898",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/maJP",
          "author": "Jerod Santo",
          "description": "AutoAnimate is a zero-config, drop-in animation utility that adds smooth transitions to your web app. You can use it with Vue, React, or any other JavaScript application.\n\nDiscuss on Changelog News",
          "link": "https://github.com/formkit/auto-animate",
          "publishedOn": "2022-05-20T14:40:00.000Z",
          "wordCount": null,
          "title": "Add motion to your web apps with a single line of code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/wkgR",
          "author": "Jerod Santo",
          "description": "How can you tell it’s Friday? I’m posting something ridiculous (but cool) to the news feed. These are some high quality cat pics! 302, 403, and  405 are all great… but 414 is the best.\nDiscuss on Changelog News",
          "link": "https://http.cat/",
          "publishedOn": "2022-05-20T13:53:00.000Z",
          "wordCount": null,
          "title": "HTTP Cats (this is exactly what you hope it's going to be)",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1620",
          "author": null,
          "description": "Matt Holt & Mohammed S. Al Sahaf sit down with Natalie & Jon to discuss every gopher’s favorite open source web server with automatic HTTPS!\nIn addition to laying out what Caddy is and why it’s interesting, we dive deep into how you can (and why you might want to) extend Caddy as a result of its modular architecture.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a d…",
          "link": "https://changelog.com/gotime/230",
          "publishedOn": "2022-05-19T21:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 230: Revisiting Caddy",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/230/go-time-230.mp3",
            "length": "51038178",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/4E6D",
          "author": "Martin Heinz",
          "description": "In this article we take look at how you can use Python’s Kubernetes Client library to automate all the boring Kubernetes tasks and operations, such as creating/patching resources, watching events, accessing containers and more.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/73",
          "publishedOn": "2022-05-19T19:46:00.000Z",
          "wordCount": null,
          "title": "Automate all the boring Kubernetes operations with Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lbzy",
          "author": "Jerod Santo",
          "description": "David Crawshaw gave an excellent talk (at Go Northwest in 2018) on using SQLite (so hot right now) together with Go and how enjoyable/productive the combo is. Quite worthy of its ~30 minutes runtime.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=RqubKSF3wig",
          "publishedOn": "2022-05-19T18:59:00.000Z",
          "wordCount": null,
          "title": "SQLite and Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03bZ",
          "author": "Jerod Santo",
          "description": "Ryan Dahl describes the JavaScript sandbox as a higher level container for server software:\nThis container isn’t meant to address the same breadth of problems that Linux containers target. Its emergence is a result of its simplicity. It minimizes the boilerplate for web service business logic. It shares concepts with the browser and reduces the concepts that the programmer needs to know.\nPeople like Ryan and his colleagues at Deno are exploring this future, but it’s not quite here yet.\nDiscuss on Changelog News",
          "link": "https://tinyclouds.org/javascript_containers",
          "publishedOn": "2022-05-19T18:08:00.000Z",
          "wordCount": null,
          "title": "On the potential of JavaScript-based containers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pkWL",
          "author": "Jerod Santo",
          "description": "Provides interactive git add, git log (👀 below), git diff, and a bunch more. Powered by fzf\n\nDiscuss on Changelog News",
          "link": "https://github.com/wfxr/forgit",
          "publishedOn": "2022-05-19T14:07:00.000Z",
          "wordCount": null,
          "title": "forgit –a tool powered by fzf for using git interactively",
          "itunes": {}
        },
        {
          "id": "changelog.com/4/1593",
          "author": null,
          "description": "Connor Sears, founder and CEO of Rewatch, joins Adam to share the journey of creating Rewatch. What began inside of GitHub to help them thrive and connect is now available to every product team on the planet. Rewatch lets teams save, manage, and search all their video content so they can collaborate async and with greater flexibility. We talk about where the tool’s inspiration came from (spoiler alert, inside GitHub it was called GitHub TV which you’ll hear during the show), how teams leverage video to reduce the constraints of communication, how Connor and his co-founder knew they had product-fit and how they grew the team and product, and of course the flip side of that — we talk about some of Connor’s failures along the way, and knowing when it’s the right time to take a big swing.\nDisc…",
          "link": "https://changelog.com/founderstalk/90",
          "publishedOn": "2022-05-18T18:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 90: From GitHub TV to Rewatch",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/90/founders-talk-90.mp3",
            "length": "110499353",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Lpg4",
          "author": "Jerod Santo",
          "description": "CloudNativePG is distributed under the Apache License 2.0, and is now owned and governed by a newly formed community of contributors to the project, built on solid principles and values inspired by the Cloud Native Computing Foundation (CNCF).\nAmong these are openness, fairness, inclusivity, technical excellence, “community over product/company,” built-in quality and built-in security. I’m part of the initial group of maintainers of the project, currently made up by the top six committers of the project within EDB.\nIf you’ve been following Ship It’s Kaizen episodes, you know we had troubles running Postgres in K8s and recently moved to a managed (sorta) database. I wonder if Gerhard will be tempted to try this operator out anyhow…\nDiscuss on Changelog News",
          "link": "https://www.enterprisedb.com/blog/introducing-cloudnativepg-new-open-source-kubernetes-operator-postgres",
          "publishedOn": "2022-05-18T15:20:00.000Z",
          "wordCount": null,
          "title": "CloudNativePG – a new Kubernetes operator for Postgres",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bNkZ",
          "author": "Jerod Santo",
          "description": "Curl creator/maintainer Daniel Stenberg is writing a book. It’s (aptly) named: Uncurled\nBecause of my background and life with Open Source and probably a lot because of the relative success some of my projects have had, I frequently get questions about subjects related to maintaining Open Source. How to run a project and what makes them succeed? For a long time I have been collecting lessons from my life with Open Source into a list of advice for fellow Open Source library hackers. This document is my attempt to convert those thoughts and experiences into words.\nI don’t believe it’s finished, but there’s a lot here already! Excited for this and while it’s a free to read GitBook right now, I hope it ends with some kind of physical manifestation.\nDiscuss on Changelog News",
          "link": "https://un.curl.dev/",
          "publishedOn": "2022-05-18T14:33:00.000Z",
          "wordCount": null,
          "title": "Everything I know and learned about running and maintaining open source projects for three decades",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0814release/",
          "author": null,
          "description": "Big Model",
          "link": "https://blog.comma.ai/0814release/",
          "publishedOn": "2022-06-01T00:00:00.000Z",
          "wordCount": 1943,
          "title": "openpilot 0.8.14"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/products/chrome/building-a-more-helpful-browser-with-machine-learning/",
          "author": null,
          "description": "At Google we use technologies like machine learning (ML) to build more useful products — from filtering out email spam, to keeping maps up to date, to offering more relevant search results. Chrome is no exception: We use ML to make web images more accessible to people who are blind or have low vision, and we also generate real-time captions for online videos, in service of people in noisy environments, and those who are hard of hearing.\nThis work in Chrome continues, so we wanted to share some recent and future ML improvements that offer a safer, more accessible and more personalized browsing experience. Importantly: these updates are powered by on-device ML models, which means your data stays private, and never leaves your device.\nMore peace of mind, less annoying prompts\nSafe Browsing in…",
          "link": "https://blog.google/products/chrome/building-a-more-helpful-browser-with-machine-learning/",
          "publishedOn": "2022-06-09T16:00:00.000Z",
          "wordCount": 1338,
          "title": "Building a more helpful browser with machine learning"
        },
        {
          "id": "https://blog.google/outreach-initiatives/accessibility/building-with-the-disability-community-2022/",
          "author": null,
          "description": "Editor’s note: Today is Global Accessibility Awareness Day. We’re also sharing how we’re making education more accessibleand launching a newAndroid accessibility feature.\nOver the past nine years, my job has focused on building accessible products and supporting Googlers with disabilities. Along the way, I’ve been constantly reminded of how vast and diverse the disability community is, and how important it is to continue working alongside this community to build technology and solutions that are truly helpful.\nBefore delving into some of the accessibility features our teams have been building, I want to share how we’re working to be more inclusive of people with disabilities to create more accessible tools overall.\nNothing about us, without us\nIn the disability community, people often say …",
          "link": "https://blog.google/outreach-initiatives/accessibility/building-with-the-disability-community-2022/",
          "publishedOn": "2022-05-19T13:00:00.000Z",
          "wordCount": 1560,
          "title": "How we build with and for people with disabilities"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=19296",
          "author": "Daniel Stenberg",
          "description": "Twenty-one years ago, in May 2001 we introduced the global initialization function to libcurl version 7.8 called curl_global_init(). The main reason we needed this separate function to get called before anything else was used in libcurl, was that several of libcurl’s dependencies at the time (including OpenSSL and GnuTLS) had themselves thread-unsafe initialization procedures. This … Continue reading Making libcurl init more thread-safe →",
          "link": "https://daniel.haxx.se/blog/2022/06/08/making-libcurl-init-more-thread-safe/",
          "publishedOn": "2022-06-08T06:42:32.000Z",
          "wordCount": 660,
          "title": "Making libcurl init more thread-safe"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18849",
          "author": "Daniel Stenberg",
          "description": "Before this, the latest refreshed specification of HTTP/1.1 was done in the RFC 7230 series, published in June 2014. After that, HTTP/2 was done in the spring of 2015 and recently the HTTP/3 spec has been a work in progress. To better reflect this new world of multiple HTTP versions and an HTTP protocol ecosystem … Continue reading New HTTP core specs →",
          "link": "https://daniel.haxx.se/blog/2022/06/06/new-http-core-specs/",
          "publishedOn": "2022-06-06T21:06:52.000Z",
          "wordCount": 418,
          "title": "New HTTP core specs"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19219",
          "author": "Daniel Stenberg",
          "description": "The .netrc file is used to hold user names and passwords for specific host names and allows tools to login to those systems automatically without having to prompt the user for the credentials while avoiding having to use them in command lines. The .netrc file is typically set without group or world read permissions (0600) … Continue reading .netrc pains →",
          "link": "https://daniel.haxx.se/blog/2022/05/31/netrc-pains/",
          "publishedOn": "2022-05-31T07:23:43.000Z",
          "wordCount": 1229,
          "title": ".netrc pains"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=18925",
          "author": "Daniel Stenberg",
          "description": "curl --rate is your new friend. This option is for when you use curl to do many requests in a single command line, but you want curl to not do them as quickly as possible. You want curl to do them no more often than at a certain interval. This is a way to slow … Continue reading curl offers repeated transfers at slower pace →",
          "link": "https://daniel.haxx.se/blog/2022/05/23/curl-offers-repeated-transfers-at-slower-pace/",
          "publishedOn": "2022-05-23T16:06:58.000Z",
          "wordCount": 858,
          "title": "curl offers repeated transfers at slower pace"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19143",
          "author": "Daniel Stenberg",
          "description": "Back in 2008, I had a revelation when it dawned on me that the POSIX function called strcasecmp() compares strings case insensitively, but locale dependent. Because of this, “file” and “FILE” is not actually a case insensitive match in Turkish but is a match in most other locales. curl would sometimes fail in mysterious ways … Continue reading case insensitive string comparisons in C →",
          "link": "https://daniel.haxx.se/blog/2022/05/19/case-insensitive-string-comparisons-in-c/",
          "publishedOn": "2022-05-19T17:29:32.000Z",
          "wordCount": 1283,
          "title": "case insensitive string comparisons in C"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-06-15T12:18:42.019Z",
          "wordCount": 2031,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-06-14T12:18:53.801Z",
          "wordCount": 1278,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-06-10T12:19:56.032Z",
          "wordCount": 828,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-06-09T12:21:18.778Z",
          "wordCount": 985,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-06-04T12:15:18.288Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-06-03T12:18:28.916Z",
          "wordCount": 1609,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-05-25T12:22:20.025Z",
          "wordCount": 791,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-05-25T12:22:20.008Z",
          "wordCount": 812,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-05-19T12:18:55.505Z",
          "wordCount": 1839,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "author": null,
          "description": "In this blog, we’ll share how we use machine learning techniques to ensure people see the right amount of relevant and timely notifications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/a-hybrid-approach-to-personalize-notification-volume",
          "publishedOn": "2022-05-19T12:18:55.471Z",
          "wordCount": 1663,
          "title": "A hybrid approach to personalize notification volume"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-05-18T12:20:06.762Z",
          "wordCount": 1350,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/06/an-autopsy-on-zombie-in-wild-0-day.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_vnkr79j0brd5-6>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-8>li:before{content:\"\\0025a0  \"}ol.lst-kix_rpn0sahs9m0k-5.start{counter-reset:lst-ctn-kix_rpn0sahs9m0k-5 0}.lst-kix_rpn0sahs9m0k-1>li{counter-increment:lst-ctn-kix_rpn0sahs9m0k-1}.lst-kix_vnkr79j0brd5-5>li:before{content:\"\\0025a0  \"}.lst-kix_vnkr79j0brd5-2>li:before{content:\"\\0025a0  \"}.lst-kix_vnkr79j0brd5-4>li:before{content:\"\\0025cb  \"}ol.lst-kix_rpn0sahs9m0k-8.start{counter-reset:lst-ctn-kix_rpn0sahs9m0k-8 0}.lst-kix_vnkr79j0brd5-3>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-0>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-1>li:before{content:\"\\0025cb  \"}ol.lst-kix_omx22nj2js1z-1.start{counter-reset:lst-ctn-kix…",
          "link": "https://googleprojectzero.blogspot.com/2022/06/an-autopsy-on-zombie-in-wild-0-day.html",
          "publishedOn": "2022-06-14T16:00:00.000Z",
          "wordCount": 2809,
          "title": "An Autopsy on a Zombie In-the-Wild 0-day"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47842",
          "author": "Aria Beingessner",
          "description": "For the last year, we've been working on the development of rust-minidump, a pure-Rust replacement for the minidump-processing half of google-breakpad. The first in this two-part series explains what minidumps are, and how we made rust-minidump.\nThe post Everything Is Broken: Shipping rust-minidump at Mozilla – Part 1 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/everything-is-broken-shipping-rust-minidump-at-mozilla/",
          "publishedOn": "2022-06-14T15:05:06.000Z",
          "wordCount": 4580,
          "title": "Everything Is Broken: Shipping rust-minidump at Mozilla – Part 1"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47809",
          "author": "Evgeny Pavlov",
          "description": "The Bergamot project is a collaboration between Mozilla, University of Edinburgh, Charles University in Prague, the University of Sheffield, and University of Tartu with funding from the European Union’s Horizon 2020 research and innovation programme. It brings MT to the local environment, providing small, high-quality, CPU optimized NMT models. The Firefox Translations web extension utilizes proceedings of project Bergamot and brings local translations to Firefox. In this article, we will discuss the components used to train our efficient NMT models.\nThe post Training efficient neural network models for Firefox Translations appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/training-efficient-neural-network-models-for-firefox-translations/",
          "publishedOn": "2022-06-07T15:25:47.000Z",
          "wordCount": 2291,
          "title": "Training efficient neural network models for Firefox Translations"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=65724",
          "author": "Lee Reilly",
          "description": "Git Merge, the conference dedicated to bringing the Git community together returns on September 14-15 in Chicago, Illinois.",
          "link": "https://github.blog/2022-06-15-git-merge-2022/",
          "publishedOn": "2022-06-16T00:29:33.000Z",
          "wordCount": 530,
          "title": "Git Merge 2022"
        },
        {
          "id": "https://github.blog/?p=65687",
          "author": "Tanmayee Kamath",
          "description": "Teams and GHEC customers can now create blazing fast codespaces, even for your largest and most complex projects.",
          "link": "https://github.blog/2022-06-15-prebuilding-codespaces-is-generally-available/",
          "publishedOn": "2022-06-15T17:00:27.000Z",
          "wordCount": 1277,
          "title": "Prebuilding codespaces is generally available"
        },
        {
          "id": "https://github.blog/?p=65709",
          "author": "Brittany O'Shea",
          "description": "To combat the prevalence of malware in the open source ecosystem, GitHub now publishes malware occurrences in the GitHub Advisory Database. These advisories power Dependabot alerts and remain forever free and usable by the community.",
          "link": "https://github.blog/2022-06-15-github-now-publishes-malware-advisories-in-the-github-advisory-database/",
          "publishedOn": "2022-06-15T15:46:26.000Z",
          "wordCount": 674,
          "title": "GitHub now publishes malware advisories in the GitHub Advisory Database"
        },
        {
          "id": "https://github.blog/?p=65680",
          "author": "Cole Bemis",
          "description": "Learn why the GitHub Design Infrastructure team built a dedicated color tool and how they use it to create new color palettes for GitHub.",
          "link": "https://github.blog/2022-06-14-accelerating-github-theme-creation-with-color-tooling/",
          "publishedOn": "2022-06-14T19:04:41.000Z",
          "wordCount": 1275,
          "title": "Accelerating GitHub theme creation with color tooling"
        },
        {
          "id": "https://github.blog/?p=65673",
          "author": "Margaret Tucker",
          "description": "We share a recap of a recent roundtable event about what a federal open source software policy could look like in the United States.",
          "link": "https://github.blog/2022-06-14-how-can-the-united-states-build-its-open-source-software-policy/",
          "publishedOn": "2022-06-14T16:55:42.000Z",
          "wordCount": 888,
          "title": "How can the United States build its Open Source Software policy?"
        },
        {
          "id": "https://github.blog/?p=65652",
          "author": "Rizel Scarlett",
          "description": "June's Open Source Monthly features Modos–a community-focused company building software and hardware that designs digital devices with respect for users' time, attention, and well-being.",
          "link": "https://github.blog/2022-06-13-open-source-monthly-june-2022-edition/",
          "publishedOn": "2022-06-13T20:47:28.000Z",
          "wordCount": 1284,
          "title": "Open Source Monthly: June 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=65636",
          "author": "Rahul Zhade",
          "description": "How can you robustly assert and identify a user’s identity?",
          "link": "https://github.blog/2022-06-10-implementing-a-robust-digital-identity/",
          "publishedOn": "2022-06-10T19:12:59.000Z",
          "wordCount": 2215,
          "title": "Implementing a robust digital identity"
        },
        {
          "id": "https://github.blog/?p=65046",
          "author": "Keith Cirkel",
          "description": "Discover how GitHub thinks about browser support, look at usage patterns, and learn about the tools we use to make sure our customers are getting the best experience.",
          "link": "https://github.blog/2022-06-10-how-we-think-about-browsers/",
          "publishedOn": "2022-06-10T18:37:03.000Z",
          "wordCount": 5792,
          "title": "How we think about browsers"
        },
        {
          "id": "https://github.blog/?p=65600",
          "author": "Victoria Fawcett",
          "description": "Dependabot is generally available in GitHub Enterprise Server 3.5. Here is how to set up Dependabot on your instance.",
          "link": "https://github.blog/2022-06-09-dependabot-updates-hit-ga-in-ghes/",
          "publishedOn": "2022-06-09T20:47:19.000Z",
          "wordCount": 1440,
          "title": "Dependabot Updates hit GA in GHES"
        },
        {
          "id": "https://github.blog/?p=65571",
          "author": "Shawna Butterworth",
          "description": "We're excited to announce that we're open sourcing our Identity and Access Management solution: Entitlements.",
          "link": "https://github.blog/2022-06-09-introducing-entitlements-githubs-open-source-identity-and-access-management-solution/",
          "publishedOn": "2022-06-09T15:00:55.000Z",
          "wordCount": 1259,
          "title": "Introducing Entitlements: GitHub’s open source Identity and Access Management solution"
        },
        {
          "id": "https://github.blog/?p=65583",
          "author": "Bailey Brooks",
          "description": "Available in public beta today, we're announcing Achievements as a new way to commemorate milestones on GitHub.",
          "link": "https://github.blog/2022-06-09-introducing-achievements-recognizing-the-many-stages-of-a-developers-coding-journey/",
          "publishedOn": "2022-06-09T15:00:28.000Z",
          "wordCount": 792,
          "title": "Introducing Achievements: recognizing the many stages of a developer’s coding journey"
        },
        {
          "id": "https://github.blog/?p=65542",
          "author": "GitHub Staff",
          "description": "We are archiving Atom and all projects under the Atom organization for an official sunset on December 15, 2022.",
          "link": "https://github.blog/2022-06-08-sunsetting-atom/",
          "publishedOn": "2022-06-08T15:00:23.000Z",
          "wordCount": 625,
          "title": "Sunsetting Atom"
        },
        {
          "id": "https://github.blog/?p=65517",
          "author": "Matthew Dyson",
          "description": "Are you a student who is new to open source or just starting your maintainer journey? GitHub Global Campus’ Community Exchange can help you make that first contribution or grow your open source project.",
          "link": "https://github.blog/2022-06-08-start-your-open-source-journey-with-community-exchange/",
          "publishedOn": "2022-06-08T08:00:01.000Z",
          "wordCount": 808,
          "title": "Start your open source journey with Community Exchange"
        },
        {
          "id": "https://github.blog/?p=65520",
          "author": "Landon Grindheim",
          "description": "A personal story about building the feature you want and sharing it with the world.",
          "link": "https://github.blog/2022-06-07-one-developers-journey-bringing-dependabot-to-github-enterprise-server/",
          "publishedOn": "2022-06-07T19:55:45.000Z",
          "wordCount": 1429,
          "title": "One developer’s journey bringing Dependabot to GitHub Enterprise Server"
        },
        {
          "id": "https://github.blog/?p=65475",
          "author": "Emily Gould",
          "description": "Today, we’re announcing GitHub Skills, a new learning experience to help you throughout your GitHub journey.",
          "link": "https://github.blog/2022-06-06-introducing-github-skills/",
          "publishedOn": "2022-06-06T16:15:52.000Z",
          "wordCount": 526,
          "title": "Introducing GitHub Skills"
        },
        {
          "id": "https://github.blog/?p=65493",
          "author": "Courtney Claessens",
          "description": "The Rust community can now discover, report, and prevent security vulnerabilities.",
          "link": "https://github.blog/2022-06-06-github-brings-supply-chain-security-features-to-the-rust-community/",
          "publishedOn": "2022-06-06T10:15:39.000Z",
          "wordCount": 846,
          "title": "GitHub brings supply chain security features to the Rust community"
        },
        {
          "id": "https://github.blog/?p=65362",
          "author": "Rizel Scarlett",
          "description": "CI/CD and workflow automation are native capabilities on GitHub platform. Here’s how to start using them and speed up your workflows.",
          "link": "https://github.blog/2022-06-03-a-beginners-guide-to-ci-cd-and-automation-on-github/",
          "publishedOn": "2022-06-03T17:31:19.000Z",
          "wordCount": 2452,
          "title": "A beginner’s guide to CI/CD and automation on GitHub"
        },
        {
          "id": "https://github.blog/?p=65425",
          "author": "Klint Finley",
          "description": "How to interview for skill, not spare time.",
          "link": "https://github.blog/2022-06-03-making-technical-interviews-better-for-everyone/",
          "publishedOn": "2022-06-03T09:00:13.000Z",
          "wordCount": 2199,
          "title": "Making technical interviews better for everyone"
        },
        {
          "id": "https://github.blog/?p=65400",
          "author": "Rizel Scarlett",
          "description": "Learn how you can securely manage users with the latest ships for GitHub Enterprise.",
          "link": "https://github.blog/2022-06-02-whats-new-in-security-and-user-management-for-github-enterprise/",
          "publishedOn": "2022-06-02T16:52:14.000Z",
          "wordCount": 923,
          "title": "What’s new in security and user management for GitHub Enterprise"
        },
        {
          "id": "https://github.blog/?p=65197",
          "author": "Demetris Cheatham",
          "description": "Join us on the GitHub All In journey.",
          "link": "https://github.blog/2022-06-02-github-all-in-our-first-student-cohort-and-whats-next/",
          "publishedOn": "2022-06-02T16:00:00.000Z",
          "wordCount": 968,
          "title": "GitHub All In: Our first student cohort and what’s next"
        },
        {
          "id": "https://github.blog/?p=65380",
          "author": "Kelsey Bernius",
          "description": "Read about all the features you may not have known come on the GitHub Free plan, and how to choose the right plan for you.",
          "link": "https://github.blog/2022-06-01-github-team-or-free-how-to-choose-the-right-plan/",
          "publishedOn": "2022-06-01T21:09:27.000Z",
          "wordCount": 1059,
          "title": "GitHub Team or Free? How to choose the right plan"
        },
        {
          "id": "https://github.blog/?p=65390",
          "author": "Kara Sowles",
          "description": "During the month of June, we’re holding space for open source maintainers to gather, share, and be celebrated.",
          "link": "https://github.blog/2022-06-01-welcome-to-maintainer-month/",
          "publishedOn": "2022-06-01T19:10:48.000Z",
          "wordCount": 690,
          "title": "Welcome to Maintainer Month! 🎉"
        },
        {
          "id": "https://github.blog/?p=65340",
          "author": "Jakub Oleksy",
          "description": "In May, we experienced three distinct incidents resulting in significant impact to multiple services across GitHub.com. This report also sheds light into the billing incident that impacted Actions and Codespaces users in April.",
          "link": "https://github.blog/2022-06-01-github-availability-report-may-2022/",
          "publishedOn": "2022-06-01T18:55:09.000Z",
          "wordCount": 1066,
          "title": "GitHub Availability Report: May 2022"
        },
        {
          "id": "https://github.blog/?p=65333",
          "author": "Zachary Steindler",
          "description": "Several ways for GitHub-hosted Actions runners to connect to resources on your private network.",
          "link": "https://github.blog/2022-06-01-connecting-to-a-private-network-from-github-hosted-actions-runners/",
          "publishedOn": "2022-06-01T16:28:58.000Z",
          "wordCount": 854,
          "title": "Connecting to a private network from GitHub-hosted Actions runners"
        },
        {
          "id": "https://github.blog/?p=65346",
          "author": "Jessica Lord",
          "description": "GitHub Sponsors is now available in Brazil—an exciting expansion for one of our fastest growing developer communities.",
          "link": "https://github.blog/2022-06-01-github-sponsors-launches-in-brazil/",
          "publishedOn": "2022-06-01T13:00:43.000Z",
          "wordCount": 923,
          "title": "GitHub Sponsors launches in Brazil"
        },
        {
          "id": "https://github.blog/?p=65243",
          "author": "Melody Mileski",
          "description": "GitHub Enterprise Server 3.5 is available now, including access to the Container registry, the addition of Dependabot, enhanced administrator capabilities, and features for GitHub Advanced Security.",
          "link": "https://github.blog/2022-05-31-github-enterprise-server-3-5-is-now-generally-available/",
          "publishedOn": "2022-05-31T16:36:05.000Z",
          "wordCount": 1504,
          "title": "GitHub Enterprise Server 3.5 is now generally available"
        },
        {
          "id": "https://github.blog/?p=65250",
          "author": "Andrzej Mazur",
          "description": "The recently-ended Gamedev.js Jam 2022 encouraged game developers to create web games and share their sources on GitHub. GitHub Star ⭐️ @end3r shares the best 13 entries and sees what experts and other participants think of them.",
          "link": "https://github.blog/2022-05-31-top-games-source-code-from-gamedev-js-jam-2022/",
          "publishedOn": "2022-05-31T08:00:03.000Z",
          "wordCount": 1457,
          "title": "Top games + source code from Gamedev.js Jam 2022"
        },
        {
          "id": "https://github.blog/?p=65217",
          "author": "Greg Ose",
          "description": "npm's impact analysis of the attack campaign using stolen OAuth tokens and additional findings.",
          "link": "https://github.blog/2022-05-26-npm-security-update-oauth-tokens/",
          "publishedOn": "2022-05-27T04:37:28.000Z",
          "wordCount": 1814,
          "title": "npm security update: Attack campaign using stolen OAuth tokens"
        },
        {
          "id": "https://github.blog/?p=65226",
          "author": "Phil Turnbull",
          "description": "A two-part story about how GitHub’s Product Security Engineering team rolled out Dependabot internally to track vulnerable dependencies, and how GitHub tracks and prioritizes technical debt.",
          "link": "https://github.blog/2022-05-25-how-we-use-dependabot-to-secure-github/",
          "publishedOn": "2022-05-25T22:22:22.000Z",
          "wordCount": 1992,
          "title": "How we use Dependabot to secure GitHub"
        },
        {
          "id": "https://github.blog/?p=65096",
          "author": "Rachael Sewell",
          "description": "We’re excited to announce some big improvements to our REST API documentation. We know developers rely on this documentation to integrate with GitHub, and we are committed to making it trustworthy, easy to find, and easy to use.",
          "link": "https://github.blog/2022-05-24-improved-rest-api-documentation/",
          "publishedOn": "2022-05-24T16:00:53.000Z",
          "wordCount": 1161,
          "title": "Improved REST API documentation"
        },
        {
          "id": "https://github.blog/?p=65180",
          "author": "Jessica Lord",
          "description": "GitHub Sponsors is now available to all developers in India – no more waitlist, you can sign up right away!",
          "link": "https://github.blog/2022-05-23-github-sponsors-launches-in-india/",
          "publishedOn": "2022-05-24T03:30:37.000Z",
          "wordCount": 613,
          "title": "GitHub Sponsors launches in India"
        },
        {
          "id": "https://github.blog/?p=65156",
          "author": "Jill Moné-Corallo",
          "description": "It was another record year for our Security Bug Bounty program. We're excited to highlight some achievements we’ve made together with the bounty community from 2021!",
          "link": "https://github.blog/2022-05-23-eight-years-of-the-github-security-bug-bounty-program/",
          "publishedOn": "2022-05-23T17:54:46.000Z",
          "wordCount": 1463,
          "title": "Eight years of the GitHub Security Bug Bounty program"
        },
        {
          "id": "https://github.blog/?p=65072",
          "author": "Michelle Mannering",
          "description": "Each month, we highlight open source projects that have shipped major updates. These include everything from world-changing technology to developer tooling, and weekend projects. Here are our top staff picks on projects that shipped major version releases in April. Flyte 1.0 I was lucky enough to discover Flyte during Hacktoberfest last year. Now, Flyte has […]",
          "link": "https://github.blog/2022-05-20-release-radar-apr-2022/",
          "publishedOn": "2022-05-20T16:00:05.000Z",
          "wordCount": 1265,
          "title": "Release Radar · April 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=65110",
          "author": "Jim Boyle",
          "description": "Upgrade to GHES 3.2 or newer by June 3rd to continue using GitHub Connect.",
          "link": "https://github.blog/2022-05-20-action-needed-by-github-connect-customers-using-ghes-3-1-and-older-to-adopt-new-authentication-token-format-updates/",
          "publishedOn": "2022-05-20T15:27:38.000Z",
          "wordCount": 449,
          "title": "Action needed by GitHub Connect customers using GHES 3.1 and older to adopt new authentication token format updates"
        },
        {
          "id": "https://github.blog/?p=65023",
          "author": "Martin Woodward",
          "description": "Mathematical expressions are key to information sharing amongst engineers, scientists, data scientists, and mathematicians. Today we are pleased to announce that math expressions can be rendered in Markdown on GitHub using $$ as a delimiter for code blocks with math content or the $ delimiter for inline math expressions.",
          "link": "https://github.blog/2022-05-19-math-support-in-markdown/",
          "publishedOn": "2022-05-19T17:41:03.000Z",
          "wordCount": 588,
          "title": "Math support in Markdown"
        },
        {
          "id": "https://github.blog/?p=65049",
          "author": "Benjamin Allen",
          "description": "Learn about what GitHub is doing to make their products more inclusive, and what’s next.",
          "link": "https://github.blog/2022-05-19-how-were-continuing-to-enable-all-developers-to-build/",
          "publishedOn": "2022-05-19T16:48:04.000Z",
          "wordCount": 1090,
          "title": "How we’re continuing to enable all developers to build"
        },
        {
          "id": "https://github.blog/?p=65060",
          "author": "Zack Koppert",
          "description": "With innersource, it’s important to measure both the amount of innersource activity and the quality of the code being created. Here’s how.",
          "link": "https://github.blog/2022-05-18-securing-and-delivering-high-quality-code-with-innersource-metrics/",
          "publishedOn": "2022-05-18T21:50:03.000Z",
          "wordCount": 791,
          "title": "Securing and delivering high-quality code with innersource metrics"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18459",
          "author": "Nubank Editorial",
          "description": "Nubank's Chief of Technology Officer Matt Swann invited Nubank's CEO David Vélez for a conversation to share some thoughts about the importance of tech professionals roles.\nThe post 6 questions from a CTO to a CEO appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/cto-matt-swann-interviews-ceo-david-velez-engineering-principles/",
          "publishedOn": "2022-06-01T22:02:04.000Z",
          "wordCount": 3816,
          "title": "6 questions from a CTO to a CEO"
        },
        {
          "id": "https://building.nubank.com.br/?p=18440",
          "author": "Ezequiel Siddig - Editor and Content Creator at Nubank",
          "description": "“I don't necessarily worry about whether people are always talking about us, as long as they wouldn’t want to live without us”, says co-founder Edward Wible.\nThe post Nubank’s Engineering Principles: interview with Edward Wible appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubanks-engineering-principles-interview-with-co-founder-ed-wible/",
          "publishedOn": "2022-05-26T21:32:50.000Z",
          "wordCount": 5489,
          "title": "Nubank’s Engineering Principles: interview with Edward Wible"
        },
        {
          "id": "https://building.nubank.com.br/?p=18427",
          "author": "Nubank Editorial",
          "description": "The international talents are coming from Parkside Technologies, a North American company that already uses the same functional programming languages\nThe post Nubank announces hires to strengthen tech team appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-hires-engineers-of-parkside/",
          "publishedOn": "2022-05-24T14:10:19.000Z",
          "wordCount": 3030,
          "title": "Nubank announces hires to strengthen tech team"
        },
        {
          "id": "https://building.nubank.com.br/?p=18415",
          "author": "Nubank Editorial",
          "description": "The list, published annually and in its 19th edition, recognizes people who are making an impact in the world.\nThe post David Vélez, CEO of Nubank, joins the TIME100 list of most influential people in the world appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/david-velez-time-100-most-influential-people/",
          "publishedOn": "2022-05-23T12:09:00.000Z",
          "wordCount": 3188,
          "title": "David Vélez, CEO of Nubank, joins the TIME100 list of most influential people in the world"
        },
        {
          "id": "https://building.nubank.com.br/?p=18404",
          "author": "Nubank Editorial",
          "description": "Applications for the recruitment program of Black people in the software engineering industry are open until May 22nd. Check out how you can join.\nThe post Nubank opens applications for the 2nd edition of We Code appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-we-code-2nd-edition-2022/",
          "publishedOn": "2022-05-20T18:00:01.000Z",
          "wordCount": 3197,
          "title": "Nubank opens applications for the 2nd edition of We Code"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/community-blog/live-hacking-event-invitations-2022-guide",
          "author": "jessica@hackerone.com",
          "description": "Hello Hackers,\n\nLive Hacking Events are an experience like no other: hackers collaborate and connect with security teams, each other and HackerOne.�",
          "link": "https://www.hackerone.com/community-blog/live-hacking-event-invitations-2022-guide",
          "publishedOn": "2022-06-15T03:17:06.000Z",
          "wordCount": 1632,
          "title": "Live Hacking Event Invitations - 2022 Guide"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/cisos-do-you-know-security-risks-your-organizations-next-ma",
          "author": "Chris Evans",
          "description": "An ever-expanding attack surface is a global concern for most organizations and complicates an M&A, especially for CISOs. The M&A prospect may have a partially unprotected attack surface, thus increasing security risk coming in the form of a gap between the attack surface they can and do protect and the attack surface (and accompanying assets) they need to defend. This gap is what many M&A prospects bring to the table. And while an M&A may have undisputed business and strategic value, CISOs must still address the security risks involved in acquiring another organization's assets and its current attack surface, fully protected or not.",
          "link": "https://www.hackerone.com/vulnerability-management/cisos-do-you-know-security-risks-your-organizations-next-ma",
          "publishedOn": "2022-06-14T16:00:00.000Z",
          "wordCount": 1425,
          "title": "CISOs: Do You Know the Security Risks of Your Organization's Next M&A?"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-community-team-your-hacker-allies",
          "author": "jesse@hackerone.com",
          "description": "Jessica Sexton, Director of Community (Twitter/LinkedIn)\n\n\n\"I am excited to build a team and strategic programs that focus on human connectio",
          "link": "https://www.hackerone.com/community-blog/h1-community-team-your-hacker-allies",
          "publishedOn": "2022-06-13T17:41:00.000Z",
          "wordCount": 2284,
          "title": "H1 Community Team: Your Hacker Allies"
        },
        {
          "id": "https://hackerone.com/community-blog/community-hackerone-whats-come",
          "author": "jessica@hackerone.com",
          "description": "From Jessica Sexton - Director of Community,\n\nThree years ago, I found my home at HackerOne. My primary focus was to revamp our Live Hacking Events",
          "link": "https://www.hackerone.com/community-blog/community-hackerone-whats-come",
          "publishedOn": "2022-06-13T17:40:43.000Z",
          "wordCount": 2212,
          "title": "Community at HackerOne: What's to Come"
        },
        {
          "id": "https://hackerone.com/top-5-most-common-security-issues-i-discover-when-reviewing-code",
          "author": "William Barrett",
          "description": "NOTE: The following code examples have been contrived to provide detailed, illustrative representations of real security issues I’ve found while rev",
          "link": "https://www.hackerone.com/top-5-most-common-security-issues-i-discover-when-reviewing-code",
          "publishedOn": "2022-06-10T16:00:00.000Z",
          "wordCount": 1898,
          "title": "The Top 5 Most Common Security Issues I Discover When Reviewing Code"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/how-catch-injection-security-vulnerabilities-code-review",
          "author": "William Barrett",
          "description": "Injection vulnerabilities result from insecure handling of user inputs. They are relatively simple to fix once the underlying issues that cause them are understood, and are frequently found by experienced reviewers who know what to look for. The prevalence of injection vulnerabilities today is one of the best arguments for continuing to perform code review in many organizations—this type of vulnerability is most frequently caught through human inspection of the offending code.",
          "link": "https://www.hackerone.com/vulnerability-management/how-catch-injection-security-vulnerabilities-code-review",
          "publishedOn": "2022-06-09T16:00:00.000Z",
          "wordCount": 1662,
          "title": "How to Catch Injection Security Vulnerabilities in Code Review"
        },
        {
          "id": "https://hackerone.com/application-security/severe-confluence-vulnerability-active-threat-cve-2022-26134",
          "author": "HackerOne",
          "description": "Background\n\nThe vulnerability allows unauthenticated remote code execution (RCE). Exploitation occurs by sending an HTTP request with an attack payl",
          "link": "https://www.hackerone.com/application-security/severe-confluence-vulnerability-active-threat-cve-2022-26134",
          "publishedOn": "2022-06-06T20:20:00.000Z",
          "wordCount": 1173,
          "title": "Severe Confluence Vulnerability is an Active Threat (CVE-2022-26134)"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/how-critical-infrastructure-can-be-protected-threats",
          "author": "Christopher Dickens",
          "description": "Accessing a major critical infrastructure network is very appealing to cybercriminals, as they can maximize societal impact and demand large ransom sums to fix tampered systems. With recent high-profile attacks, including that against the Colonial Pipeline in March 2021, it has become clear that the organizations handling critical infrastructure networks are now in the firing line. Critical infrastructure is vulnerable to both threat groups that are evolving their tactics and public scrutiny if they do not remain transparent when an attack occurs.",
          "link": "https://www.hackerone.com/vulnerability-management/how-critical-infrastructure-can-be-protected-threats",
          "publishedOn": "2022-06-02T16:00:00.000Z",
          "wordCount": 1895,
          "title": "How Critical Infrastructure Can be Protected from Threats"
        },
        {
          "id": "https://hackerone.com/customer-stories/ethical-hackers-help-beiersdorf-minimize-risk-and-protect-their-attack-surface",
          "author": "HackerOne",
          "description": "After a year of running a private Vulnerability Disclosure Program (VDP), Beiersdorf is announcing the launch of its public VDP. HackerOne met with Kai Widua, Chief Information Security Officer (CISO) at Beiersdorf, to learn about the challenges they face in retail security.",
          "link": "https://www.hackerone.com/customer-stories/ethical-hackers-help-beiersdorf-minimize-risk-and-protect-their-attack-surface",
          "publishedOn": "2022-06-02T11:45:00.000Z",
          "wordCount": 1378,
          "title": "Ethical Hackers Help Beiersdorf Minimize Risk and Protect Their Attack Surface"
        },
        {
          "id": "https://hackerone.com/security-compliance/what-securitytxt-file-and-how-can-it-help-your-program",
          "author": "HackerOne",
          "description": "Security.txt is a security mechanism that allows your organization to provide its vulnerability disclosure policy and contact information in a standar",
          "link": "https://www.hackerone.com/security-compliance/what-securitytxt-file-and-how-can-it-help-your-program",
          "publishedOn": "2022-05-27T20:00:00.000Z",
          "wordCount": 1663,
          "title": "What Is a Security.txt File and How Can It Help Your Program?"
        },
        {
          "id": "https://hackerone.com/application-security/5-ways-i-provide-value-pullrequest-reviewer-when-i-start-reviewing-new-project",
          "author": "William Barrett",
          "description": "Important reviewer traits for providing a great code review include prior knowledge and experience, expertise, background context, attention to detail, and written communication skills. As a reviewer on PullRequest, I need to quickly gain context when I’m reviewing a project for the first time. But as is the case for any engineer new to a team, some context is gained over time.",
          "link": "https://www.hackerone.com/application-security/5-ways-i-provide-value-pullrequest-reviewer-when-i-start-reviewing-new-project",
          "publishedOn": "2022-05-24T16:15:00.000Z",
          "wordCount": 1615,
          "title": "5 Ways I Provide Value as a PullRequest Reviewer When I Start Reviewing a New Project"
        },
        {
          "id": "https://hackerone.com/assessments/hackerone-announces-new-customer-pentest-setup-thats-more-efficient-and-speeds-time",
          "author": "Sean Ryan",
          "description": "This improved experience reduces time to launch, which is vital when your organization is up against an urgent timeline to complete a pentest due to a",
          "link": "https://www.hackerone.com/assessments/hackerone-announces-new-customer-pentest-setup-thats-more-efficient-and-speeds-time",
          "publishedOn": "2022-05-20T16:00:00.000Z",
          "wordCount": 1175,
          "title": "HackerOne Announces a New Customer Pentest Setup that's More Efficient and Speeds Time to Launch"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/understanding-public-and-private-bug-bounties-and-vulnerability-disclosure",
          "author": "Tim Matthews",
          "description": "How Are Bug Bounty Programs and Vulnerability Disclosure Programs Different?\n\nLet’s start with the similarities. Both bug bounties and VDPs aim to",
          "link": "https://www.hackerone.com/vulnerability-management/understanding-public-and-private-bug-bounties-and-vulnerability-disclosure",
          "publishedOn": "2022-05-18T16:00:00.000Z",
          "wordCount": 1650,
          "title": "Understanding Public and Private Bug Bounties and Vulnerability Disclosure Programs"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/49348511c06c",
          "author": "Netflix Technology Blog",
          "description": "By Alex Hutter, Falguni Jhaveri, and Senthil Sayeebaba",
          "link": "https://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-part-2-49348511c06c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-06-15T16:34:20.000Z",
          "wordCount": 1720,
          "title": "How Netflix Content Engineering makes a federated graph searchable (Part 2)"
        },
        {
          "id": "https://medium.com/p/c9e0f1488bc5",
          "author": "Netflix Technology Blog",
          "description": "By Astha Singhal, Lakshmi Sudheer, Julia Knecht",
          "link": "https://netflixtechblog.com/scaling-appsec-at-netflix-part-2-c9e0f1488bc5?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-06-06T17:38:41.000Z",
          "wordCount": 1255,
          "title": "Scaling Appsec at Netflix (Part 2)"
        },
        {
          "id": "https://medium.com/p/b62d25175e6f",
          "author": "Netflix Technology Blog",
          "description": "At Netflix, we want to entertain the world through creating engaging content and helping members discover the titles they will love. Key to…",
          "link": "https://netflixtechblog.com/a-survey-of-causal-inference-applications-at-netflix-b62d25175e6f?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-05-21T15:02:49.000Z",
          "wordCount": 1558,
          "title": "A Survey of Causal Inference Applications at Netflix"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-5",
          "author": "Market Radar",
          "description": "A mix of charts on stocks, indices and crypto",
          "link": "https://marketradar.substack.com/p/charts-to-watch-5",
          "publishedOn": "2022-06-13T13:00:37.000Z",
          "wordCount": null,
          "title": "Charts to watch #5",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc77bcb2e-eb3a-4e44-9a0f-e9cc10e3fd56_933x746.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/investors-fearful-of-a-possible-recession",
          "author": "Market Radar",
          "description": "A new fear in a tough year",
          "link": "https://marketradar.substack.com/p/investors-fearful-of-a-possible-recession",
          "publishedOn": "2022-05-21T14:16:08.000Z",
          "wordCount": null,
          "title": "Investors fearful of a possible recession",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa31460c1-bd79-409a-ac2b-5ab0881a6d08_905x691.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}