{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/12/trust-in-transparency-private-compute.html",
          "author": null,
          "description": "Posted by Dave Kleidermacher, Dianne Hackborn, and Eugenio Marchiori  \nWe care deeply about privacy. We also know that trust is built by transparency. This blog, and the technical paper reference within, is an example of that commitment: we describe an important new Android privacy infrastructure called Private Compute Core (PCC). \nSome of our most exciting machine learning features use continuous sensing data — information from the microphone, camera, and screen. These features keep you safe, help you communicate, and facilitate stronger connections with people you care about. To unlock this new generation of innovative concepts, we built a specialized sandbox to privately process and protect this data.  \nAndroid Private Compute Core\n  \nPCC is a secure, isolated data processing environmen…",
          "link": "http://security.googleblog.com/2022/12/trust-in-transparency-private-compute.html",
          "publishedOn": "2022-12-08T16:59:00.001Z",
          "wordCount": 1027,
          "title": "Trust in transparency: Private Compute Core"
        },
        {
          "id": "http://security.googleblog.com/2022/12/enhanced-protection-strongest-level-of.html",
          "author": null,
          "description": "Posted by Benjamin Ackerman, Chrome Security and Jonathan Li, Safe Browsing  \nAs a follow-up to a previous blog post about How Hash-Based Safe Browsing Works in Google Chrome, we wanted to provide more details about Safe Browsing’s Enhanced Protection mode in Chrome. Specifically, how it came about, the protections that are offered and what it means for your data. \nSecurity and privacy have always been top of mind for Chrome. Our goal is to make security effortless for you while browsing the web, so that you can go about your day without having to worry about the links that you click on or the files that you download. This is why Safe Browsing’s phishing and malware protections have been a core part of Chrome since 2007. You may have seen these in action if you have ever come across one of…",
          "link": "http://security.googleblog.com/2022/12/enhanced-protection-strongest-level-of.html",
          "publishedOn": "2022-12-05T18:03:00.001Z",
          "wordCount": 1240,
          "title": "Enhanced Protection - The strongest level of Safe Browsing protection Google Chrome has to offer"
        },
        {
          "id": "http://security.googleblog.com/2022/12/memory-safe-languages-in-android-13.html",
          "author": null,
          "description": "Posted by Jeffrey Vander Stoep \nFor more than a decade, memory safety vulnerabilities have consistently represented more than 65% of vulnerabilities across products, and across the industry. On Android, we’re now seeing something different - a significant drop in memory safety vulnerabilities and an associated drop in the severity of our vulnerabilities. \n  \nLooking at vulnerabilities reported in the Android security bulletin, which includes critical/high severity vulnerabilities reported through our vulnerability rewards program (VRP) and vulnerabilities reported internally, we see that the number of memory safety vulnerabilities have dropped considerably over the past few years/releases. From 2019 to 2022 the annual number of memory safety vulnerabilities dropped from 223 down to 85. \n  …",
          "link": "http://security.googleblog.com/2022/12/memory-safe-languages-in-android-13.html",
          "publishedOn": "2022-12-01T16:58:00.000Z",
          "wordCount": 2324,
          "title": "Memory Safe Languages in Android 13"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/qM1e",
          "author": "Jerod Santo",
          "description": "Congrats to the entire Svelte team (and contributors) for this release, which culminates two years of effort:\nWe’re so excited to share this release with you. It’s the culmination of thousands of hours of work, both from the Svelte core team and the wider community, and we think it’s the most enjoyable way to build production-grade websites, whether you’re a solo developer working on a small project or part of a large team.\nDiscuss on Changelog News",
          "link": "https://svelte.dev/blog/announcing-sveltekit-1.0",
          "publishedOn": "2022-12-14T18:42:00.000Z",
          "wordCount": null,
          "title": "Announcing SvelteKit 1.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V173",
          "author": "Jerod Santo",
          "description": "Tony Parker writing on Swift’s blog:\nWhen Swift began life as an open source project, we wanted to open not just the language itself, but the ecosystem around it. Foundation has been instrumental in the success of decades of software and has been an integral part of the Swift developer experience from the beginning, and we knew it had to be included in the open source offering.\nHistorically, Apple’s open source efforts have varied in just how open they are when it comes to community. On that topic, this is an uplifting bit of prose:\nOpen source projects are at their best when the community of users can participate and become a community of developers. A new, open contribution process will be available to enable all developers to contribute new API to Foundation.\nThis new Foundation project is slated to launch on GitHub in 2023.\nDiscuss on Changelog News",
          "link": "https://www.swift.org/blog/future-of-foundation/",
          "publishedOn": "2022-12-14T16:41:00.000Z",
          "wordCount": null,
          "title": "Apple's Swift rewrite of its Foundation framework will be open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y71e",
          "author": "Jerod Santo",
          "description": "Jacob O’Bryant’s “Grand Vision For How Social Media Ought To Be”:\nthere should be a bunch of different:\npublishing services, like Substack and Ghost\nreading apps, like Gmail and Matter\ncommunity platforms, like Slack and Discord\nand we should look for ways to make these reading, publishing, and community services all play nicely together. I’m calling this model “the unbundled web,” and I think RSS should be the primary method of interop.\nWhere do I sign up? 😉\nDiscuss on Changelog News",
          "link": "https://tfos.co/p/rebuild-social-media/",
          "publishedOn": "2022-12-14T15:00:01.000Z",
          "wordCount": null,
          "title": "How to rebuild social media on top of RSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jg5d",
          "author": "Jerod Santo",
          "description": "Setting up Rails for the first time with all the dependencies necessary can be daunting for beginners. Docked Rails attempts to flatten the onboarding curve by only requiring a working Docker installation in order to get started making a new Rails application, working with that application during development, and running a basic server. All based on pre-configured commands and dependencies living in a Docker image.\nGetting started is as easy as:\ndocker volume create ruby-bundle-cache\nalias rails='docker run --rm -it -v ${PWD}:/rails -v ruby-bundle-cache:/bundle dhh37/rails'\nalias rails-server='docker run --rm -it -v ${PWD}:/rails -v ruby-bundle-cache:/bundle -p 3000:3000 dhh37/rails server -b 0.0.0.0'\n\nDiscuss on Changelog News",
          "link": "https://github.com/rails/docked",
          "publishedOn": "2022-12-14T13:57:00.000Z",
          "wordCount": null,
          "title": "Running Rails from Docker for easy start to development",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8ln6",
          "author": "Jerod Santo",
          "description": "After 5+ years working for GitLab, Brendan O’Leary is moving on to his next adventure.\nI’m so proud of what we built—and I’m still proud and awed by the remarkable people there. GitLab’s values are the gold standard for what it means to be a wonderful company—for the team-members, for the community, and for the shareholders.\nHe took a moment to write down a few things he learned while there. The bullet points follow, but you’ll have to visit his blog for all the details:\nWrite down everything\nGive and accept: ownership, agency, and responsibility\nBe transparent with a low level of shame\nDiscuss on Changelog News",
          "link": "https://blog.boleary.dev/what-i-learned-at-gitlab-that-i-dont-want-to-forget/",
          "publishedOn": "2022-12-13T20:51:00.000Z",
          "wordCount": null,
          "title": "What I learned at GitLab that I don't want to forget",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1950",
          "author": null,
          "description": "José and Ricardo joined Daniel at EMNLP 2022 to discuss state-of-the-art machine translation, the WMT shared tasks, and quality estimation. Among other things, they talk about Unbabel’s innovations in quality estimation including COMET, a neural framework for training multilingual machine translation (MT) evaluation models.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nRicardo Rei – Twitter\nJosé Souza – Twitter\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nUnbabel\nCOMET\nThe WMT workshop/ conference\nEMNLP\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/204",
          "publishedOn": "2022-12-13T19:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 204: SOTA machine translation at Unbabel",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/204/practical-ai-204.mp3",
            "length": "29454127",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1bP",
          "author": "Adam Stacoviak",
          "description": "Nick Cameron works on Rust at Microsoft. He shared these desires for Rust in 2023.\nThe core team used to call for blog posts to help plan the next year. The core team has pretty much disappeared and certainly hasn’t called for blog posts, but I’m going to write one anyway because I have opinions and I want you to hear them. Sorry. I think you should write such a post too!\nDiscuss on Changelog News",
          "link": "https://www.ncameron.org/blog/rust-in-2023/",
          "publishedOn": "2022-12-13T13:45:00.000Z",
          "wordCount": null,
          "title": "Rust in 2023",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1948",
          "author": null,
          "description": "tRPC helps you move fast and break nothing, Michael Muré embeds a bug tracker in git, Fatih Kadir Akın curates some awesome ChatGPT prompts, Mike Nikles thinks dev environments in the cloud are a half-baked solution & Georgi Gerganov ports OpenAI’s Whisper model to a lightweight, portable C/C++ program.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nNotes and Links\n📥 Subscribe to Changelog’s Weekly newsletter\ntRPC.io\nMichaelMure/git-bug\nAwesome ChatGPT Prompts\nDev environments in the cloud are a half-baked solution\nggerganov/whisper.cpp\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-12-12",
          "publishedOn": "2022-12-12T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: tRPC, a bug tracker embedded in git, awesome ChatGPT prompts, half-baked cloud dev envs & Whisper.cpp",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-12-12/the-changelog-news-2022-12-12.mp3",
            "length": "7259779",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Mbw6",
          "author": "Adam Stacoviak",
          "description": "I thouroughly enjoyed reading this. It’s interesting to think about the evolution of transport storage. To this day, the USB thumb drive has proved to be the long-term winner and something I personally use very often. Wanna install Debian or do a clean install of macOS? You’ll likely do it by creating a bootable USB thumb drive.\nBefore the invention of the thumb drive, computer users stored and transported their files using floppy disks. Developed by IBM in the 1960s, first 8-inch and later 5 ¼-inch and 3 ½-inch floppy disks replaced cassette tapes as the most practical portable storage media. Floppy disks were limited by their relatively small storage capacity—even double-sided, double-density disks could store only 1.44 MB of data. During the 1990s, as the size of files and software increased…\nWould you be surprised to learn that the supposed inventor of the thumb drive is in jail right now in Singapore? But why?\nDiscuss on Changelog News",
          "link": "https://spectrum.ieee.org/thumb-drive",
          "publishedOn": "2022-12-12T18:25:34.000Z",
          "wordCount": null,
          "title": "Who really invented the thumb drive?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXNe",
          "author": "Jerod Santo",
          "description": "SQLite has few functions compared to other database management systems. SQLite authors see this as a feature rather than a problem, because SQLite has an extension mechanism in place.\nThere are a lot of SQLite extensions out there, but they are incomplete, inconsistent and scattered across the internet. sqlean brings them together, neatly packaged into domain modules, documented, tested, and built for Linux, Windows and macOS.\nThink of it like an extended standard library for SQLite.\nDiscuss on Changelog News",
          "link": "https://github.com/nalgeon/sqlean",
          "publishedOn": "2022-12-12T15:36:00.000Z",
          "wordCount": null,
          "title": "The ultimate set of SQLlite extensions",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9l8y",
          "author": "Jerod Santo",
          "description": "Stephan Schmidt warns: “We have invited complexity through the door. But it will not leave as easily.”\nOne way to simplify your stack and reduce the moving parts, speed up development, lower the risk and deliver more features in your startup is “Use Postgres for everything”. Postgres can replace - up to millions of users - many backend technologies, Kafka, RabbitMQ, Mongo and Redis among them.\nHe then goes on to list nine things you can use Postgres for that replace more specific solutions: fulltext search, geospatial queries, etc.\nDiscuss on Changelog News",
          "link": "https://www.amazingcto.com/postgres-for-everything/",
          "publishedOn": "2022-12-12T14:48:00.000Z",
          "wordCount": null,
          "title": "Just use Postgres for everything",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1869",
          "author": null,
          "description": "This week we’re joined by Christina Warren, Senior Developer Advocate at GitHub, and a true tech and pop culture connoisseur. From her days at Mashable covering the intersections of entertainment and technology, to Gizmodo, to Microsoft, and now her current role at GitHub we talk with Christina about her journey from journalist to developer, and the latest happenings coming out of GitHub Universe.\nBTW, we’re planning to get Christina on Backstage in the new year to talk about Plex, MakeMKV, and all things that go into hosting your own media server. Drop a commment on this episode with a +1 if you want to see that happen.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nInfluxData – With its data collector…",
          "link": "https://changelog.com/podcast/518",
          "publishedOn": "2022-12-09T22:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 518: Coming home to GitHub",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/518/the-changelog-518.mp3",
            "length": "74930931",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1824",
          "author": null,
          "description": "KBall interviews CSS instructor & YouTuber extraordinaire Kevin Powell in a wide ranging discussion about CSS and how to learn it - what to start with, what to ignore, and various topics in between.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers…",
          "link": "https://changelog.com/jsparty/255",
          "publishedOn": "2022-12-09T17:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 255: Learning CSS in 2023",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/255/js-party-255.mp3",
            "length": "50880328",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/AX46",
          "author": "Jerod Santo",
          "description": "Phlex views are “plain old Ruby objects” — templates are methods and HTML tags are method calls. If you know how to define a class with a method that calls another method, you know how to use Phlex.\nWhen it comes to API usability, Ruby is so tough to beat. This looks actually fun to use!\nclass Nav < Phlex::HTML\n  def template\n    nav(class: \"main-nav\") {\n      ul {\n        li { a(href: \"/\") { \"Home\" } }\n        li { a(href: \"/about\") { \"About\" } }\n        li { a(href: \"/contact\") { \"Contact\" } }\n      }\n    }\n  end\nend\n\nDiscuss on Changelog News",
          "link": "https://www.phlex.fun/",
          "publishedOn": "2022-12-09T16:14:00.000Z",
          "wordCount": null,
          "title": "A framework for building fast, reusable, testable views in pure Ruby",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWpZ",
          "author": "Jerod Santo",
          "description": "How will large language models (LLMs) change the world?\nNo one knows. With such uncertainty, a good exercise is to look for historical analogies—to think about other technologies and ask what would happen if LLMs played out the same way.\nI like to keep things concrete, so I’ll discuss the impact of LLMs on writing. But most of this would also apply to the impact of LLMs on other fields, as well as other AI technologies like AI art/music/video/code.\nWhat follows are 13 examples of technological innovations that changed the world and description of how they affected they way people work. Here’s an example analogy of Feet and Segways:\nFirst, there was walking. Then the Segway came to CHANGE THE NATURE OF HUMAN TRANSPORT. Twenty years later, there is still walking, plus occasionally low-key alternatives like electric scooters.\nIn this analogy, LLMs work fine but just aren’t worth the trouble in most cases and society doesn’t evolve to integrate them. Domain-specific LLMs are used for some applications, but we start to associate “general” LLMs with tourists and mall cops. George W. Bush falls off an LLM on vacation and everyone loses their minds.\nDiscuss on Changelog News",
          "link": "https://dynomight.net/llms/",
          "publishedOn": "2022-12-09T15:26:00.000Z",
          "wordCount": null,
          "title": "Historical analogies for large language models",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdJM",
          "author": "Jerod Santo",
          "description": "José Valim announces Bumblebee and walks you through how to run ML modules in Livebook with just three clicks. Finally, he shows you how to embed a model into a Phoenix app. So cool!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=g3oyh3g1AtQ",
          "publishedOn": "2022-12-08T23:29:00.000Z",
          "wordCount": null,
          "title": "Bumblebee: GPT2, Stable Diffusion, and more in Elixir",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1867",
          "author": null,
          "description": "Ivan Kwiatkowski joins Natalie once again for a follow-up episode to Hacking with Go: Part 2. This time we’ll get Ivan’s perspective on the way Go’s security features are designed and used, from the user/hacker perspective. And of course we will also talk about how AI fits into all this…\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nFeaturing\nIvan Kwiatkowski – Mastodon, Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nHacking with Go: Part 1\nHacking with Go: Part 2\nPascal (programming language)\nHacking tool: IDA Pro\nHacking tool: Ghidra\nStowaway – Multi-hop Proxy Tool for pentesters\nIvan’s video on reversing a Go malware\n“Stylometry” - recognizing author by code style, talk from the CCC 2014\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/259",
          "publishedOn": "2022-12-08T22:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 259: Hacking with Go: Part 3",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/259/go-time-259.mp3",
            "length": "56055586",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1939",
          "author": null,
          "description": "Narayanan Raghavan leads the global SRE organization that runs Red Hat managed cloud services including OpenShift Dedicated, Azure Red Hat Openshift, Red Hat OpenShift Service on AWS, and Red Hat OpenShift Data Science among others across the three major cloud providers: AWS, GCP & Azure. We start with a high-level discussion about DevOps, SRE & platform engineering, and then we dig into SRE specifics, including what it takes to safely roll out updates across many tens of thousands of OpenShift clusters.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insight…",
          "link": "https://changelog.com/shipit/82",
          "publishedOn": "2022-12-08T19:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 82: Red Hat's approach to SRE",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/82/ship-it-82.mp3",
            "length": "65292874",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/O58N",
          "author": "Jerod Santo",
          "description": "Julia Evans is working on a new zine about debugging, so she took to Mastodon to ask for tips and compiled a list of the best ones (with explainers). Here’s a short list of some tips covered:\nsearch for the request’s ID\ncorrelate between different systems\ncheck that a “suspicious” error is actually new\nDiscuss on Changelog News",
          "link": "https://jvns.ca/blog/2022/12/07/tips-for-analyzing-logs/",
          "publishedOn": "2022-12-08T15:49:00.000Z",
          "wordCount": null,
          "title": "Tips for analyzing logs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1Wnn",
          "author": "Jerod Santo",
          "description": "A series of 8 free data puzzles to be released daily starting on December 18th. Created by Saul Pwanson (author of VisiData) as an analogue to the popular Advent of Code, but for data nerds who want to find answers in a dataset, rather than hack on algorithms.\nDiscuss on Changelog News",
          "link": "https://hanukkah.bluebird.sh/",
          "publishedOn": "2022-12-08T15:00:00.000Z",
          "wordCount": null,
          "title": "Hanukkah of Data",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwZG",
          "author": "Jerod Santo",
          "description": "OpenAI recently released a model for automatic speech recognition called Whisper. I decided to reimplement the inference of the model from scratch using C/C++. To achieve this I implemented a minimalistic tensor library in C and ported the high-level architecture of the model in C++. The entire code is less than 8000 lines of code and is contained in just 2 source files without any third-party dependencies.\nState of the art voice recognition without any PyTorch baggage and it’s optimized to run on Apple Silicon!\nDiscuss on Changelog News",
          "link": "https://github.com/ggerganov/whisper.cpp",
          "publishedOn": "2022-12-07T21:49:00.000Z",
          "wordCount": null,
          "title": "OpenAI's Whisper model ported to C/C++",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1946",
          "author": null,
          "description": "In this special episode, we interview some of the sponsors and teams from a recent case competition organized by Purdue University, Microsoft, INFORMS, and SIL International. 170+ teams from across the US and Canada participated in the competition, which challenged students to create AI-driven systems to caption images in three languages (Thai, Kyrgyz, and Hausa).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMatthew Lanham – Twitter, Website\nMark Tabladillo – Twitter, LinkedIn\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nPurdue University’s Krannert School of Business\nMaster the basics of Azure: AI Fundamentals\nAzure Architecture Center\nSIL International\nThe bloom-captioning dataset\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/203",
          "publishedOn": "2022-12-07T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 203: AI competitions & cloud resources",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/203/practical-ai-203.mp3",
            "length": "32788404",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X1Wp",
          "author": "Jerod Santo",
          "description": "Andrea Leopardi likens database migrations to git commits and wonders why we don’t leave them in the past and load an up-to-date SQL file instead. He also shares his approach to this in Elixir.\nDiscuss on Changelog News",
          "link": "https://andrealeopardi.com/posts/get-rid-of-your-old-database-migrations/",
          "publishedOn": "2022-12-07T16:50:00.000Z",
          "wordCount": null,
          "title": "Get rid of your old database migrations",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ml43",
          "author": "Jerod Santo",
          "description": "Wait-for-secrets GitHub Action waits for the developer to enter secrets during a workflow run. Developers can enter secrets using a web browser and use them in the workflow.\nThis seems like a good enough solution to yet another battle between security and usability.\nDiscuss on Changelog News",
          "link": "https://github.com/step-security/wait-for-secrets",
          "publishedOn": "2022-12-07T16:03:00.000Z",
          "wordCount": null,
          "title": "A way to publish from GitHub Actions using multi-factor authentication",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rnQ",
          "author": "Jerod Santo",
          "description": "I had the honor of joining the fine folks at Elixir SF awhile back to talk all about how we’ve been podcasting on Elixir for a long time now. Tune in if you’re curious about such things and/or if you’d like to take a stroll down memory lane as I show old versions of our album art and play our intro music along the way.\nThe preso is average, but the Q&A near the end is above average, if you ask me. OH! And also we got Zoom bombed twice, which was a first for me. Thankfully, it was also a last. So far, at least…\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=qech2rRMQR8",
          "publishedOn": "2022-12-06T17:26:00.000Z",
          "wordCount": null,
          "title": "Podcasting on Elixir for the better half of a decade",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jnr",
          "author": "Jerod Santo",
          "description": "Simon Willison is using this year’s Advent of Code as an opportunity to learn Rust.\nHe’s using Copilot to help him with syntax/snippets via comment-driven prompting. He’s using ChatGPT as a study partner by asking it questions about how to do things in Rust. Is it working?\nSo far I think this is working really well.\nI feel like I’m beginning to get a good mental model of how Rust works, and a lot of the basic syntax is beginning to embed itself into my muscle memory.\nThe real test is going to be if I can first make it to day 25 (with no prior Advent of Code experience I don’t know how much the increasing difficulty level will interfere with my learning) and then if I can actually write a useful Rust program after that without any assistance from these AI models.\nAnd honestly, the other big benefit here is that this is simply a lot of fun. I’m finding interacting with AIs in this way—as an actual exercise, not just to try them out—is deeply satisfying and intellectually stimulating.\nThis might be an early glimpse into the future of AI-assisted learning…\nDiscuss on Changelog News",
          "link": "https://simonwillison.net/2022/Dec/5/rust-chatgpt-copilot/",
          "publishedOn": "2022-12-06T16:04:00.000Z",
          "wordCount": null,
          "title": "Learning Rust with ChatGPT, Copilot and Advent of Code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOqd",
          "author": "Jerod Santo",
          "description": "Spotify’s annual “Wrapped” campaign is so successful we’re starting to see it copy/pasted to various other social networks. This GitHub version is by a 3rd-party, though, so they have a lot of API limitations to work around. It’s a cool service, but be prepared to see “Incomplete Data. Please refresh later to finish loading.”\nDiscuss on Changelog News",
          "link": "https://www.githubtrends.io/wrapped",
          "publishedOn": "2022-12-06T15:18:00.000Z",
          "wordCount": null,
          "title": "Reflect on your year with GitHub Wrapped",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1945",
          "author": null,
          "description": "Jonas Degrave builds a virtual machine inside ChatGPT, Advent of Code 2022 is in full swing, Mat Ryer impersonates Liam Neeson as web developer, Luca Hammer’s Fedifinder project helps you join the Fediverse & we chat with Brian (BDougie) Douglas about Open Sauced at All Things Open 2022.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nBrian Douglas – Twitter, GitHub, Website\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSend us a message for state of the “log” 2022!\nBuilding A Virtual Machine inside ChatGPT\nAdvent of Code 2022\nLiam Neeson Impression - Web developer (from Taken)\nFedifinder\nOpen Sauced\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-12-05",
          "publishedOn": "2022-12-05T21:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Building a VM inside ChatGPT, Advent of Code 2022, webdev Liam Neeson, Fedifinder & BDougie",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-12-05/the-changelog-news-2022-12-05.mp3",
            "length": "27978192",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqEG",
          "author": "Jerod Santo",
          "description": "Distributed, offline-first bug tracker embedded in git, with bridges\nI love the idea of having your bug repo right there inside your code repo. The terminal UI is a nice touch!\n\nDiscuss on Changelog News",
          "link": "https://github.com/MichaelMure/git-bug",
          "publishedOn": "2022-12-05T18:09:00.000Z",
          "wordCount": null,
          "title": "A bug tracker that is fully embedded in git",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njpJ",
          "author": "Jerod Santo",
          "description": "Loren describes the differences between gRPC and GraphQL and summarizes the strengths and weaknesses of each. They give a rule of thumb (GraphQL for client-server and gRPC for server-to-server) and note cases in which you might want to make exceptions to the rule.\nDiscuss on Changelog News",
          "link": "https://stackoverflow.blog/2022/11/28/when-to-use-grpc-vs-graphql/",
          "publishedOn": "2022-12-05T16:18:00.000Z",
          "wordCount": null,
          "title": "When to use gRPC vs GraphQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Ne",
          "author": "Austin Gil",
          "description": "When choosing between pixels and rems in CSS, you should almost always use rems. It’s a simple rule to follow. This article explains why.\nDiscuss on Changelog News",
          "link": "https://austingil.com/px-or-rem-in-css/",
          "publishedOn": "2022-12-05T15:29:00.000Z",
          "wordCount": null,
          "title": "PX or REM in CSS? Just use REM",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1941",
          "author": null,
          "description": "This week we’re back at All Things Open 2022 covering the hallway track. Up first is Shivay Lamba and he’s schooling us on all things server-side WASM. It’s the new hotness. After that, we talk with Yishai Beeri, CTO of LinearB about the world of code review, PR queues, AI developers, and making human developers more efficient, and happier. And last, we talk with Guy Martin from NVIDIA about what’s going on in the Industrial Metaverse. He shares details about an open source project developed by Pixar called Universal Scene Description (USD) and what they’re doing with NVIDIA Omniverse.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFly.io – The home of Changelog.com — Deploy your apps and databases clos…",
          "link": "https://changelog.com/podcast/517",
          "publishedOn": "2022-12-02T23:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 517: ANTHOLOGY - Wasm, efficient code review & the industrial metaverse",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/517/the-changelog-517.mp3",
            "length": "54752410",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1856",
          "author": null,
          "description": "Thomas Steiner (Web Developer Advocate at Google) joins Amal & Nick to talk about Project Fugu – an effort to close gaps in the web’s capabilities enabling new classes of applications to run on the web.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams …",
          "link": "https://changelog.com/jsparty/254",
          "publishedOn": "2022-12-02T17:40:00.000Z",
          "wordCount": null,
          "title": "JS Party 254: Project Fugu 🐡",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/254/js-party-254.mp3",
            "length": "54735466",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMEe",
          "author": "Jerod Santo",
          "description": "Mat Ryer has a very particular set of skills… 🤣\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=BXPYUQtoEKw",
          "publishedOn": "2022-12-02T17:33:00.000Z",
          "wordCount": null,
          "title": "Liam Neeson Impression - Web developer (from Taken)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDVn",
          "author": "Jerod Santo",
          "description": "This looks like an interesting framework for everything error-related. The core handles the usual tasks (wrapping errors, creating classes, etc.) and plugins offer more advanced use cases (serialization, CLI errors, logging, etc.).\nDiscuss on Changelog News",
          "link": "https://github.com/ehmicky/modern-errors",
          "publishedOn": "2022-12-02T15:35:00.000Z",
          "wordCount": null,
          "title": "A library for handling JS errors in a simple, stable, consistent way",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoLz",
          "author": "Jerod Santo",
          "description": "This awesome list clocs in at ~1500 lines and has been maintained for six years now. It could use some help in the podcasts section, though…\nDiscuss on Changelog News",
          "link": "https://github.com/charlax/engineering-management",
          "publishedOn": "2022-12-02T14:49:00.000Z",
          "wordCount": null,
          "title": "A collection of resources related to engineering management & leadership",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1866",
          "author": null,
          "description": "That is the question. Whether ’tis nobler in the mind to suffer the slings and arrows of outrageous test coverage, or to take arms against a sea of bugs…\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nFeaturing\nBill Kennedy – Twitter, GitHub, Website\nChris James – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nThe tweet that started it all\n📘 Learn Go with Tests\nThe Test Pyramid\nInternet Protocol Suite\n🐘 techhub.social\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/258",
          "publishedOn": "2022-12-01T19:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 258: To TDD or not to TDD",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/258/go-time-258.mp3",
            "length": "70279358",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1819",
          "author": null,
          "description": "In today’s episode, we have the pleasure of two guests: Whitney Lee, Staff Technical Advocate at VMware, the one behind the ⚡️ Enlightning episodes, and Mauricio Salatino, which you already know from 🎧 shipit.show/41 on Continuous Delivery for Kubernetes.\nThe two of them gave the most amazing KubeCon NA Keynote last month: What a RUSH! Let’s Deploy Straight to Production!\nSo how do we create an Internal Development Platform that enables anyone on the team to deploy straight to production with the confidence that everything will just work?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Source…",
          "link": "https://changelog.com/shipit/81",
          "publishedOn": "2022-12-01T17:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 81: Let's deploy straight to production!",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/81/ship-it-81.mp3",
            "length": "64945167",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qp9y",
          "author": "Jerod Santo",
          "description": "Robert Laszczak does a good job defending/explaining many gophers’ position on frameworks:\nGo frameworks exist, but none provides a feature set like frameworks from other languages. This won’t change soon.\nYou may think that it’s because the Go ecosystem is younger. But there is a more important factor. Go is built around the Unix Philosophy…\n\nDiscuss on Changelog News",
          "link": "https://threedots.tech/post/best-go-framework/",
          "publishedOn": "2022-12-01T15:41:00.000Z",
          "wordCount": null,
          "title": "The best Go framework: no framework?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1OP",
          "author": "Jerod Santo",
          "description": "Burnout has reportedly reached a critical point in the software developer circle since the onset of the Covid-19 health crisis. A recent study by Haystack Analytics, a company specializing in productivity of engineers, found that 83% of software developers suffer from burnout. The main reasons given by the latter to explain this exhaustion are high workload (47%), process inefficiency (31%) and lack of clarity of objectives and targets (29%).\nThat few?! 😏\nDiscuss on Changelog News",
          "link": "https://vocal.media/01/83-of-developers-suffer-from-burnout",
          "publishedOn": "2022-11-30T19:57:00.000Z",
          "wordCount": null,
          "title": "83% of developers suffer from burnout",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/oj08",
          "author": "Jerod Santo",
          "description": "Jake Lazaroff spent the last few months learning Tailwind with an open mind and he’s ready to share his opinion of the popular CSS framework:\nTailwind is commonly described as “utility classes”, but that’s a bit of an understatement. It’s essentially a small language you write in the class attributes of your HTML that compiles to a combination of CSS rules and selectors — an abstraction over CSS. But all abstractions leak, and Tailwind is very leaky.\nWhen an abstraction leaks, it means you still have to be aware of (and sometimes deeply so) the underlying layer that’s being abstracted. In this case, Jake is saying that you still need to know CSS to use Tailwind and lays out a few scenarios in which this is the case.\nThis might be unfair to Tailwind. To my knowledge, the team has never promoted it as a CSS replacement. At its core, it really is just a set of class names that apply styles. But even after working with it for months, there’s still a mental translation layer between “Tailwind CSS” and “real CSS”.\nDiscuss on Changelog News",
          "link": "https://jakelazaroff.com/words/tailwind-is-a-leaky-abstraction/",
          "publishedOn": "2022-11-30T14:55:00.000Z",
          "wordCount": null,
          "title": "Tailwind is a leaky abstraction",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1943",
          "author": null,
          "description": "There are some big AI-related controversies swirling, and it’s time we talk about them. A lawsuit has been filed against GitHub, Microsoft, and OpenAI related to Copilot code suggestions, and many people have been disturbed by the output of Meta AI’s Galactica model. Does Copilot violate open source licenses? Does Galactica output dangerous science-related content? In this episode, we dive into the controversies and risks, and we discuss the benefits of these technologies.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nRelated to Copilot:\nArticle - “GitHub Copilot Isn’t Worth the Risk”\nTabnine\nBig Code Project\nRelated to Galactica:\nModel website\nArticle: “Galactica: the AI knowledge base that makes stuff up”\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/202",
          "publishedOn": "2022-11-29T20:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 202: Copilot lawsuits & Galactica \"science\"",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/202/practical-ai-202.mp3",
            "length": "42635728",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9l9y",
          "author": "Jerod Santo",
          "description": "Ruby 3.1 adds a new core class called Data to represent simple immutable value objects. The Data class helps define simple classes for value-alike objects that can be extended with custom methods.\nWhile the Data class is not meant to be used directly, it can be used as a base class for creating custom value objects. The Data class is similar to Struct, but the key difference being that it is immutable.\nIn its heyday, most Rubyists wouldn’t touch immutability with a ten-foot pole. Times, they are a changin’…\nDiscuss on Changelog News",
          "link": "https://blog.saeloun.com/2022/11/22/data-immutable-object",
          "publishedOn": "2022-11-29T17:08:00.000Z",
          "wordCount": null,
          "title": "Ruby adds a new core Data class to represent immutable value objects",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQzn",
          "author": "Jerod Santo",
          "description": "Learning C was quite difficult for Tom M. Thankfully for us, along the way he collected summaries, signposts, and advice for these broader points that made his journey with C and other compiled languages easier. So, if you’re on a similar journey, this page will serve you well on your way.\nDiscuss on Changelog News",
          "link": "https://tmewett.com/c-tips/",
          "publishedOn": "2022-11-29T16:21:00.000Z",
          "wordCount": null,
          "title": "Everything I wish I knew when learning C",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1942",
          "author": null,
          "description": "Heroku’s free plans officially reach EOL, Swyx explains the mixed reaction to Stable Diffusion 2.0, a real Twitter SRE explains how it continues to stay up even with ~80% gone, Tyler Cipriani tells us about one of Git’s coolest, most unloved features & we chat with Joel Lord about brewing beer with IoT & JavaSCript at All Things Open 2022.\nOh, and help make this year’s state of the “log” episode awesome by lending your voice!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJoel Lord – Twitter, GitHub\nJerod Santo – Mastodon, Twitter, GitHub, LinkedIn\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSend us a message for state of the “log” 2022!\nHeroku will delete all free dbs and shut down all free dynos Monday\nWhy “Prompt Engineering” and “Generative AI” are overhyped\nWhy Twitter Didn’t Go Down: From a Real Twitter SRE\nGit Notes: Git’s Coolest, Most Unloved Feature\nJoel Lord’s Brain Brew\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-11-28",
          "publishedOn": "2022-11-28T20:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Free Heroku EOL, Stable Diffusion 2.0, Twitter SRE explains why it stays up, Git Notes & Joel Lord",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-11-28/the-changelog-news-2022-11-28.mp3",
            "length": "24415513",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/GW9Z",
          "author": "Jerod Santo",
          "description": "Multithreaded, cross-platform, reliable & written in Rust.\n\nDiscuss on Changelog News",
          "link": "https://github.com/GyulyVGC/sniffnet",
          "publishedOn": "2022-11-28T15:45:00.000Z",
          "wordCount": null,
          "title": "Sniffnet is a cross-platform application to monitor your network traffic with ease",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEVR",
          "author": "Jerod Santo",
          "description": "If you’ve ever had to split a string into sentences, you may have reached for a naive regular expression:\n'Hello! How are you?'.split(/[.!?]/);\n\nInstead of giving yourself two problems, Stefan Judis says maybe reach for Intl.Segmenter, which he shows is quite sophisticated and supported everywhere but Firefox.\nDiscuss on Changelog News",
          "link": "https://www.stefanjudis.com/today-i-learned/how-to-split-javascript-strings-with-intl-segmenter/",
          "publishedOn": "2022-11-28T14:58:00.000Z",
          "wordCount": null,
          "title": "Split JS strings into sentences, words or graphemes with `Intl.Segmenter`",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1887",
          "author": null,
          "description": "This week we’re back talking to Gergely Orosz — this time not quite about the insane tech hiring market, but more so the flip side, the 180, the not so good tech hiring market, the layoff market and what you can expect. There’s a lot of FUD out there, so hopefully this show gives you a lens into what’s really going on, and what to really expect. Maybe more so, how to keep your job or find a new job. We come to this topic with great compassion and great understanding, so please…there is a community here for you. There’s a lot of people in our Slack. Call it your home, it’s free to join and everyone is welcome.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers tr…",
          "link": "https://changelog.com/podcast/516",
          "publishedOn": "2022-11-25T19:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 516: This !insane tech hiring market",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/516/the-changelog-516.mp3",
            "length": "79427771",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1921",
          "author": null,
          "description": "Debbie O’Brien –Senior Program Manager at Microsoft– joins Amal & Nick for a deep-dive on Playwright, an automation library for cross-browser end-to-end testing. Along the way, we learn why Microsoft decided to fork Puppeteer, Playwright’s unique value proposition, cool features like auto-waiting & the trace viewer, how it compares to Cypress & a lot more.\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nDebbie O'Brien – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nNotes and Links\nShout out to Caio Amaral for requesting this episode. You, too, can request an episode!\nMallorca\nplaywright.dev\nPlaywright on GitHub\nNuxt\npuppeteer\nSelenium\nPlaywright test for VSCode\nGetting started - VS Code\nTesting Library\nPlaywright on YouTube\nWhat’s new in Playwright 1.27\nTest Generator\nCI GitHub Actions\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/253",
          "publishedOn": "2022-11-25T18:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 253: All about Playwright",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/253/js-party-253.mp3",
            "length": "60891469",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/2lP6",
          "author": "Jerod Santo",
          "description": "If you don’t have time to fill out the entire survey… at least skip down to the “Resources” ~> “Podcasts” section and help someone dethrone those rascals over at Syntax. I think it might be JS Party’s time, y’all…\nDiscuss on Changelog News",
          "link": "https://survey.devographics.com/survey/state-of-js/2022",
          "publishedOn": "2022-11-25T17:12:00.000Z",
          "wordCount": null,
          "title": "Take the \"State of JS 2022\" survey!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O5ON",
          "author": "Jerod Santo",
          "description": "Matt Welsh:\nI hesitated writing this post, because I don’t want to start, or get into, a holy war over programming languages. (Just to get the flame bait out of the way, Visual Basic is the best language ever!) But I’ve had a number of people ask me about my experience with Rust and whether they should pick up Rust for their projects. So, I’d like to share some of the pros and cons that I see of using Rust in a startup setting, where moving fast and scaling teams is really important.\nThe learning curve and hiring difficulties seem to be the major culprits, in Matt’s experience.\nDiscuss on Changelog News",
          "link": "https://scribe.rip/using-rust-at-a-startup-a-cautionary-tale-42ab823d9454",
          "publishedOn": "2022-11-25T16:22:00.000Z",
          "wordCount": null,
          "title": "Using Rust at a startup: a cautionary tale",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1861",
          "author": null,
          "description": "Nishant Roy, Engineering Manager at Pinterest Ads, joins Johnny & Jon to detail how they’ve managed to continue shipping quality software from startup through hypergrowth all the way to IPO. Prepare to learn a lot about Pinterest’s integration and deployment pipeline, observability stack, Go-based services and more.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nCalhoun Black Friday – Go Time co-host Jon Calhoun is having a Black Friday sale on November 21st-29th. All paid courses will be 50% OFF. Learn more about Jon’s courses at calhoun.io/courses\n\n    \nFeaturing\nNishant Roy – Twitter, GitHub, LinkedIn\nJohnny Boursiquot – Twitter, GitHub, Website\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/257",
          "publishedOn": "2022-11-24T15:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 257: How Pinterest delivers software at scale",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/257/go-time-257.mp3",
            "length": "52760690",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJ37",
          "author": "Abdulfatai Popoola",
          "description": "A team without a proven observability strategy will invariably suffer from reactive disruptions; mitigating outages will be painful, like finding a needle in a haystack while blindfolded. This post describes a battle-proven strategy for ensuring full observability coverage.\nDiscuss on Changelog News",
          "link": "https://abdulapopoola.com/2022/11/16/why-most-monitoring-strategies-fail/",
          "publishedOn": "2022-11-24T14:50:00.000Z",
          "wordCount": null,
          "title": "Why most monitoring strategies fail",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwql",
          "author": "Jerod Santo",
          "description": "Why another file manager? I wanted something simple and minimalistic. Something to help me with faster navigation in the filesystem; a cd and ls replacement. So I build “llama”. It allows for quick navigation with fuzzy searching. cd integration is quite simple. And you can open vim right from the llama. That’s it. As simple and dumb as a llama.\n\nDiscuss on Changelog News",
          "link": "https://github.com/antonmedv/llama",
          "publishedOn": "2022-11-23T18:42:00.000Z",
          "wordCount": null,
          "title": "Llama — a terminal file manager",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1857",
          "author": null,
          "description": "For our  last 2022 Kaizen episode, we went all out:\n💪 @jerod outdid himself in the number of improvements shipped between Kaizens\n🕺 A few of our listeners contributed → prompted us to create a new contributing guide\n🗺 We now have a new infrastructure diagram\nAll of this, and a whole lot more, is captured as GitHub discussion 🐙 changelog.com#433. If you want to see everything that we improved, that is a great companion to this episode.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nGerhard Lazu – Twitter, GitHub, Website\nNotes and Links\nAll episode notes are in GitHub discussion changelog.com#433. Feel free to add your thoughts / questions!\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/shipit/80",
          "publishedOn": "2022-11-23T16:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 80: Kaizen! 24 improvements & a lot more",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/80/ship-it-80.mp3",
            "length": "66344399",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlj3",
          "author": "Jerod Santo",
          "description": "An interesting idea from Gustav Westling…\nOne of the things that I like to do in my projects, is to make the git history as linear as possible.\nUsually this means to rebase commits onto the main branch, but it can also mean to only allow merges in one direction, from feature branches into main, never the other way around. It kind of depends on the project.\nToday I’m taking this one step further, and I’m introducing a new concept: extremely linear git history.\nWith our extremely linear history, the first commit in a repo hash a hash that starts with 0000000, the second commit is 0000001, the third is 0000002, and so on!\nHow he accomplishes this is perhaps even more interesting (and hacky!)\n\nDiscuss on Changelog News",
          "link": "https://westling.dev/b/extremely-linear-git",
          "publishedOn": "2022-11-23T14:36:00.000Z",
          "wordCount": null,
          "title": "Introducing the extremely linear git history",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqbg",
          "author": "Austin Gil",
          "description": "I recently discovered an awesome tool called Coolify that calls itself an open-source Netlify or Heroku alternative that can be self-hosted. Gave it a whirl for my own personal projects and loved it, so I thought I’d share.\nDiscuss on Changelog News",
          "link": "https://austingil.com/automatically-deploy-from-git/",
          "publishedOn": "2022-11-22T22:32:00.000Z",
          "wordCount": null,
          "title": "Automatically deploy apps to a VPS with Git triggers & Coolify",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqy5",
          "author": "Jerod Santo",
          "description": "Kate Monica and the team at Tremendous have been doing this high-documentation, low-meeting work culture for awhile now, so she wrote up five discrete benefits that they’ve seen as a result of it.\nDiscuss on Changelog News",
          "link": "https://www.tremendous.com/blog/the-perks-of-a-high-documentation-low-meeting-work-culture",
          "publishedOn": "2022-11-22T21:46:00.000Z",
          "wordCount": null,
          "title": "The perks of a high-documentation, low-meeting work culture",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6r9Q",
          "author": "Jerod Santo",
          "description": "In a tweet, of all places:\nCome to @tumblr. We’ll add activitypub for interconnect. Don’t stress.\nThis is exactly the kind of adoption necessary for the Fediverse to really take off. its_happening.gif?\nDiscuss on Changelog News",
          "link": "https://twitter.com/photomatt/status/1594587024245260289",
          "publishedOn": "2022-11-22T20:59:00.000Z",
          "wordCount": null,
          "title": "Matt Mullenweg says Tumblr will support ActivityPub",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5j1r",
          "author": "Jerod Santo",
          "description": "Matthew Tejo:\nTwitter supposedly lost around 80% of its work force. What ever the real number is, there are whole teams with out engineers on it now. Yet, the website goes on and the tweets keep coming. This left a lot wondering what exactly was going on with all those engineers and made it seem like it was all just bloat. I’d like to explain my little corner of Twitter (though it wasn’t so little) and some of the work that went on that kept this thing running.\nThis is a detailed post about Twitter’s caching system that Matthew and others built while working there, and it’s brilliantly summed up by commenter Johnny Manu40:\nWhen everything works fine, they wonder why they hired you. When everything stops working, they wonder why they hired you. I.T. in a nutshell.\nDiscuss on Changelog News",
          "link": "https://matthewtejo.substack.com/p/why-twitter-didnt-go-down-from-a",
          "publishedOn": "2022-11-22T20:13:00.000Z",
          "wordCount": null,
          "title": "Why Twitter didn’t go down (from a real Twitter SRE)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LWOA",
          "author": "Jerod Santo",
          "description": "Christoffer Ekeroth:\nI’ve become convinced that “little languages”—small languages designed to solve very specific problems—are the future of programming, particularly after reading Gabriella Gonzalez’s The end of history for programming and watching Alan Kay’s Programming and Scaling talk.\nExamples of “little languages” include SQL and regular expressions. In the old days we called these DSLs, but the author argues that term has become overloaded and I have a hard time disagreeing with that.\nDiscuss on Changelog News",
          "link": "https://chreke.com/little-languages.html",
          "publishedOn": "2022-11-21T20:49:00.000Z",
          "wordCount": null,
          "title": "Little languages are the future of programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1938",
          "author": null,
          "description": "Matt Healy says your next smart device is a $30 Kindle, Changelog sets up an instance as Mastodon takes off, Anurag Bhagsain puts OpenAI’s GPT-3 in your CLI, Kirill Rogovoy argues that no architecture is better than bad architecture & we talk to Mish Manners at All Things Open 2022.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMish Manners – Twitter, GitHub, LinkedIn\nJerod Santo – Twitter, GitHub\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSubscribe to Changelog Weekly!\nYour next smart home device is a $30 used Kindle\nChangelog’s Mastodon instance\n\nEugen Rochko on The Changelog\ngithub.com/tmm1/flyapp-mastodon\ngithub.com/thechangelog/changelog.social\nGPT-3 Powered CLI\nNo architecture is better than bad architecture\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-11-21",
          "publishedOn": "2022-11-21T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Kindle as a smart device, Changelog on Mastodon, GPT-3 up in your CLI, no arch better than bad arch & Mish Manners",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-11-21/the-changelog-news-2022-11-21.mp3",
            "length": "20570818",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/491E",
          "author": "Jerod Santo",
          "description": "Homebrew creator Max Howell is back with a brand new invention:\ntea is a standalone, binary download for all platforms that puts the entire open source ecosystem at your fingertips. Casually and effortlessly use the latest and greatest or the oldest and most mature from any layer of any stack. Break down the silos between programming communities, throw together scripts that use entirely separate tools and languages and share them with the world with a simple one-liner.\nAll you need is tea.\nBold! I love how many interesting ideas are packed in to this project: pipelines, universal virtual-env, executable markdown… the list goes on. Check out the README for all the deets. My big question is: might Max and the team be thinking too big this time around?\nDiscuss on Changelog News",
          "link": "https://github.com/teaxyz/cli",
          "publishedOn": "2022-11-21T15:01:00.000Z",
          "wordCount": null,
          "title": "tea is not a package manager. tea is unified packaging infrastructure",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1933",
          "author": null,
          "description": "This week we’re taking you to the hallway track of All Things Open 2022 in Raleigh, NC. Let’s set the stage, here’s what we like do when we go to conferences — we setup our podcast studio at our booth where all the other vendors are and we talk to everyone we can. We give out t-shirts, stickers, pins, high fives…and it’s a blast.\nToday’s anthology episode from ATO features: Arun Gupta (VP and GM of Open Ecosystem Initiatives at Intel), long-time friend Chad Whitacre (Head of Open Source at Sentry), and Ricardo Sueiras (Principal Advocate in Open Source at AWS)\nThe common denominator for each of these conversations is advocating for and supporting open source. Special thanks to Todd Lewis and team for inviting us to come back to ATO. We enjoyed meeting long time fans and new ones too.\nDiscu…",
          "link": "https://changelog.com/podcast/515",
          "publishedOn": "2022-11-18T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 515: ANTHOLOGY — Advocating for and supporting open source",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/515/the-changelog-515.mp3",
            "length": "73597205",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1888",
          "author": null,
          "description": "KBall and Boneskull dive deep with Paloma Oliveira on the cultural and social consequences of open source software, explore her background in arts and government-supported open source, and discuss practical approaches to change the culture of open source towards more sustainability.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nPaloma Oliveira – Twitter, GitHub\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/252",
          "publishedOn": "2022-11-18T18:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 252: Gremlins in the water",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/252/js-party-252.mp3",
            "length": "59018507",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1848",
          "author": null,
          "description": "In your company, who designs the end-to-end developer experience? From design to implementation, what is the developer experience that you actually ship? Even though the average developer wastes almost half of their working hours because of bad DX, many of us don’t even know what that means, or how to improve it.\nKenneth Auchenberg is working at Stripe, building economic infrastructure for the internet. Gerhard found his perspective on Developer Experience Infrastructure (DXI) refreshingly simple, as well as very useful.\nDiscuss on Changelog News\nChangelog++ members save 2 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nFeaturing\nKenneth Auchenberg – Twitter, GitHub, LinkedIn, Website\nGerhard Lazu – Twitter, GitHub, Website\nNotes and Links\nThe tweet that started this episode\n📝 Developer Experience Infrastructure (DXI)\nThe Radiating Circles of DX Architecture - How to design an end to end developer journey - Shawn “swyx” Wang\nDeveloper Experience is the new hot thing, and we now see many existing teams re-labeled as Dev Experience. What does DX really mean, and what is the relationship between developer relations, advocacy, DX, and product teams?\n@auchenberg Twitter 🧵\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/shipit/79",
          "publishedOn": "2022-11-18T18:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 79: Developer Experience Infrastructure (DXI)",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/79/ship-it-79.mp3",
            "length": "62861486",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/y7ye",
          "author": "Jerod Santo",
          "description": "Amazon CTO, Werner Vogels:\nToday, I am publishing the Distributed Computing Manifesto, a canonical document from the early days of Amazon that transformed the architecture of Amazon’s ecommerce platform. It highlights the challenges we were facing at the end of the 20th century, and hints at where we were headed.\n25 years later. This is super cool!\nDiscuss on Changelog News",
          "link": "https://www.allthingsdistributed.com/2022/11/amazon-1998-distributed-computing-manifesto.html",
          "publishedOn": "2022-11-18T16:10:00.000Z",
          "wordCount": null,
          "title": "The Distributed Computing Manifesto",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgkd",
          "author": "Jerod Santo",
          "description": "Elaine Atwell says all CTOs urgently need to answer the question: should I allow Copilot at my company?\nIf you haven’t already figured it out from the title, Elaine’s answer to that question is No. But that might not be the right answer for everyone. In this article, she goes over the case for and against Copilot, and how you can detect whether it’s already in use at your organization.\nDiscuss on Changelog News",
          "link": "https://www.kolide.com/blog/github-copilot-isn-t-worth-the-risk",
          "publishedOn": "2022-11-18T15:21:00.000Z",
          "wordCount": null,
          "title": "GitHub Copilot isn't worth the risk",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDAn",
          "author": "Jerod Santo",
          "description": "Kirill Rogovoy:\nIt took me several years to learn how to write code that scales to 10s of team members and a million lines of code. It took even more time to learn to write stupid code again.\n\nDiscuss on Changelog News",
          "link": "https://rogovoy.me/blog/no-architecture",
          "publishedOn": "2022-11-17T22:41:00.000Z",
          "wordCount": null,
          "title": "No architecture is better than bad architecture",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1865",
          "author": null,
          "description": "On a previous episode of Go Time we discussed binary bloat, and how the Go protocol buffer implementation is a big offender. In this episode we dive into the history of protocol buffers and gRPC, then we discuss how the protocol and the implementation can vary and lead to things like binary bloat.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nCalhoun Black Friday – Go Time co-host Jon Calhoun is having a Black Friday sale on November 21st-29th. All paid courses will be 50% OFF. Learn more about Jon’s courses at calhoun.io/courses\n\n    \nFeaturing\nAkshay Shah – Twitter, GitHub, LinkedIn, Website\nJon Calhoun – Twitter, GitHub, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nWhere Akshay works\nBuf’s gRPC implementation\nbufbuild/connect-go\nbufbuild/connect-web\nGoogle’s Protocol Buffers overview\ngRPC docs\nGoogle’s grpc-go\ngRPC benchmarks\ngRPC spec\nhand-write a gRPC handler in 7m\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/256",
          "publishedOn": "2022-11-17T18:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 256: gRPC & protocol buffers",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/256/go-time-256.mp3",
            "length": "72831339",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zDAP",
          "author": "Martin Heinz",
          "description": "Kubernetes v1.25 introduced Container Checkpointing API as an alpha feature. This provides a way to backup-and-restore containers running in Pods, without ever stopping them.\nThis feature is primarily aimed at forensic analysis, but general backup-and-restore is something any Kubernetes user can take advantage of.\nSo, let’s take a look at this brand-new feature and see how we can enable it in our clusters and leverage it for backup-and-restore or forensic analysis.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/85",
          "publishedOn": "2022-11-17T14:16:00.000Z",
          "wordCount": null,
          "title": "Kubernetes' brand new Checkpointing API lets you backup-and-restore containers without every stopping them",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1937",
          "author": null,
          "description": "Online platforms and their users are susceptible to a barrage of threats – from disinformation to extremism to terror. Daniel and Chris chat with Matar Haller, VP of Data at ActiveFence, a leader in identifying online harm – is using a combination of AI technology and leading subject matter experts to provide Trust & Safety teams with precise, real-time data, in-depth intelligence, and automated tools to protect users and ensure safe online experiences.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMatar Haller – GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nActiveFence\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/201",
          "publishedOn": "2022-11-16T17:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 201: Protecting us with the Database of Evil",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/201/practical-ai-201.mp3",
            "length": "46711802",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/QpVe",
          "author": "Andrew Ste",
          "description": "While obtaining a job internationally may seem daunting, this guide will walk you through all the steps you need to find and secure a developer job abroad.\nIn this article, I share how how to prepare your resume for getting a developer job abroad, how to search for international opportunities, application strategies, important considerations to make when applying, the do’s and don’ts of successful interviews, and more!\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/11/search-developer-job-abroad/",
          "publishedOn": "2022-11-16T16:39:00.000Z",
          "wordCount": null,
          "title": "How to search for a developer job abroad",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZopN",
          "author": "Jerod Santo",
          "description": "As the old saying goes, imitation is the sincerest form of flattery. In the software world, an open source alternative is the sincerest form of imitation. Well, Retool (a Changelog sponsor) can consider themselves flattered, because Openblocks sets out to do openly what they’ve been doing proprietarily. Here’s why:\nIt’s cumbersome to create a single app. You had to design user interfaces, write code in multiple languages and frameworks, and understand how all of that code works together.\nLow-code/No-code platforms are fast to get started with but quickly become unmaintainable and inflexible. This creates more problems than it solves.\nRetool-like solutions are great for their simplicity and flexibility, but they can also be limited in different ways compared to frameworks like React/Vue.\nOpenblocks wants to take a step forward. More specifically, Openblocks is\nAn all-in-one IDE to create internal or customer-facing apps.\nA place to create, build and share building blocks of web applications.\nA domain-specific language that UI-configurable block is the first-class citizen.\nDiscuss on Changelog News",
          "link": "https://github.com/openblocks-dev/openblocks",
          "publishedOn": "2022-11-16T15:52:01.000Z",
          "wordCount": null,
          "title": "Openblocks is an open source alternative to Retool",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/090release/",
          "author": null,
          "description": "Make driving chill... and experimental?",
          "link": "https://blog.comma.ai/090release/",
          "publishedOn": "2022-11-20T00:00:00.000Z",
          "wordCount": 2594,
          "title": "openpilot 0.9.0"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/helping-robots-learn-from-each-other/",
          "author": null,
          "description": "A look at how Transformers are helping robots become more useful.",
          "link": "https://blog.google/technology/ai/helping-robots-learn-from-each-other/",
          "publishedOn": "2022-12-13T15:00:00.000Z",
          "wordCount": 1505,
          "title": "Helping robots learn from each other"
        },
        {
          "id": "https://blog.google/outreach-initiatives/sustainability/startups-for-sustainable-development/",
          "author": null,
          "description": "Google's Startups for Sustainable Development program supports impact-driven startups who are building a more sustainable future.",
          "link": "https://blog.google/outreach-initiatives/sustainability/startups-for-sustainable-development/",
          "publishedOn": "2022-12-06T21:56:00.000Z",
          "wordCount": 1421,
          "title": "How startups can help build a sustainable future"
        },
        {
          "id": "https://blog.google/technology/ai/icad-partnership-breast-cancer-screening/",
          "author": null,
          "description": "Our partnership with iCAD Inc. marks the first time we are licensing our mammography AI model in clinical practice.",
          "link": "https://blog.google/technology/ai/icad-partnership-breast-cancer-screening/",
          "publishedOn": "2022-11-28T13:00:00.000Z",
          "wordCount": 1254,
          "title": "Partnering with iCAD to improve breast cancer screening"
        },
        {
          "id": "https://blog.google/technology/ai/using-ai-to-study-12-years-of-representation-in-tv/",
          "author": null,
          "description": "A new report from the Geena Davis Institute, Google Research and USC uses AI to analyze representation in media.",
          "link": "https://blog.google/technology/ai/using-ai-to-study-12-years-of-representation-in-tv/",
          "publishedOn": "2022-11-18T20:00:00.000Z",
          "wordCount": 1836,
          "title": "Using AI to study 12 years of representation in TV"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=20978",
          "author": "Daniel Stenberg",
          "description": "IDN, International Domain Names, is the concept that lets us register and use international characters in domain names, and by international we of course mean characters outside of the ASCII range. Recently I have fought some battles against IDN and IDN decoding so I felt this urge to write a lot of words about it … Continue reading IDN is crazy →",
          "link": "https://daniel.haxx.se/blog/2022/12/14/idn-is-crazy/",
          "publishedOn": "2022-12-14T07:59:28.000Z",
          "wordCount": 1932,
          "title": "IDN is crazy"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20904",
          "author": "Daniel Stenberg",
          "description": "In the 2021 movie Silk Road, at around 19:23-19:26 into the film we can see Ross Ulbricht, the lead character, write a program on his laptop that uses curl. A few seconds we get a look at the screen as Ross types on the keyboard and explains to the female character who says I didn’t … Continue reading curl sighting: Silk Road →",
          "link": "https://daniel.haxx.se/blog/2022/12/10/curl-sighting-silk-road/",
          "publishedOn": "2022-12-10T16:45:53.000Z",
          "wordCount": 653,
          "title": "curl sighting: Silk Road"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20828",
          "author": "Daniel Stenberg",
          "description": "This adventure started with an issue where a user pointed out that the libcurl function for base64 encoding actually would allocate a few bytes too many at times. That turned out to be true and we fixed it fairly quickly. As I glanced at that base64 encoder function that was still loaded and showing in … Continue reading Faster base64 in curl →",
          "link": "https://daniel.haxx.se/blog/2022/12/06/faster-base64-in-curl/",
          "publishedOn": "2022-12-06T07:58:05.000Z",
          "wordCount": 2160,
          "title": "Faster base64 in curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20657",
          "author": "Daniel Stenberg",
          "description": "I occasionally do talks about curl. In these talks I often include a few slides that say something abut curl’s coverage and presence on different platforms. Mostly to boast of course, but also to help explain to the audience how curl has manged to reach its ten billion installations. This is current incarnation of those … Continue reading 89 operating systems →",
          "link": "https://daniel.haxx.se/blog/2022/11/25/89-operating-systems/",
          "publishedOn": "2022-11-25T14:23:44.000Z",
          "wordCount": 1306,
          "title": "89 operating systems"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20238",
          "author": "Daniel Stenberg",
          "description": "tldr: we stick to C89 for now. The curl project builds on foundations that started in late 1996 with the tool named httpget. ANSI C became known as C89 In 1996 there were not too many good alternatives for making a small and efficient command line tool for doing Internet transfers. I am not saying … Continue reading Considering C99 for curl →",
          "link": "https://daniel.haxx.se/blog/2022/11/17/considering-c99-for-curl/",
          "publishedOn": "2022-11-17T09:34:25.000Z",
          "wordCount": 1280,
          "title": "Considering C99 for curl"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-12-13T12:17:39.710Z",
          "wordCount": 832,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-12-09T12:16:41.549Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-12-09T12:16:40.103Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-12-09T12:16:39.933Z",
          "wordCount": 1494,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2022-11-22T12:20:52.722Z",
          "wordCount": 2277,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-11-22T12:20:52.680Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-11-21T12:20:08.980Z",
          "wordCount": 1352,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-11-16T12:19:32.984Z",
          "wordCount": 1272,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-11-16T12:19:32.084Z",
          "wordCount": 887,
          "title": "Data Quality Automation at Twitter"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/12/exploiting-CVE-2022-42703-bringing-back-the-stack-attack.html",
          "author": null,
          "description": "Seth Jenkins, Project Zero\n\nThis blog post details an exploit for CVE-2022-42703 (P0 issue 2351 - Fixed 5 September 2022), a bug Jann Horn found in the Linux kernel's memory management (MM) subsystem that leads to a use-after-free on struct anon_vma. As the bug is very complex (I certainly struggle to understand it!), a future blog post will describe the bug in full. For the time being, the issue tracker entry, this LWN article explaining what an anon_vma is and the commit that introduced the bug are great resources in order to gain additional context.\nSetting the scene\nSuccessfully triggering the underlying vulnerability causes folio->mapping to point to a freed anon_vma object. Calling madvise(..., MADV_PAGEOUT)can then be used to repeatedly trigger accesses to the freed anon_vma in foli…",
          "link": "https://googleprojectzero.blogspot.com/2022/12/exploiting-CVE-2022-42703-bringing-back-the-stack-attack.html",
          "publishedOn": "2022-12-08T19:04:00.000Z",
          "wordCount": 2498,
          "title": "Exploiting CVE-2022-42703 - Bringing back the stack attack"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/11/mind-the-gap.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=OPeqXG-QxW3ZD8BtmPikfA');.lst-kix_9apzkelodq30-0>li:before{content:\"\\0025cf  \"}ul.lst-kix_9apzkelodq30-6{list-style-type:none}ul.lst-kix_9apzkelodq30-7{list-style-type:none}ul.lst-kix_9apzkelodq30-4{list-style-type:none}ul.lst-kix_9apzkelodq30-5{list-style-type:none}ul.lst-kix_9apzkelodq30-2{list-style-type:none}ul.lst-kix_9apzkelodq30-3{list-style-type:none}ul.lst-kix_9apzkelodq30-0{list-style-type:none}.lst-kix_9apzkelodq30-6>li:before{content:\"\\0025cf  \"}ul.lst-kix_9apzkelodq30-1{list-style-type:none}.lst-kix_9apzkelodq30-5>li:before{content:\"\\0025a0  \"}.lst-kix_9apzkelodq30-3>li:before{content:\"\\0025cf  \"}.lst-kix_9apzkelodq30-7>li:before{content:\"\\0025cb  \"}.lst-kix_9apzkelodq30-4>li:before{content:\"\\0025cb  \"}.lst-kix_9a…",
          "link": "https://googleprojectzero.blogspot.com/2022/11/mind-the-gap.html",
          "publishedOn": "2022-11-22T21:05:00.000Z",
          "wordCount": 1076,
          "title": "Mind the Gap"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47943",
          "author": "Francesca Minelli",
          "description": "A product is first an idea, then a project, and then a prototype. Here, at Mozilla, our awesome community is there every step of the way to support and contribute to our products. None of what we do would be possible without this multicultural, multilingual community of like-minded people working together to be a better internet. \nThe post How the Mozilla Community helps shape our products appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/12/how-the-mozilla-community-helps-to-shape-our-products/",
          "publishedOn": "2022-12-07T18:48:54.000Z",
          "wordCount": 1314,
          "title": "How the Mozilla Community helps shape our products"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47935",
          "author": "Gabriele Svelto",
          "description": "We break down how we reduced Firefox out-of-memory crashes on Windows with a simple trick. Poorly behaving web pages and apps are no longer capable of crashing the browser by exhausting memory.\nThe post Improving Firefox stability with this one weird trick appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/11/improving-firefox-stability-with-this-one-weird-trick/",
          "publishedOn": "2022-11-22T14:16:56.000Z",
          "wordCount": 1210,
          "title": "Improving Firefox stability with this one weird trick"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": null,
      "articles": [
        {
          "id": "https://github.blog/?p=69113",
          "author": "John Swanson",
          "description": "GitHub will require all users who contribute code on GitHub.com to enable one or more forms of two-factor authentication (2FA) by the end of 2023. Learn more about our approach, when we’ll begin our rollout, and what you can expect as we begin requiring 2FA.",
          "link": "https://github.blog/2022-12-14-raising-the-bar-for-software-security-next-steps-for-github-com-2fa/",
          "publishedOn": "2022-12-14T17:00:15.000Z",
          "wordCount": 1149,
          "title": "Raising the bar for software security: next steps for GitHub.com 2FA"
        },
        {
          "id": "https://github.blog/?p=69101",
          "author": "Lindsey Wild",
          "description": "GitHub’s search inputs have several complex accessibility considerations. Let’s dive into what those are, how we addressed them, and talk about the standalone, reusable component that was ultimately built.",
          "link": "https://github.blog/2022-12-13-creating-an-accessible-search-experience-with-the-querybuilder-component/",
          "publishedOn": "2022-12-13T16:08:24.000Z",
          "wordCount": 2177,
          "title": "Creating an accessible search experience with the QueryBuilder component"
        },
        {
          "id": "https://github.blog/?p=69083",
          "author": "Taylor Blau",
          "description": "Another new release of Git is here to end the year! Take a look at some of our highlights on what's new in Git 2.39.",
          "link": "https://github.blog/2022-12-12-highlights-from-git-2-39/",
          "publishedOn": "2022-12-12T15:50:38.000Z",
          "wordCount": 1941,
          "title": "Highlights from Git 2.39"
        },
        {
          "id": "https://github.blog/?p=68917",
          "author": "Michelle Mannering",
          "description": "Before you say it, yes, the October Release Radar was supposed to be shared in November. But with Hackatoberfest, GitHub Universe, Turkey Day, and in real life (IRL) conferences returning to their pre-COVID frequency, we’ve all been so busy. And our community has been hustling to ship all kinds of open source projects. We wanted […]",
          "link": "https://github.blog/2022-12-09-release-radar-october-2022/",
          "publishedOn": "2022-12-09T19:00:32.000Z",
          "wordCount": 1260,
          "title": "Release Radar · October 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=69029",
          "author": "Natalie Somersall",
          "description": "How much does it really cost to buy more powerful cloud compute resources for development work? A lot less than you think.",
          "link": "https://github.blog/2022-12-08-experiment-the-hidden-costs-of-waiting-on-slow-build-times/",
          "publishedOn": "2022-12-08T18:00:02.000Z",
          "wordCount": 1984,
          "title": "Experiment: The hidden costs of waiting on slow build times"
        },
        {
          "id": "https://github.blog/?p=69019",
          "author": "Karen Bella",
          "description": "We delivered two different courses specifically designed to help students in the lowest-income neighborhood of Montevideo, Uruguay learn how to use GitHub and understand the value of open source.",
          "link": "https://github.blog/2022-12-08-git-commit-uruguay-lowering-barriers-to-make-software-development-more-inclusive-and-diverse/",
          "publishedOn": "2022-12-08T17:00:06.000Z",
          "wordCount": 859,
          "title": "Git Commit Uruguay: Lowering barriers to make software development more inclusive and diverse"
        },
        {
          "id": "https://github.blog/?p=68995",
          "author": "Inbal Shani",
          "description": "GitHub is in an exciting phase of our journey as the developer community grows significantly every day, and the needs of the community grow and change with it. Today we’re introducing our new Chief Product officer.",
          "link": "https://github.blog/2022-12-08-hello-from-githubs-new-chief-product-officer/",
          "publishedOn": "2022-12-08T16:59:59.000Z",
          "wordCount": 646,
          "title": "Hello from GitHub’s new Chief Product Officer"
        },
        {
          "id": "https://github.blog/?p=68972",
          "author": "Shuyin Zhao",
          "description": "GitHub Copilot for Business is officially here with simple license management, organization-wide policy controls, and industry-leading privacy—all for $19 USD per user per month.",
          "link": "https://github.blog/2022-12-07-github-copilot-is-generally-available-for-businesses/",
          "publishedOn": "2022-12-07T17:34:23.000Z",
          "wordCount": 1139,
          "title": "GitHub Copilot is generally available for businesses"
        },
        {
          "id": "https://github.blog/?p=68986",
          "author": "Jakub Oleksy",
          "description": "In November, we experienced two incidents that resulted in degraded performance across GitHub services. This report also sheds light into an incident that impacted Codespaces in October.",
          "link": "https://github.blog/2022-12-07-github-availability-report-november-2022/",
          "publishedOn": "2022-12-07T17:00:37.000Z",
          "wordCount": 1190,
          "title": "GitHub Availability Report: November 2022"
        },
        {
          "id": "https://github.blog/?p=68998",
          "author": "Monish Mohan",
          "description": "Now you can create tokens with fine-grained permissions for automating your publishing and organization management workflows. And a new code explorer allows you to view content of a package directly in the npm portal.",
          "link": "https://github.blog/2022-12-06-new-npm-features-for-secure-publishing-and-safe-consumption/",
          "publishedOn": "2022-12-06T17:42:23.000Z",
          "wordCount": 1360,
          "title": "New npm features for secure publishing and safe consumption"
        },
        {
          "id": "https://github.blog/?p=68893",
          "author": "Laura Lindeman",
          "description": "Catch up on everything we announced and see what else happened during this year’s GitHub Universe conference that took place November 9-10.",
          "link": "https://github.blog/2022-12-05-icymi-a-look-back-at-github-universe-2022/",
          "publishedOn": "2022-12-05T19:11:50.000Z",
          "wordCount": 1101,
          "title": "ICYMI: A look back at GitHub Universe 2022"
        },
        {
          "id": "https://github.blog/?p=68912",
          "author": "Ed Summers",
          "description": "We just published our vision for GitHub accessibility at accessibility.github.com. Here’s the TL;DR: the prime directive of the GitHub accessibility program is to empower people with disabilities to build cool technology.",
          "link": "https://github.blog/2022-12-02-github-accessibility-and-the-disability-divide/",
          "publishedOn": "2022-12-02T17:44:01.000Z",
          "wordCount": 872,
          "title": "GitHub, accessibility, and the disability divide"
        },
        {
          "id": "https://github.blog/?p=68865",
          "author": "Tobias Ahlin",
          "description": "Learn how to use and express yourself with GitHub’s open source variable fonts, Mona Sans and Hubot Sans.",
          "link": "https://github.blog/2022-12-02-introducing-mona-sans-and-hubot-sans/",
          "publishedOn": "2022-12-02T16:16:15.000Z",
          "wordCount": 1338,
          "title": "Introducing Mona Sans and Hubot Sans"
        },
        {
          "id": "https://github.blog/?p=68849",
          "author": "Gwen Davis",
          "description": "AppSec expert Niroshan Rajadurai says putting developers at the center of everything will enable you to meet your security goals.",
          "link": "https://github.blog/2022-12-01-how-empowering-developers-helps-teams-ship-secure-software-faster/",
          "publishedOn": "2022-12-01T20:07:23.000Z",
          "wordCount": 1372,
          "title": "How empowering developers helps teams ship secure software faster"
        },
        {
          "id": "https://github.blog/?p=68433",
          "author": "Melody Mileski",
          "description": "Administrators, or enterprise owners, have the increased responsibility of managing their account and keeping it secure. We are excited to introduce what is new with enterprise accounts and what is coming soon.",
          "link": "https://github.blog/2022-12-01-an-enterprise-account-is-coming-to-all-enterprise-customers/",
          "publishedOn": "2022-12-01T17:00:07.000Z",
          "wordCount": 942,
          "title": "An enterprise account is coming to all Enterprise customers"
        },
        {
          "id": "https://github.blog/?p=68839",
          "author": "Tim Rogers",
          "description": "We’re introducing calendar-based versioning for our REST API, so we can keep evolving our API, whilst still giving integrators a smooth migration path and plenty of time to update their integrations.",
          "link": "https://github.blog/2022-11-28-to-infinity-and-beyond-enabling-the-future-of-githubs-rest-api-with-api-versioning/",
          "publishedOn": "2022-11-28T20:17:10.000Z",
          "wordCount": 1137,
          "title": "To infinity and beyond: enabling the future of GitHub’s REST API with API versioning"
        },
        {
          "id": "https://github.blog/?p=68806",
          "author": "Seth Juarez",
          "description": "Discover the exciting enhancements in GitHub that empower Machine Learning practitioners to do more.",
          "link": "https://github.blog/2022-11-22-exciting-new-github-features-powering-machine-learning/",
          "publishedOn": "2022-11-22T19:00:35.000Z",
          "wordCount": 1363,
          "title": "Exciting New GitHub Features Powering Machine Learning"
        },
        {
          "id": "https://github.blog/?p=68760",
          "author": "Martin Woodward",
          "description": "How is open source changing the world and impacting businesses? In this year's Octoverse report, we identified three big trends to watch.",
          "link": "https://github.blog/2022-11-17-octoverse-2022-10-years-of-tracking-open-source/",
          "publishedOn": "2022-11-17T19:56:26.000Z",
          "wordCount": 1306,
          "title": "Octoverse 2022: 10 years of tracking open source"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19782",
          "author": "Victor Campanha",
          "description": "Product Designers are responsible for designing solutions that leave a positive impact using thorough understanding of the clients' and the business's needs. Check out more about this career:\nThe post What is It like being a Product Designer at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/product-designer-at-nubank/",
          "publishedOn": "2022-12-14T15:59:20.000Z",
          "wordCount": 3452,
          "title": "What is It like being a Product Designer at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19842",
          "author": "Felipe Almeida - Machine Learning Engineer at Nubank",
          "description": "In this article we analyze lessons learned and best practices assembled from years of applying Machine Learning to real-life problems at Nubank.\nThe post Best Practices for Real-time Machine Learning: Alerting appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/best-practices-for-real-time-machine-learning-alerting/",
          "publishedOn": "2022-12-05T18:13:09.000Z",
          "wordCount": 4607,
          "title": "Best Practices for Real-time Machine Learning: Alerting"
        },
        {
          "id": "https://building.nubank.com.br/?p=19831",
          "author": "Daniela Grecco - Recruitment Analyst at Nubank",
          "description": "A step-by-step on how we select the best talents for our Product Team and how to be prepared for it. \nThe post What is the hiring process like for Product Managers at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/hiring-process-product-managers-at-nubank/",
          "publishedOn": "2022-12-02T20:00:20.000Z",
          "wordCount": 3976,
          "title": "What is the hiring process like for Product Managers at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19754",
          "author": "Maria Rodrigues - Analytics Engineer at Nubank",
          "description": "A look into the career of an Analytics Engineer at Nubank, the scope of work and the main expected skills in this field.\nThe post What is it like being an Analytics Engineer at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/analytics-engineer-at-nubank/",
          "publishedOn": "2022-11-30T13:32:13.000Z",
          "wordCount": 3512,
          "title": "What is it like being an Analytics Engineer at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19729",
          "author": "Carla Garcia - Content Designer at Nubank",
          "description": "Content Designers transform complex product concepts and research insights into stories that people can relate to. Check out more about this career!\nThe post What is it like being a Content Designer at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/content-designer-at-nubank/",
          "publishedOn": "2022-11-21T21:03:27.000Z",
          "wordCount": 3431,
          "title": "What is it like being a Content Designer at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19799",
          "author": "Nubank Editorial",
          "description": "He’s as disruptive as Nubank. He's a child-hearted genius. He's James Gosling, the creator of Java's original design, compiler and virtual machine.\nThe post A mind-blowing conversation with James Gosling, Java’s father appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/talk-james-gosling-java-at-nubank/",
          "publishedOn": "2022-11-21T01:10:40.000Z",
          "wordCount": 3791,
          "title": "A mind-blowing conversation with James Gosling, Java’s father"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-drsniper",
          "author": "HackerOne",
          "description": "What made you want to become an ambassador?  \nI love meeting and getting to know new people. Regarding cybersecurity, it is fun talking to peop",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-drsniper",
          "publishedOn": "2022-12-10T03:05:02.000Z",
          "wordCount": 1612,
          "title": "Ambassador Spotlight: DrSniper"
        },
        {
          "id": "https://hackerone.com/application-security/how-human-testers-improve-application-security",
          "author": "HackerOne",
          "description": "A suite of DevSecOps tools is available to automate reviews, audits, tests, and scans throughout the development pipeline, which have become standard",
          "link": "https://www.hackerone.com/application-security/how-human-testers-improve-application-security",
          "publishedOn": "2022-12-10T01:00:00.000Z",
          "wordCount": 859,
          "title": "How Human Testers Improve Application Security"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/ambassador-spotlight-emperor",
          "author": "HackerOne",
          "description": "Who are you?\nMy name is Raviraj; I'm from Gujarat, India. I go by the handle, Emperor. My handle came from an anime called \"Kuruko no Basuke.\" It r",
          "link": "https://www.hackerone.com/hackerone-community-blog/ambassador-spotlight-emperor",
          "publishedOn": "2022-12-01T15:23:25.000Z",
          "wordCount": 1477,
          "title": "Ambassador Spotlight: Emperor"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/creating-ctf-success-flag-hunt-bangladesh",
          "author": "HackerOne",
          "description": "About the CTF \nFlag Hunt 2022 CTF was the first ever two-stage event in Bangladesh, where the qualification round took place online among 159 te",
          "link": "https://www.hackerone.com/hackerone-community-blog/creating-ctf-success-flag-hunt-bangladesh",
          "publishedOn": "2022-11-30T02:15:59.000Z",
          "wordCount": 1034,
          "title": "Creating a CTF: The Success of Flag Hunt Bangladesh"
        },
        {
          "id": "https://hackerone.com/company-news/introducing-program-levels-hacker-friendly-practices-improve-program-results",
          "author": "Chris Evans",
          "description": "The ethical hacker community is one of the most powerful security resources available to any organization. We’ve worked with this community firsthand for the last decade and have witnessed their effectiveness and ingenuity. We’ve also learned a lot while helping organizations engage the world’s largest community of ethical hackers. \n\nToday, we’re pleased to announce a new tool to align your program with the state-of-the-art and signal your program maturity: Program Levels, a structured framework that lets programs level up by publicly committing to certain best practices.",
          "link": "https://www.hackerone.com/company-news/introducing-program-levels-hacker-friendly-practices-improve-program-results",
          "publishedOn": "2022-11-16T17:00:00.000Z",
          "wordCount": 1527,
          "title": "Introducing Program Levels: Hacker-friendly Practices that Improve Program Results"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/17440a9e141d",
          "author": "Netflix Technology Blog",
          "description": "by Jasmine Omeke, Obi-Ike Nwoke, Olek Gorajek",
          "link": "https://netflixtechblog.com/ready-to-go-sample-data-pipelines-with-dataflow-17440a9e141d?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-12-04T00:10:21.000Z",
          "wordCount": 3301,
          "title": "Ready-to-go sample data pipelines with Dataflow"
        },
        {
          "id": "https://medium.com/p/5b8d032da09c",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/for-your-eyes-only-improving-netflix-video-quality-with-neural-networks-5b8d032da09c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-17T21:08:00.000Z",
          "wordCount": null,
          "title": "For your eyes only: improving Netflix video quality with neural networks"
        },
        {
          "id": "https://medium.com/p/31c3fc14ae59",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/match-cutting-at-netflix-finding-cuts-with-smooth-visual-transitions-31c3fc14ae59?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-17T16:37:01.000Z",
          "wordCount": null,
          "title": "Match Cutting at Netflix: Finding Cuts with Smooth Visual Transitions"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": []
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}