{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2021/12/exploring-container-security-storage.html",
          "author": null,
          "description": "Posted by Fabricio Voznika and Mauricio Poppe, Google Cloud \nKubernetes Security is constantly evolving - keeping pace with enhanced functionality, usability and flexibility while also balancing the security needs of a wide and diverse set of use-cases.\nRecently, the GKE Security team discovered a high severity vulnerability that allowed workloads to have access to parts of the host filesystem outside the mounted volumes boundaries. Although the vulnerability was patched back in September we thought it would be beneficial to write up a more in-depth analysis of the issue to share with the community.\nWe assessed the impact of the vulnerability as described in vulnerability management in open-source Kubernetes and worked closely with the GKE Storage team and the Kubernetes Security Response …",
          "link": "http://security.googleblog.com/2021/12/exploring-container-security-storage.html",
          "publishedOn": "2021-12-02T20:00:00.000Z",
          "wordCount": 1307,
          "title": "Exploring Container Security: A Storage Vulnerability Deep Dive"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/6/1482",
          "author": null,
          "description": "Rich Harris joins Amal & Amelia for a Svelte deep-dive! What’s it all about? Why might you pick it over React and friends? What up with SvelteKit? Rich is working on it full-time now?! Will even more questions be answered?\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nAuth0 – The for developers, by developers identity platform built for the cloud era that secures billions of logins every year. Security, compliance, and industry standards are always up-to-date, plus devs are free to provide the login options their users want with the security their application demands. Make login Auth0’s problem. Not yours. Learn more at Auth0.com\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nRich Harris – Twitter, GitHub\nAmal Hussein – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nNotes and Links\nRich on The Changelog\nSratch for Developers\nLerna\nRush",
          "link": "https://changelog.com/jsparty/205",
          "publishedOn": "2021-12-10T17:40:00.000Z",
          "wordCount": null,
          "title": "JS Party 205: So much Sveltey goodness",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/205/js-party-205.mp3",
            "length": "66759392",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/rlWq",
          "author": "Jerod Santo",
          "description": "GitHub’s all new code search is in technology preview (sign up here for early access) and this 5-minute video does a great job of providing a rundown on how it works and why you’ll probably want to try it asap.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=UOIPBfPXkus",
          "publishedOn": "2021-12-10T15:21:00.000Z",
          "wordCount": null,
          "title": "Improving GitHub code search",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9OQJ",
          "author": "Jerod Santo",
          "description": "Check out the original RFC to find the genesis of this effort. Here’s the opening pitch:\nWe know there are huge costs and risks in introducing a new main language in the kernel. We risk dividing efforts and we increase the knowledge required to contribute to some parts of the kernel.\nMost importantly, any new language introduced means any module written in that language will be way harder to replace later on if the support for the new language gets dropped.\nNevertheless, we believe that, even today, the advantages of using Rust outweighs the cost. We will explain why in the following sections.\nGodspeed to everyone collaborating on what will surely be a massive, years-long undertaking.\nDiscuss on Changelog News",
          "link": "https://lkml.org/lkml/2021/12/6/461",
          "publishedOn": "2021-12-10T14:33:00.000Z",
          "wordCount": null,
          "title": "Experimental Rust support lands in the Linux kernel",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2509",
          "author": "Nora Jones",
          "description": "The meeting was supposed to be short. The incident seemed a straightforward case of human error by the new engineer.  Surely all they had to do was tell them not to do it again and move on, right?\nBut as the meeting went on, a series of perplexing questions began to be raised:\n“How did the new engineer have access to break this in the first place?”\n“What about our testing standards… How did they not catch this?”\n“Actually, the change shouldn’t have impacted this service!”\n“Luckily we were able to roll back quickly thanks to the instrumentation so-and-so wrote.”\n“Well so-and-so left last year, do other services have the same instrumentation?”\n“Wait! How are these 2 services even related?”\n“I’m not sure, so-and-so wrote this doc. It seems outdated and they’re no longer with this org.”\nA fami…",
          "link": "https://changelog.com/posts/incident-shouldnt-be-a-four-letter-word",
          "publishedOn": "2021-12-09T21:17:23.000Z",
          "wordCount": null,
          "title": "“Incident” shouldn’t be a four-letter word",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1535",
          "author": null,
          "description": "In this episode Dominic speaks with Jon about his experience transitioning to using a screen reader and learning to code without his vision. They discuss how some of the tooling works, things other developers can do to make their code more accessible for blind teammates, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Securely access any computing resource anywhere. Engineers and security teams can unify access to SSH servers, Kubernetes clusters, web applications, and databases across all environments. Try Teleport today in the cloud, self-hosted, or open source at goteleport.com\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nLinode – Get $100 in free credit to get started on Linode – Linode is our cloud of choice and the home of Changelog.com. Head to linode.com/changelog OR text CHANGELOG to 474747 to get instant access to that $100 in free credit.\n\n    \nFeaturing\nDominic St-Pierre – Twitter, Website\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\nHow A Blind Developer Uses Visual Studio\nOrca Screen Reader",
          "link": "https://changelog.com/gotime/209",
          "publishedOn": "2021-12-09T18:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 209: Coding Go in the blind",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/209/go-time-209.mp3",
            "length": "51409589",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pkqy",
          "author": "Ivan Nikolić",
          "description": "Webpack’s node-libs-browser was standard for bringing Node libraries to browsers (at least those which can be polyfilled), but it’s no longer maintained.\nMy version updates the original package with maintained versions of packages, adds support for Rollup, esbuild and Browserify, brings support for node: protocol, and much more.\nDiscuss on Changelog News",
          "link": "https://github.com/niksy/node-stdlib-browser",
          "publishedOn": "2021-12-09T16:48:00.000Z",
          "wordCount": null,
          "title": "Node standard library for the browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2ka",
          "author": "Jerod Santo",
          "description": "In the quest to explore language models and develop new ones, we trained a series of transformer language models of different sizes, ranging from 44 million parameters to 280 billion parameters.\nOur research investigated the strengths and weaknesses of those different-sized models, highlighting areas where increasing the scale of a model continues to boost performance – for example, in areas like reading comprehension, fact-checking, and the identification of toxic language. We also surface results where model scale does not significantly improve results — for instance, in logical reasoning and common-sense tasks.\nSometimes size matters, sometimes it doesn’t as much. Fascinating analysis.\n\nDiscuss on Changelog News",
          "link": "https://deepmind.com/blog/article/language-modelling-at-scale",
          "publishedOn": "2021-12-09T15:53:00.000Z",
          "wordCount": null,
          "title": "A 280 billion parameter language model named Gopher",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1479",
          "author": null,
          "description": "Tammer Saleh, founder of SuperOrbital and former VP of Engineering at Pivotal, is joining Gerhard to talk about table tennis, remote work, and challenges that teams have with K8s.\nSome years ago, both Tammer & Gerhard used to work in the same London office on CloudFoundry, and nowadays they are both into Kubernetes. Tammer and the SuperOrbital team are deeply experienced in this topic, and they help teams at companies like Bloomberg, Shopify, and federal U.S. agencies tackle hard Kubernetes and DevOps problems through engineering and training.\nWhy do companies need Kubernetes in the first place? Which are the right reasons for choosing it? Is Kubernetes a platform? Gerhard’s favourite: we are doing Kubernetes wrong, but it works better than when we were doing it right, so what’s up with th…",
          "link": "https://changelog.com/shipit/31",
          "publishedOn": "2021-12-08T19:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 31: Is Kubernetes a platform?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/31/ship-it-31.mp3",
            "length": "58715912",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/d3wj",
          "author": "Jerod Santo",
          "description": "When you start Vim with the --clean option, it shows up in “vanilla” mode. No plugins, no configuration, just back to the roots. I have collected a ton of configuration statements over the years, some of them dating from MS-DOS or Windows 3.1. Here is the deal: I will start from scratch to find a good starting-point configuration with just the plugins available in Fedora 35. Will I survive a week of coding? I’ll find out!\nHow Lukáš Zapletal dropped from 35 Vim plugins to just six.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/21/12/vanilla-vim-config",
          "publishedOn": "2021-12-08T19:33:00.000Z",
          "wordCount": null,
          "title": "Vanilla Vim is fun",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1527",
          "author": null,
          "description": "Today we’re bringing our appearance on DevDiscuss right here to The Changelog. Jerod and I guested their launch episode for Season 7 to talk about deeply human stories we’ve covered over the years on this podcast. For long-time listners this will be a trip down memory lane and for recent subscibers this will be a guided tour on some of our most impactful episodes. Special thanks to Ben Halpern and Christina Gorton for hosting us. Check out their show at dev.to/devdiscuss\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped data produced by sensor…",
          "link": "https://changelog.com/podcast/471",
          "publishedOn": "2021-12-08T18:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 471: Deeply human stories",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/471/the-changelog-471.mp3",
            "length": "53323511",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/036e",
          "author": "Jerod Santo",
          "description": "An excellent analysis of the age-old dependency management problem:\nAt this point, I hope the tension is pretty clear: on the one hand, it’s great to keep components small, simple, and composable. On the other hand, it’s terrible to bury yourself in a tangle of different packages, no matter how tiny they are. The Unix philosophy and killing your dependencies pull in opposite directions.\nBut the author doesn’t stop there. They also offer a potential solution, which shouldn’t be a surprise to anyone, requires a compromise.\nDiscuss on Changelog News",
          "link": "https://raku-advent.blog/2021/12/06/unix_philosophy_without_leftpad/",
          "publishedOn": "2021-12-08T14:50:00.000Z",
          "wordCount": null,
          "title": "Following the Unix philosophy without getting left-pad",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3qg",
          "author": "Jerod Santo",
          "description": "Highlights include built-in support for caching with Redis, more easily customizable forms and error lists, and standardizing Django’s timezone implementation to align with the Python standard library’s implementation. for the full list of goodies, check the release notes. Congrats to the entire Django team and community on the big release!\nSide note: we haven’t done an episode on Django for many moons. Are we due? Who’d be the perfect guest you’d love to hear from on the topic?\nDiscuss on Changelog News",
          "link": "https://www.djangoproject.com/weblog/2021/dec/07/django-40-released/",
          "publishedOn": "2021-12-07T17:01:00.000Z",
          "wordCount": null,
          "title": "Django 4.0 released",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1545",
          "author": null,
          "description": "This episode is a follow up to our recent Fully Connected show discussing federated learning. In that previous discussion, we mentioned Flower (a “friendly” federated learning framework). Well, one of the creators of Flower, Daniel Beutel, agreed to join us on the show to discuss the project (and federated learning more broadly)! The result is a really interesting and motivating discussion of ML, privacy, distributed training, and open source AI.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipeline. Connect your whole customer data stack. Warehouse-first, open source Segment alternative.\n\n    \nMe, Myself, and AI – A podcast on artificial intelligence and business produced by MIT Sloan Management Review and Boston Consulting Group. Each episode, Sam Ransbotham and Sheervin Khodabandeh talk to AI leaders from organizations like Nasdaq, Spotify, Starbucks, and IKEA. Me, Myself, and AI is available wherever you get your podcasts. Just search Me, Myself, and AI.\n\n    \nFeaturing\nDaniel Beutel – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nOur FC episode on federated learning\nFlower\nFlower Blog\nFlower Conference (with videos)",
          "link": "https://changelog.com/practicalai/160",
          "publishedOn": "2021-12-07T16:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 160:  Friendly federated learning 🌼",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/160/practical-ai-160.mp3",
            "length": "45557406",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/4EXQ",
          "author": "Jerod Santo",
          "description": "Slashbase is an open-source collaborative IDE for your databases in your browser. Connect to your database, browse data, run a bunch of SQL commands or share SQL queries with your team, right from your browser!\nIt’s written in Golang and Nextjs React Framework (SPA) and runs as a single Linux binary with PostgreSQL. Documentation is currently WIP.\nIt’s early days and security will be a major concern to get right, but this has a lot of potential to unlock some cool use cases.\nDiscuss on Changelog News",
          "link": "https://github.com/slashbase/slashbase",
          "publishedOn": "2021-12-07T15:56:00.000Z",
          "wordCount": null,
          "title": "A collaborative IDE for your databases, right in your browser",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/q04w",
          "author": "Jerod Santo",
          "description": "Mitchell Hashimoto is partaking in Advent of Code this year and he’s added an extra facet to the challenge: implementing each solution with a single SQL statement.\nI’m not an expert at SQL (or PostgreSQL) by any means. One of the reasons I decided to use SQL was to regain some proficiency while also learning some new concepts. I expect that many of my solutions are suboptimal and there are likely much better ways (by various definitions) to reach the same answer. I’d love to hear about those (make an issue) but I won’t be merging any changes since this represents my approach.\nSounds like a fun challenge! But how does he find the time? By timeboxing each problem to just 30 minutes.\nDiscuss on Changelog News",
          "link": "https://github.com/mitchellh/advent-2021-sql",
          "publishedOn": "2021-12-07T15:04:00.000Z",
          "wordCount": null,
          "title": "Solving Advent of Code puzzles with PostgreSQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3b2",
          "author": "Jerod Santo",
          "description": "When your productivity takes a nosedive, it adds stress and anxiety, as you don’t have enough time to accomplish your goals and do what really matters to you. Understanding why your productivity is flailing will help you get back on track.\nThe idea is simple: ask “why” 5 times, until you get to the root cause of your issue. It’s not dissimilar to a kid who exasperates their parents by continually repeating “why”… but the benefits can be transformative!\n\nDiscuss on Changelog News",
          "link": "https://blog.superhuman.com/five-whys-method",
          "publishedOn": "2021-12-07T14:14:00.000Z",
          "wordCount": null,
          "title": "The \"5 whys\" productivity technique",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5zo",
          "author": "Adam Stacoviak",
          "description": "This hit my radar a few times in the past year – this week, and then most recently a few months back when we had Richard Hipp on The Changelog (again) – but, I didn’t post it to the newsfeed.\nHere’s what’s interesting about the SQLite test suite – it’s their secret sauce…the sustaining enablement of building a support business around SQLite. Here’s a direct quote from Richard Hipp in that episode.\nOriginally we thought we were gonna sell this and make money from it, and that’s how we were gonna support ongoing development. That didn’t really play out, nobody ever bought it. It does sort of become our business value, our intellectual property. I mean, you can take the SQLite code and fork it and start your own thing…but you don’t have the full test suite. You’ve got a lot of tests, but not all of them. So we’ve got a little bit of advantage over you there.\nClick here to play that episode from this quote.\nDiscuss on Changelog News",
          "link": "https://www.sqlite.org/testing.html",
          "publishedOn": "2021-12-06T22:53:11.000Z",
          "wordCount": null,
          "title": "How SQLite is tested",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8Ozj",
          "author": "Adam Stacoviak",
          "description": "If you’re a fan of Easter eggs in software, you won’t find them in the curl codebase. Daniel explains, “There are no Easter eggs in curl. For the good.” The parimary reason is “trust,” but also to not waste time and effort on “useless work.”\nIf we would allow an Easter egg to get merged, we would soon start getting improvements to the egg code and people would like to add more eggs and to change the existing one. We would spend time and effort on the silly parts and we would need to spend testing and energy on these jokes instead of the real thing. We already have enough work without adding irrelevant work to the pile.\nGiven the massive usage of curl, I agree with the all business approach that Daniel desires and promises.\nDiscuss on Changelog News",
          "link": "https://daniel.haxx.se/blog/2021/12/06/no-easter-eggs-in-curl/",
          "publishedOn": "2021-12-06T17:22:01.000Z",
          "wordCount": null,
          "title": "There are \"no easter eggs in curl\"",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N5XO",
          "author": "Jerod Santo",
          "description": "In Firefox 95, we’re shipping a novel sandboxing technology called RLBox that makes it easy and efficient to isolate subcomponents to make the browser more secure. This technology opens up new opportunities beyond what’s been possible with traditional process-based sandboxing…\nTurns out using WebAssembly to isolate potentially-buggy code is a pretty big win:\nGoing forward, we can treat these modules as untrusted code, and — assuming we did it right — even a zero-day vulnerability in any of them should pose no threat to Firefox.\nDiscuss on Changelog News",
          "link": "https://hacks.mozilla.org/2021/12/webassembly-and-back-again-fine-grained-sandboxing-in-firefox-95/",
          "publishedOn": "2021-12-06T16:29:00.000Z",
          "wordCount": null,
          "title": "Fine-grained sandboxing in Firefox 95",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/n7ZG",
          "author": "Jerod Santo",
          "description": "Jacob Kaplan-Moss, who has been writing a lot about good interview questions and how to hire well:\nWork sample tests are an exercise, a simulation, a small slice of real day-to-day work that we ask candidates to perform. They’re practical, hands-on, and very close or even identical to actual tasks the person would perform if hired. They’re also small, constrained, and simplified enough to be fair to include in a job selection process.\nTo give you a more concrete idea of what I’m talking about, here are several examples of work sample tests I’ve used…\nAnd just in case you think he’s prescribing whiteboarding…\nHowever, work sample tests are also a minefield: the space is littered with silly practices like whiteboarding, FizzBuzz, Leetcode, and “reverse a linked list”-style bullshit. The point of this series is to separate these silly practices from the good ones and to give you a framework and several examples to use in your hiring rounds.\nDiscuss on Changelog News",
          "link": "https://jacobian.org/2021/nov/9/wst-intro/",
          "publishedOn": "2021-12-06T15:32:00.000Z",
          "wordCount": null,
          "title": "An introduction to work sample tests",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/YNDL",
          "author": "Jerod Santo",
          "description": "Zinc is a search engine that does full text indexing. It is a lightweight alternative to elasticsearch and runs in less than 100 MB of RAM. It uses bluge as the underlying indexing library.\nIt is very simple and easy to operate as opposed to elasticsearch which requires a couple dozen knobs to understand and tune.\nIt is a drop-in replacement for elasticsearch if you are just ingesting data using APIs and searching using kibana (Kibana is not supported with zinc. Zinc provides its own UI).\nDiscuss on Changelog News",
          "link": "https://github.com/prabhatsharma/zinc",
          "publishedOn": "2021-12-06T14:46:00.000Z",
          "wordCount": null,
          "title": "A lightweight alternative to Elasticsearch that requires minimal resources",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1498",
          "author": null,
          "description": "Salma Alam-Naylor joins us this week to share her thesis that JavaScript is best in moderation, and is a liability when creating performant, resilient, and accessible web applications. Salma says we’re drunk on JavaScript, and it’s time we learn how to leverage this powerful web primitive to enhance our web experiences, alongside HTML and CSS, instead of purely relying on JavaScript to completely run the show.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power thei…",
          "link": "https://changelog.com/jsparty/204",
          "publishedOn": "2021-12-03T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 204: JavaScript will kill you in the Apocalypse",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/204/js-party-204.mp3",
            "length": "64753624",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/AaW5",
          "author": "Jerod Santo",
          "description": "Simon Eskildsen (of napkin math) shares a word of warning about one possible decision-making trap:\nWhenever you find yourself arguing for improving infrastructure by yanking up complexity, you need to be very careful.\nHe applies this thinking to a common technical proposal of switching from a general-purpose RDBMS to a specialty database to account for growth and scale.\nI’m a proponent of mastering and abusing existing tools, rather than chasing greener pastures. The more facility you gain with first-principle reasoning and napkin math, the closer I’d wager you’ll inch towards this conclusion as well. A new system theoretically having better guarantees is not enough of an argument. Adding a new system to your stack is a huge deal and difficult to undo.\nDiscuss on Changelog News",
          "link": "https://sirupsen.com/trading-complexity",
          "publishedOn": "2021-12-03T14:28:00.000Z",
          "wordCount": null,
          "title": "Careful trading complexity for 'improvements'",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Gb06",
          "author": "Jerod Santo",
          "description": "This the best intro to zk proofs I’ve seen. She starts simple with a Where’s Waldo example and works her way up to Sudoku.\nIn cryptography, zero knowledge proofs let you convince me that you know something, or have done something, without revealing to me what your secret thing was.\nDiscuss on Changelog News",
          "link": "https://blog.goodaudience.com/understanding-zero-knowledge-proofs-through-simple-examples-df673f796d99",
          "publishedOn": "2021-12-03T13:20:00.000Z",
          "wordCount": null,
          "title": "Understanding zero-knowledge proofs through illustrated examples",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1542",
          "author": null,
          "description": "We’re prepping for our 4th annual state of the “log” episode where we look back at the year, discuss some of our favorite episodes as well as the most popular ones, and talk a bit about what we have in the works for 2022 and beyond.\nWe thought it’d be awesome to include some listener voices on the show! So, please share your favorite Changelog guests, topics, or a-ha moments you’ve had over the last year.\nIf you get your message included in the episode, we’ll send you a free t-shirt.\nIt doesn’t have to be super produced. Just pop open your Voice Memos app on your phone\nThen upload your audio to ~> changelog.fm/sotl\nWe’re recording the episode next week, so don’t sleep on the opportunity. We’d love to hear from you!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links",
          "link": "https://changelog.com/podcast/help-sotl-2021",
          "publishedOn": "2021-12-03T00:25:43.000Z",
          "wordCount": null,
          "title": "The Changelog Help make state of the \"log\" 2021 extra special!",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/help-sotl-2021/the-changelog-help-sotl-2021.mp3",
            "length": "1429726",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1543",
          "author": null,
          "description": "Here’s a bonus episode this week from our friends behind Me, Myself, and AI — a podcast on artificial intelligence and business, and produced by MIT Sloan Management Review and Boston Consulting Group. We partnered with them to help promote their awesome podcast.\nWe hand picked this full-length episode to share with you because of its focus on using technology as a force for good, something we’re very passionate about. This episode features, Paula Goldman, Chief Ethical and Humane Use Officer at Salesforce, and the conversation touches on some interesting topics around the role tech companies play in society at large.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nPaula Goldman – Twitter, LinkedIn, Website\nSam Ransbotham – Twitter\nShervin Khodabandeh – LinkedIn, Website\nNotes and Links\nSubscribe to Me, Myself, and AI on Apple Podcasts, Spotify, or Google Podcasts.",
          "link": "https://changelog.com/practicalai/takeover-mmai-304",
          "publishedOn": "2021-12-02T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI Technology as a force for good",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/takeover-mmai-304/practical-ai-takeover-mmai-304.mp3",
            "length": "38552316",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/73gd",
          "author": "Adam Stacoviak",
          "description": "This is super interesting to see bare metal Mac mini’s attached through Thunderbolt to the Amazon EC2 infrastructure. Really makes me wish I had a reason to use them. 😂\n\nDiscuss on Changelog News",
          "link": "https://aws.amazon.com/blogs/aws/use-amazon-ec2-m1-mac-instances-to-build-test-macos-ios-ipados-tvos-and-watchos-apps/",
          "publishedOn": "2021-12-02T18:18:10.000Z",
          "wordCount": null,
          "title": "EC2 M1 Mac instances",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1490",
          "author": null,
          "description": "We’ve talked several times about getting started with Go. But Go is already 12 years old! Let’s talk about how it all started, and hear about it from the people who were there from the beginning.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Securely access any computing resource anywhere. Engineers and security teams can unify access to SSH servers, Kubernetes clusters, web applications, and databases across all environments. Try Teleport today in the cloud, self-hosted, or open source at goteleport.com\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nEquinix Metal – If you want the choice and control of hardware…with low overhead…and the developer experience of the cloud – you need to check out Equinix Metal. Deploy in minutes across 18 global locations, from Silicon Valley to Sydney. Visit metal.equinix.com/justaddmetal and receive $100 credit to play.\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nMiki Tebeka – Twitter, GitHub, LinkedIn, Website\nRoger Peppe – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nThe free lunch is over\nThe C10K problem\nSelenium and Go’s bindings\nt.Parallel()\nPython’s asyncio\nGo Community Code of Conduct\nRoger talking about the acme editor in Dev Tool Time\nMiki was trying Clojure and Erlang before settling on Go",
          "link": "https://changelog.com/gotime/208",
          "publishedOn": "2021-12-02T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 208: Our first decade with Go",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/208/go-time-208.mp3",
            "length": "57940622",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/O2ga",
          "author": "Jerod Santo",
          "description": "ICYMI. (I miss it. Do you miss it?)\nDiscuss on Changelog News",
          "link": "https://github.com/Anarios/return-youtube-dislike",
          "publishedOn": "2021-12-02T16:18:00.000Z",
          "wordCount": null,
          "title": "A web extension that returns the YouTube dislike count",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/03le",
          "author": "Jerod Santo",
          "description": "Bryan Cantrill, announcing Hubris and Humility:\n… we found ourselves increasingly forcing existing systems out of the comfort of their design centers, we wondered: was our assumption of using an existing system wrong? Should we in fact be exploring our own de novo operating system? In particular, our colleague Cliff Biffle, who had a ton of experience with both Rust and embedded systems, had a vision for what such a system might look like (namely, the system that he had always wanted for himself!). Cliff dove into a sketch of his ideas, giving the nascent system a name that felt perfectly apt: Hubris.\nThere’s some serious innovation going on at Oxide and I can’t wait to see what they do next.\nDiscuss on Changelog News",
          "link": "https://oxide.computer/blog/hubris-and-humility",
          "publishedOn": "2021-12-02T15:26:00.000Z",
          "wordCount": null,
          "title": "An embedded OS all in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1500",
          "author": null,
          "description": "Today we’re joined by Jessica Lord, talking about the origins of Electron and her boomerang back to GitHub to lead GitHub Sponsors. We cover the early days of Electron before Electron was Electron, how she advocated to turn it into a product and make it a framework, how it’s used today, why she boomeranged back to GitHub to lead Sponsors, what’s next in funding open source creators, and we attempt to answer the question “what happens to open source once it’s funded?”\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped data produced by sensors, a…",
          "link": "https://changelog.com/podcast/470",
          "publishedOn": "2021-12-02T00:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 470: Returning to GitHub to lead Sponsors",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/470/the-changelog-470.mp3",
            "length": "95223099",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/maVj",
          "author": "Jerod Santo",
          "description": "When I was in college my professor tried teaching us regular expressions: the theory, the algebra, all that. I left dumbfounded. When I hit the Real World I quickly ran into many practical use cases where a regular expression helped me solve a problem. That’s when I finally grokked them.\nIf you want to improve your understanding (and deployment of) regular expressions to solve problems, but don’t have a use case at the moment… here’s a whole bunch of them for you to practice on in the meantime.\nDiscuss on Changelog News",
          "link": "https://github.com/learnbyexample/py_regular_expressions/tree/master/interactive_exercises",
          "publishedOn": "2021-12-01T19:04:00.000Z",
          "wordCount": null,
          "title": "Improve your Python regex skills with 75 interactive exercises",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1469",
          "author": null,
          "description": "This is our third Kaizen episode in which Adam, Jerod & Gerhard talk about GitOps the wrong way, ask questions with Honeycomb and realise that they must be holding the CDN wrong, and the effort that has been going into moving all changelog.com static files from regular volumes to an S3-like object store. If you like a good yak shake, listening to this one is a lot more fun than doing it.\nGerhard is most excited about the Ship It Christmas gifts that we have been preparing for you. While GitHub Codespaces is not going to be part of the upcoming Christmas special episode, today’s talk covers why investing in a Codespaces integration is worth it.\nChangelog #459 and Backstage #20 are related to this topic.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal,…",
          "link": "https://changelog.com/shipit/30",
          "publishedOn": "2021-12-01T17:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 30: Kaizen! Are we holding it wrong?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/30/ship-it-30.mp3",
            "length": "78311656",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bND9",
          "author": "Jerod Santo",
          "description": "The Evil Martians have been hard at work de-stressifying their Ruby on Rails deployments with a new tool: Kuby. In this post they share their journey getting there. It’s a lot. But in the end they seem happy with the results.\nKuby lowers the bar of adopting Kubernetes for Rails apps, leveraging the power of the convention-over-configuration principle. Just as Rails conquered the world with its “build a blog in 15 minutes” idea, so too could Kuby reign supreme in the context of deployment—”deploy Rails on Kubernetes in 15 minutes”.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/kubing-rails-stressless-kubernetes-deployments-with-kuby",
          "publishedOn": "2021-12-01T15:23:01.000Z",
          "wordCount": null,
          "title": "Stressless Rails deployments on K8s with Kuby",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2502",
          "author": "Ian Eyberg",
          "description": "Did you know Linux is approaching 30 years old? Did you know Unix is around 50 years old? I’m not knocking them — I’ve been using Linux since they were distributed on floppies. However, Unix was built for machines like the PDP-7 — you know, the kind that takes up an entire wall.\nThe PDP-7 - a minicomputer produced by Digital Equipment Corporation\n\nBut, have you ever wondered what an operating system built in 2022 would look like?\nToday, cloud infrastructure is so complex that devops/SRE folks are attracting salaries that sometimes exceed normal software engineers.\nCybersecurity is so insanely bad that there is at least one major data breach every single week now. If you look at illicit crypto miner bots that infect k8s clusters, they literally have code that hunts down other bots and kicks…",
          "link": "https://changelog.com/posts/the-big-idea-around-unikernels",
          "publishedOn": "2021-12-01T14:27:18.000Z",
          "wordCount": null,
          "title": "The big idea around unikernels",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3YnG",
          "author": "Jerod Santo",
          "description": "Milosz Danczak shares a principle that was surely born from years of painful experiences:\nWhen committing to a piece of software, favor those created by people who value backward compatibility.\nBut how can you tell if a piece of software is likely to remain stable? Milosz also provides some heuristics you can apply when evaluating a project.\nDiscuss on Changelog News",
          "link": "https://blog.sidebits.tech/life-is-too-short-to-depend-on-unstable-software/",
          "publishedOn": "2021-11-30T18:20:00.000Z",
          "wordCount": null,
          "title": "Life is too short to depend on unstable software",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pk4y",
          "author": "Jerod Santo",
          "description": "This question could be dismissed by saying that Nix and Docker are different tools that solve different problems. One is a toolkit for building and deploying containers and the other is a package and configuration manager. However, these tools do have some overlap: they can both be used to create reproducible environments.\nWhile both tools aim to solve this problem, they take different approaches.\nA solid rundown of the different approaches these two tools take, and how you might think about picking which one to use. Maybe you can have the best of both worlds?\nDiscuss on Changelog News",
          "link": "https://blog.replit.com/nix-vs-docker",
          "publishedOn": "2021-11-30T17:32:00.000Z",
          "wordCount": null,
          "title": "Will Nix overtake Docker?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/j5QW",
          "author": "Adam Stacoviak",
          "description": "As mentioned on Backstage #20, I’m automating a few rsync commands using cron and Cronitor to backup my “Production” files to the Storinator AV15 on the local network.\nIt turns out that cron on macOS is frowned upon in favor of launchd, but information on how to use all the power of launchd is sparse to say the least. This resource is the best I’ve found in learning all the parts of launchd and how to use it.\nAsk me anything in the comments, I’ll tell you everything I’ve learned.\nDiscuss on Changelog News",
          "link": "https://www.launchd.info/",
          "publishedOn": "2021-11-30T16:31:55.000Z",
          "wordCount": null,
          "title": "The best resource for launchd on macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1536",
          "author": null,
          "description": "Recently, GitHub released Copilot, which is an amazing AI pair programmer powered by OpenAI’s Codex model. In this episode, Natalie Pistunovich tells us all about Codex and helps us understand where it fits in our development workflow. We also discuss MLOps and how AI is influencing software engineering more generally.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipeline. Connect your whole customer data stack. Warehouse-first, open source Segment alternative.\n\n    \niMerit ML DataOps Summit – A FREE virtual event on December 2nd, 2021! iMerit is excited to gather 1000+ senior leaders at the forefront of deploying data solutions that power machine learning and artificial intelligence. Learn more and register to attend at imerit.net/dataops\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nNatalie Pistunovich – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nGitHub Copilot\nOpenAI Codex Beta\nPrevious GopherCon Workshop: Infrastructure for a Fraud Detection ML Application",
          "link": "https://changelog.com/practicalai/159",
          "publishedOn": "2021-11-30T14:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 159: AI-generated code with OpenAI Codex",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/159/practical-ai-159.mp3",
            "length": "44997669",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/q0Ww",
          "author": "Jerod Santo",
          "description": "Cate Huston with another great career-related post. Click through for explainers of each these 5 signs and a bonus 6th (meta) sign:\nYou’re not learning (and you want to be).\nYou’re learning coping mechanisms rather than skills.\nYou feel morally conflicted about hiring.\nYour job is affecting your confidence.\nYour job is affecting you physically.\nDiscuss on Changelog News",
          "link": "https://cate.blog/2021/11/29/5-signs-its-time-to-quit-your-job/",
          "publishedOn": "2021-11-29T21:33:00.000Z",
          "wordCount": null,
          "title": "5 signs it’s time to quit your job",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/VJD1",
          "author": "Jerod Santo",
          "description": "Richard MacManus answers a couple of his own questions after the announcement of the newly formed PHP Foundation:\nWhy is PHP still such a critical part of the web, when other programming languages and frameworks are seemingly more suited to the modern web? Second, what are the motivations behind the companies that have formed this new foundation?\nDid you know almost half of the top 10,000 websites on the internet use PHP?! That’s quite the footprint. I’m happy to hear PHP is still alive, kickin’, and continuing to evolve. The more tools we have to build awesome websites with, the better.\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/php-has-survived-for-26-years-because-it-keeps-evolving/",
          "publishedOn": "2021-11-29T20:04:00.000Z",
          "wordCount": null,
          "title": "PHP has survived for 26 years because it keeps evolving",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/yk5k",
          "author": "Jerod Santo",
          "description": "I’m still setting up my new rig and best-tools-for-markdown-based-workflows is on my mind. This one has a lot going for it: MIT licensed, theme-able, and feature-full.\nWhat do you use to edit .md files these days? Anything good enough to pull you out of your code editor?\n\nDiscuss on Changelog News",
          "link": "https://marktext.app/",
          "publishedOn": "2021-11-29T16:38:00.000Z",
          "wordCount": null,
          "title": "A cross-platform Markdown editor focused on speed and usability",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JL6q",
          "author": "Jerod Santo",
          "description": "Bozhidar Batsov on the sad state of Chrome’s web rendering hegemony:\nWe’ve gotten to the point that Chrome-based browsers are so common that developers just stopped to bother supporting other browsers… Soon Google are going to be in complete control of web standards, unless something drastically changes. Do you want the future of browsing to lie solely in the hands of the biggest advertising business on Earth? I’m pretty sure that I don’t.\nDiscuss on Changelog News",
          "link": "https://batsov.com/articles/2021/11/28/firefox-is-the-only-alternative/",
          "publishedOn": "2021-11-29T13:23:00.000Z",
          "wordCount": null,
          "title": "Firefox is the only browser alternative",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1503",
          "author": null,
          "description": "Liana Leahy tells Amal and KBall all about her journey from software engineer to product manager. Along the way we learn what a PM does, how to be great at it, how to know if it’s for you, why the role is in such demand these days, and much more. - It’s UNIX, I know this!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nAuth0 – The for developers, by developers identity platform built for the cloud era that secures billions of logins every year. Security, compliance, and industry standards are always up-to-date, plus devs are free to provide the login options their users want with the security their application demands. Make login Auth0’s problem. Not yours. Learn more at Auth0.com\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nLiana Leahy – Twitter, GitHub, LinkedIn, Website\nAmal Hussein – Twitter, GitHub\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links",
          "link": "https://changelog.com/jsparty/203",
          "publishedOn": "2021-11-26T18:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 203: From engineering to product",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/203/js-party-203.mp3",
            "length": "63361386",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNbm",
          "author": "Jerod Santo",
          "description": "Sonic outperforms other Go implementations on all JSON sizes. Here are the results on a large dataset. 👇\n\nDiscuss on Changelog News",
          "link": "https://github.com/bytedance/sonic",
          "publishedOn": "2021-11-26T17:00:00.000Z",
          "wordCount": null,
          "title": "A blazingly fast JSON serializing & deserializing library",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W37W",
          "author": "Jerod Santo",
          "description": "Blueboat aims to be a developer-friendly, multi-tenant platform for serverless web applications. A monolithic approach is followed: we try to implement features of commonly used libraries (in the web application context) natively in Rust to replace native Node addons, improve performance and reduce duplicated code. Blueboat’s architecture ensures the security of the platform, prevents code duplication and keeps the overhead low.\nDiscuss on Changelog News",
          "link": "https://github.com/losfair/blueboat",
          "publishedOn": "2021-11-26T16:03:00.000Z",
          "wordCount": null,
          "title": "An open source alternative to Cloudflare Workers",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1450",
          "author": null,
          "description": "Open Source and other source available projects have been a huge driver of progress in our industry, but building and maintaining an open source project is about a lot more than just writing the initial code and putting together a good README. On this episode of the maintenance mini-series, we’ll be discussing open source and the maintenance required to keep it going.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nLaunchDarkly / TrajectoryConf – Software powers the world. LaunchDarkly empowers all teams to deliver and control their software. DevOps and feature management are reimagining how we build and release new products. On November 9th and 10th, LaunchDarkly is hosting Trajectory Conference 2021 — a two-day…",
          "link": "https://changelog.com/gotime/207",
          "publishedOn": "2021-11-25T15:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 207: Maintenance in the open",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/207/go-time-207.mp3",
            "length": "66076614",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/4/1489",
          "author": null,
          "description": "This week Adam is joined by Zac Smith, Co-Founder of Packet and now running Equinix Metal. They talk about the early days of the internet infrastructure space, the beginnings of Packet, the “why” of bare metal, transitioning Packet from startup to global company overnight when they were acquired by Equinix, and how all this for Zac is 20 years in the making.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nAuth0 – The for developers, by developers identity platform built for the cloud era that secures billions of logins every year. Security, compliance, and industry standards are always up-to-date, plus devs are free to provide the login options their users want with the security their application demands. Make lo…",
          "link": "https://changelog.com/founderstalk/84",
          "publishedOn": "2021-11-24T19:30:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 84: Building on global bare metal",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/84/founders-talk-84.mp3",
            "length": "89190439",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1534",
          "author": null,
          "description": "We upgraded to the new MacBook Pro M1 Max and decided to share our first impressions of the new hardware, how we migrate data and settings from our old machines (or don’t), which apps were “instant installs” for each of us, which apps we’re trying to live without, and how we get our new machines set up for work and play. Nerd out with us!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nJerod mentions\niStat Menus\nSpark\nTransmit\nEspanso\nCopyClip\nAdam mentions\nSuperhuman\nDracula Pro\nAlfred\nOh My Zsh\n1Password",
          "link": "https://changelog.com/backstage/20",
          "publishedOn": "2021-11-24T18:00:00.000Z",
          "wordCount": null,
          "title": "Backstage 20: New Mac day!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/20/backstage-20.mp3",
            "length": "85016797",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Dzab",
          "author": "James Sinclair",
          "description": "Property-based tests give us more confidence in our code. They’re great at catching edge-cases we may not have thought of otherwise. But this confidence comes at a cost. Property tests take more effort to write. They force you to think hard about what the code is doing, and what its expected behaviour should be. It’s hard work. And on top of that, running 100+ tests is always going to take longer than running 3–5 example-based tests. This cost is real, and it raises the question:\nHow do we keep ourselves from over-specifying or writing unnecessary tests?\nDiscuss on Changelog News",
          "link": "https://jrsinclair.com/articles/2021/how-not-to-write-property-tests-in-javascript/",
          "publishedOn": "2021-11-24T17:41:00.000Z",
          "wordCount": null,
          "title": "How not to write property tests in JavaScript",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/o9MR",
          "author": "Jerod Santo",
          "description": "A fascinating look at the state of packaging apps for the Linux desktop:\nThe stability of the Linux desktop has dramatically improved in recent years. Core library developers are finally seeing the benefits of maintaining compatibility. Despite this, many developers are not interested in depending on a stable base of libraries for binary software. Instead, they have decided to ignore and override almost all libraries pre-installed on the user’s system.\nAnd why the author thinks Flatpak (which some believe is the future) is not the way to go.\nI am not a fan. I’m going to outline here some of the technical, security and usability problems with Flatpak and others. I’ll try to avoid addressing “fixable” problems (like theming) and instead focus on fundamental problems inherent in their design. I aim to convince you that these are not the future of desktop Linux apps.\nDiscuss on Changelog News",
          "link": "https://ludocode.com/blog/flatpak-is-not-the-future",
          "publishedOn": "2021-11-24T16:51:00.000Z",
          "wordCount": null,
          "title": "Flatpak is not the future of desktop Linux apps",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1468",
          "author": null,
          "description": "Zac Smith, managing director Equinix Metal, is sharing how Equinix Metal runs the best hardware and networking in the industry, why pairing magical software with the right hardware is the future, and what Open19 means for sustainability in the data centre. Think modular components that slot in (including CPUs), liquid cooling that converts heat into energy, and a few other solutions that minimise the impact on the environment.\nBut first, Zac tells us about the transition from Packet to Equinix Metal, his reasons for doing what he does, as well as the things that he is really passionate about, such as the most efficient data centres in the world and building for the love of it.\nThis is a great follow-up to episode 18 because it goes deeper into the reasons that make Gerhard excited about th…",
          "link": "https://changelog.com/shipit/29",
          "publishedOn": "2021-11-24T16:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 29: Find the infrastructure advantage",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/29/ship-it-29.mp3",
            "length": "64172925",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9O0Q",
          "author": "Jerod Santo",
          "description": "Josh Comeau:\nRecently, I’ve been using my own custom CSS reset. It includes all of the little tricks I’ve discovered to improve both the user experience and the CSS authoring experience.\nLike other CSS resets, it’s unopinionated when it comes to design / cosmetics. You can use this reset for any project, no matter the aesthetic you’re going for.\nIn this tutorial, we’ll go on a tour of my custom CSS reset. We’ll dig into each rule, and you’ll learn what it does and why you might want to use it!\nIt has 9 rules and unlike previous resets, the goal is not to create a ‘blank slate’ that is uniform across browsers. Josh walks/talks you through each rule and why they made the cut.\nDiscuss on Changelog News",
          "link": "https://www.joshwcomeau.com/css/custom-css-reset/",
          "publishedOn": "2021-11-24T14:29:00.000Z",
          "wordCount": null,
          "title": "A modern CSS reset",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1529",
          "author": null,
          "description": "In this Fully-Connected episode, Daniel and Chris ponder whether in-person AI conferences are on the verge of making a post-pandemic comeback.  Then on to BigScience from Hugging Face, a year-long research workshop on large multilingual models and datasets.  Specifically they dive into the T0, a series of natural language processing (NLP) AI models specifically trained for researching zero-shot multitask learning.  Daniel provides a brief tour of the possible with the T0 family.  They finish up with a couple of new learning resources.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipeline. Connect your whole customer data stack. Warehouse-first, open source Segment alternative.\n\n    \niMerit ML DataOps Summit – A FREE virtual event on December 2nd, 2021! iMerit is excited to gather 1000+ senior leaders at the forefront of deploying data solutions that power machine learning and artificial intelligence. Learn more and register to attend at imerit.net/dataops\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nInfoQ: BigScience Research Workshop Releases AI Language Model T0\nHugging Face: bigscience / T0pp\nMultitask Prompted Training Enables Zero-Shot Task Generalization\nIEEE Specturm:  How Deep Learning Works\n5 Deep Learning Activation Functions You Need to Know",
          "link": "https://changelog.com/practicalai/158",
          "publishedOn": "2021-11-24T03:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 158: Zero-shot multitask learning",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/158/practical-ai-158.mp3",
            "length": "45067935",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X68q",
          "author": "Stefan",
          "description": "What if we could contribute to a project without having to create a pull request? Imagine all we have to do is to create an issue. Yes, you can with GitHub Actions and the new GitHub Issue Forms. Let’s get to it!\n\nDiscuss on Changelog News",
          "link": "https://stefanbuck.com/blog/codeless-contributions-with-github-issue-forms",
          "publishedOn": "2021-11-23T21:33:00.000Z",
          "wordCount": null,
          "title": "Codeless contributions with a GitHub Issue Form",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P577",
          "author": "Jerod Santo",
          "description": "Building a modern front end in Django without reaching for a full-blown JavaScript framework. Choosing the right tools for the job, and bringing them into your project.\nThis is as close to a tutorial as you’ll see on Changelog News. I’m linking to it not for the step-by-step bits like talking to your “Django backend without a full-page reload”, but for the decision making bits like “when you might choose low-JavaScript.”\nDiscuss on Changelog News",
          "link": "https://www.saaspegasus.com/guides/modern-javascript-for-django-developers/htmx-alpine/",
          "publishedOn": "2021-11-23T20:41:00.000Z",
          "wordCount": null,
          "title": "Modern websites, JavaScript optional (Django + HTMX + Alpine)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Gb79",
          "author": "Jerod Santo",
          "description": "Eric Bailey’s take on CSS is certainly counter to the direction most are headed:\nHuman-friendly CSS is an interface that prioritizes people. It allows someone using your website or web app to easily make modifications to get what they need. This is huge because we can’t know who the person is, or what circumstances they’re experiencing.\nHumans reading/modifying your CSS may seem like an edge case, but it’s more common than you think:\nStylus on the Chrome Web Store has more than half a million users. Stylish has over three million. That’s a lot of people modifying the web to get what they want.\nHe goes on to point out that even if it weren’t that many people, it’s still worth considering for other reasons. Lots to ponder.\nDiscuss on Changelog News",
          "link": "https://ericwbailey.design/writing/your-css-is-an-interface/",
          "publishedOn": "2021-11-23T15:20:00.000Z",
          "wordCount": null,
          "title": "Your CSS is an interface",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eZjN",
          "author": "Jerod Santo",
          "description": "The much-anticipated (and admittedly much-hyped) full stack web framework for React has opened its source (MIT license) to the public. What’s interesting about Remix? Here’s some marketing copy from the homepage:\nRemix is a seamless server and browser runtime that provides snappy page loads and instant transitions by leveraging distributed systems and native browser features instead of clunky static builds. Built on the Web Fetch API (instead of Node) it can run anywhere. It already runs natively on Cloudflare Workers, and of course supports serverless and traditional Node.js environments, so you can come as you are.\nOkay that is pretty sales-y (hit up the homepage for more like that), so you might prefer jumping straight over to the docs instead and check out the example Jokes app to see what’s what.\nDiscuss on Changelog News",
          "link": "https://github.com/remix-run/remix",
          "publishedOn": "2021-11-23T14:29:00.000Z",
          "wordCount": null,
          "title": "Remix is now open source",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2dg",
          "author": "Liran Tal",
          "description": "If you’re unaware of what Trojan Source attacks are, or how unicode characters injected into a codebase could be used in malicious ways, refer to the README of the anti-trojan-source source code repository.\nThis ESLint plugin is based on the library and command-line tool anti-trojan-source.\nDiscuss on Changelog News",
          "link": "https://github.com/lirantal/eslint-plugin-anti-trojan-source",
          "publishedOn": "2021-11-22T15:58:00.000Z",
          "wordCount": null,
          "title": "An ESLint plugin to detect and stop Trojan Source attacks",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/294m",
          "author": "Jerod Santo",
          "description": "elfshaker is a CLI tool written in the Rust programming language. It stores snapshots of directories into highly-compressed pack files and provides fast on-demand access to the stored files. It is particularly good for storing lots of similar files, for example object files from an incremental build.\nThey’ve had phenomenal results when using this with clang builds.\nDiscuss on Changelog News",
          "link": "https://github.com/elfshaker/elfshaker",
          "publishedOn": "2021-11-22T14:42:00.000Z",
          "wordCount": null,
          "title": "elfshaker is version control fine-tuned for binaries",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1513",
          "author": null,
          "description": "Today we’re joined by Ilya Grigorik to talk about Shopify’s developer preview release of Hydrogen and the preview release of Oxygen which is in early access preview with select merchants on Shopify. Hydrogen is their React framework for dynamic, contextual, and personalized e-commerce. And Oxygen is Shopify’s hosted V8 JavaScript worker runtime that leverages all of their platform with the hope of scaling millions of storefronts. We cover what developers can expect from the Hydrogen framework, Shopify’s big bet on React Server Components, the future of Shopify at scale with Hydrogen powered by Oxygen, and a world where merchants never have to think about the complexities of scaling infrastructure.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and …",
          "link": "https://changelog.com/podcast/469",
          "publishedOn": "2021-11-19T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 469: Shopify's vision for the future of commerce",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/469/the-changelog-469.mp3",
            "length": "69750583",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1515",
          "author": null,
          "description": "This week we are joined by Sophie Alpert, Head of Engineering at Humu, and former lead of the React Core team, to discuss her experience on being a very early adopter, contributor, and eventually maintainer of React. In her 4+ years on the Core team, she went from supporting a new niche OSS UI library to supporting a project used by millions of developers around the world.  Join us to hear about this epic journey, as well as Sophie’s thought’s on some common critiques and misconceptions of React.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nAuth0 – The for developers, by developers identity platform built for the cloud era that secures billions of logins every year. Security, compliance, and industry standards…",
          "link": "https://changelog.com/jsparty/202",
          "publishedOn": "2021-11-19T20:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 202: Sophie is the bomb diggity",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/202/js-party-202.mp3",
            "length": "64977634",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2507",
          "author": "Simey de Klerk",
          "description": "I love automation. It’s just magical when an application or a script  *just does the thing* 100x faster than I could by hand and infinitely more accurate. Especially for mundane tasks. Magic.\nIn the world of magical automation, GitHub Actions are a grade A Elder Wand\n\nI created a GitHub action that auto-formats Changelog’s episode transcripts. Here’s how. 👇\nMy backstory 📖\nThis was my first meaningful code contribution to open source!\nIt was an awesome experience for me. I’m a hobby coder, and podcasts like The Changelog played a big role in my journey learning to code. This made it even more exciting for me when I came across an issue requesting a GitHub action to auto-improve Changelog’s transcripts while scouring for potential contributions during Hacktoberfest. It was a special chance…",
          "link": "https://changelog.com/posts/auto-improved-transcripts-with-github-actions",
          "publishedOn": "2021-11-19T15:47:20.000Z",
          "wordCount": null,
          "title": "Auto-improved transcripts with GitHub Actions",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1517",
          "author": null,
          "description": "Tiago Mendes joins Mat, Jon, and Johnny to discuss eventual consistency and strategies for changing data at scale.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nIncident.io – Create, manage, and resolve incidents directly in Slack. Use the /incident command to create and manage incidents. This command lets you share updates, assign roles, set important lin…",
          "link": "https://changelog.com/gotime/206",
          "publishedOn": "2021-11-18T22:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 206: Eventually consistent (managing data at scale)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/206/go-time-206.mp3",
            "length": "64460807",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Z3Lm",
          "author": "Jerod Santo",
          "description": "Our progress with safeguards makes it possible to remove the waitlist for GPT-3. Starting today, developers in supported countries can sign up and start experimenting with our API right away.\nGood news for anyone still waiting around for access.\nDiscuss on Changelog News",
          "link": "https://openai.com/blog/api-no-waitlist/",
          "publishedOn": "2021-11-18T17:33:00.000Z",
          "wordCount": null,
          "title": "OpenAI’s API is now open (goodbye, waitlist)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MdOG",
          "author": "Bhupesh Varshney",
          "description": "Overdoing things can have a deep mental impact, one should not feel guilty about giving up on something. It’s the same with pursuing side-projects don’t hesitate to abandon them if the need arises\nDiscuss on Changelog News",
          "link": "https://buttondown.email/bhupesh/archive/why-its-ok-to-abandon-your-side-projects/",
          "publishedOn": "2021-11-18T15:35:00.000Z",
          "wordCount": null,
          "title": "Why it's OK to abandon your side projects",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Q5QN",
          "author": "Jerod Santo",
          "description": "If Microsoft can rip off be inspired by Notion, what’s stopping open sourcerers from getting in on it? 😜\n\nDiscuss on Changelog News",
          "link": "https://github.com/AppFlowy-IO/appflowy",
          "publishedOn": "2021-11-17T17:19:00.000Z",
          "wordCount": null,
          "title": "AppFlowy is an open source alternative to Notion",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8OnL",
          "author": "Jerod Santo",
          "description": "The bulk of this post by Brett Cannon is a detailed argument that Python makes sense to select even for projects with known performance concerns, but I got my money’s worth from the concept in the title and opener:\n… it dawned on me that the problem is people are not treating language selection as potential form of premature optimization: if you select a programming language based on your preconceived notions of how a language performs, you will never know if the language that might be a better, more productive fit for your developers would have actually worked out.\nDiscuss on Changelog News",
          "link": "https://snarky.ca/programming-language-selection-is-a-form-of-premature-optimization/",
          "publishedOn": "2021-11-17T16:31:00.000Z",
          "wordCount": null,
          "title": "Selecting a programming language can be a form of premature optimization",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1464",
          "author": null,
          "description": "This week Gerhard is chatting with Romano Roth, Head of DevOps at Zühlke, a company founded by Gerhard Zühlke in 1968. Nowadays they help companies all over the world build, ship and run anything from factory robots, to AI assistants in complex regulatory environments, and even medical devices that perform autonomous robotic surgery.\nWhen Romano is not leading a team of 30 software engineers that specialise in operations, infrastructure and cloud, he is one of the organisers of DevOps Days Zürich, and also the DevOps Meetup group which is how Gerhard and Romano met in 2019.\nHaving started his career as a .Net developer back in 2002, Romano had his fair share of dev and ops challenges, and he always enjoys seeing real business value delivered continuously in an automated way. In recent year…",
          "link": "https://changelog.com/shipit/28",
          "publishedOn": "2021-11-17T16:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 28: What does good DevOps look like?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/28/ship-it-28.mp3",
            "length": "53721694",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/n7Wr",
          "author": "Jerod Santo",
          "description": "Tanner Linsley (whom you may remember from JS Party #179) adds a new component to his TanStack.\nDeclarative & asynchronous route elements and data loaders, first-class Search Param APIs, nested-routing, code-splitting and so much more.\nDiscuss on Changelog News",
          "link": "https://github.com/tannerlinsley/react-location",
          "publishedOn": "2021-11-17T14:23:00.000Z",
          "wordCount": null,
          "title": "Enterprise-grade routing for React applications",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRJp",
          "author": "Gerhard Lazu",
          "description": "Run ping, DNS, TLS & HTTP test against any URL or host with a single command.\n\nDiscuss on Changelog News",
          "link": "https://github.com/ycd/dstp",
          "publishedOn": "2021-11-16T15:58:00.000Z",
          "wordCount": null,
          "title": "Run common networking tests against your site with `dstp`",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/maNR",
          "author": "Jonas Lundberg",
          "description": "Often software developers are encouraged to learn deeply. Know your language and framework of choice better. That’s all good, but there’s another side to learning that’s often overlooked. Knowing a little about a lot of things so you have less blind spots.\nIn the blog post we look at the importance of learning broadly and how to go about it.\nDiscuss on Changelog News",
          "link": "https://www.iamjonas.me/2021/10/want-to-be-great-know-lot.html",
          "publishedOn": "2021-11-16T15:08:00.000Z",
          "wordCount": null,
          "title": "Want to be great? Know a lot",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Aa44",
          "author": "James Sinclair",
          "description": "Property-based testing helps us write better tests, with less code, and greater coverage. This leads to more confidence in our code, and fewer bugs in our applications. But, as always, there’s a price. Property tests take more effort to write, and they take longer to run. But they’re worth it.\nDiscuss on Changelog News",
          "link": "https://jrsinclair.com/articles/2021/how-to-get-started-with-property-based-testing-in-javascript-with-fast-check/",
          "publishedOn": "2021-11-16T14:20:00.000Z",
          "wordCount": null,
          "title": "Write better tests, with less code, and greater coverage",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9O8Q",
          "author": "Jerod Santo",
          "description": "One-liners with explanations, a short tutorial, and links to other resources.\nDiscuss on Changelog News",
          "link": "https://github.com/adrianscheff/useful-sed",
          "publishedOn": "2021-11-15T16:30:00.000Z",
          "wordCount": null,
          "title": "Useful sed tips, techniques, and tricks for daily usage",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aO6R",
          "author": "Jerod Santo",
          "description": "Doug Turnbull breaks down a major difference between two beloved programming languages in how they handle iteration.\nPython embraces for. Objects tell for how to work with them, and the for loop’s body processes what’s given back by the object. Ruby does the opposite. In Ruby, for itself (via each) is a method of the Object. The caller passes the body of the for loop to this method.\nHe goes on to give examples and explain why each approach might map to different developers’ brains… differently. Here’s a succinct summary, if you don’t have time for the deeper discussion:\nIn Ruby, the objects control the affordances. In Python, the language does.\nDiscuss on Changelog News",
          "link": "https://softwaredoug.com/blog/2021/11/12/ruby-vs-python-for-loop.html",
          "publishedOn": "2021-11-15T15:18:00.000Z",
          "wordCount": null,
          "title": "Ruby vs Python comes down to the for loop",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P5z7",
          "author": "Jerod Santo",
          "description": "TIL Apple added a networkQuality utility to Monterey which measures the quality of your device’s internet connection much like speedtest.net and fast.com.\nλ networkQuality\n==== SUMMARY ====\nUpload capacity: 14.696 Mbps\nDownload capacity: 21.661 Mbps\nUpload flows: 20\nDownload flows: 12\nResponsiveness: Low (103 RPM)\n\nWhat’s interesting about it is that it measures your upload and download in parallel by default, which is more aligned with real-world usage than running them back-to-back like other tests do.\nDiscuss on Changelog News",
          "link": "https://danpetrov.xyz/macos/2021/11/14/analysing-network-quality-macos.html",
          "publishedOn": "2021-11-15T14:30:00.000Z",
          "wordCount": null,
          "title": "The secret of the macOS Monterey network quality tool",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1514",
          "author": null,
          "description": "This week we’re bringing JS Party to The Changelog — Mitch and Andrew from the 1Password team talk with Amal and Nick about the company’s transition to Electron and web technologies, and how the company utilized its existing web stack to shape the future of its desktop experience.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/changelog\n\n    \nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nFireHydrant – The reliability platform for teams of all sizes. With FireHydrant, teams achieve reliability at scale by enabling speed and consistency from a service deployment to an unexpected outage. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nFeaturing\nMitchell Cohen – Twitter, GitHub\nAndrew Beyer – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNotes and Links\n1Password 8: The Story So Far\nwc3 community group for web extensions\n1Password Security Design\nGopherJS\nReact\nSvelte\nElectron\nRust\nNeon (rust in Electron)\nRFCs for JMAP?\n1Password Careers Page (they are hiring!)",
          "link": "https://changelog.com/podcast/468",
          "publishedOn": "2021-11-12T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 468: 1Password is all in on its web stack",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/468/the-changelog-468.mp3",
            "length": "71030097",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1493",
          "author": null,
          "description": "Rachel Nabors –beloved educator, animator, & documentation engineer at Meta– joins Amal and Amelia for a first look at the brand new React docs!\nThis massive overhaul to the React website (which supports 2 million+ developers around the world) was no easy feat! We dive into all the behind the scenes coordination, as well of the goals, wins, and intended outcomes of this new way of approaching educational content and API reference material for open source projects.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from s…",
          "link": "https://changelog.com/jsparty/201",
          "publishedOn": "2021-11-12T18:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 201: The inside story on React’s all new docs",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/201/js-party-201.mp3",
            "length": "71405088",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/gdQk",
          "author": "Jerod Santo",
          "description": "What was I doing the last time I was here?\nWe’re linking to the repo, but the idea is where it’s at. The code is a one-liner (if you’re using zsh)\ngrep -v \"jog\" ~/.zsh_history_ext | grep -a --color=never \"${PWD}   \" | cut -f1 -d\"|\" | tail\n\nThen you add this to your .zshrc\nfunction zshaddhistory() {\n\techo \"${1%%$'\\n'}|${PWD}   \" >> ~/.zsh_history_ext\n}\n\nNow you’re all set for the next time you need to jog your memory!\nDiscuss on Changelog News",
          "link": "https://github.com/natethinks/jog",
          "publishedOn": "2021-11-12T15:33:00.000Z",
          "wordCount": null,
          "title": "A simple script to print the last 10 commands you ran in this directory",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X6Wq",
          "author": "Jerod Santo",
          "description": "Sound career && life advice by Adam Keys:\nIt’s possibly the best advice for managers I’ve given so far. When you’re communicating with your team, lead with context and reassurance. Never message someone on your team, “let’s talk when you get a minute”. That’s void of information and scary as heck!\nI have to remind myself of this when I’m rushing. It’s faster to ping someone to arrange a synchronous talk than it is to write out what I need to say and cover all the bases. But that doesn’t give me license to skip all the context. Broad strokes are okay. An information vacuum is not okay.\nHmm I probably have to work on this one…\nDiscuss on Changelog News",
          "link": "https://therealadam.com/2021/11/01/dont-be-spooky/",
          "publishedOn": "2021-11-12T14:47:00.000Z",
          "wordCount": null,
          "title": "Don’t be spooky",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0811release/",
          "author": null,
          "description": "Welcome to the second edition of our release blog posts! The first edition was well received and happened to coincide with one of the biggest openpilot releases. This release is on the smaller side, though it features a new car brand port and several car model ports.",
          "link": "https://blog.comma.ai/0811release/",
          "publishedOn": "2021-11-29T18:00:00.000Z",
          "wordCount": 743,
          "title": "openpilot 0.8.11"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/outreach-initiatives/google-org/unlocking-human-rights-information-with-machine-learning/",
          "author": null,
          "description": "Human rights defenders need information from many sources to do their work effectively. But as issues evolve and new precedents are set, finding the right information to defend a particular case can be like looking for a needle in a haystack.\nFor example, a human rights advocate campaigning for LGBTQ rights may want to know which countries have made the most progress and what resolutions they’ve passed. To do so, they have to manually sift through thousands of pages of dense documentation covering global laws and victims’ testimonies to find what they’re looking for.\nThe curation and cataloging of documents makes this process much easier, but still relies on the manual work of skilled experts. To help, the non-profit organization HURIDOCS looked to machine learning. With support from Googl…",
          "link": "https://blog.google/outreach-initiatives/google-org/unlocking-human-rights-information-with-machine-learning/",
          "publishedOn": "2021-12-08T17:00:00.000Z",
          "wordCount": 1200,
          "title": "Unlocking human rights information with machine learning"
        },
        {
          "id": "https://blog.google/outreach-initiatives/accessibility/ml-making-sign-language-more-accessible/",
          "author": null,
          "description": "Google has spent over twenty years helping to make information accessible and useful in more than 150 languages. And our work is definitely not done, because the internet changes so quickly. About 15% of searches we see are entirely new every day. And when it comes to other types of information beyond words, in many ways, technology hasn’t even begun to scratch the surface of what’s possible. Take one example: sign language.\nThe task is daunting. There are as many sign languages as there are spoken languages around the world. That’s why, when we started exploring how we could better support sign language, we started small by researching and experimenting with what machine learning models could recognize. We also spoke with members of the Deaf community, as well as linguistic experts. We be…",
          "link": "https://blog.google/outreach-initiatives/accessibility/ml-making-sign-language-more-accessible/",
          "publishedOn": "2021-12-01T01:00:00.000Z",
          "wordCount": 1217,
          "title": "Machine learning to make sign language more accessible"
        },
        {
          "id": "https://blog.google/technology/ai/decade-deep-learning-and-whats-next/",
          "author": null,
          "description": "Twenty years ago, Google started using machine learning, and 10 years ago, it helped spur rapid progress in AI using deep learning. Jeff Dean and Marian Croak of Google Research take a look at how we’ve innovated on these techniques and applied them in helpful ways, and look ahead to a responsible and inclusive path forward.\n\n\n\n\nJeff Dean\n\n\nFrom research demos to AI that really works\n\n\nI was first introduced to neural networks — computer systems that roughly imitate how biological brains accomplish tasks — as an undergrad in 1990. I did my senior thesis on using parallel computation to train neural networks. In those early days, I thought if we could 32X more compute power (using 32 processors at the time!), we could get neural networks to do impressive things. I was way off. It turns out …",
          "link": "https://blog.google/technology/ai/decade-deep-learning-and-whats-next/",
          "publishedOn": "2021-11-18T18:30:00.000Z",
          "wordCount": 2534,
          "title": "A decade in deep learning, and what's next"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=17834",
          "author": "Daniel Stenberg",
          "description": "Easter egg; noun: An unexpected or undocumented feature in a piece of computer software, included as a joke or a bonus. There are no Easter eggs in curl. For the good. I’ve been asked about this many times. Among the enthusiast community, people seem to generally like the concept of Easter eggs and hidden treasures, … Continue reading No easter eggs in curl →",
          "link": "https://daniel.haxx.se/blog/2021/12/06/no-easter-eggs-in-curl/",
          "publishedOn": "2021-12-06T13:47:58.000Z",
          "wordCount": 1603,
          "title": "No easter eggs in curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17838",
          "author": "Daniel Stenberg",
          "description": "When I speak of curl in this post, I lump curl the command line tool and libcurl the library into one, and I just call them curl. Related: my webinar titled “Why everyone is using curl and you should too“. I believe just about every curl user has their own story and explanation about why … Continue reading Why curl is used everywhere, even on Mars →",
          "link": "https://daniel.haxx.se/blog/2021/12/03/why-curl-is-used-everywhere-even-on-mars/",
          "publishedOn": "2021-12-03T12:45:48.000Z",
          "wordCount": 1617,
          "title": "Why curl is used everywhere, even on Mars"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17766",
          "author": "Daniel Stenberg",
          "description": "Imagine running a trillion dollar company that bundles various open source components into your products, making billions of dollars of profit annually. When one of your users reach out and ask for help, with the product you ship to your customers, you instead refer the user to the open source project. The project which is … Continue reading Free Apple support →",
          "link": "https://daniel.haxx.se/blog/2021/11/18/free-apple-support/",
          "publishedOn": "2021-11-18T14:50:03.000Z",
          "wordCount": 729,
          "title": "Free Apple support"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17746",
          "author": "Daniel Stenberg",
          "description": "Thursday November 18 at 09:00 Pacific Time (17:00 UTC, 18:00 CET) I will sum up the curl news in the 7.80.0 release with extra focus and details on and about the post quantum features you can now use! Register here The webinar will be live and we end with a Q&A session where you can … Continue reading cURL Release Webinar – Featuring Post Quantum cURL →",
          "link": "https://daniel.haxx.se/blog/2021/11/16/curl-release-webinar-featuring-post-quantum-curl/",
          "publishedOn": "2021-11-16T12:38:08.000Z",
          "wordCount": 710,
          "title": "cURL Release Webinar – Featuring Post Quantum cURL"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17764",
          "author": "Daniel Stenberg",
          "description": "I still remember the RFC number off the top of my head for the first multipart formdata spec that I implemented support for in curl. Added to curl in version 5.0, December 1998. RFC 1867. Multipart formdata is the name of the syntax for how HTTP clients send data in a HTTP POST when they … Continue reading Fun multipart/form-data inconsistencies →",
          "link": "https://daniel.haxx.se/blog/2021/11/13/fun-multipart-form-data-inconsistencies/",
          "publishedOn": "2021-11-13T12:58:47.000Z",
          "wordCount": 1113,
          "title": "Fun multipart/form-data inconsistencies"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17688",
          "author": "Daniel Stenberg",
          "description": "Almost 14 months since I celebrated 15,000 commits in curl’s source code repository I have now passed 16,000 commits. My commit number 16,000 was a minor man page fix. The official gitstats page shows that I’ve committed changes on almost 4,600 separate days since the year 2000. 16,000 commits is 13,413 commits more than the … Continue reading 16000 curl commmits →",
          "link": "https://daniel.haxx.se/blog/2021/11/12/16000-curl-commmits/",
          "publishedOn": "2021-11-12T14:29:32.000Z",
          "wordCount": 858,
          "title": "16000 curl commmits"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "author": null,
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2021-12-10T12:27:38.715Z",
          "wordCount": 2397,
          "title": "Logging at Twitter: Updated"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "author": null,
          "description": "In this post, we will discuss our recent work on neural graph diffusion networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "publishedOn": "2021-12-10T12:27:37.927Z",
          "wordCount": 2889,
          "title": "Graph Neural Networks as Neural Diffusion PDEs"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "author": null,
          "description": "As part of this year’s DEFCON AI Village, we’re trying something radical by introducing the industry’s first algorithmic bias bounty competition.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-12-10T12:27:37.432Z",
          "wordCount": 889,
          "title": "Introducing Twitter’s first algorithmic bias bounty challenge"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "author": null,
          "description": "How we apply machine learning techniques at Twitter to forecast SQL query resource utilization during the development and maintenance of our large-scale SQL system.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/forecasting-sql-query-resource-usage-with-machine-learning",
          "publishedOn": "2021-12-10T12:27:37.422Z",
          "wordCount": 1920,
          "title": "Forecasting SQL query resource usage with machine learning"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "author": null,
          "description": "Sharing learnings from the first algorithmic bias bounty challenge",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-12-10T12:27:37.394Z",
          "wordCount": 1447,
          "title": "Sharing learnings from the first algorithmic bias bounty challenge"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/processing-billions-of-events-in-real-time-at-twitter-",
          "author": null,
          "description": "How we process large scale data in real time at Twitter while reducing latency and improving accuracy.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/processing-billions-of-events-in-real-time-at-twitter-",
          "publishedOn": "2021-12-10T12:27:37.384Z",
          "wordCount": 1899,
          "title": "Processing billions of events in real time at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-rolled-out-security-keys-at-twitter",
          "author": null,
          "description": "In this blog, we share how we’ve accelerated efforts to increase the use of security keys to prevent phishing attacks at Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-rolled-out-security-keys-at-twitter",
          "publishedOn": "2021-12-10T12:27:37.372Z",
          "wordCount": 1613,
          "title": "How we rolled out security keys at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "author": null,
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-12-10T12:27:37.350Z",
          "wordCount": 2222,
          "title": "Provably expressive graph neural networks"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "author": null,
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2021-12-10T12:27:37.306Z",
          "wordCount": 1293,
          "title": "Applying flame graphs outside of performance analysis"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2021/12/this-shouldnt-have-happened.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=t66UaDGGO9uRFa9A_n0Ge4kPz49mG1-u2NJpkhDAP5E');.lst-kix_q4elz23jmthh-5>li{counter-increment:lst-ctn-kix_q4elz23jmthh-5}ol.lst-kix_q4elz23jmthh-6.start{counter-reset:lst-ctn-kix_q4elz23jmthh-6 0}ul.lst-kix_wy7koemfbmv1-3{list-style-type:none}ul.lst-kix_wy7koemfbmv1-2{list-style-type:none}ul.lst-kix_wy7koemfbmv1-5{list-style-type:none}.lst-kix_2hgb22nra90i-8>li:before{content:\"\\0025a0  \"}ul.lst-kix_wy7koemfbmv1-4{list-style-type:none}ul.lst-kix_wy7koemfbmv1-1{list-style-type:none}.lst-kix_2hgb22nra90i-7>li:before{content:\"\\0025cb  \"}ul.lst-kix_wy7koemfbmv1-0{list-style-type:none}ol.lst-kix_q4elz23jmthh-0.start{counter-reset:lst-ctn-kix_q4elz23jmthh-0 0}.lst-kix_2hgb22nra90i-4>li:before{content:\"\\0025cb  \"}.lst-kix_2hgb22nra90i-6>…",
          "link": "https://googleprojectzero.blogspot.com/2021/12/this-shouldnt-have-happened.html",
          "publishedOn": "2021-12-01T18:38:00.002Z",
          "wordCount": 2266,
          "title": "This shouldn't have happened: A vulnerability postmortem"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47492",
          "author": "Bobby Holley",
          "description": "In Firefox 95, we're shipping a novel sandboxing technology called RLBox — developed in collaboration with researchers at the University of California San Diego and the University of Texas — that makes it easy and efficient to isolate subcomponents to make the browser more secure. This technology opens up new opportunities beyond what's been possible with traditional process-based sandboxing, and we look forward to expanding its usage and (hopefully) seeing it adopted in other browsers and software projects.\nThe post WebAssembly and Back Again: Fine-Grained Sandboxing in Firefox 95 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/12/webassembly-and-back-again-fine-grained-sandboxing-in-firefox-95/",
          "publishedOn": "2021-12-06T13:05:44.000Z",
          "wordCount": 1171,
          "title": "WebAssembly and Back Again: Fine-Grained Sandboxing in Firefox 95"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47474",
          "author": "Xavier Harding",
          "description": "Seyi Akiwowo’s reputation precedes her. Akiwowo is the founder of Glitch, an organization that seeks to end online abuse. We spoke with Seyi over video chat to learn about what drives her, why she does what she does and what she’d be doing if not battling trolls online for a living. \nThe post Hacks Decoded: Seyi Akiwowo, Founder of Glitch appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/11/hacks-decoded-seyi-akiwowo-founder-of-glitch/",
          "publishedOn": "2021-11-30T16:02:27.000Z",
          "wordCount": 1961,
          "title": "Hacks Decoded: Seyi Akiwowo, Founder of Glitch"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=61819",
          "author": "Douglas Creager",
          "description": "Precise code navigation is powered by stack graphs, a new open source framework that lets you define the name binding rules for a programming language.",
          "link": "https://github.blog/2021-12-09-introducing-stack-graphs/",
          "publishedOn": "2021-12-09T17:00:40.000Z",
          "wordCount": 2713,
          "title": "Introducing stack graphs"
        },
        {
          "id": "https://github.blog/?p=61817",
          "author": "Douglas Creager",
          "description": "Code navigation is now available in PRs, and code navigation results for Python are now more precise.",
          "link": "https://github.blog/2021-12-09-precise-code-navigation-python-code-navigation-pull-requests/",
          "publishedOn": "2021-12-09T17:00:28.000Z",
          "wordCount": 596,
          "title": "Precise code navigation for Python, and code navigation in pull requests"
        },
        {
          "id": "https://github.blog/?p=61800",
          "author": "Pavel Avgustinov",
          "description": "Today, we are rolling out a technology preview for GitHub code search, the next iteration for search, discovery, and navigation on GitHub.",
          "link": "https://github.blog/2021-12-08-improving-github-code-search/",
          "publishedOn": "2021-12-08T17:00:01.000Z",
          "wordCount": 912,
          "title": "Improving GitHub code search"
        },
        {
          "id": "https://github.blog/?p=61776",
          "author": "Ian Marsh",
          "description": "GitHub Enterprise Server is now generally available for all customers. This release improves performance for CI/CD and for customers with large repositories.",
          "link": "https://github.blog/2021-12-07-github-enterprise-server-3-3-is-generally-available/",
          "publishedOn": "2021-12-08T01:04:26.000Z",
          "wordCount": 550,
          "title": "GitHub Enterprise Server 3.3 is generally available"
        },
        {
          "id": "https://github.blog/?p=61784",
          "author": "Myles Borins",
          "description": "Today we're introducing enhanced login verification to the npm registry, and we will begin a staged rollout to maintainers beginning Dec 7.",
          "link": "https://github.blog/2021-12-07-enrolling-npm-publishers-enhanced-login-verification-two-factor-authentication-enforcement/",
          "publishedOn": "2021-12-07T17:00:09.000Z",
          "wordCount": 809,
          "title": "Enrolling all npm publishers in enhanced login verification and next steps for two-factor authentication enforcement"
        },
        {
          "id": "https://github.blog/?p=61743",
          "author": "Alvaro Munoz",
          "description": "This lesser-known OWASP project aims to help developers prevent vulnerabilities from being introduced in the first place.",
          "link": "https://github.blog/2021-12-06-write-more-secure-code-owasp-top-10-proactive-controls/",
          "publishedOn": "2021-12-06T22:30:11.000Z",
          "wordCount": 1813,
          "title": "Write more secure code with the OWASP Top 10 Proactive Controls"
        },
        {
          "id": "https://github.blog/?p=61737",
          "author": "Justin Hutchings",
          "description": "GitHub has partnered with the OpenSSF and Project Sigstore to add container image signing to our default “Publish Docker Container” workflow.",
          "link": "https://github.blog/2021-12-06-safeguard-container-signing-capability-actions/",
          "publishedOn": "2021-12-06T17:30:08.000Z",
          "wordCount": 1085,
          "title": "Safeguard your containers with new container signing capability in GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=61646",
          "author": "Michelle Mannering",
          "description": "The end of the year is getting closer, and our communities are busy working away on their projects. While you’ve all been busy maintaining open source projects and shipping releases, we’ve created a new open",
          "link": "https://github.blog/2021-12-03-release-radar-nov-2021/",
          "publishedOn": "2021-12-03T22:00:35.000Z",
          "wordCount": 1236,
          "title": "Release Radar · November 2021 Edition"
        },
        {
          "id": "https://github.blog/?p=61701",
          "author": "Scott Sanders",
          "description": "In November, we experienced one incident resulting in significant impact and degraded state of availability for multiple services.",
          "link": "https://github.blog/2021-12-01-github-availability-report-november-2021/",
          "publishedOn": "2021-12-01T20:14:04.000Z",
          "wordCount": 658,
          "title": "GitHub Availability Report: November 2021"
        },
        {
          "id": "https://github.blog/?p=61663",
          "author": "Yaswanth Anantharaju",
          "description": "You can multiply the impact of your domain experts by building their common workflows into ChatOps.",
          "link": "https://github.blog/2021-12-01-using-chatops-to-help-actions-on-call-engineers/",
          "publishedOn": "2021-12-01T18:01:09.000Z",
          "wordCount": 1627,
          "title": "Using ChatOps to help Actions on-call engineers"
        },
        {
          "id": "https://github.blog/?p=61656",
          "author": "Maneesh Sharma",
          "description": "Are you a student in India? Applications are open for the GitHub Externships Winter Cohort!",
          "link": "https://github.blog/2021-11-30-github-externships-enabling-indias-next-generation-of-developers/",
          "publishedOn": "2021-12-01T03:30:25.000Z",
          "wordCount": 734,
          "title": "GitHub Externships: enabling India’s next generation of developers"
        },
        {
          "id": "https://github.blog/?p=61638",
          "author": "Damian Brady",
          "description": "From learning YAML to scripting with Bash, here are a few simple tips for developers who want to speed up their workflows.",
          "link": "https://github.blog/2021-11-30-5-devops-tips-to-speed-up-your-developer-workflow/",
          "publishedOn": "2021-11-30T17:09:28.000Z",
          "wordCount": 2377,
          "title": "5 DevOps tips to speed up your developer workflow"
        },
        {
          "id": "https://github.blog/?p=61460",
          "author": "Jennifer Schelkopf",
          "description": "DRY your Actions configuration with reusable workflows (and more!)",
          "link": "https://github.blog/2021-11-29-github-actions-reusable-workflows-is-generally-available/",
          "publishedOn": "2021-11-29T17:38:13.000Z",
          "wordCount": 782,
          "title": "GitHub Actions: reusable workflows is generally available"
        },
        {
          "id": "https://github.blog/?p=61611",
          "author": "Usha Narayanabhatta",
          "description": "GitHub Actions now supports OpenID Connect for secure deployment to different cloud providers via short-lived, auto-rotated tokens.",
          "link": "https://github.blog/2021-11-23-secure-deployments-openid-connect-github-actions-generally-available/",
          "publishedOn": "2021-11-23T20:16:17.000Z",
          "wordCount": 689,
          "title": "Secure deployments with OpenID Connect & GitHub Actions now generally available"
        },
        {
          "id": "https://github.blog/?p=61590",
          "author": "Kevin Backhouse",
          "description": "OSS-Fuzz is Google’s awesome fuzzing service for open source projects. GitHub Security Lab's @kevinbackhouse describes enrolling a project.",
          "link": "https://github.blog/2021-11-23-how-to-squash-bugs-by-enrolling-in-oss-fuzz/",
          "publishedOn": "2021-11-23T17:37:46.000Z",
          "wordCount": 1637,
          "title": "How to squash bugs by enrolling in OSS-Fuzz"
        },
        {
          "id": "https://github.blog/?p=61574",
          "author": "Justin Colannino",
          "description": "Recently, the Copyright Office responded to the calls to clarify the scope of protected security research.",
          "link": "https://github.blog/2021-11-23-copyright-office-expands-security-research-rights/",
          "publishedOn": "2021-11-23T16:47:28.000Z",
          "wordCount": 1229,
          "title": "The Copyright Office expands your security research rights"
        },
        {
          "id": "https://github.blog/?p=61563",
          "author": "Zack Koppert",
          "description": "The GitHub Services Engineers have released the Advanced Security Enforcer GitHub Action to enable organizations to utilize code scanning in a consistent and automated way.",
          "link": "https://github.blog/2021-11-22-accelerate-security-adoption-in-your-organization/",
          "publishedOn": "2021-11-22T17:27:15.000Z",
          "wordCount": 700,
          "title": "Accelerate security adoption in your organization"
        },
        {
          "id": "https://github.blog/?p=61527",
          "author": "Matthew Dyson",
          "description": "A recap of all the GitHub Education news from Universe 2021, including the new Intro to Web Dev Experience.",
          "link": "https://github.blog/2021-11-19-in-case-you-missed-it-github-education-at-universe-2021/",
          "publishedOn": "2021-11-19T21:21:48.000Z",
          "wordCount": 1021,
          "title": "In case you missed it, GitHub Education at Universe 2021!"
        },
        {
          "id": "https://github.blog/?p=61504",
          "author": "Sidi Merzouk",
          "description": "A public beta of the new GitHub Issues, a \"security manager\" role for organizations, a command palette beta, and lots more.",
          "link": "https://github.blog/2021-11-19-whats-new-from-github-changelog-october-2021-recap/",
          "publishedOn": "2021-11-19T18:41:19.000Z",
          "wordCount": 1648,
          "title": "What’s new from GitHub Changelog? October 2021 recap"
        },
        {
          "id": "https://github.blog/?p=61473",
          "author": "Brian Douglas",
          "description": "Check out some advanced automation and CI/CD capabilities you can use today with GitHub Actions on any GitHub account.",
          "link": "https://github.blog/2021-11-18-7-advanced-workflow-automation-features-with-github-actions/",
          "publishedOn": "2021-11-18T17:06:45.000Z",
          "wordCount": 917,
          "title": "7 advanced workflow automation features with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=61444",
          "author": "Abby Vollmer",
          "description": "GitHub puts the needs of developers at the core of our content moderation policies. Learn more about our approach and how you can contribute.",
          "link": "https://github.blog/2021-11-17-githubs-developer-first-approach-to-content-moderation/",
          "publishedOn": "2021-11-17T17:00:36.000Z",
          "wordCount": 1246,
          "title": "GitHub’s developer-first approach to content moderation"
        },
        {
          "id": "https://github.blog/?p=60724",
          "author": "Andrew Hoglund",
          "description": "All newly created GraphQL objects now have IDs that conform to a new format, which we refer to as \"next IDs.\" Learn how to migrate older IDs to the new format and why we're making the change.",
          "link": "https://github.blog/2021-11-16-graphql-global-id-migration-update/",
          "publishedOn": "2021-11-16T21:00:47.000Z",
          "wordCount": 990,
          "title": "GraphQL global ID migration update"
        },
        {
          "id": "https://github.blog/?p=61411",
          "author": "Kevin Backhouse",
          "description": "The Exiv2 team tightened our security by enabling GitHub’s code scanning feature and adding custom queries tailored to the Exiv2 code base.",
          "link": "https://github.blog/2021-11-16-adding-custom-codeql-queries-code-scanning/",
          "publishedOn": "2021-11-16T18:00:02.000Z",
          "wordCount": 2700,
          "title": "Blue-teaming for Exiv2: adding custom CodeQL queries to code scanning"
        },
        {
          "id": "https://github.blog/?p=61422",
          "author": "Eirini Kalliamvakou",
          "description": "The State of the Octoverse analyzes data from millions of developers & repos to share trends across working habits, productivity, and career satisfaction.",
          "link": "https://github.blog/2021-11-16-the-2021-state-of-the-octoverse/",
          "publishedOn": "2021-11-16T14:00:01.000Z",
          "wordCount": 539,
          "title": "The 2021 State of the Octoverse"
        },
        {
          "id": "https://github.blog/?p=61405",
          "author": "Mike Hanley",
          "description": "We're sharing details of recent incidents on the npm registry, our investigations, and how we’re continuing to invest in the security of npm.",
          "link": "https://github.blog/2021-11-15-githubs-commitment-to-npm-ecosystem-security/",
          "publishedOn": "2021-11-15T23:00:52.000Z",
          "wordCount": 1402,
          "title": "GitHub’s commitment to npm ecosystem security"
        },
        {
          "id": "https://github.blog/?p=61348",
          "author": "Taylor Blau",
          "description": "To celebrate this most recent release, here's GitHub's look at some of the most interesting features and changes introduced since last time.",
          "link": "https://github.blog/2021-11-15-highlights-from-git-2-34/",
          "publishedOn": "2021-11-15T17:42:15.000Z",
          "wordCount": 3658,
          "title": "Highlights from Git 2.34"
        },
        {
          "id": "https://github.blog/?p=61331",
          "author": "Michelle Mannering",
          "description": "What an incredible month it’s been for GitHub and our communities. Whilst we’ve been busy with GitHub Universe, our communities have been busy coding. It’s been a successful year for Hacktoberfest, with many first-time contributors",
          "link": "https://github.blog/2021-11-12-release-radar-oct-2021/",
          "publishedOn": "2021-11-12T22:00:36.000Z",
          "wordCount": 1184,
          "title": "Release Radar · October 2021 Edition"
        },
        {
          "id": "https://github.blog/?p=61305",
          "author": "Berk Veral",
          "description": "During Universe, we received a number of security questions ranging from our strategy to our advisories. Here's what we've got planned!",
          "link": "https://github.blog/2021-11-12-highlights-github-security-roadmap-universe-2021/",
          "publishedOn": "2021-11-12T17:30:15.000Z",
          "wordCount": 949,
          "title": "Highlights from GitHub’s security roadmap at Universe 2021"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18004",
          "author": "David Vélez - Founder &#38; CEO of Nubank",
          "description": "Our customers have always been at the core of everything we do. \nThe post The Spark Of Our Foundation: a letter from our founders appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/founders-letter/",
          "publishedOn": "2021-12-09T02:01:48.000Z",
          "wordCount": 5117,
          "title": "The Spark Of Our Foundation: a letter from our founders"
        },
        {
          "id": "https://building.nubank.com.br/?p=17990",
          "author": "Nubank Press",
          "description": "In 2022, we want to be even closer to people through special events and content. The 2022 FIFA World Cup™ will be held in Qatar between November and December and will have Nubank as an official regional supporter. \nThe post Nubank is an official FIFA World Cup™ supporter: soon, we’ll have more surprises for our customers appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-official-fifa-world-cup-supporter/",
          "publishedOn": "2021-11-24T13:09:23.000Z",
          "wordCount": 3397,
          "title": "Nubank is an official FIFA World Cup™ supporter: soon, we’ll have more surprises for our customers"
        },
        {
          "id": "https://building.nubank.com.br/?p=17967",
          "author": "Leonardo Pierette",
          "description": "Announced in 2020, NuLab Salvador will be headquartered in a building located in the Rio Vermelho neighborhood. Get to know the project.\nThe post NuLab Salvador: Nubank prepares to inaugurate technology and customer experience hub￼ appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nulab-salvador/",
          "publishedOn": "2021-11-22T17:42:46.000Z",
          "wordCount": 3182,
          "title": "NuLab Salvador: Nubank prepares to inaugurate technology and customer experience hub￼"
        },
        {
          "id": "https://building.nubank.com.br/?p=17947",
          "author": "Nubank Editorial",
          "description": "In 2022, we want to be even closer to people through special events and content. The 2022 FIFA World Cup will be held in Qatar between November and December and will have Nubank as an official supporter. \nThe post Nubank is an official World Cup supporter: soon, we’ll have more surprises for our customers appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-qatar-2022/",
          "publishedOn": "2021-11-18T13:18:39.000Z",
          "wordCount": 3237,
          "title": "Nubank is an official World Cup supporter: soon, we’ll have more surprises for our customers"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/vulnerability-management/common-vulnerability-scoring-system-cvss-complete-explanation",
          "author": "HackerOne",
          "description": "Were you wondering about the Common Vulnerability Scoring System (CVSS)? We explain what CVSS is, why it is important, and show how to prioritize vulnerabilities based on their score.",
          "link": "https://www.hackerone.com/vulnerability-management/common-vulnerability-scoring-system-cvss-complete-explanation",
          "publishedOn": "2021-12-09T17:50:00.000Z",
          "wordCount": 1723,
          "title": "Common Vulnerability Scoring System [CVSS] | A Complete Explanation"
        },
        {
          "id": "https://hackerone.com/security-event/how-hackers-help-organizations-face-new-attack-vectors-and-build-stronger-security",
          "author": "HackerOne",
          "description": "The risk of cyberattacks grows every day. But there is an essential defensive step that organizations can take: hacker-powered security programs.",
          "link": "https://www.hackerone.com/security-event/how-hackers-help-organizations-face-new-attack-vectors-and-build-stronger-security",
          "publishedOn": "2021-12-07T17:50:00.000Z",
          "wordCount": 1636,
          "title": "How Hackers Help Organizations Face New Attack Vectors and Build Stronger Security Programs"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/vulnerability-management-complete-guide-and-best-practices",
          "author": "HackerOne",
          "description": "We explain what vulnerability management is and why it matters, and we give a step-by-step guide to implementing a vulnerability management process.",
          "link": "https://www.hackerone.com/vulnerability-management/vulnerability-management-complete-guide-and-best-practices",
          "publishedOn": "2021-12-02T17:50:00.000Z",
          "wordCount": 2231,
          "title": "Vulnerability Management | A Complete Guide and Best Practices"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/securing-supply-chain-working-ethical-hackers",
          "author": "HackerOne",
          "description": "Software supply chain attacks increasingly create concern among cybersecurity experts as these exploits are becoming more common. But solving the problem has left organizations scrambling for an answer because supply-chain security management is inherently complex.",
          "link": "https://www.hackerone.com/vulnerability-management/securing-supply-chain-working-ethical-hackers",
          "publishedOn": "2021-11-30T17:50:00.000Z",
          "wordCount": 1644,
          "title": "Securing the Supply Chain by Working With Ethical Hackers"
        },
        {
          "id": "https://hackerone.com/customer-stories/tiktok-celebrates-one-year-bug-bounty",
          "author": "HackerOne",
          "description": "As part of an ongoing commitment to proactive cybersecurity, TikTok celebrated its one-year anniversary of HackerOne bug bounty by thanking (via video, of course!) 150+ hackers from around the globe who have helped them identify and resolve more than 225 vulnerabilities. They also share insights into assets in scope, their commitment to transparency, and their best-in-class payout and response time metrics.",
          "link": "https://www.hackerone.com/customer-stories/tiktok-celebrates-one-year-bug-bounty",
          "publishedOn": "2021-11-19T17:00:00.000Z",
          "wordCount": 1354,
          "title": "TikTok Celebrates One Year of Bug Bounty"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/bug-bounty-platforms-best-choices-bug-bounty-program",
          "author": "HackerOne",
          "description": "Are you wondering about bug bounty platforms? We explain what a bug bounty platform is and how it can help you run a successful bug bounty program.",
          "link": "https://www.hackerone.com/vulnerability-management/bug-bounty-platforms-best-choices-bug-bounty-program",
          "publishedOn": "2021-11-18T17:50:00.000Z",
          "wordCount": 1323,
          "title": "Bug Bounty Platforms [Best Choices For a Bug Bounty Program]"
        },
        {
          "id": "https://hackerone.com/how-elastic-attracts-and-retains-top-hackers-without-offering-highest-bounties",
          "author": "HackerOne",
          "description": "Skilled hackers are the foundation of an effective bug bounty program. But how can you ensure your program attracts top hackers and keeps them engaged?",
          "link": "https://www.hackerone.com/how-elastic-attracts-and-retains-top-hackers-without-offering-highest-bounties",
          "publishedOn": "2021-11-16T17:50:00.000Z",
          "wordCount": 1726,
          "title": "How Elastic Attracts and Retains Top Hackers Without Offering the Highest Bounties"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}