{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Mike Maraya, Google Open Source Security Team&nbsp;\n\n\n\n\nAs an active member of the open source software (OSS) community, Google recognizes the growing threat of software supply chain attacks against OSS we use and develop. Building on our efforts to improve OSS security with an end-to-end framework (SLSA), metrics (Scorecards), and coordinated vulnerability disclosure (guide), we are excited to announce Allstar. \n\n\nAllstar is a GitHub app that continuously enforces security policy settings through…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/fr5L26WgsB8/allstar-continuous-security-policy.html",
          "publishedOn": "2021-08-11T12:05:00.001Z",
          "wordCount": 875,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "AllStar: Continuous Security Policy Enforcement for GitHub Projects"
        },
        {
          "description": "Posted by Christiaan Brand, Product Manager, Google Cloud\n\n\n\nToday we are excited to announce some changes to our lineup of Titan Security Keys on the Google Store which provide a simpler experience and make choosing the right security key for you even easier. We will now offer only two types of Titan Security Keys: a USB-A and a USB-C version. Both of these keys have Near Field Communication (NFC) functionality, which allows you to use it with most mobile devices by simply tapping it on the back of your mo…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/YlO-lbMuiSg/simplifying-titan-security-key-options.html",
          "publishedOn": "2021-08-09T16:00:00.002Z",
          "wordCount": 941,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Simplifying Titan Security Key options for our users"
        },
        {
          "description": "Posted by Kees Cook, Software Engineer, Google Open Source Security Team\n\nTo borrow from an excellent analogy between the modern computer ecosystem and the US automotive industry of the 1960s, the Linux kernel runs well: when driving down the highway, you're not sprayed in the face with oil and gasoline, and you quickly get where you want to go. However, in the face of failure, the car may end up on fire, flying off a cliff.\n\nAs we approach its 30th Anniversary, Linux still remains the largest collaborative…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/e2pkIxkg4tI/linux-kernel-security-done-right.html",
          "publishedOn": "2021-08-03T16:00:00.023Z",
          "wordCount": 2091,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Linux Kernel Security Done Right"
        },
        {
          "description": "Posted by Jan Keller, Technical Program Manager, Google VRP&nbsp;\n\nA little over 10 years ago, we launched our Vulnerability Rewards Program (VRP). Our goal was to establish a channel for security researchers to report bugs to Google and offer an efficient way for us to thank them for helping make Google, our users, and the Internet a safer place. To recap our progress on these goals, here is a snapshot of what VRP has accomplished with the community over the past 10 years:\n\nTotal bugs rewarded: 11,055\nNumb…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/hQ3GKGkClOQ/a-new-chapter-for-googles-vulnerability.html",
          "publishedOn": "2021-07-27T13:00:00.024Z",
          "wordCount": 987,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "A new chapter for Google’s Vulnerability Reward Program"
        },
        {
          "description": "Posted by Charlie Reis​ and Alex Moshchuk, Chrome Security Team\nChrome's Site Isolation is an essential security defense that makes it harder for malicious web sites to steal data from other web sites. On Windows, Mac, Linux, and Chrome OS, Site Isolation protects all web sites from each other, and also ensures they do not share processes with extensions, which are more highly privileged than web sites. As of Chrome 92, we will start extending this capability so that extensions can no longer share processes…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/CBZqJOPDFeY/protecting-more-with-site-isolation.html",
          "publishedOn": "2021-07-20T17:00:00.007Z",
          "wordCount": 1006,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Protecting more with Site Isolation"
        },
        {
          "description": "Posted by Sarah Morales, Community Outreach Manager, Security&nbsp;\nIt’s no secret that lack of diversity in corporate America is a well-documented problem and improvements have been slow. To help improve female representation in the cybersecurity industry, Google teamed up with Women in Cybersecurity (WiCyS) and SANS Institute a year ago to establish the Security Training Scholarship Program. \nThe multi-stage security training program set participants on a path to launch and advance their careers in cybers…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/9UA3XccGiOc/advancing-inclusive-diverse-security.html",
          "publishedOn": "2021-07-20T16:20:00.007Z",
          "wordCount": 1043,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Advancing an inclusive, diverse security industry"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "Brett Cannon:\n… over 3 years ago I set out to re-implement the Python Launcher for Unix in Rust. On July 24, 2021, I launched 1.0.0 of the Python Launcher for Unix… This gives you a py command on Unix which will always use the newest version of Python.\nHe goes on to describe some workflow niceties that a built in and also what this project is not about:\nThe Launcher is purely a convenience and not meant to be The Launcher For All Things; this should never end up in a Docker container.\nDiscuss on Changelog N…",
          "link": "https://snarky.ca/introducing-the-python-launcher-for-unix/",
          "publishedOn": "2021-08-16T14:33:00.000Z",
          "wordCount": 1231,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Introducing the Python launcher for  Unix"
        },
        {
          "description": "Matt Rickard shares 31 reflections after putting his time 10k hours in programming:\nThese are reflections only about pure coding — no lessons sum up to “programming is about people” or “how to be a senior technical leader” (arguably more important to a career, but not the topic of this post).\nThese reflections are just about deliberately writing code for 10,000 hours. Most don’t apply to beginners. These reflections are not career advice. Think of them as lessons on being a technical guitarist, not about be…",
          "link": "https://matt-rickard.com/reflections-on-10-000-hours-of-programming/",
          "publishedOn": "2021-08-16T13:39:00.000Z",
          "wordCount": 934,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reflections on 10,000 hours of programming"
        },
        {
          "description": "Ned Batchelder, after reading some code to termine whether or not it was “Pythonic”:\nMy first response was that I don’t like this code, because I had to read it with my eyebrows. That is, I furrow my brow, and read slowly, and scowl at the code as I puzzle through it. This code is dense and tricky.\nIs it Pythonic? I guess in the sense that it uses a number of Python-specific constructs and tools, yes. But not in the sense of Python code being clear and straightforward. It uses Python thoroughly, but misses …",
          "link": "https://nedbatchelder.com/blog/202108/pythonic_monotonic.html",
          "publishedOn": "2021-08-13T18:43:00.000Z",
          "wordCount": 2209,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "On reading code with your eyebrows"
        },
        {
          "description": "Henrik Fricke:\nIndiepen lets you embed HTML, CSS, and JS code examples on a website. We built it because we wanted to embed code examples on our  blog, but many existing solutions set cookies, have a ton of features or just come with a bad performance.\n😎 No cookies, no tracking, no external requests\nCongrats, Henrik, on shipping your first open source project! 👏\nDiscuss on Changelog News",
          "link": "https://indiepen.tech/",
          "publishedOn": "2021-08-13T17:54:00.000Z",
          "wordCount": 341,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Indiepen – a  privacy-friendly solution to present your code to people"
        },
        {
          "description": "It’s 22 months since I found myself frustrated with writing boilerplate instructions to install simple, but necessary software in every tutorial I wrote for clients and for my own open source work.\nIn this article post I’ll walk you through the journey of the past two years from the initial creation, through to growing the community, getting the first sponsored app and what’s next. There will be code snippets, and technical details, but there should be something for everyone as we celebrate the two year ann…",
          "link": "https://blog.alexellis.io/kubernetes-marketplace-two-year-update/",
          "publishedOn": "2021-08-13T17:07:00.000Z",
          "wordCount": 3295,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building an open source marketplace for Kubernetes (2 years later)"
        },
        {
          "description": "Luis Villa of Tidelift joins the show to discuss GitHub Copilot and the implications of an AI pair programmer from a legal perspective.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to …",
          "link": "https://changelog.com/jsparty/188",
          "publishedOn": "2021-08-13T16:20:00.000Z",
          "wordCount": 446,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 188: We ask a lawyer about GitHub Copilot"
        },
        {
          "description": "Fossil deliberately omits a “rebase” command because the original designer of Fossil (and original author of this article) considers rebase to be an anti-pattern to be avoided. This article attempts to explain that point of view.\nRead this article by SQLite/Fossil creator Richard Hipp to prep for next week’s episode of The Changelog. 😉\nDiscuss on Changelog News",
          "link": "https://www.fossil-scm.org/home/doc/trunk/www/rebaseharm.md",
          "publishedOn": "2021-08-13T13:51:00.000Z",
          "wordCount": 3599,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Rebase considered harmful"
        },
        {
          "description": "This week Adam is joined by Eugenio Pace, co-founder and CEO of Auth0. Auth0 is a for developers, by developers identity, access, security, and authentication platform built for the cloud that secures billions of logins every year. Mid 2020 they raised $120 million at a $1.92 billion valuation after being told no several times. Then, earlier this year in March they announced they were being acquired by Okta for $6.5 billion, in a bold and future-thinking all stock deal. This episode is full of wisdom, inspi…",
          "link": "https://changelog.com/founderstalk/78",
          "publishedOn": "2021-08-13T11:00:00.000Z",
          "wordCount": 490,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 78: Leading Auth0 to a $6.5 billion acquisition"
        },
        {
          "description": "Mihai and Ashley join Jon to discuss data streaming. What is it, why is it being used, and common mistakes developers make when setting up. They also discuss some of the tools in the ecosystem, including Benthos, a tool created by Ashley Jeff’s to make the plumbing part of data streaming easier to get right.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any computing resource anyw…",
          "link": "https://changelog.com/gotime/192",
          "publishedOn": "2021-08-12T20:45:00.000Z",
          "wordCount": 406,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 192: Data streaming and Benthos"
        },
        {
          "description": "In today’s episode, Gerhard is joined by Uma, CEO and co-founder of ChaosNative, as well as Karthik, CTO and also a ChaosNative co-founder. They talk Chaos Engineering and Litmus.\nChaos Engineering is not just for super SREs. It is not meant to prevent outages. And, it is not just about hardware. Chaos Engineering is about testing how reliable your systems are. It’s meant to show you how things fail, including when other dependent systems fail - think cascading failures. This is a good way to discover incon…",
          "link": "https://changelog.com/shipit/14",
          "publishedOn": "2021-08-12T19:30:00.000Z",
          "wordCount": 548,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 14: Cloud-native chaos engineering"
        },
        {
          "description": "Where by “on the web” James means “in the browser”:\nSQL is a great way to build apps. Especially small local web apps. Key/value stores may have their place in large distributed systems, but wow wouldn’t it be great if we could use SQLite on the web?\nI’m excited to announce absurd-sql which makes this possible. absurd-sql is a filesystem backend for sql.js that allows SQLite to read/write from IndexedDB in small blocks, just like it would a disk. I ported my app to use and you can try it here.\nA very cool p…",
          "link": "https://jlongster.com/future-sql-web",
          "publishedOn": "2021-08-12T15:37:00.000Z",
          "wordCount": 4260,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A future for SQL on the web"
        },
        {
          "description": "Nick told us about this on our modern Unix tooling episode, but I thought I’d link up his excellent writeup/video on the subject for those who had a hard time following with audio only.\nLet’s say you have an nginx or Kubernetes config file which doesn’t support templating out of the box and you want to dynamically create config files based on 1 or more environment variables. This is what envsubst lets you do.\nDiscuss on Changelog News",
          "link": "https://nickjanetakis.com/blog/using-envsubst-to-merge-environment-variables-into-config-files",
          "publishedOn": "2021-08-12T14:48:00.000Z",
          "wordCount": 419,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Using `envsubst` to merge environment variables into config files"
        },
        {
          "description": "Ivan Velichko:\nI compiled this thread on Twitter, and all of a sudden, it got quite some attention. So here, I’ll try to elaborate on the topic a bit more. Maybe it would be helpful for someone trying to make a career decision or just improve general understanding of the most hyped titles in the industry.\nTitles come and go, and it’s worth knowing which ones are coming and which ones are going. This article is a good place to catch up if you haven’t been tracking. Oh, and there’s a pod for that too. 😉\nDisc…",
          "link": "https://iximiuz.com/en/posts/devops-sre-and-platform-engineering/",
          "publishedOn": "2021-08-12T14:00:00.000Z",
          "wordCount": 1925,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "DevOps, SRE, and Platform Engineering"
        },
        {
          "description": "Jordan Eldredge:\nWebamp.org’s visualizer, Butterchurn, now uses WebAssembly (Wasm) to achieve better performance and improved security. Whereas most projects use Wasm by compiling pre-existing native code to Wasm, Butterchurn uses an in-browser compiler to compile untrusted user-supplied code to fast and secure Wasm at runtime.\n\nDiscuss on Changelog News",
          "link": "https://jordaneldredge.com/blog/speeding-up-winamps-music-visualizer-with-webassembly/",
          "publishedOn": "2021-08-11T16:38:00.000Z",
          "wordCount": 1410,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Speeding up Webamp's music visualizer with WebAssembly"
        },
        {
          "description": "Chris Coyier is not too pleased about browsers changing the way cross-origin iframes handle certain native JavaScript calls such as alert and confirm:\nCross-origin iframes are essentially the heart of how CodePen works. You write code, and we execute it for you in an iframe that doesn’t share the same domain as CodePen itself, as the very first line of security defense. We didn’t hear any heads up or anything, but I’m sure the plans were on display.\nThe change is about security and performance, it seems. Th…",
          "link": "https://css-tricks.com/choice-words-about-the-upcoming-deprecation-of-javascript-dialogs/",
          "publishedOn": "2021-08-11T15:46:00.000Z",
          "wordCount": 2300,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Choice words about the upcoming deprecation of JavaScript dialogs"
        },
        {
          "description": "This week we’re joined by Lara Hogan – author of Resilient Management and management coach &amp; trainer for the tech industry. Lara lead engineering teams at Kickstarter and Etsy before she, and Deepa Subramaniam stepped away from their deep roots in the tech industry to start Wherewithall – a consultancy that helps level up managers and emerging leaders.\nThe majority of our conversation focuses on the four primary hats leaders and managers end up wearing; mentoring, coaching, sponsoring, and delivering fe…",
          "link": "https://changelog.com/podcast/453",
          "publishedOn": "2021-08-11T11:00:00.000Z",
          "wordCount": 559,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 453: Leading leaders who lead engineers"
        },
        {
          "description": "The WeTransfer team recently finished a big migration with the goal achieving Single Sign On (SSO) across their 3 products.\nThis post goes into the details on why they chose Auth0, how the migration process went, the challenges they faced, and the things they learned along the way. Here’s an example of one of their learnings:\nThink about accounts ownerships between products. Is it possible for an attacker to take control of another account with the same email? How do you avoid that? We decided to ask for cr…",
          "link": "https://wetransfer.com/blog/story/migrating-millions-of-users-to-auth0-without-downtime",
          "publishedOn": "2021-08-10T15:26:00.000Z",
          "wordCount": 1964,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Migrating millions of users to Auth0 without downtime"
        },
        {
          "description": "SLICED is like the TV Show Chopped but for data science. Competitors get a never-before-seen dataset and two-hours to code a solution to a prediction challenge. Meg and Nick, the SLICED show hosts, join us in this episode to discuss how the show is creating much needed data science community. They give us a behind the scenes look at all the datasets, memes, contestants, scores, and chat of SLICED.\n\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disa…",
          "link": "https://changelog.com/practicalai/144",
          "publishedOn": "2021-08-10T14:40:00.000Z",
          "wordCount": 476,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 144: SLICED - will you make the (data science) cut?"
        },
        {
          "description": "The opener on this post by Alex Kotliarskyi spoke to me so deeply I felt like I wrote it myself:\nIn my lifetime I’ve tried a dozen todo apps. In the beginning they all seem different, novel and special. Slick UI, shortcuts, tags, subtasks, the list goes on and on.\nBut all our stories were the same: I start using the new app, then after awhile I stop using it.\nEven my most minimalist system ever eventually fell by the wayside. Alex is on to something here, and whoever figures it out will be able to check “su…",
          "link": "https://blog.frantic.im/all/todo-apps-are-meant-for-robots/",
          "publishedOn": "2021-08-10T13:49:00.000Z",
          "wordCount": 806,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "TODO apps are meant for robots"
        },
        {
          "description": "This week Adam is joined by Asim Aslam, the founder of Micro - a new cloud platform entirely focused on the developer experience of consuming and publishing public APIs. Asim’s journey spans many years of open source work on Micro. His sole focus right now, is evolving that work into a commercially viable business. This episode is jam-packed with stories of great timing, grit, resilence, success and failure, and, of course, lessons learned.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get…",
          "link": "https://changelog.com/founderstalk/77",
          "publishedOn": "2021-08-09T21:00:00.000Z",
          "wordCount": 453,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 77: From open source to commercially viable"
        },
        {
          "description": "A proof-of-concept inspired and enabled by Hosting SQLite Databases on GitHub Pages and the ensuing Hacker News post. The compiled single-page app supports autocomplete for titles, automatic redirecting &amp; other MediaWiki datasets like WikiQuote or Chinese Wikipedia. It makes no external API calls except to get Wikipedia’s images.\n2MB of CSS, JS, and WASM. One 43GB SQLite file.\nDiscuss on Changelog News",
          "link": "http://static.wiki/",
          "publishedOn": "2021-08-09T18:52:00.000Z",
          "wordCount": 10,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wikipedia using only static assets & no backend"
        },
        {
          "description": "The top 1% of companies spend thousands of hours building their own A/B testing platforms in-house. The other 99% are left paying for expensive 3rd party SaaS tools or hacking together unmaintained open source libraries.\nGrowth Book gives you the flexibility and power of a fully-featured in-house A/B testing platform without needing to build it yourself.\n\nDiscuss on Changelog News",
          "link": "https://github.com/growthbook/growthbook",
          "publishedOn": "2021-08-09T15:36:00.000Z",
          "wordCount": 998,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "GrowthBook – an open source A/B testing platform"
        },
        {
          "description": "Rainer Hahnekamp:\nOn 24th April 2021, Angular announced the deprecation of their E2E testing tool protractor. It was unclear if there will be a successor or if Angular delegates this to its users. In this article, I will provide a short overview over the differences between the various E2E frameworks, and argue why you should use Cypress.\nI’ve heard nothing but high praise of Cypress and thoroughly enjoyed our conversation with Gleb Bahmutov when he joined us on JS Party.\nDiscuss on Changelog News",
          "link": "https://www.rainerhahnekamp.com/en/angular-e2e-testing-protractor-is-dead-long-live-cypress/",
          "publishedOn": "2021-08-09T14:26:00.000Z",
          "wordCount": 1425,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Protractor is dead, long live Cypress"
        },
        {
          "description": "On this episode, we make our big Frontend Feud announcement, welcome Amelia to the party, then share a metric crap ton of productivity tips &amp; tricks: scripting, pomodoro, retaining your dev flow, and more!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, t…",
          "link": "https://changelog.com/jsparty/187",
          "publishedOn": "2021-08-06T16:30:00.000Z",
          "wordCount": 452,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 187: When (and how) to say NO"
        },
        {
          "description": "Not only does Drew DeVault have a lot of insightful and interesting things to say about Postgres, I’m just generally a fan of people praising good software. Many people are quick to offer criticism, but slow to heap some praise. Let’s change that, maybe?\nAfter 25 years of persistence, and a better logo design, Postgres stands today as one of the most significant pillars of profound achievement in free software, alongside the likes of Linux and Firefox. PostgreSQL has taken a complex problem and solved it to…",
          "link": "https://drewdevault.com/2021/08/05/In-praise-of-Postgres.html",
          "publishedOn": "2021-08-06T14:18:00.000Z",
          "wordCount": 948,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "In praise of PostgreSQL"
        },
        {
          "description": "A new open-source desktop operating system that aims to provide a similar experience and compatibility with macOS on x86-64 systems. It builds on the solid foundations of FreeBSD, existing open source packages in the same space, and new code to fill the gaps. Airyx aims to feel sleek, stable, familiar and intuitive, handle your daily tasks, and provide as much compatibility as possible with the commercial OS that inspired it.\nThis is largely the effort of one hacker in her spare time. It’s still early days,…",
          "link": "https://github.com/mszoek/airyx",
          "publishedOn": "2021-08-06T13:27:00.000Z",
          "wordCount": 879,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A macOS-like operating system based on FreeBSD"
        },
        {
          "description": "That’s a big addition. Here’s what Hillary Juma (Common Voice’s community mgr) had to say about it:\nInternet access is increasingly mediated through speech: Voice assistants and smart speakers give us directions, search for information, connect us to friends, used in assistive technology and much more. Yet this technology doesn’t work for millions of people. For example, neither Amazon’s Alexa, Apple’s Siri, nor Google Home support a single native African language.\nBy giving individuals the ability to share…",
          "link": "https://foundation.mozilla.org/en/blog/mozilla-common-voice-adds-16-new-languages-and-4600-new-hours-of-speech/",
          "publishedOn": "2021-08-05T19:57:00.000Z",
          "wordCount": 473,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mozilla Common Voice adds 16 new languages and 4,600 new hours of speech"
        },
        {
          "description": "Mat Ryer and Jerod Santo sit down to review and discuss the MOST and LEAST unpopular “unpopular opinions” since we started keeping track of such things. Also Generics.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any computing resource anywhere. Engineers and security teams can unify access to SSH servers, Kubernetes clusters, web applications, and databases across all environmen…",
          "link": "https://changelog.com/gotime/191",
          "publishedOn": "2021-08-05T16:30:00.000Z",
          "wordCount": 738,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 191: Opening up the opinion box"
        },
        {
          "description": "Mapus is a tool to explore and annotate collaboratively on a map. You can draw, add markers, lines, areas, find places to go, observe other users, and much more.\nIt’s self-host only because 💰💰💰 but so cool!\n\nDiscuss on Changelog News",
          "link": "https://github.com/alyssaxuu/mapus",
          "publishedOn": "2021-08-05T14:28:00.000Z",
          "wordCount": 1678,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Maps with real-time collaboration 🗺️"
        },
        {
          "description": "I love how Shopify’s Polaris team researched their options on replacing Sass in the open:\nThe Polaris team is exploring alternatives to Sass that better serve our current needs from CSS. Stay tuned for a follow up on our explorations and learning.\nIn the meantime, we want to know your thoughts on removing Sass! Join the conversation in the comments below..\nThe comment thread that follows details the pros and cons of many replacement options including Tailwind, CSS Modules, and vanilla-extract (which they ul…",
          "link": "https://github.com/Shopify/polaris/discussions/44",
          "publishedOn": "2021-08-05T13:39:00.000Z",
          "wordCount": 2250,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Shopify engineers on replacing Sass"
        },
        {
          "description": "This week we’re sharing a special episode of our new podcast called Ship It. This episode is our Kaizen-style episode where we point our lens inward to Changelog.com to see what we should improve next. The plan is do this episode style every 10 episodes.\nGerhard, Adam, and Jerod talk about the things that we want to improve in our setup over the next few months. We talk about how the June Fastly outage affected changelog.com, how we responded that day, and what we could do better. We discuss multi-cloud, mu…",
          "link": "https://changelog.com/podcast/452",
          "publishedOn": "2021-08-05T11:00:00.000Z",
          "wordCount": 549,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 452: Kaizen! The day half the internet went down"
        },
        {
          "description": "In this episode, Gerhard talks to his Skyhook Adventure friends: Alan Cooney, Saul Cullen &amp; Wycliffe Maina. They are the ones that introduced Gerhard to the world of serverless in the context of Amazon Web Services. Gerhard shared his experience with remote work, how to ship software with confidence and consistency, and what to look for in infrastructure as code.\nAt the heart of Skyhook Adventure are adventure trips, and 2020 was not a good one for this business. As you can already tell, code and infras…",
          "link": "https://changelog.com/shipit/13",
          "publishedOn": "2021-08-04T18:00:00.000Z",
          "wordCount": 623,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 13: A monorepo of serverless microservices"
        },
        {
          "description": "Brewster Kahle, founder of the Internet Archive:\nAs a young man, I wanted to help make a new medium that would be a step forward from Gutenberg’s invention hundreds of years before.\nBy building a Library of Everything in the digital age, I thought the opportunity was not just to make it available to everybody in the world, but to make it better–smarter than paper. By using computers, we could make the Library not just searchable, but organizable; make it so that you could navigate your way through millions,…",
          "link": "https://blog.archive.org/2021/07/21/reflections-as-the-internet-archive-turns-25/",
          "publishedOn": "2021-08-04T16:19:00.000Z",
          "wordCount": 2496,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reflections as the Internet Archive turns 25"
        },
        {
          "description": "axum focuses on ergonomics and modularity. It can:\nRoute requests to handlers with a macro free API.\nDeclaratively parse requests using extractors.\nSimple and predictable error handling model.\nGenerate responses with minimal boilerplate.\nTake full advantage of the [tower] and [tower-http] ecosystem of middleware, services, and utilities.\nLots of axum doing various webby things right here.\nDiscuss on Changelog News",
          "link": "https://github.com/tokio-rs/axum",
          "publishedOn": "2021-08-04T15:32:00.000Z",
          "wordCount": 1047,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A Rusty web framework built with Tokio, Tower, and Hyper"
        },
        {
          "description": "AI is being used to transform the most personal instrument we have, our voice, into something that can be “played.” This is fascinating in and of itself, but Yotam Mann from Never Before Heard Sounds is doing so much more! In this episode, he describes how he is using neural nets to process audio in real time for musicians and how AI is poised to change the music industry forever.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRu…",
          "link": "https://changelog.com/practicalai/143",
          "publishedOn": "2021-08-03T18:45:00.000Z",
          "wordCount": 421,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 143: AI is creating never before heard sounds! 🎵"
        },
        {
          "description": "The FSF is funding white papers on “philosophical and legal questions around Copilot”. In their post announcing the fund, Donald Robertson states:\nThe Free Software Foundation has received numerous inquiries about our position on these questions. We can see that Copilot’s use of freely licensed software has many implications for an incredibly large portion of the free software community. Developers want to know whether training a neural network on their software can really be considered fair use. Others who…",
          "link": "https://www.fsf.org/blogs/licensing/fsf-funded-call-for-white-papers-on-philosophical-and-legal-questions-around-copilot",
          "publishedOn": "2021-08-03T15:41:00.000Z",
          "wordCount": 1461,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Free Software Foundations declares GitHub Copilot \"unacceptable and unjust\""
        },
        {
          "description": "For the past year, my friend, Ole Kröger, and I have been developing a native animation package in Julia called, Javis.jl. Through our development process, we have been able to build a nearly 70 person developer community, sponsor Google summer of code students, and help new Julia programmers create powerful visuals! We recently presented the tool at JuliaCon, and were able to show its use for educational outreach and beyond.\nOur hope is that this open source tool can be used by programmers, educators, prof…",
          "link": "https://github.com/Wikunia/Javis.jl",
          "publishedOn": "2021-08-03T14:54:00.000Z",
          "wordCount": 962,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Javis.jl - Julia animations and visualizations"
        },
        {
          "description": "Node recently introduced timers/promises API which provides functionality such as setTimeout and setInterval but using Promises. Developers usually achieved that functionality with various 3rd-party packages but now they have full STD support with additional features like native cancellation.\nSo, I thought it would be useful to have that same API available in browsers (even down to IE11) and older Node versions!\nDiscuss on Changelog News",
          "link": "https://github.com/niksy/isomorphic-timers-promises",
          "publishedOn": "2021-08-03T14:07:00.000Z",
          "wordCount": 1033,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Node `timers/promises` for browser and server"
        },
        {
          "description": "Jessica Kerr, TL;DR’ing herself for you:\nWhen different parts of an organization need to coordinate, it seems like a good idea to help them coordinate smoothly and frequently. Don’t. Help them coordinate less — more explicitly, less often.\nI think she may be on to something here…\nDiscuss on Changelog News",
          "link": "https://jessitron.com/2021/08/02/better-coordination-or-better-software/",
          "publishedOn": "2021-08-02T21:09:00.000Z",
          "wordCount": 1299,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Better coordination, or better software?"
        },
        {
          "description": "We’re releasing Triton 1.0, an open-source Python-like programming language which enables researchers with no CUDA experience to write highly efficient GPU code—most of the time on par with what an expert would be able to produce.\nOpenAI continues to deliver the goods for the AI community.\nDiscuss on Changelog News",
          "link": "https://www.openai.com/blog/triton/",
          "publishedOn": "2021-08-02T15:25:00.000Z",
          "wordCount": 2926,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Introducing Triton: open source GPU programming for neural networks"
        },
        {
          "description": "Tim Perry:\nThere’s been a lot of discussion recently about how “Safari is the new IE”\nI don’t want to rehash the basics of that, but I have seen some interesting rebuttals, most commonly: Safari is actually protecting the web, by resisting adding unnecessary and experimental features that create security/privacy/bloat problems.\nThat is worth further discussion, because it’s widespread, and wrong.\nDiscuss on Changelog News",
          "link": "https://httptoolkit.tech/blog/safari-is-killing-the-web/",
          "publishedOn": "2021-08-02T14:33:00.000Z",
          "wordCount": 4618,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Safari isn't protecting the web, it's killing it"
        },
        {
          "description": "in version 2.23 of git, two new commands have been introduced to replace the old git checkout (git checkout is still available, but people new to git should start with these ones preferably). As you would expect, they basically each implement one of the two behaviors described previously, splitting git checkout in two.\nTIL!\nDiscuss on Changelog News",
          "link": "https://www.banterly.net/2021/07/31/new-in-git-switch-and-restore/",
          "publishedOn": "2021-08-02T13:44:00.000Z",
          "wordCount": 1008,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "New in Git: switch and restore"
        },
        {
          "description": "This week we’re talking with Nick Janetakis about modern unix tools, and the various commands, tooling, and ways we use the commmand line. Do you Bash or Zsh? Do you use cat or bat? What about man vs tldr? Today’s show is a deep dive into unix tools you know and love, or should know and maybe love.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxDB – InfluxDB empowers developers to build IoT, analytics, and monitoring softwa…",
          "link": "https://changelog.com/podcast/451",
          "publishedOn": "2021-07-31T01:00:00.000Z",
          "wordCount": 448,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 451: Modern Unix tools"
        },
        {
          "description": "This week we talk with Kent C. Dodds, one of the greatest React teachers in the industry, all about React! Why choose React over another framework? What are the hardest parts about learning React? You’ll find out this week!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance issu…",
          "link": "https://changelog.com/jsparty/186",
          "publishedOn": "2021-07-30T14:30:00.000Z",
          "wordCount": 499,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 186: Getting hooked on React"
        },
        {
          "description": "Gerhard talks to Tom Wilkie, VP of Product for Grafana Labs. They talk about Loki, Tempo, and how can Grafana Cloud offer such a generous free tier. The solution is in the Cortex architecture, which was used in Loki and in Tempo too. Yes, Tom is the Cortex co-author. We recommend that you listen to this episode in combination with episodes 3 and 11. That’s the best way to get a more complete picture of the topics that we discuss today.\nLastly, would you like to watch Gerhard &amp; Tom pair-up and build Graf…",
          "link": "https://changelog.com/shipit/12",
          "publishedOn": "2021-07-30T14:30:00.000Z",
          "wordCount": 542,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 12: Grafana’s \"Big Tent\" idea"
        },
        {
          "description": "Accessibility when designing for a screen is not an exception to the Pareto principle. We believe that just about 20% of designer effort can solve up to 80% of accessibility challenges for digital interfaces. Read on for an extensive collection of practical tips that can help you build a great foundation for a11y—right at the mockup stage.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/accessible-design-from-the-get-go",
          "publishedOn": "2021-07-30T14:30:00.000Z",
          "wordCount": 3350,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Accessible design from the get-go"
        },
        {
          "description": "Peanut provides a REST API, Admin Dashboard and a command line tool to deploy and configure the commonly used services like databases, message brokers, graphing, tracing, caching tools … etc. It perfectly suited for development, manual testing, automated testing pipelines where mocking is not possible and test drives.\nUnder the hood, it works with the containerization runtime like docker to deploy and configure the service. Destroy the service if it is a temporary one.\nTechnically you can achieve the same w…",
          "link": "https://github.com/Clivern/Peanut",
          "publishedOn": "2021-07-29T20:53:00.000Z",
          "wordCount": 2137,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deploy databases and services easily for dev and testing pipelines"
        },
        {
          "description": "Jon Stokes believes blockchain tech has the opportunity to take us from a world where individual corporations build their siloed users tables to a world where the entire Internet shares a single users table.\nIn place of a decentralized network of user data silos connected by APIs, there’s a single decentralized user data store accessible via an open protocol and a decentralized network of storage nodes. So the identity-hosting blockchain represents decentralization at the datastore implementation layer, and…",
          "link": "https://1729.com/the-billion-user-table",
          "publishedOn": "2021-07-29T20:04:00.000Z",
          "wordCount": 2697,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The billion user table"
        },
        {
          "description": "Programs like AWS Activate, the Google Cloud Startup Program, and Hatch by DigitalOcean offer free cloud credits to startups to help them grow. For software projects that aren’t eligible for funding through one of these incubators, most cloud providers also offer free tiers and services for a limited time. Google Cloud, for example, offers a free three-month trial and $300 in credits for their services.\nIn the early stages of development, free anything sounds like a no-brainer. Who doesn’t like free stuff? …",
          "link": "https://changelog.com/posts/your-free-cloud-credits-are-up-now-what",
          "publishedOn": "2021-07-29T19:18:53.000Z",
          "wordCount": 1166,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Your free cloud credits are up. Now what?"
        },
        {
          "description": "To k8s or not to k8s, that is the question on lots of people’s minds these days. In this post on Stack Overflow’s blog, Max Horstmann argues it’s worth doing… and worth doing right away.\nIf you’re building a new app today, it might be worth taking a closer look at making it cloud-native and using Kubernetes from the jump. The effort to set up Kubernetes is less than you think. Certainly, it’s less than the effort it would take to refactor your app later on to support containerization.\nDiscuss on Changelog N…",
          "link": "https://stackoverflow.blog/2021/07/21/why-you-should-build-on-kubernetes-from-day-one/",
          "publishedOn": "2021-07-29T14:46:00.000Z",
          "wordCount": 5582,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why you should build on Kubernetes from day one"
        },
        {
          "description": "The panel are joined by Teiva Harsanyi, author of 100 Go Mistakes, to talk about how best to make mistakes when writing Go.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database on the planet. Build and scale fast with CockroachCloud (CockroachDB hosted as a service) where a team of world-class SREs maintains and manages your da…",
          "link": "https://changelog.com/gotime/190",
          "publishedOn": "2021-07-29T14:00:00.000Z",
          "wordCount": 457,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 190: How to make mistakes in Go"
        },
        {
          "description": "Buzz Anderson lays out the history of one of the most beloved/hated tools in every developer’s tool belt:\nThe concept of a regular expression has a surprisingly interesting history that dates back to the optimistic, mid-20th Century heyday of artificial intelligence research.\nThe term itself originated with mathematician Stephen Kleene. In 1943, neuroscientist Warren McCulloch and logician Walter Pitts had just described the first mathematical model of an artificial neuron, and Kleene, who specialized in th…",
          "link": "https://whyisthisinteresting.substack.com/p/the-regular-expression-edition",
          "publishedOn": "2021-07-29T13:28:00.000Z",
          "wordCount": 1618,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The history of regular expressions"
        },
        {
          "description": "Alex Koutmos:\nIf you follow my blog, you have probably noticed that my articles usually revolve around some deep technical problems and how to go about solving these problems using the amazing Elixir programming language. These posts usually discuss the technical merits surrounding Elixir and the Erlang virtual machine, but rarely touch on the “human” aspects of Elixir.\nThe goal of today’s post will be to address some of the non-technical aspects of the Elixir programming language and talk about the profoun…",
          "link": "https://akoutmos.com/post/betting-on-elixir/",
          "publishedOn": "2021-07-28T15:26:00.000Z",
          "wordCount": 2764,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The human side of Elixir"
        },
        {
          "description": "At the first glance Python’s operator module might not seem very interesting. It includes many operator functions for arithmetic and binary operations and a couple of convenience and helper functions. They might not seem so useful, but with help of just a few of these functions you can make your code faster, more concise, more readable and more functional. So, in this article we will explore this great Python module and make the most out of the every function included in it.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/54",
          "publishedOn": "2021-07-28T14:39:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The unknown features of Python's `operator` module"
        },
        {
          "description": "Hemanth HM added a page to his website that highlights new features in ES2021: logical assignment operators, numerical separators (e.g. 1_000_000), Promise.any, and more. So if you don’t know, now you know.\nDiscuss on Changelog News",
          "link": "https://h3manth.com/ES2021/",
          "publishedOn": "2021-07-28T13:50:00.000Z",
          "wordCount": 316,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "ES2021 features!"
        },
        {
          "description": "Inspired by a recent article from Erik Bernhardsson titled “Building a data team at a mid-stage startup: a short story”, Chris and Daniel discuss all things AI/data team building. They share some stories from their experiences kick starting AI efforts at various organizations and weight the pro and cons of things like centralized data management, prototype development, and a focus on engineering skills.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads…",
          "link": "https://changelog.com/practicalai/142",
          "publishedOn": "2021-07-27T14:45:00.000Z",
          "wordCount": 399,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 142: Building a data team"
        },
        {
          "description": "NocoDB will turn any MySQL, PostgreSQL, SQL Server, SQLite, or MariaDB into a smart-spreadsheet. Built with Node and Vue.js. Deploy directly to Heroku or with Docker.\n\nDiscuss on Changelog News",
          "link": "https://github.com/nocodb/nocodb",
          "publishedOn": "2021-07-27T14:24:00.000Z",
          "wordCount": 1463,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An open source AirTable alternative"
        },
        {
          "description": "Apollo is a different type of search engine. Traditional search engines (like Google) are great for discovery when you’re trying to find the answer to a question, but you don’t know what you’re looking for.\nHowever, they’re very poor at recall and synthesis when you’ve seen something before on the internet somewhere but can’t remember where. Trying to find it becomes a nightmare - how can you synthezize the great material on the internet when you forgot where it even was? I’ve wasted many an hour combing th…",
          "link": "https://github.com/amirgamil/apollo",
          "publishedOn": "2021-07-27T13:36:00.000Z",
          "wordCount": 2629,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A Unix-style personal search engine and web crawler for your digital footprint"
        },
        {
          "description": "David Sacks shared frameworks for Series A, B, and C stage SaaS startup orgs, saying they can be “helpful as a starting point.”\nYou’re the founder of a nicely growing SaaS startup which has just raised a Series A, Series B, or Series C funding round. You need to hire rapidly to seize the opportunity. But how much should you hire, what roles should you hire, and what should the org chart look like when you’re done?\nDiscuss on Changelog News",
          "link": "https://sacks.substack.com/p/the-saas-org-chart",
          "publishedOn": "2021-07-26T18:02:50.000Z",
          "wordCount": 990,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building out your SaaS org"
        },
        {
          "description": "After nearly two years of design and development, IBM Plex is now open source and free to use. Check the site for all the details and what makes Plex… Plex.\n\nDiscuss on Changelog News",
          "link": "https://github.com/IBM/plex",
          "publishedOn": "2021-07-26T15:28:09.000Z",
          "wordCount": 1246,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "IBM Plex"
        },
        {
          "description": "I first heard the term runbook on Ship It! #10 when we were discussing potential incident management platforms and Gerhard mentioned the topic. In this brief post, Ash Patel describes them as:\nAn SRE’s best friend, runbooks can help engineering teams stop putting out the same fires again and again.\nDiscuss on Changelog News",
          "link": "https://ashpatel.substack.com/p/runbooks-for-better-incident-management",
          "publishedOn": "2021-07-26T14:12:00.000Z",
          "wordCount": 491,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Runbooks for better incident management"
        },
        {
          "description": "This is not a use-it-in-the-real-world kinda thing. It’s being written as a learning project, but may interest you if you want to learn about database internals. It includes:\nRaft-based distributed consensus engine for linearizable state machine replication.\nACID-compliant transaction engine with MVCC-based snapshot isolation.\nPluggable storage engine with B+tree and log-structured backends.\nIterator-based query engine with heuristic optimization and time-travel support.\nSQL interface including projections,…",
          "link": "https://github.com/erikgrinaker/toydb",
          "publishedOn": "2021-07-26T13:25:00.000Z",
          "wordCount": 1145,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "toyDB – a distributed SQL db written in Rust"
        },
        {
          "description": "Julia stuck around after our Vim interview to share some of her Vim setup with me. She shows off the Visual Mode feature that I learned on the pod and shared her love of macros as well!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=mFKrw_zTbpc",
          "publishedOn": "2021-07-24T14:26:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Vimming with Julia Evans"
        },
        {
          "description": "Miguel Carranza from RevenueCat lays out why he and his co-founder decided to provide equal compensation for the same role regardless of location. Here’s the bullet points of their reasoning:\nThe quality of the work is equivalent\nImmigration can be a challenge\nKeeping up with the competition\nIt’s simpler\nIt’s part of our company mission\nRead his post for the details along with some downsides of this approach.\nDiscuss on Changelog News",
          "link": "https://www.revenuecat.com/blog/the-case-for-location-independent-salaries",
          "publishedOn": "2021-07-24T13:26:00.000Z",
          "wordCount": 1126,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The case for location-independent salaries"
        },
        {
          "description": "Feross is back with a brand new web app for us to pick apart! Wormhole is the fastest way to send files on the internet and we want to know why he built it, how it works, and what crazy hacks he invented along the way.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance issues ac…",
          "link": "https://changelog.com/jsparty/185",
          "publishedOn": "2021-07-23T16:15:00.000Z",
          "wordCount": 441,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 185: Into the Wormhole"
        },
        {
          "description": "The Free Motion Capture (FreeMoCap) system leverages bleeding-edge markerless motion capture software (e.g. OpenPose, DeepLabCut, etc) to create a streamlined ‘one-click’ pipeline for 3D kinematic reconstruction.\nThis is still in development, but you can hop into the source to check out what they’re up to.\n\nDiscuss on Changelog News",
          "link": "http://jonmatthis.com/fmc.html",
          "publishedOn": "2021-07-23T14:06:00.000Z",
          "wordCount": 307,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The FreeMoCap Project"
        },
        {
          "description": "Gary stuck around after our Vim interview to share some of his Vim setup with me. If you’ve never seen Gary use Vim, this is a must-watch. The guy moves at the speed of thought. 🏃‍♂️\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=iF4RvQq6yU0",
          "publishedOn": "2021-07-23T13:19:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Vimming with Gary Bernhardt"
        },
        {
          "description": "I believe Chris Coyier put that period at the end of this post title for a reason:\nPutting images on websites is incredibly simple, yes? Actually, yes, it is. You use &lt;img&gt; and link it to a valid source in the src attribute and you’re done. Except that there are (counts fingers) 927 things you could (and some you really should) do that often go overlooked. Let’s see…\nHe goes on to list 15 bullet points of things to consider. This images situation is actually a microcosm of the web (and all software?) …",
          "link": "https://css-tricks.com/images-are-hard/",
          "publishedOn": "2021-07-22T19:30:00.000Z",
          "wordCount": 970,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Images are hard."
        },
        {
          "description": "By adding visual elements to your tests, you can gain more options to add meaningful ways in maintaining a high level of quality for your app. Colby Fayock explains how.\nThis article pairs nicely with what Angie Jones had to say about visual testing on Our recent JS Party episode.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2021/07/maintaining-end-to-end-quality-visual-testing/",
          "publishedOn": "2021-07-22T18:44:00.000Z",
          "wordCount": 4491,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Maintaining end-to-end quality with visual testing"
        },
        {
          "description": "Gerhard talks with Charity Majors, ops engineer and accidental startup founder at honeycomb.io about high-performing teams, why “15 minutes or bust,” and how we should start using Honeycomb in our own monolithic Phoenix app that runs changelog.com. There is just one step, and it’s actually really simple!\nThey also talk about how Honeycomb uses Honeycomb to learn about Honeycomb, which is one of Gerhard’s favorite questions. As for key take-aways, deploying straight into production is really important, but n…",
          "link": "https://changelog.com/shipit/11",
          "publishedOn": "2021-07-22T16:45:00.000Z",
          "wordCount": 513,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 11: Honeycomb's secret to high-performing teams"
        },
        {
          "description": "What is a Product Manager, and do Engineers need them? In this episode, we will be discussing what a Product Manager does, what makes a good Product Manager, and debating if engineering teams truly need them, with some tech companies going without them. We are joined by Gaëlle Sharma, Senior Technical Product Manager, at the New York Times, leading the Identity group.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs …",
          "link": "https://changelog.com/gotime/189",
          "publishedOn": "2021-07-22T16:20:00.000Z",
          "wordCount": 432,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 189: Do devs need a product manager?"
        },
        {
          "description": "This open source project is made in the hope to replicate the Windows 11 desktop experience on web, using standard web technologies like React, CSS (SCSS), and JS.\nThe project description says “in React”, but the source code is comprised of 93.5% CSS. I love this portion of the README that addresses why the author built it (I assume they get this question a lot).\nWHY NOT? Why not just waste a week of your life creating a react project just to coverup your insecurities of how incompetent you are. Just Why no…",
          "link": "https://win11.blueedge.me",
          "publishedOn": "2021-07-22T15:25:00.000Z",
          "wordCount": 12,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Windows 11 in React"
        },
        {
          "description": "Suz stuck around after our Vim interview to share some of her Vim setup with me. She created an epic plugin that lets her Twitch audience comment on specific lines while she’s editing. Definitely worth a 👀!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=iJHnvGIj09A",
          "publishedOn": "2021-07-22T14:38:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Vimming with Suz Hinton"
        },
        {
          "description": "Battlesnake’s Brad Van Vugt:\nThis past spring on Coding Badly, Joe and I, for whatever reason, challenged ourselves to build a camera-controlled Battlesnake. The result was “Facesnake” – a Battlesnake controlled in real-time using your face and webcam. This post outlines how we built it using Replit and tracking.js :-)\nYou can also jump straight to the source code or watch Facesnake in action here.\nDiscuss on Changelog News",
          "link": "https://blog.battlesnake.com/controlling-a-battlesnake-with-your-face/",
          "publishedOn": "2021-07-22T13:50:00.000Z",
          "wordCount": 1786,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Controlling a battlesnake with a webcam, Replit, and your face"
        },
        {
          "description": "This keeps getting better! We talked with @lawik about the same topic a few weeks back on Ship It! #7. We even did a follow-up YouTube stream. I intend to continue this conversation if Maik is up for it 🎙\nDiscuss on Changelog News",
          "link": "https://ably.com/blog/no-we-dont-use-kubernetes",
          "publishedOn": "2021-07-21T17:00:00.000Z",
          "wordCount": 4671,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "No, we don’t use Kubernetes"
        },
        {
          "description": "Too often, web tiers are full of boilerplate that does nothing except convert a result set into JSON. A middle tier could be as simple as a function call that returns JSON. All we need is an easy way to convert result sets into JSON in the database.\nPostgreSQL has built-in JSON generators that can be used to create structured JSON output right in the database, upping performance and radically simplifying web tiers. Fortunately, PostgreSQL has such functions, that run right next to the data, for better perfo…",
          "link": "https://blog.crunchydata.com/blog/generating-json-directly-from-postgres",
          "publishedOn": "2021-07-21T15:12:00.000Z",
          "wordCount": 1051,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Generating JSON directly from Postgres"
        },
        {
          "description": "On this special edition of The Changelog, we tell Vim’s story from the mouths of its users. Julia Evans, Drew Neil, Suz Hinton, and Gary Bernhardt join Jerod Santo for a deep and wide-ranging discussion about “the best text editor that anyone ever wrote.”\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to…",
          "link": "https://changelog.com/podcast/450",
          "publishedOn": "2021-07-21T14:15:00.000Z",
          "wordCount": 9353,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 450: Why we 💚 Vim"
        },
        {
          "description": "This expands on topics that we have discussed in Ship It! #11 and covers community findings on the practices that make the biggest difference for:\nHigher productivity\nImprovement in code quality\nEnd-user satisfaction\nSoftware developer retention\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=W3UU2lsQDoo",
          "publishedOn": "2021-07-20T17:34:00.000Z",
          "wordCount": 27,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mature teams ship better code faster and you can too"
        },
        {
          "description": "In 1984 John Gage of Sun Microsystems was credited as saying “The Network is the computer.” Almost four decades ago, John had a vision of distributed systems working together to be greater than the sum of their parts.\nFor this article, I surveyed the land of hosted IDEs and it turns out that we’ve progressed beyond running VS Code on an iPad whilst sipping a cocktail.\nYou can still do that, but there’s way more to it today and I’ll take you through some of use-cases and add my own thoughts. There’s also a p…",
          "link": "https://blog.alexellis.io/the-internet-is-my-computer/",
          "publishedOn": "2021-07-20T16:43:00.000Z",
          "wordCount": 2495,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Internet is my computer"
        },
        {
          "description": "Angle-grinder allows you to parse, aggregate, sum, average, min/max, percentile, and sort your data. You can see it, live-updating, in your terminal. Angle grinder is designed for when, for whatever reason, you don’t have your data in graphite/honeycomb/kibana/sumologic/splunk/etc. but still want to be able to do sophisticated analytics.\nAngle grinder can process well above 1M rows per second (simple pipelines as high as 5M), so it’s usable for fairly meaty aggregation. The results will live update in your …",
          "link": "https://github.com/rcoh/angle-grinder",
          "publishedOn": "2021-07-20T15:55:00.000Z",
          "wordCount": 4074,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Slice and dice logs on the command line with Angle Grinder"
        },
        {
          "description": "9 out of 10 AI projects don’t end up creating value in production. Why? At least partly because these projects utilize unstable models and drifting data. In this episode, Roey from BeyondMinds gives us some insights on how to filter garbage input, detect risky output, and generally develop more robust AI systems.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nPSSC Labs – Solutions from PSSC Labs provide a cost effective, highly s…",
          "link": "https://changelog.com/practicalai/141",
          "publishedOn": "2021-07-20T15:00:00.000Z",
          "wordCount": 397,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 141: Towards stability and robustness"
        },
        {
          "description": "This week we’re talking to Rasmus Andersson about his journey as a software creator. We talk about the work he’s doing right now on Playbit, a computing environment which encourages playful learning, building, and sharing of software. We also talk about his work on the Inter typeface, as well as the reasons why this font family needed to be free and open source.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourceg…",
          "link": "https://changelog.com/podcast/449",
          "publishedOn": "2021-07-19T20:30:00.000Z",
          "wordCount": 493,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 449: The story behind Inter"
        },
        {
          "description": "k6 describes itself as “like unit testing, for performance.” It’s an open source tool that can be run locally or on their cloud. The company behind the tool was recently acquired by Grafana, so the project is now a Grafana Labs thing. You write your scripts in JavaScript and they run on a Go backend engine.\n\nDiscuss on Changelog News",
          "link": "https://k6.io/",
          "publishedOn": "2021-07-19T16:13:00.000Z",
          "wordCount": 1226,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A modern load testing tool, using Go and JavaScript"
        },
        {
          "description": "There are server colocation providers that allow hosting a 1U server for as low as $30/month, but there’s a catch: There are restrictions on power usage (1A @ 120v max, for example) because they’re expecting small and power-efficient network equipment like firewalls.\nThis repo is about designing a server that fits within the 1U space and 1A @ 120v power constraint while maximizing computing power, storage, and value.\n\nDiscuss on Changelog News",
          "link": "https://github.com/pawl/raspberry-pi-1u-server",
          "publishedOn": "2021-07-19T15:27:00.000Z",
          "wordCount": 3302,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A low power 1U Raspberry Pi cluster server"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": [
        {
          "description": "comma.ai introduces comma three with 360° vision\nFeaturing the most powerful triple-camera system to ever live on your windshield.\nSan Diego, California – comma today announced the comma three devkit, delivering innovations that make the world’s highest rated ADAS system even more powerful, improving the features people use the most throughout their drives. comma three introduces a powerful triple-camera system, offering a 360 degree view of the road, plus a narrow cam to see even the furthest away objects.…",
          "link": "https://blog.comma.ai/comma-three-press-release/",
          "publishedOn": "2021-07-31T18:00:00.000Z",
          "wordCount": 797,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "comma three Press Release"
        }
      ]
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "From the early days of the internet to the development of the Human Genome Project, U.S. government-funded R&amp;D has yielded remarkable progress for society, and today it is an important engine for AI research. That’s why, last year, we were proud to announce our partnership with the U.S. National Science Foundation (NSF) to provide $5M to support the establishment of national research institutes working in the area of Human-AI Interaction and Collaboration (HAIC). This partnership—which is part of a more…",
          "link": "https://blog.google/technology/ai/partnering-nsf-research-institute-ai-improve-elderly-care/",
          "publishedOn": "2021-07-29T15:10:00.000Z",
          "wordCount": 1229,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Partnering with the NSF on a research institute for AI to improve care for older adults"
        },
        {
          "description": "Between 2020 and 2050, Africa’s population is expected to double, adding 950 million more people to its urban areas alone. However, according to 2018 figures, a scarcity of affordable housing in many African cities has forced over half of the city dwellers in Sub-Saharan Africa to live in informal settlements. And in rural areas, many also occupy makeshift structures due to widespread poverty. \nThese shelters have remained largely undetectable using traditional monitoring tools. Machine learning, computer v…",
          "link": "https://blog.google/around-the-globe/google-africa/using-ai-to-map-africas-buildings/",
          "publishedOn": "2021-07-28T16:00:00.000Z",
          "wordCount": 1456,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Using AI to map Africa’s buildings"
        },
        {
          "description": "In 2019, our Quantum AI team achieved a beyond-classical computation by outperforming the world’s fastest classical computer. Today, a quantum processor from the Sycamore generation that accomplished this important computing milestone will be donated to the Deutsches Museum of Masterpieces of Science and Technology in Munich, Germany. \nThe Deutsches Museum has one of the largest collections of science and technology artifacts in the world. This means that the Sycamore will share the same exhibition space as…",
          "link": "https://blog.google/technology/ai/our-quantum-processor-deutsches-museum/",
          "publishedOn": "2021-07-28T08:00:00.000Z",
          "wordCount": 1088,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Our quantum processor at the Deutsches Museum"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "&#8220;The GitHub Stars program thanks GitHub’s most influential developers and gives them a platform to showcase their work, reach more people, and shape the future of GitHub.&#8221; That&#8217;s a quote from stars.github.com. In the beginning of June 2021 I was invited into the program. I consider it an honor to be recognized. See my featured &#8230; Continue reading A GitHub star &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/08/11/a-github-star/",
          "publishedOn": "2021-08-11T12:18:48.000Z",
          "wordCount": 1015,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "A GitHub star"
        },
        {
          "description": "Back in February of this year, I received one of the most chilling emails in my life when someone threatened my life: &#8220;I will slaughter you&#8220;. That email penetrated something deep into my soul and heart and I was not quite myself for a few days. Almost six month later (a few days ago), I &#8230; Continue reading Nocai&#8217;s apology &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/08/09/nocais-apology/",
          "publishedOn": "2021-08-09T07:19:31.000Z",
          "wordCount": 1716,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Nocai’s apology"
        },
        {
          "description": "Welcome to another release! We did more bug-fixes than in any previous release (176). We paid more in bug-bounties than during any previous release cycle (4,200 USD) and we thank more contributors in the RELEASE-NOTES than ever before (83). Release presentation Numbers the 201st release6 changes56 days (total: 8,524)176 bug-fixes (total: 7,142)263 commits (total: 27,465)0 &#8230; Continue reading curl 7.78.0 five in one &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/21/curl-7-78-0-five-in-one/",
          "publishedOn": "2021-07-21T07:32:03.000Z",
          "wordCount": 1364,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.78.0 five in one"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-08-14T12:17:11.190Z",
          "wordCount": 2221,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-08-14T12:17:09.228Z",
          "wordCount": 3228,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-08-14T12:17:09.196Z",
          "wordCount": 2278,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-08-14T12:17:08.430Z",
          "wordCount": 1457,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan",
          "publishedOn": "2021-08-14T12:17:08.416Z",
          "wordCount": 2260,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2021-08-14T12:17:08.396Z",
          "wordCount": 2396,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Logging at Twitter: Updated"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-08-14T12:17:08.350Z",
          "wordCount": 1790,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2021-08-13T12:17:53.542Z",
          "wordCount": 1282,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Applying flame graphs outside of performance analysis"
        },
        {
          "description": "As part of this year’s DEFCON AI Village, we’re trying something radical by introducing the industry’s first algorithmic bias bounty competition.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-07-31T12:17:33.822Z",
          "wordCount": 880,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter’s first algorithmic bias bounty challenge"
        },
        {
          "description": "In this post, we will discuss our recent work on neural graph diffusion networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "publishedOn": "2021-07-24T12:17:02.451Z",
          "wordCount": 2888,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Graph Neural Networks as Neural Diffusion PDEs"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "The world’s most popular women’s health app, Flo Health, is responsible for the sensitive health data of 40 million women. With that much PII under their purview, Flo Health’s CISO knew that enabling his security team with the most advanced security testing methods was of the utmost importance to brand trust and user loyalty.",
          "link": "https://www.hackerone.com/blog/one-month-learnings-flo-healths-bug-bounty-program-qa-ciso-leo-cunningham",
          "publishedOn": "2021-08-04T15:00:00.000Z",
          "wordCount": 1610,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "One Month of Learnings from Flo Health’s Bug Bounty Program: A Q&A with CISO, Leo Cunningham"
        },
        {
          "description": "The world’s most popular women’s health app, Flo Health, is responsible for the sensitive health data of 40 million women. With that much PII under their purview, Flo Health’s CISO knew that enabling his security team with the most advanced security testing methods was of the utmost importance to brand trust and user loyalty.",
          "link": "https://www.hackerone.com/blog/vulnerability-management/one-month-learnings-flo-healths-bug-bounty-program-qa-ciso-leo",
          "publishedOn": "2021-08-04T14:00:00.000Z",
          "wordCount": 1709,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "One Month of Learnings from Flo Health’s Bug Bounty Program: A Q&A with CISO, Leo Cunningham"
        },
        {
          "description": "Wondering about vulnerability assessments? We give a full explanation of what vulnerability assessments are, how they work, and how they help prevent cyberattacks.",
          "link": "https://www.hackerone.com/blog/vulnerability-assessment-i-complete-guide",
          "publishedOn": "2021-07-30T13:15:00.000Z",
          "wordCount": 1353,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Assessment I A Complete Guide"
        },
        {
          "description": "Earlier this month, software vendor Kaseya made headlines when a vulnerability in its Virtual System Administrator (VSA) software led to an epidemic of the REvil ransomware.\n\nGlobal ransomware attacks are on the rise, with REvil attacks the most common. According to this year’s IBM X-Force Threat Intelligence Index, REvil ransomware actors made at least $123 million in 2020 and stole nearly 21.6 terabytes of data.",
          "link": "https://www.hackerone.com/blog/vulnerability-management/what-we-can-learn-recent-ransomware-attacks",
          "publishedOn": "2021-07-23T17:00:00.000Z",
          "wordCount": 1666,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What We Can Learn From Recent Ransomware Attacks"
        },
        {
          "description": "What can we learn from recent ransomware attacks where bad actors like REvil made over $120 million in 2020 alone? Organizations may have effective security but still fall prey to attacks due to supplier system vulnerabilities. Learn how you can use VDPs and hacker-powered security to stay safe.",
          "link": "https://www.hackerone.com/blog/what-we-can-learn-recent-ransomware-attacks",
          "publishedOn": "2021-07-23T17:00:00.000Z",
          "wordCount": 1548,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What We Can Learn From Recent Ransomware Attacks"
        },
        {
          "description": "HackerOne and PagerDuty have partnered to create a workflow automation integration that feeds critical and high severity vulnerability findings into PagerDuty alerts to notify security teams and take timely action immediately.",
          "link": "https://www.hackerone.com/blog/vulnerability-management/how-use-hackerone-and-pagerduty-identify-when-vulnerabilities-need",
          "publishedOn": "2021-07-19T14:00:00.000Z",
          "wordCount": 964,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How to Use HackerOne and PagerDuty to Identify When Vulnerabilities Need Action"
        },
        {
          "description": "Organizations rely on security testing to identify vulnerabilities, but how do they know when a vulnerability is critical and needs immediate attention? HackerOne and PagerDuty partnered to create a workflow automation integration that identifies when critical vulnerabilities need action minimizing cyber risk and remediation time.",
          "link": "https://www.hackerone.com/blog/hackerone-and-pagerduty-partner-identify-when-vulnerabilities-need-action",
          "publishedOn": "2021-07-19T14:00:00.000Z",
          "wordCount": 853,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How to Use HackerOne and PagerDuty to Identify When Vulnerabilities Need Action"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "August is already here, which means so is Firefox 91! For developers, Firefox 91 supports the Visual Viewport API and Intl.DateTimeFormat object additions.\nThe post Hopping on Firefox 91 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/08/hopping-on-firefox-91/",
          "publishedOn": "2021-08-10T15:04:27.000Z",
          "wordCount": 973,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Hopping on Firefox 91"
        },
        {
          "description": "Last month, Gregor Weber and Peter Bengtsson added an autocomplete search to MDN Web Docs, that allows you to quickly jump straight to the document you're looking for by typing parts of the document title. This is the story about how that's implemented. \nThe post How MDN&#8217;s autocomplete search works appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/08/mdns-autocomplete-search/",
          "publishedOn": "2021-08-03T15:49:30.000Z",
          "wordCount": 1490,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "How MDN’s autocomplete search works"
        },
        {
          "description": "As we’re all aware by now, we made some big platform changes at the end of 2020. Whilst the big move has happened, it’s given us a great opportunity to clear out the cupboards and closets. \nThe post Spring Cleaning MDN: Part 1 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/07/spring-cleaning-mdn-part-1/",
          "publishedOn": "2021-07-20T16:00:48.000Z",
          "wordCount": 418,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Spring Cleaning MDN: Part 1"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "The open source Git project just released Git 2.33, with features and bug fixes from over 74 contributors. Here's a look at some of the most interesting features and changes.",
          "link": "https://github.blog/2021-08-16-highlights-from-git-2-33/",
          "publishedOn": "2021-08-16T23:15:27.000Z",
          "wordCount": 3754,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Highlights from Git 2.33"
        },
        {
          "description": "The benefits of multifactor authentication are widely documented, and there are a number of options for using 2FA on GitHub.",
          "link": "https://github.blog/2021-08-16-securing-your-github-account-two-factor-authentication/",
          "publishedOn": "2021-08-16T18:00:51.000Z",
          "wordCount": 761,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Securing your GitHub account with two-factor authentication"
        },
        {
          "description": "A public beta for CodeQL package manager, additional options to manage Actions runs from first-time contributors, GitHub Discussions translation, and more.",
          "link": "https://github.blog/2021-08-12-whats-new-from-github-changelog-july-2021-recap/",
          "publishedOn": "2021-08-13T00:15:37.000Z",
          "wordCount": 976,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? July 2021 Recap"
        },
        {
          "description": "This GitHub Classroom extension for Visual Studio Code provides a simplified introduction to Git, GitHub Classroom, and Visual Studio Code.",
          "link": "https://github.blog/2021-08-12-teaching-learning-github-classroom-visual-studio-code/",
          "publishedOn": "2021-08-12T18:00:00.000Z",
          "wordCount": 705,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Seamless teaching and learning through GitHub Classroom and Visual Studio Code"
        },
        {
          "description": "Over the past months, we’ve left our macOS model behind and moved to Codespaces for the majority of GitHub.com development.",
          "link": "https://github.blog/2021-08-11-githubs-engineering-team-moved-codespaces/",
          "publishedOn": "2021-08-11T16:00:14.000Z",
          "wordCount": 2293,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub’s Engineering Team has moved to Codespaces"
        },
        {
          "description": "The GitHub Campus Expert applications are officially open for the August 2021 generation!",
          "link": "https://github.blog/2021-08-09-august-2021-campus-experts-applications-are-open/",
          "publishedOn": "2021-08-09T14:00:52.000Z",
          "wordCount": 824,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "August 2021 Campus Experts applications are open!"
        },
        {
          "description": "It&#8217;s been a busy time of the year for our Hubbers (GitHub employees). We&#8217;ve been shipping products, getting ready for launches, and taking some much needed time off for the summer. Well, it&#8217;s summer for",
          "link": "https://github.blog/2021-08-05-release-radar-jun-jul-2021/",
          "publishedOn": "2021-08-05T17:00:45.000Z",
          "wordCount": 1843,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · Mid-year 2021 Edition"
        },
        {
          "description": "In July, we experienced no incidents resulting in service downtime to our core services. Please follow our status page for real time updates. To learn more about what we’re working on, check out the GitHub",
          "link": "https://github.blog/2021-08-04-github-availability-report-july-2021/",
          "publishedOn": "2021-08-04T16:00:45.000Z",
          "wordCount": 243,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: July 2021"
        },
        {
          "description": "Today, we’re happy to announce more than 15 new integrations with open source security tools that broaden our language coverage to include PHP, Swift, Kotlin, Ruby, and more.",
          "link": "https://github.blog/2021-07-28-new-code-scanning-integrations-open-source-security-tools/",
          "publishedOn": "2021-07-28T16:01:02.000Z",
          "wordCount": 1185,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "15+ new code scanning integrations with open source security tools"
        },
        {
          "description": "GitHub’s Developer Defense Fund will enable independent legal support from the Stanford Juelsgaard Clinic to review and handle appropriate DMCA cases for developers on GitHub and across the software ecosystem.",
          "link": "https://github.blog/2021-07-27-github-developer-rights-fellowship-stanford-law-school/",
          "publishedOn": "2021-07-27T14:00:34.000Z",
          "wordCount": 767,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Standing up for developers: the GitHub Developer Rights Fellowship at Stanford Law School"
        },
        {
          "description": "When you move from 1 maintainer to 1+N maintainers of your project, things can get complicated. Minimum Viable Governance (MVG) is a simple, easy-to-implement governance framework for your free and open source projects.",
          "link": "https://github.blog/2021-07-22-minimum-viable-governance-lightweight-community-structure-foss-projects/",
          "publishedOn": "2021-07-22T17:00:32.000Z",
          "wordCount": 1060,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Minimum Viable Governance: lightweight community structure to grow your FOSS projects"
        },
        {
          "description": "GitHub’s supply chain security features are now available for Go modules, which will help the Go community discover, report, and prevent security vulnerabilities.",
          "link": "https://github.blog/2021-07-22-github-supply-chain-security-features-go-community/",
          "publishedOn": "2021-07-22T16:00:25.000Z",
          "wordCount": 865,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub brings supply chain security features to the Go community"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "Machine learning (ML) models are very sensitive pieces of software; their successful use needs careful monitoring to make sure they are working correctly.\nThe post ML Model Monitoring &#8211; 9 Tips From the Trenches appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/ml-model-monitoring-9-tips-from-the-trenches/",
          "publishedOn": "2021-08-16T17:48:43.000Z",
          "wordCount": 5168,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "ML Model Monitoring – 9 Tips From the Trenches"
        },
        {
          "description": "Reinventing the premium experience in the credit card industry from Brazil\nThe post Designing Nubank Ultravioleta: always purple, metalic and premium appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-ultravioleta/",
          "publishedOn": "2021-07-22T13:46:26.000Z",
          "wordCount": 4544,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Designing Nubank Ultravioleta: always purple, metalic and premium"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}