{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Anna Hupa,&nbsp; Marc Henson, and Martin Straka, Google VRP Team&nbsp;\n\n\n\nOur Abuse Bug Bounty program has proved tremendously successful in the past three years since its introduction – thanks to our incredibly engaged community of researchers. Their contributions resulted in +1,000 valid bugs, helping us raise the bar in combating product abuse.\nAs a result of this continued success, today we are announcing a new experimental Abuse Research Grants Program in addition to the already existing Vuln…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/tKjA9YjPiSk/announcing-new-abuse-research-grants.html",
          "publishedOn": "2021-06-04T13:03:00.006Z",
          "wordCount": 629,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing New Abuse Research Grants Program"
        },
        {
          "description": "Posted by Badr Salmi, Google Safe Browsing &amp; Varun Khaneja, Chrome Security \nIn 2020 we launched Enhanced Safe Browsing, which you can turn on in your Chrome security settings, with the goal of substantially increasing safety on the web. These improvements are being built on top of existing security mechanisms that already protect billions of devices. Since the initial launch, we have continuously worked behind the scenes to improve our real-time URL checks and apply machine learning models to warn on p…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/-aonhXBJuDM/new-protections-for-enhanced-safe.html",
          "publishedOn": "2021-06-03T17:00:00.024Z",
          "wordCount": 944,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "New protections for Enhanced Safe Browsing users in Chrome"
        },
        {
          "description": "Posted by Jon Markoff and Sean Smith, Android Security and Privacy Team\n\n \nIntegrating security into your app development lifecycle can save a lot of time, money, and risk. That’s why we’ve launched Security by Design on Google Play Academy to help developers identify, mitigate, and proactively protect against security threats. \nThe Android ecosystem, including Google Play, has many built-in security features that help protect developers and users. The course Introduction to app security best practices take…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/2vy9ZDhnfjU/introducing-security-by-design.html",
          "publishedOn": "2021-05-26T17:00:00.003Z",
          "wordCount": 739,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Security By Design"
        },
        {
          "description": "Research Team: Salman Qazi, Yoongu Kim, Nicolas Boichat, Eric Shiu &amp; Mattias Nissler&nbsp;\n\nToday, we are sharing details around our discovery of Half-Double, a new Rowhammer technique that capitalizes on the worsening physics of some of the newer DRAM chips to alter the contents of memory.\nRowhammer is a DRAM vulnerability whereby repeated accesses to one address can tamper with the data stored at other addresses. Much like speculative execution vulnerabilities in CPUs, Rowhammer is a breach of the sec…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/Y2QoJFBaTug/introducing-half-double-new-hammering.html",
          "publishedOn": "2021-05-25T15:59:00.000Z",
          "wordCount": 862,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Half-Double: New hammering technique for DRAM Rowhammer bug"
        },
        {
          "description": "Posted by Ivan Lozano, Android Team\n\nThe Android team has been working on introducing the Rust programming language into the Android Open Source Project (AOSP) since 2019 as a memory-safe alternative for platform native code development. As with any large project, introducing a new language requires careful consideration. For Android, one important area was assessing how to best fit Rust into Android’s build system. Currently this means the Soong build system (where the Rust support resides), but these desi…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/RTirZGlM7IY/integrating-rust-into-android-open.html",
          "publishedOn": "2021-05-11T17:31:00.001Z",
          "wordCount": 2603,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Integrating Rust Into the Android Open Source Project"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "This week we’re joined by Ryan Dahl, Node.js creator, and now the creator of Deno - a simple, modern and secure runtime for JavaScript and TypeScript that uses V8 and is built in Rust.\nWe talk with Ryan about the massive success of Node and how it impacted his life, how he eventually created Deno and what he’s doing differently this time around. We also talk about The Deno Company, and what’s in store for Deno Delpoy.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, a…",
          "link": "https://changelog.com/podcast/443",
          "publishedOn": "2021-06-08T12:00:00.000Z",
          "wordCount": 485,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 443: Exploring Deno Land 🦕"
        },
        {
          "description": "Powered by Mediapipe, TensorFlow, and Jeeliz.\n\nDiscuss on Changelog News",
          "link": "https://handsfree.dev",
          "publishedOn": "2021-06-07T16:31:00.000Z",
          "wordCount": 2044,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Add face, hand, and pose tracking to your projects in a snap ✨👌"
        },
        {
          "description": "I was clueless how big and competitive a marketplace Chrome extensions are until Oleg Anashkin decided to document all of the proposals he’s received over the years to monetize Hover Zoom+. His reasoning:\nThe main reason I continue to maintain this extension is because I can hardly trust others to not fall for one of these offers. I’m fortunate to have a job that pays well enough to allow me to keep my moral compass and ignore all of these propositions. I realize that not everyone has the same financial sec…",
          "link": "https://github.com/extesy/hoverzoom/discussions/670",
          "publishedOn": "2021-06-07T15:03:00.000Z",
          "wordCount": 9240,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Chrome extension devs get hit up incessantly with monetization proposals"
        },
        {
          "description": "We first talked fuzzing with Katie Hockman back in August of 2020. Fast-forward 10 months and native fuzzing in Go is ready for beta testing! Here’s Katie explaining fuzzing, for the uninitiated:\nFuzzing is a type of automated testing which continuously manipulates inputs to a program to find issues such as panics or bugs. These semi-random data mutations can discover new code coverage that existing unit tests may miss, and uncover edge case bugs which would otherwise go unnoticed. Since fuzzing can reach t…",
          "link": "https://blog.golang.org/fuzz-beta",
          "publishedOn": "2021-06-07T13:53:00.000Z",
          "wordCount": 747,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go's fuzzing effort now in beta"
        },
        {
          "description": "Eric Simons and the StackBlitz team recently announced WebContainers which let you run Node.js natively in your browser! This has BIG implications and leaves us with many BIG questions like: how did they do it, why did they do it, and where does it go from here? Tune in! Keyword: BIG\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy …",
          "link": "https://changelog.com/jsparty/178",
          "publishedOn": "2021-06-04T16:35:00.000Z",
          "wordCount": 391,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 178: Running Node natively in the browser"
        },
        {
          "description": "Nick Janetakis shares a few patterns he’s picked up based on using Docker since 2014 for many freelance projects. He also posted a timestamped video version on YouTube if you’d prefer to watch over reading.\nDiscuss on Changelog News",
          "link": "https://nickjanetakis.com/blog/best-practices-around-production-ready-web-apps-with-docker-compose",
          "publishedOn": "2021-06-04T15:29:00.000Z",
          "wordCount": 7003,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Best practices around production ready web apps with Docker Compose"
        },
        {
          "description": "Most people who use GraphQL haven’t read the spec, often because it sounds or looks intimidating. This post simply and cogently shares the essentials of the query language section of the spec.\nDiscuss on Changelog News",
          "link": "https://blog.graphql.guide/the-graphql-spec-simplified-93005ce0671f",
          "publishedOn": "2021-06-04T14:39:00.000Z",
          "wordCount": 2168,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The GraphQL spec, simplified"
        },
        {
          "description": "If you updated your Firefox to version 89 and were not-so-pleasantly surprised by the brand new Proton interface, this Lepton project may be of interest to you. Lepton doesn’t throw Proton out with the bath water, but aims to improve some key aspects the author didn’t appreciate.\nDiscuss on Changelog News",
          "link": "https://github.com/black7375/Firefox-UI-Fix",
          "publishedOn": "2021-06-04T13:48:00.000Z",
          "wordCount": 896,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An attempt to improve Firefox's new Proton UI"
        },
        {
          "description": "Open Source Insights is an experimental service developed and hosted by Google to help developers better understand the structure, construction, and security of open source software packages. The service examines each package, constructs a full, detailed graph of its dependencies and their properties, and makes the results available to anyone who could benefit from them. The goal is to provide developers with a picture of how their software is put together, how that changes as dependencies change, and what …",
          "link": "https://deps.dev/",
          "publishedOn": "2021-06-03T18:03:00.000Z",
          "wordCount": 11,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Google's experimental Open Source Insights project"
        },
        {
          "description": "In the past decade a variety of games have emerged where players need to create an AI to play the game rather than play the game directly. In this episode we speak with the creator of one of those games - Battlesnake. Brad Van Vugt joins us to talk about building a game engine using Go, making programming games easier for beginners to get started with, the long term vision for games like Battlesnake, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make …",
          "link": "https://changelog.com/gotime/182",
          "publishedOn": "2021-06-03T16:20:00.000Z",
          "wordCount": 459,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 182: Go Battlesnake Go!"
        },
        {
          "description": "I hadn’t heard of Prosus prior to this announcement, so if you’re at all like me, this is for you:\nProsus invests globally across a range of online platforms focused on areas such as food delivery, classifieds and fintech. It also maintains a more than $200 billion holding in Tencent. Prosus’ parent company, Naspers Ltd., acquired the Tencent stake in 2001 for $34 million.\nTurning $34 million into $200 billion is quite the feat. They’re a savvy bunch, if nothing else. Joel Spolsky also wrote about the acqui…",
          "link": "https://www.wsj.com/articles/software-developer-community-stack-overflow-sold-to-tech-giant-prosus-for-1-8-billion-11622648400",
          "publishedOn": "2021-06-03T14:57:00.000Z",
          "wordCount": 1622,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Stack Overflow sold to tech giant Prosus for $1.8 billion"
        },
        {
          "description": "Due to concerns over control of user information, multiple volunteers have resigned from Freenode to found Libera Chat. This FAQ notes:\nWhat it appears to come down to, is that Andrew Lee is attempting to essentially take over the network by drowning staff in lawyers.\nDiscuss on Changelog News",
          "link": "https://libera.chat/news/welcome-to-libera-chat",
          "publishedOn": "2021-06-03T13:55:00.000Z",
          "wordCount": 372,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Libera Chat –  a next-gen IRC network for FOSS projects"
        },
        {
          "description": "Craig Kerstiens:\nPostgres has had “JSON” support for nearly 10 years now. I put JSON in quotes because well, 10 years ago when we announced JSON support we kinda cheated. We validated JSON was valid and then put it into a standard text field. Two years later in 2014 with Postgres 9.4 we got more proper JSON support with the JSONB datatype. My colleague @will likes to state that the B stands for better. In Postgres 14, the JSONB support is indeed getting way better.\nA small but solid improvement to how you q…",
          "link": "https://blog.crunchydata.com/blog/better-json-in-postgres-with-postgresql-14",
          "publishedOn": "2021-06-02T18:17:00.000Z",
          "wordCount": 1391,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Better JSON in Postgres with PostgreSQL 14"
        },
        {
          "description": "This is the resource that Una Kravets said we’d put in the show notes on JS Party #176. I thought it was worth a direct linking in News as well, since it’s so freakin’ well-done and useful:\nYou’ll learn CSS fundamentals like the box model, cascade and specificity, flexbox, grid and z-index. And, along with these fundamentals, you’ll learn about functions, color types, gradients, logical properties and inheritance to make you a well-rounded front-end developer, ready to take on any user interface.\nDiscuss on…",
          "link": "https://web.dev/learn/css/",
          "publishedOn": "2021-06-02T15:22:00.000Z",
          "wordCount": 1040,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An evergreen CSS course and reference to level up your web styling expertise"
        },
        {
          "description": "This isn’t merely a speech-to-text thing. It also provides intent recognition, which makes it great for doing voice commands. For example, when trained with this template, the following command:\n$ voice2json transcribe-wav \\\n      &lt; turn-on-the-light.wav | \\\n      voice2json recognize-intent | \\\n      jq .\n\nProduces this JSON event:\n{\n    &quot;text&quot;: &quot;turn on the light&quot;,\n    &quot;intent&quot;: {\n        &quot;name&quot;: &quot;LightState&quot;\n    },\n    &quot;slots&quot;: {\n        &quo…",
          "link": "https://github.com/synesthesiam/voice2json",
          "publishedOn": "2021-06-02T13:42:00.000Z",
          "wordCount": 893,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Command-line tools for speech and intent recognition on Linux"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Ben Ford, former Royal Marine and founder of Commando Development, about the OODA loop (observe, orient, decide, act). Shipping is just a small part of it. The OODA loop that you know is probably the wrong one. We explore Mission &amp; Command, Situational Awareness and a few other practices that will help you deal with complexity as you code and ship. As a former Royal Marine Commando, Ben learned these skills the hard way, and then refined them over many years as a…",
          "link": "https://changelog.com/shipit/4",
          "publishedOn": "2021-06-02T11:00:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 4: OODA for operational excellence"
        },
        {
          "description": "Tuhin Srivastava tells Daniel and Chris why BaseTen is the application development toolkit for data scientists.  BaseTen’s goal is to make it simple to serve machine learning models, write custom business logic around them, and expose those through API endpoints without configuring any infrastructure.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernete…",
          "link": "https://changelog.com/practicalai/136",
          "publishedOn": "2021-06-01T22:00:00.000Z",
          "wordCount": 369,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 136: The fastest way to build ML-powered apps"
        },
        {
          "description": "JupyterLite is a JupyterLab distribution that runs entirely in the browser built from the ground up using JupyterLab components and extensions.\nTry it now with JupyterLab and/or RetroLab.\nDiscuss on Changelog News",
          "link": "https://github.com/jtpio/jupyterlite",
          "publishedOn": "2021-06-01T19:41:00.000Z",
          "wordCount": 1057,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wasm powered Jupyter running in the browser"
        },
        {
          "description": "Boring avatars is a tiny JavaScript React library that generates custom, SVG-based, round avatars from any username and color palette.\nCool, but it’d be even cooler if it detached from React so we could all use it. It’d also be nice if you could opt to having the initials overlay the gradient.\n\nDiscuss on Changelog News",
          "link": "https://github.com/boringdesigners/boring-avatars",
          "publishedOn": "2021-06-01T14:44:00.000Z",
          "wordCount": 669,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A little React library to replace your boring fallback avatars"
        },
        {
          "description": "Sometimes to solve a problem we tend to choose a set of tools we got used to. How often we pick a tool just because we know it, and not necessarily because it’s the right one for a task at hand? These are my rules to overcome that.\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/a-hacker-mindset/",
          "publishedOn": "2021-06-01T13:37:00.000Z",
          "wordCount": 517,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A hacker mindset"
        },
        {
          "description": "This week is all about Maintainer Week — it’s a week long event starting June 7th for open source maintainers to gather, share, and be celebrated. We’re joined by Josh Simmons (Ecosystem Strategy Lead at Tidelift &amp; President of Open Source Initiative) and Kara Sowles (Senior Open Source Program Manager at GitHub). Of course we love open source maintainers, that’s why we’re so excited about Maintainer Week and making it an annual thing. Today we talk through all the details of this event, what we can exp…",
          "link": "https://changelog.com/podcast/442",
          "publishedOn": "2021-05-28T21:00:00.000Z",
          "wordCount": 478,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 442: Maintainer week!"
        },
        {
          "description": "Debugging containerized workloads is a daily task for everyone who works with Kubernetes, which can be made much simpler with kubectl debug - a beta feature of Kubernetes. In the article you will learn how to make it available in your cluster, how it works, as well as some examples how you can use it to easily debug both Kubernetes Pods and worker Nodes.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/49",
          "publishedOn": "2021-05-28T16:29:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The easiest way to debug Kubernetes workloads"
        },
        {
          "description": "Brian LeRoux has been building the web long enough to see many ways we produce HTML come in and go out of fashion. On this episode, he joins Amal &amp; Nick to discuss the past, present, and potential future of rendering patterns on the web. SSR, ISR, &amp; DSR (oh my!)\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open y…",
          "link": "https://changelog.com/jsparty/177",
          "publishedOn": "2021-05-28T15:30:00.000Z",
          "wordCount": 406,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 177: Let's talk rendering patterns"
        },
        {
          "description": "Docker images can leak runtime secrets, build secrets, and even just some secret files you have lying around. Learn how to leak them, and (probably more usefully) how to avoid leaks.\nDiscuss on Changelog News",
          "link": "https://pythonspeed.com/articles/leaking-secrets-docker/",
          "publishedOn": "2021-05-28T14:49:00.000Z",
          "wordCount": 1320,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to (not) use Docker to share your password with hackers"
        },
        {
          "description": "This is an opinionated list that goes so far as to tell you what to avoid and some options to use instead. I’d love if they’d also tell you why to avoid things. For example, under the Photo Editing and Management section they say to avoid VSCO. Yeah but why?!\nDiscuss on Changelog News",
          "link": "https://github.com/pluja/awesome-privacy",
          "publishedOn": "2021-05-28T14:03:00.000Z",
          "wordCount": 4613,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A curated list of services and alternatives that respect your privacy"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Alex Koutmos about Elixir observability using PromEx. Why do we need to understand how our setup behaves? What is PromEx and where does PromEx fit in changelog.com?\nBonus! Tune in to our LIVE Friday evening deploy 😱 of Erlang 24 in the context of changelog.com. Check the show notes for a link on YouTube. Bring your own popcorn 🍿\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The…",
          "link": "https://changelog.com/shipit/3",
          "publishedOn": "2021-05-28T12:20:00.000Z",
          "wordCount": 463,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 3: Elixir observability using PromEx"
        },
        {
          "description": "This week on Ship It! Gerhard is joined by Constance Caramanolis, Principal Engineer at Splunk and former maintainer of Envoy Proxy, and Stephen Augustus, Head of Open Source at Cisco &amp; self-proclaimed Caesar of Systems. Constance and Stephen are the KubeCon + CloudNativeCon co-chairs. Join us to find out what happens before and after KubeCon gets shipped.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The Zero DevOp…",
          "link": "https://changelog.com/shipit/2",
          "publishedOn": "2021-05-28T12:10:00.000Z",
          "wordCount": 441,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 2: Shipping KubeCon EU 2021"
        },
        {
          "description": "Welcome to Ship It! This is a new show from Changelog about shipping software - and all the details, challenges, and problems that surface. Changelog SRE Gerhard Lazu is taking us on a journey into the world of shipping code, infrastructure, ops, and the people making it happen.\nShipping is near and dear to every developers’ heart. We do it every day. It’s the essential first step. You have to ship it to share your ideas with the world. New episodes ship weekly.\nDiscuss on Changelog News\nJoin Changelog++ to…",
          "link": "https://changelog.com/shipit/1",
          "publishedOn": "2021-05-28T12:00:00.000Z",
          "wordCount": 300,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 1: Introducing Ship It!"
        },
        {
          "description": "In this episode, we will talk about building for Blockchain in Go. We are joined by two of the co-founders of Prysmatic Labs (a company behind the upgrades to the Ethereum network). Raul Jordan and Preston Van Loon tell Angelica how they started the company, as well as what it’s like to build technical infrastructure for the Ethereum blockchain using Go.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by…",
          "link": "https://changelog.com/gotime/181",
          "publishedOn": "2021-05-27T15:30:00.000Z",
          "wordCount": 411,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 181: Building for Ethereum in Go"
        },
        {
          "description": "WireGuard Easy uses Docker to set up WireGuard VPN along with a web UI for easy management. While this may be the easiest way to get up and running, I’d still advise checking out Algo VPN as well since it’s also pretty easy and has been designed/configured with maximum security in mind. Still, this looks cool and the web admin UI makes it quite approachable as well.\n\nDiscuss on Changelog News",
          "link": "https://github.com/WeeJeWel/wg-easy",
          "publishedOn": "2021-05-27T14:13:00.000Z",
          "wordCount": 737,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The easiest way to install & manage WireGuard on any Linux host"
        },
        {
          "description": "rpg-cli is a bare-bones JRPG-inspired terminal game written in Rust. It can work as an alternative to cd where you randomly encounter enemies as you change directories.\nYou’ll want to practice a bit first, then once you get good at it go ahead and override the builtin cd by adding this function to your bash profile.\ncd () {\n   rpg-cli &quot;$@&quot;\n   builtin cd &quot;$(rpg-cli --pwd)&quot;\n}\n\n\nDiscuss on Changelog News",
          "link": "https://github.com/facundoolano/rpg-cli",
          "publishedOn": "2021-05-27T13:27:00.000Z",
          "wordCount": 1275,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "rpg-cli —your filesystem as a dungeon!"
        },
        {
          "description": "Chris Manson goes into detail about the benefits of a clean git history and describes some tips and tricks that really help you clean up your branches and Pull Requests.\nDiscuss on Changelog News",
          "link": "https://simplabs.com/blog/2021/05/26/keeping-a-clean-git-history/",
          "publishedOn": "2021-05-26T15:44:00.000Z",
          "wordCount": 3325,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The magic of keeping a clean Git history"
        },
        {
          "description": "Today we’re sharing a special crossover episode from The Changelog podcast here on Practical AI. Recently, Daniel Whitenack joined Jerod Santo to talk with José Valim, Elixir creator, about Numerical Elixir. This is José’s newest project that’s bringing Elixir into the world of machine learning. They discuss why José chose this as his next direction, the team’s layered approach, influences and collaborators on this effort, and their awesome collaborative notebook that’s built on Phoenix LiveView.\nDiscuss on…",
          "link": "https://changelog.com/practicalai/135",
          "publishedOn": "2021-05-26T14:45:00.000Z",
          "wordCount": 445,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 135: Elixir meets machine learning"
        },
        {
          "description": "Works out of the box, no configuration required. Great alternative to TeamViewer and AnyDesk! You have full control of your data, with no concerns about security. You can use our rendezvous/relay server, set up your own, or write your own rendezvous/relay server.\nThe built-in file transfer and tunneling look great.\nDiscuss on Changelog News",
          "link": "https://github.com/rustdesk/rustdesk",
          "publishedOn": "2021-05-26T14:32:00.000Z",
          "wordCount": 929,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An open source RDP client in Rust"
        },
        {
          "description": "Tom MacWright on the pendulum swinging back and forth between simple and “fancy”\nTechnology is seeing a little return to complexity. Dreamweaver gave way to hand-coding websites, which is now leading into Webflow, which is a lot like Dreamweaver. Evernote give way to minimal Markdown notes, which are now becoming Notion, Coda, or Craft. Visual Studio was “disrupted” by Sublime Text and TextMate, which are now getting replaced by Visual Studio Code. JIRA was replaced by GitHub issues, which is getting outmod…",
          "link": "https://macwright.com/2021/03/16/return-of-fancy-tools.html",
          "publishedOn": "2021-05-26T13:32:00.000Z",
          "wordCount": 537,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The return of fancy tools"
        },
        {
          "description": "This week we’re talking about the latest infrastructure updates we’ve made for 2021. We’re joined by Gerhard Lazu, our resident SRE here at Changelog, talking about the improvements we’ve made to 10x our speed and be 100% available. We also mention the new podcast we’re launching, hosted by Gerhard. Stick around the last half of the show for more details.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nLinode – Get $100 in free cr…",
          "link": "https://changelog.com/podcast/441",
          "publishedOn": "2021-05-21T21:00:00.000Z",
          "wordCount": 469,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 441: Inside 2021's infrastructure for Changelog.com"
        },
        {
          "description": "This week Emma and Adam are joined by Una Kravets to discuss difficult parts of CSS.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open your browser and dive in. Learn more and keep your teams’ skills sharp at oreilly.com/changelog\n\n    \nRaygun – With Raygun Error and Performance Monitoring you have all the information yo…",
          "link": "https://changelog.com/jsparty/176",
          "publishedOn": "2021-05-21T16:00:00.000Z",
          "wordCount": 414,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 176: CSS! Everyone's favorite programming language"
        },
        {
          "description": "Porter brings the Heroku experience to your own AWS/GCP account, while upgrading your infrastructure to Kubernetes. Get started on Porter without the overhead of DevOps and customize your infrastructure later when you need to.\nFor more on Porter, tune in to Go Time live on June 1st! Mat Ryer will be asking Carolyn Van Slyck all about it. If live isn’t an option… subscribe to Go Time, why don’t ya?\nDiscuss on Changelog News",
          "link": "https://github.com/porter-dev/porter",
          "publishedOn": "2021-05-21T14:11:00.000Z",
          "wordCount": 1141,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Porter is a Kubernetes-powered PaaS that runs in your own cloud provider"
        },
        {
          "description": "The Parcel team is excited to release Parcel 2 beta 3! This release includes a ground up rewrite of our JavaScript compiler in Rust, which improves overall build performance by up to 10x. In addition, this post will cover some other improvements we’ve made to Parcel since our last update, along with our roadmap to a stable Parcel 2 release.\nA growing trend in the JS tooling world is to replace bits and pieces with Rust || Go where it makes sense and reap the performance benefits. Congrats to the Parcel team…",
          "link": "https://v2.parceljs.org/blog/beta3/",
          "publishedOn": "2021-05-21T13:24:00.000Z",
          "wordCount": 1972,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Parcel 2 is getting a 10x compiler speedup (thanks, Rust!)"
        },
        {
          "description": "Tools and frameworks that aim to boost developer productivity are always worth a closer look, but we don’t often consider the trade-offs for whichever we settle on. In this episode, we discuss the questions one should be asking when evaluating developer productivity tools and frameworks in the Go ecosystem in particular.\nJoining us to discuss is André Eriksson, the creator of Encore, a backend framework that aims to make development and deployment as productive as it can be.\nDiscuss on Changelog News\nJoin C…",
          "link": "https://changelog.com/gotime/180",
          "publishedOn": "2021-05-20T16:40:00.000Z",
          "wordCount": 402,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 180: Are frameworks getting an Encore?"
        },
        {
          "description": "Thibault Meunir writing on Cloudflare’s blog:\nBased on our data, it takes a user on average 32 seconds to complete a CAPTCHA challenge. There are 4.6 billion global Internet users. We assume a typical Internet user sees approximately one CAPTCHA every 10 days.\nThis very simple back of the envelope math equates to somewhere in the order of 500 human years wasted every single day — just for us to prove our humanity.\nThey aren’t just doing napkin math, they’re also trying to fix things:\nWe want to get rid of C…",
          "link": "https://blog.cloudflare.com/introducing-cryptographic-attestation-of-personhood/",
          "publishedOn": "2021-05-20T15:16:00.000Z",
          "wordCount": 3071,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Humanity wastes about 500 years per day on CAPTCHAs. It’s time to end this madness"
        },
        {
          "description": "Paul Bakaus teased this on JS Party #174, but the announcement landed even sooner than he said it would:\nChrome, at least in its experimental Canary version on Android (and only for users in the U.S.), is getting an interesting update in the coming weeks that brings back RSS, the once-popular format for getting updates from all the sites you love in Google Reader and similar services.\nIn Chrome, users will soon see a “Follow” feature for sites that support RSS and the browser’s New Tab page will get what is…",
          "link": "https://techcrunch.com/2021/05/19/undead-again-google-brings-back-rss/",
          "publishedOn": "2021-05-20T14:30:00.000Z",
          "wordCount": 510,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Google revives RSS"
        },
        {
          "description": "Lima launches Linux VMs on your Intel or ARM-based Mac with automatic file sharing, port forwarding, and containerd. That means you can easily do cool stuff like:\n$ echo &quot;files under /Users on macOS filesystem are readable from Linux&quot; &gt; some-file\n\n$ lima cat some-file\nfiles under /Users on macOS filesystem are readable from Linux\n\n$ lima sh -c 'echo &quot;/tmp/lima is writable from both macOS and Linux&quot; &gt; /tmp/lima/another-file'\n\n$ cat /tmp/lima/another-file\n/tmp/lima is writable from b…",
          "link": "https://github.com/AkihiroSuda/lima",
          "publishedOn": "2021-05-19T14:22:00.000Z",
          "wordCount": 1913,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Lima is like a \"macOS subsystem for Linux\""
        },
        {
          "description": "90% of AI / ML applications never make it to market, because fine tuning models for maximum performance across disparate ML software solutions and hardware backends requires a ton of manual labor and is cost-prohibitive.  Luis Ceze and his team created Apache TVM at the University of Washington, then left founded OctoML to bring the project to market.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by do…",
          "link": "https://changelog.com/practicalai/134",
          "publishedOn": "2021-05-18T20:45:00.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 134: Apache TVM and OctoML"
        },
        {
          "description": "Bitcoin’s Proof of work (PoW) consensus mechanism is hotly debated these days due it its energy consumption. Proof of stake (PoS) is a different way to skin the consensus cat.\nWhile it’s less proven to work in the real world (Bitcoin’s uptime and security over the network’s 12-year lifespan is perhaps its greatest asset), PoS is quite promising and we’re starting to see the fruit of that promise with early numbers from Ethereum 2.\nEthereum will be completing the transition to Proof-of-Stake in the upcoming …",
          "link": "https://blog.ethereum.org/2021/05/18/country-power-no-more/",
          "publishedOn": "2021-05-18T16:44:00.000Z",
          "wordCount": 1037,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ethereum will use at least ~99.95% less energy post merge"
        },
        {
          "description": "Patrick DeVivo:\nThis is a project in Go that compiles to a SQLite runtime loadable extension, which brings Redis commands into a SQL context. This allows you to write SQL queries against data in a Redis instance, using Redis commands like LRANGE as SQL functions.\nExperimental for now. But why? Patrick says:\nIn general, Redis is fairly accessible from many programming languages, and any query using reqlite could probably be implemented in a language of your choice using a Redis client. However, sometimes dec…",
          "link": "https://github.com/augmentable-dev/reqlite",
          "publishedOn": "2021-05-18T15:58:00.000Z",
          "wordCount": 1119,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reqlite lets you query Redis with SQL"
        },
        {
          "description": "For far too long React has encouraged to people to cram their data layer into their view layer. If you learn anything from the Clojure community, this is a flawed approach. I argue that we can do better, and need a data-first frontend revolution, which relegates React to what it does best: diff and render DOM nodes.\nDiscuss on Changelog News",
          "link": "https://kea.js.org/blog/2021/05/14/data-first-frontend-revolution",
          "publishedOn": "2021-05-18T15:12:00.000Z",
          "wordCount": 877,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "It's time for a data-first frontend revolution"
        },
        {
          "description": "Stephen Lindberg takes cues from the level design in Super Mario 3D World and applies it to user experience design:\nYou may not know what a Conkdor is, but the design problem is universal: “how do we reduce cognitive load without sacrificing interest and fun?” To summarize the video, game designers would approach the problem like this:\nIntroduce a new concept in a way that the player is not punished for failing.\nBuild upon that concept in a way that challenges the player.\nCombine the concept with other fami…",
          "link": "https://thoughtbot.com/blog/designing-for-failure",
          "publishedOn": "2021-05-18T13:44:00.000Z",
          "wordCount": 716,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Designing for failure"
        },
        {
          "description": "Here’s a sneak peek of our upcoming episode of The Changelog (plus bonus videos) starring Julia Evans, Drew Neil, Suz Hinton, and Gary Bernhardt!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=Qcar5QqOZZY",
          "publishedOn": "2021-05-17T18:02:00.000Z",
          "wordCount": 19,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why we 💚 Vim (a teaser trailer)"
        },
        {
          "description": "Ashley Kolodziej speaking directly to HTML:\nYou are the foundation of the Internet. You are the bridge between humans and information. When we say HTML isn’t an expertise in and of itself, when we take you for granted, we leave behind the people and systems who access that information using web crawlers and accessibility technology.\nand CSS:\nThere is a time and place for specificity, and I cherish your ability to manage that. I love your system of overrides, of thinking ahead to what should and shouldn’t be…",
          "link": "https://css-tricks.com/a-love-letter-to-html-css/",
          "publishedOn": "2021-05-17T16:39:00.000Z",
          "wordCount": 1356,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A love letter to HTML & CSS"
        },
        {
          "description": "It’s fun seeing the proliferation of TODO comments over time on these bastions of open source. One not-surprising (but still unfortunate) trend: they all pretty much move up and to the right 📈, but a few have had some dramatic reversals 📉 at certain points in time. Go had a crazy month in April 2018 &amp; TypeScript’s TODOs exploded in the Spring of 2018.\nDiscuss on Changelog News",
          "link": "https://schleiss.io/plotting-source-code-todos-for-open-source-projects",
          "publishedOn": "2021-05-17T15:51:00.000Z",
          "wordCount": 336,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Plotting the source code \"TODO\" history of the most popular open source projects"
        },
        {
          "description": "There are a lot of screencasts, recordings of user group gatherings and conference talks available online. I try to commit myself watching at least two new talks every week, and I’ve been doing this for quite some time now. I created this list of online talks that I really enjoyed watching. I’ll also be updating this list whenever I’ve watched another awesome talk that is worthy enough. Suggestions are always appreciated through a pull request.\nDiscuss on Changelog News",
          "link": "https://github.com/JanVanRyswyck/awesome-talks",
          "publishedOn": "2021-05-17T14:13:00.000Z",
          "wordCount": 1797,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Awesome online talks and screencasts"
        },
        {
          "description": "This week we’re talking about open source on Mars. Martin Woodward (Senior Director of Developer Relations at GitHub) joins us to talk about the new Mars badge GitHub introduced. This collaboration between GitHub and NASA confirmed nearly 12,000 people contributed code, documentation, graphic design, and more to the open source software that made Ingenuity’s launch possible. Today’s show is a celebration of this human achievement and the impact of open source on space exploration as we know it.\nDiscuss on C…",
          "link": "https://changelog.com/podcast/440",
          "publishedOn": "2021-05-14T19:00:00.000Z",
          "wordCount": 543,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 440: Open source goes to Mars 🚀"
        },
        {
          "description": "Ever wanted a language like JavaScript, but without the warts, with a great type system, and with a lean build toolchain that doesn’t waste your time?\nPatrick Ecker from the ReScript Association sits down with Jerod and Feross to tell us all about  this “JavaScript-like language you have been waiting for”.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kube…",
          "link": "https://changelog.com/jsparty/175",
          "publishedOn": "2021-05-14T16:00:00.000Z",
          "wordCount": 380,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 175: This is ReScript"
        },
        {
          "description": "Syncthing synchronizes files between two or more computers. Its goals are to be:\nSafe From Data Loss\nSecure Against Attackers\nEasy to Use\nAutomatic\nUniversally Available\nFor Individuals\nEverything Else (!)\nThere’s a Goals document where these ideas are explained and expanded upon, which is neat.\nDiscuss on Changelog News",
          "link": "https://github.com/syncthing/syncthing",
          "publishedOn": "2021-05-14T15:57:00.000Z",
          "wordCount": 1296,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Syncthing is a continuous file synchronization program"
        },
        {
          "description": "This is just one of four (as of now) mysteries put together by Julia Evans to help us practice our debugging skills. Can you crack the case?!\nDiscuss on Changelog News",
          "link": "https://mysteries.wizardzines.com/50ms-request.html",
          "publishedOn": "2021-05-14T14:53:00.000Z",
          "wordCount": 14268,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The case of the 50ms request"
        },
        {
          "description": "This article won’t help you write better code, but it might help you better manage your relationship with Twitter. (Which could help you write better code.) It’s also really well written.\nSocial media are the Trojans at the gates of your mind. Their wooden horse is magnificent. It glistens with all of the fittest memes. I let those Trojans into the fortress of my mind, and it was a mistake.\nIf you’re intrigued by faustian bargains, incremental games, and petrichor… give it a read.\nDiscuss on Changelog News",
          "link": "https://mccormick.cx/news/entries/one-million-people-saw-my-dumbest-tweet",
          "publishedOn": "2021-05-14T14:05:00.000Z",
          "wordCount": 680,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "One million people saw my dumbest tweet"
        },
        {
          "description": "Use TypeScript as your preprocessor. Write type‑safe, locally scoped classes, variables and themes, then generate static CSS files at build time.\nFirst-class theming, framework agnostic, and type-safety so you can cow[boy|girl] code those styles and let your tooling catch typos and variable name changes.\nDiscuss on Changelog News",
          "link": "https://vanilla-extract.style/",
          "publishedOn": "2021-05-13T18:10:00.000Z",
          "wordCount": 558,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Zero-runtime stylesheets in TypeScript"
        },
        {
          "description": "In this episode we talk with Daniel and Steve about their experience with event-driven systems and shed some light on what they are and who they might be for. We explore topics like the complexity of setting up an event-driven system, the need to embrace eventual consistency, useful tools for building event-driven systems, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Quickly access any resource anywhere usi…",
          "link": "https://changelog.com/gotime/179",
          "publishedOn": "2021-05-13T16:00:00.000Z",
          "wordCount": 472,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 179: Event-driven systems"
        },
        {
          "description": "You may have heard that Dark Sky (the beloved weather app for iOS) was acquired by Apple and its accompanying developer API will be shut down soon, which left a lot of devs scrambling for alternatives. Enter the PirateWeather API:\nWeather forecasts are primarily determined using models run by government agencies, but the outputs aren’t easy to use or in formats built for applications. To try to address this, I’ve put together a service (built on AWS Lambda) that reads public weather forecasts and serves it …",
          "link": "https://pirateweather.net/",
          "publishedOn": "2021-05-13T14:03:00.000Z",
          "wordCount": 2,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A weather forecast API to replace Dark Sky's"
        },
        {
          "description": "App structure is complicated.\nGood app structure improves the developer experience. It can help you isolate what they are working on without needing to keep the entire codebase in your head. A well structured app can help prevent bugs by decoupling components and making it easier to write useful tests.\nA poorly structured application can do the opposite; it can make testing harder, it can make it challenging to find relevant code, and it can introduce needless complexity and verbosity that slows you down wi…",
          "link": "https://changelog.com/posts/on-go-application-structure",
          "publishedOn": "2021-05-12T18:19:40.000Z",
          "wordCount": 2504,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Thoughts on how to structure Go code"
        },
        {
          "description": "This API supports multiple deep learning frameworks (TensorFlow, PyTorch, etc), supports multiple hardware accelerators (CPU, GPU, egdeTPU), and is based on open source models. You can think of it a bit like the Google’s Cloud Vision API, only open source and self-hosted.\nDiscuss on Changelog News",
          "link": "https://openvisionapi.com/",
          "publishedOn": "2021-05-12T13:50:00.000Z",
          "wordCount": 70,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An open source computer vision API"
        },
        {
          "description": "To say that Jeff Adams is a trailblazer when it comes to speech technology is an understatement. Along with many other notable accomplishments, his team at Amazon developed the Echo, Dash, and Fire TV changing our perception of how we could interact with devices in our home. Jeff now leads Cobalt Speech and Language, and he was kind enough to join us for a discussion about human computer interaction, multimodal AI tasks, the history of language modeling, and AI for social good.\nDiscuss on Changelog News\nJoi…",
          "link": "https://changelog.com/practicalai/133",
          "publishedOn": "2021-05-11T19:00:00.000Z",
          "wordCount": 458,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 133: 25 years of speech technology innovation"
        },
        {
          "description": "Hidde de Vries takes a strong, reasoned stance to online criticism of others’ work:\nThis week, a friend shared a blog post that critiqued a popular framework for CSS. Twitter started to discuss if it’s okay to criticise tools. In this post, I’ll say it is not just okay, it is also important.\nThis is a tough subject because we identify so closely with the things we create (our code), but Hidde is right: if we want to progress as an industry (and individually) we need to be able to criticize (constructively) …",
          "link": "https://hiddedevries.nl/en/blog/2021-05-08-criticism-pushes-the-web-forward/",
          "publishedOn": "2021-05-11T15:27:00.000Z",
          "wordCount": 2811,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Criticism pushes the web forward"
        },
        {
          "description": "A nice primer on the many aspects of building full-text search, such as: data preparation, indexing, searching, term frequency, and computing relevance. It’s amazing what 150 lines of code can get done…\nDiscuss on Changelog News",
          "link": "https://bart.degoe.de/building-a-full-text-search-engine-150-lines-of-code/",
          "publishedOn": "2021-05-10T17:23:00.000Z",
          "wordCount": 3085,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Building a full-text search engine in 150 lines of Python code"
        },
        {
          "description": "There are obvious upsides to pair programming. This post from Nat Bennett shares both the ups and the downs of pairing all day for years…\nSo I paired all day, most days, for about five years. This had a lot of upsides, far more than I can list here. There’s a standard list of benefits and drawbacks to pairing that you might be familiar with, but the impact of pairing, especially pairing that much, goes much deeper than its impact on the code, on the particular work the team delivers that week.\nNat goes on t…",
          "link": "https://www.simplermachines.com/the-mortifying-ordeal-of-pairing-all-day/",
          "publishedOn": "2021-05-10T16:37:50.000Z",
          "wordCount": 1473,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What happens when you pair all day, most days, for years?"
        },
        {
          "description": "AMA Happy Hour with Priyanka Sharma \n\nAd-hoc conversations with you Carlos, Chico, Katie, Rahul &amp; Silviu were my favourite. They would not have happened was it not for your Happy Hour sessions Priyanka. And what would brilliant ideas be without your hard work Colleen &amp; Kristi, and the rest of your teams?\nI really appreciate how well this event came together. The virtual platform and diversity played a big part in this world-class experience. This was the perfect one to Ship It!, a brand new Changelo…",
          "link": "https://changelog.com/posts/kubecon-cloudnativecon-europe-2021",
          "publishedOn": "2021-05-10T16:00:00.000Z",
          "wordCount": 1398,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "🚀 KubeCon + CloudNativeCon Europe 2021"
        },
        {
          "description": "After working as a software engineer for 20 years, it’s still exciting to see how the results of your work become alive and you still feel yourself as a kid at that moment :)\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/excitement-of-making/",
          "publishedOn": "2021-05-10T15:46:00.000Z",
          "wordCount": 433,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The excitement of making things real"
        },
        {
          "description": "Stripe Atlas has a wide array of guides to running an internet business that are totally open and free for everyone. This guide, written by Dr. Sherry Walling (a clinical psychologist), on “managing founder stress” covers everything from running smart (not just hard), coping with chronic stress, mastering the ups and downs, and a reminder that as a founder you are not alone.\nIf you like this guide, then you’ll probably be a fan of my podcast Founders Talk too.\nDiscuss on Changelog News",
          "link": "https://stripe.com/atlas/guides/founder-stress",
          "publishedOn": "2021-05-10T15:00:01.000Z",
          "wordCount": 7895,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Guide to managing founder stress"
        },
        {
          "description": "Bash is great, but when it comes to writing scripts, people usually choose a more convenient programming language. JavaScript is a perfect choice, but standard Node.js library requires additional hassle before using. zx package provides useful wrappers around child_process, escapes arguments and gives sensible defaults.\nI wouldn’t say JavaScript is a perfect choice for this kind of scripting, but it’s definitely a suitable one (especially if it’s the language you already know well). Here’s what scripting lo…",
          "link": "https://github.com/google/zx",
          "publishedOn": "2021-05-10T13:50:00.000Z",
          "wordCount": 1053,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "google/zx – a tool for writing better scripts"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": []
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "Cartier is legendary in the world of luxury — a name that is synonymous with iconic jewelry and watches, timeless design,  savoir-faire and exceptional customer service. \nMaison Cartier’s collection dates back to the opening of Louis-François Cartier’s very first Paris workshop in 1847. And with over 174 years of history, the Maison’s catalog is extensive, with over a thousand wristwatches, some with only slight variations between them. Finding specific models, or comparing several models at once, could tak…",
          "link": "https://blog.google/products/google-cloud/finding-any-cartier-watch-under-3-seconds/",
          "publishedOn": "2021-05-21T16:00:00.000Z",
          "wordCount": 1344,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Finding any Cartier watch in under 3 seconds"
        },
        {
          "description": "AI is integral to so much of the work we do at Google. Fundamental advances in computing are helping us confront some of the greatest challenges of this century, like climate change. Meanwhile, AI is also powering updates across our products, including Search, Maps and Photos — demonstrating how machine learning can improve your life in both big and small ways. \nIn case you missed it, here are some of the AI-powered updates we announced at Google I/O.\n\n\nLaMDA is a breakthrough in natural language understand…",
          "link": "https://blog.google/technology/ai/innovating-with-ai/",
          "publishedOn": "2021-05-20T15:57:00.000Z",
          "wordCount": 2184,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "11 ways we're innovating with AI"
        },
        {
          "description": "Originally, Maysam Moussalem dreamed of being an architect. “When I was 10, I looked up to see the Art Nouveau dome over the Galeries Lafayette in Paris, and I knew I wanted to make things like that,” she says. “Growing up between Austin, Paris, Beirut and Istanbul just fed my love of architecture.” But she found herself often talking to her father, a computer science (CS) professor, about what she wanted in a career. \"I always loved art and science and I wanted to explore the intersections between fields. …",
          "link": "https://blog.google/inside-google/googlers/maysam-moussalem-teaches-googlers-human-centered-ai/",
          "publishedOn": "2021-05-19T16:00:00.000Z",
          "wordCount": 1486,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Maysam Moussalem teaches Googlers human-centered AI"
        },
        {
          "description": "It’s great to be back hosting our I/O Developers Conference this year. Pulling up to our Mountain View campus this morning, I felt a sense of normalcy for the first time in a long while. Of course, it’s not the same without our developer community here in person. COVID-19 has deeply affected our entire global community over the past year and continues to take a toll. Places such as Brazil, and my home country of India, are now going through their most difficult moments of the pandemic yet. Our thoughts are …",
          "link": "https://blog.google/technology/developers/io21-helpful-google/",
          "publishedOn": "2021-05-18T18:55:00.000Z",
          "wordCount": 2629,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Google I/O 2021: Being helpful in moments that matter"
        },
        {
          "description": "Artificial intelligence (AI) has the potential to help clinicians care for patients and treat disease — from improving the screening process for breast cancer to helping detect tuberculosis more efficiently. When we combine these advances in AI with other technologies, like smartphone cameras, we can unlock new ways for people to stay better informed about their health, too.  \n\nToday at  I/O, we shared a preview of an AI-powered dermatology assist tool that helps you understand what’s going on with issues r…",
          "link": "https://blog.google/technology/health/ai-dermatology-preview-io-2021/",
          "publishedOn": "2021-05-18T18:45:00.000Z",
          "wordCount": 1380,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Using AI to help find answers to common skin conditions"
        },
        {
          "description": "Today we’re sharing new AI research that aims to improve screening for one of the top causes of death worldwide: tuberculosis (TB). TB infects 10 million people per year and disproportionately affects people in low-to-middle-income countries. Diagnosing TB early is difficult because its symptoms can mimic those of common respiratory diseases.\nCost-effective screening, specifically chest X-rays, has been identified as one way to improve the screening process. However, experts aren’t always available to inter…",
          "link": "https://blog.google/technology/health/tuberculosis-screening-ai-io-2021/",
          "publishedOn": "2021-05-18T18:45:00.000Z",
          "wordCount": 1261,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Tackling tuberculosis screening with AI"
        },
        {
          "description": "AI is a critical part of what makes Google Maps so helpful. With it, we’re able to map roads over 10 times faster than we could five years ago, and we can bring maps filled with useful information to virtually every corner of the world. Today, we’re giving you a behind-the-scenes look at how AI makes two of the features we announced at I/O possible.\n\n\nTeaching Maps to identify and forecast when people are hitting the brakes\nLet’s start with our routing update that helps you avoid situations that cause you t…",
          "link": "https://blog.google/products/maps/google-maps-101-ai-power-new-features-io-2021/",
          "publishedOn": "2021-05-18T18:00:00.000Z",
          "wordCount": 1773,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "A smoother ride and a more detailed Map thanks to AI"
        },
        {
          "description": "Within the decade, Google aims to build a useful, error-corrected quantum computer. This will accelerate solutions for some of the world’s most pressing problems, like sustainable energy and reduced emissions to feed the world’s growing population, and unlocking new scientific discoveries, like more helpful AI.\n\n\nTo begin our journey, today we’re unveiling our new Quantum AI campus in Santa Barbara, California. This campus includes our first quantum data center, our quantum hardware research laboratories, a…",
          "link": "https://blog.google/technology/ai/unveiling-our-new-quantum-ai-campus/",
          "publishedOn": "2021-05-18T17:30:00.000Z",
          "wordCount": 1459,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Unveiling our new Quantum AI campus"
        },
        {
          "description": "We've always had a soft spot for language at Google. Early on, we set out to translate the web. More recently, we’ve invented machine learning techniques that help us better grasp the intent of Search queries. Over time, our advances in these and other areas have made it easier and easier to organize and access the heaps of information conveyed by the written and spoken word.\nBut there’s always room for improvement. Language is remarkably nuanced and adaptable. It can be literal or figurative, flowery or pl…",
          "link": "https://blog.google/technology/ai/lamda/",
          "publishedOn": "2021-05-18T17:22:00.000Z",
          "wordCount": 1447,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "LaMDA: our breakthrough conversation technology"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "In 2012 I wrote a blog post titled curling the metalink, describing how we added support for metalink to curl. Today, we remove that support again. This is a very drastic move, and I feel obliged to explain it so here it goes! curl 7.78.0 will ship without metalink support. Metalink problems There were several &#8230; Continue reading Bye bye metalink in curl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/07/bye-bye-metalink-in-curl/",
          "publishedOn": "2021-06-07T07:06:19.000Z",
          "wordCount": 1076,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Bye bye metalink in curl"
        },
        {
          "description": "When you use the name localhost in a URL, what does it mean? Where does the network traffic go when you ask curl to download http://localhost ? Is &#8220;localhost&#8221; just a name like any other or do you think it infers speaking to your local host on a loopback address? Previously curl http://localhost The name &#8230; Continue reading curl localhost as a local host &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/31/curl-localhost-as-a-local-host/",
          "publishedOn": "2021-05-31T13:39:49.000Z",
          "wordCount": 1792,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl localhost as a local host"
        },
        {
          "description": "Thanks to funding by ISRG (via Google), we merged the hyper powered HTTP back-end into curl earlier this year as an alternative HTTP/1 and HTTP/2 implementation. Previously, there was only one way to do HTTP/1 and 2 in curl. Backends Core libcurl functionality can be powered by optional and alternative backends in a way that &#8230; Continue reading Taking hyper-curl further &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/28/taking-hyper-curl-further/",
          "publishedOn": "2021-05-28T16:04:12.000Z",
          "wordCount": 915,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Taking hyper-curl further"
        },
        {
          "description": "Part 1. The beginning. (There will be at least one more part later on following up the progress.) On May 18, 2021 I posted a tweet that I was giving away curl stickers for free to anyone who&#8217;d submit their address to me. It looked like this: Everyone once in a while when I post &#8230; Continue reading Giving away an insane amount of curl stickers &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/28/giving-away-an-insane-amount-of-curl-stickers/",
          "publishedOn": "2021-05-28T06:28:28.000Z",
          "wordCount": 1673,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Giving away an insane amount of curl stickers"
        },
        {
          "description": "The official publication date of the relevant QUIC specifications is: May 27, 2021. I&#8217;ve done many presentations about HTTP and related technologies over the years. HTTP/2 had only just shipped when the QUIC working group had been formed in the IETF and I started to mention and describe what was being done there. I&#8217;ve explained &#8230; Continue reading QUIC is RFC 9000 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/27/quic-is-rfc-9000/",
          "publishedOn": "2021-05-27T21:56:02.000Z",
          "wordCount": 1099,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "QUIC is RFC 9000"
        },
        {
          "description": "Welcome to the 200th curl release. We call it 200 OK. It coincides with us counting more than 900 commit authors and surpassing 2,400 credited contributors in the project. This is also the first release ever in which we thank more than 80 persons in the RELEASE-NOTES for having helped out making it and we&#8217;ve &#8230; Continue reading curl 7.77.0 &#8211; 200 OK &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/26/curl-7-77-0-200-ok/",
          "publishedOn": "2021-05-26T06:39:30.000Z",
          "wordCount": 1719,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.77.0 – 200 OK"
        },
        {
          "description": "For the eighth consecutive year we run the annual curl user survey again in 2021. The form just went up and I would love to have you spend 10 minutes of your busy life to tell us how you think curl works, what doesn&#8217;t work and what we should do next. We have no tracking &#8230; Continue reading The curl user survey 2021 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/24/the-curl-user-survey-2021/",
          "publishedOn": "2021-05-24T05:59:57.000Z",
          "wordCount": 819,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "The curl user survey 2021"
        },
        {
          "description": "Collected quotes and snippets from people publicly sneezing off or belittling what curl is, explaining how easy it would be to make a replacement in no time with no effort or generally not being very helpful. These are statements made seriously. For all I know, they were not ironic. If you find others to add &#8230; Continue reading &#8220;I could rewrite curl&#8221; &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/20/i-could-rewrite-curl/",
          "publishedOn": "2021-05-20T11:21:21.000Z",
          "wordCount": 774,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "“I could rewrite curl”"
        },
        {
          "description": "One day in March 1998 I released a little file transfer tool I called curl. The first ever curl release. That was good. 10 By the end of July the same year, I released the 10th curl release. I&#8217;ve always believed in release early release often as a service to users and developers alike. 20 &#8230; Continue reading 200 OK &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/17/200-ok/",
          "publishedOn": "2021-05-17T08:43:00.000Z",
          "wordCount": 973,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "200 OK"
        },
        {
          "description": "(This is a repost of a stackoverflow answer I once wrote on this topic. Slightly edited. Copied here to make sure I own and store my own content properly.) curl knows the HTTP method You normally use curl without explicitly saying which request method to use. If you just pass in a HTTP URL like &#8230; Continue reading curl -G vs curl -X GET &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/14/curl-g-vs-curl-x-get/",
          "publishedOn": "2021-05-14T21:39:04.000Z",
          "wordCount": 963,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl -G vs curl -X GET"
        },
        {
          "description": "I&#8217;ve worked hard on making the presentation I ended up calling libcurl under the hood. A part of that presentation is spent on explaining the main libcurl transfer state machine and here I&#8217;ll try to document some of what, in a written form. Understanding the main transfer state machine in libcurl could be valuable and &#8230; Continue reading The libcurl transfer state machine &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/10/the-libcurl-transfer-state-machine/",
          "publishedOn": "2021-05-10T07:13:47.000Z",
          "wordCount": 1417,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "The libcurl transfer state machine"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks.html",
          "publishedOn": "2021-06-02T12:58:42.871Z",
          "wordCount": 2201,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm.html",
          "publishedOn": "2021-05-20T12:20:35.755Z",
          "wordCount": 1452,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform.html",
          "publishedOn": "2021-05-10T12:26:01.303Z",
          "wordCount": 4869,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "Learn how we design a system that stores and retrieves ad impression metadata accurately and consistently in Twitter's ads ecosystem.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/storing-and-retrieving-millions-of-ad-impressions-per-second.html",
          "publishedOn": "2021-05-10T12:26:01.245Z",
          "wordCount": 2583,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Storing and retrieving millions of ad impressions per second"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks.html",
          "publishedOn": "2021-05-10T12:26:01.222Z",
          "wordCount": 3599,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data.html",
          "publishedOn": "2021-05-10T12:26:01.190Z",
          "wordCount": 1788,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research.html",
          "publishedOn": "2021-05-10T12:26:01.174Z",
          "wordCount": 1489,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache.html",
          "publishedOn": "2021-05-10T12:26:01.152Z",
          "wordCount": 2274,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks.html",
          "publishedOn": "2021-05-10T12:26:01.111Z",
          "wordCount": 1636,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan.html",
          "publishedOn": "2021-05-10T12:26:01.003Z",
          "wordCount": 2254,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning.html",
          "publishedOn": "2021-05-10T12:26:00.956Z",
          "wordCount": 3228,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Introducing Twitter Text Editor, a standalone, flexible API that provides a full-featured rich text editor for iOS applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/introducing-twitter-text-editor.html",
          "publishedOn": "2021-05-10T12:26:00.893Z",
          "wordCount": 826,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter Text Editor"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=cGvuclDC_Z1vE_cnVEU6Ae_NZQ7StBcqH_vXVqoPMX0');.lst-kix_adz5e91jwu7t-8>li:before{content:\"\" counter(lst-ctn-kix_adz5e91jwu7t-8,lower-roman) \". \"}.lst-kix_aacxccbo6zlx-1>li{counter-increment:lst-ctn-kix_aacxccbo6zlx-1}.lst-kix_adz5e91jwu7t-3>li{counter-increment:lst-ctn-kix_adz5e91jwu7t-3}.lst-kix_adz5e91jwu7t-7>li:before{content:\"\" counter(lst-ctn-kix_adz5e91jwu7t-7,lower-latin) \". \"}ol.lst-kix_ii04ufl4nr9k-3.start{counter-reset:lst-ctn-kix_ii04…",
          "link": "https://googleprojectzero.blogspot.com/2021/05/fuzzing-ios-code-on-macos-at-native.html",
          "publishedOn": "2021-05-20T17:07:00.000Z",
          "wordCount": 3019,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "Fuzzing iOS code on macOS at native speed"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Reducing risk is the fundamental reason organizations invest in cybersecurity. As the threat landscape grows and evolves, organizations need a proactive approach to building and protecting their security posture.",
          "link": "https://www.hackerone.com/blog/build-resilient-security-posture-vulnerability-intelligence-and-cybersecurity-ratings",
          "publishedOn": "2021-06-07T19:00:00.000Z",
          "wordCount": 1072,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Build a Resilient Security Posture with Vulnerability Intelligence and Cybersecurity Ratings"
        },
        {
          "description": "In March, Amazon sponsored HackerOne’s 10-day, virtual hacking event, which attracted more than 50 security researchers to identify potential vulnerabilities across Amazon’s core assets. Read on for highlights from the event.",
          "link": "https://www.hackerone.com/blog/hack-hard-have-fun-increase-security",
          "publishedOn": "2021-06-04T13:00:00.000Z",
          "wordCount": 1278,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hack Hard. Have Fun. Increase Security"
        },
        {
          "description": "Last week, HackerOne joined WhiteSource, AWS, and IGT for a roundtable discussion about the new security challenges of digital transformation. The panel discussed cloud security, software supply chain security, and vulnerability disclosure programs as examples of proactive approaches organizations can take to mitigate their risk.",
          "link": "https://www.hackerone.com/blog/how-digital-transformation-changes-organizations-security-challenges",
          "publishedOn": "2021-06-03T16:00:00.000Z",
          "wordCount": 861,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Digital Transformation Changes An Organization's Security Challenges"
        },
        {
          "description": "Microsoft says the state-backed Russian hacker group Nobelium—the same actor behind the 2020 SolarWinds attacks—took control of the State Department’s United States Agency for International Development email system. This bold attack, expected to be ongoing, breached federal government supplier systems sending out official-looking emails to over 3,000 accounts across more than 150 organizations.",
          "link": "https://www.hackerone.com/blog/microsoft-says-russian-solarwinds-hackers-hit-us-government-agencies-again",
          "publishedOn": "2021-06-02T15:05:00.000Z",
          "wordCount": 653,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Microsoft Says: Russian SolarWinds Hackers Hit U.S. Government Agencies Again"
        },
        {
          "description": "Server-side request forgery (or SSRF) vulnerabilities are particularly dangerous because they can lead to total system compromise. Discover where they’re most common, explore real-world examples, and learn prevention tips from hackers.",
          "link": "https://www.hackerone.com/blog/spotlight-server-side",
          "publishedOn": "2021-05-25T14:00:00.000Z",
          "wordCount": 1374,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Spotlight on the Server-Side"
        },
        {
          "description": "Last week’s U.S. Presidential Executive Order underscores the critical status of #cybersecurity in the U.S. Today, HackerOne CEO Marten Mickos shares his perspective on how private sector CEOs should take action and make security a collective internal priority for organizations.",
          "link": "https://www.hackerone.com/blog/time-issue-your-own-cyber-executive-order",
          "publishedOn": "2021-05-24T16:00:00.000Z",
          "wordCount": 1045,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Time to Issue Your Own Cyber Executive Order"
        },
        {
          "description": "Todayisnew is currently at the top of our global leaderboard with 100,000+ reputation points, and we’re celebrating this record-breaking milestone with an AMA, CTF, and giveaway! Read on to find out more.",
          "link": "https://www.hackerone.com/blog/celebrating-todayisnew-100k-ctf-ama-and-giveaway",
          "publishedOn": "2021-05-21T13:00:00.000Z",
          "wordCount": 660,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Celebrating todayisnew with the 100K CTF, AMA, and Giveaway"
        },
        {
          "description": "Hacking veteran @ralamosm has been in the business of bug hunting for 20+ years. In this week’s Hacker Spotlight, he dives into his hacking journey and provides inspiration on living up to your hacking potential.",
          "link": "https://www.hackerone.com/blog/hacker-spotlight-ama-ralamosm",
          "publishedOn": "2021-05-14T15:00:00.000Z",
          "wordCount": 998,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hacker Spotlight AMA: ralamosm"
        },
        {
          "description": "I was still digesting last week’s fascinating roundtable with Nicole Perlroth, cybersecurity journalist and author of This Is How They Tell Me The World Ends, when the news broke that the US’s biggest fuel pipeline had been taken out by a ransomware attack. Nicole’s closing prediction that cyber criminals, emboldened by their success in targeting hospitals with ransomware, would move onto other critical infrastructure, was coming true before my eyes.",
          "link": "https://www.hackerone.com/blog/so-how-they-tell-me-world-ends",
          "publishedOn": "2021-05-12T22:28:12.000Z",
          "wordCount": 1094,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "So This Is How They Tell Me The World Ends?"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "Firefox 89 has smartened up and brings with it a slimmed-down, slightly more minimalist interface.\nAlong with this new look, we get some great styling features including a force-colours feature for media queries and better control over how fonts are displayed. The long-awaited top-level await keyword for JavaScript modules is now enabled, as well as the PerformanceEventTiming interface, which is another addition to the performance suite of APIs: 89 really has been working out!\nThe post Looking fine with Fir…",
          "link": "https://hacks.mozilla.org/2021/06/looking-fine-with-firefox-89/",
          "publishedOn": "2021-06-01T15:19:01.000Z",
          "wordCount": 823,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Looking fine with Firefox 89"
        },
        {
          "description": "Roughly a year ago at Mozilla we started an effort to improve Firefox stability on Linux. This effort quickly became an example of good synergies between FOSS projects.\nThe post Improving Firefox stability on Linux appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/05/improving-firefox-stability-on-linux/",
          "publishedOn": "2021-05-19T14:28:53.000Z",
          "wordCount": 1411,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Improving Firefox stability on Linux"
        },
        {
          "description": "Like any web browser, Firefox loads code from untrusted and potentially hostile websites and runs it on your computer. To protect you against new types of attacks from malicious sites and to meet the security principles of Mozilla, we set out to redesign Firefox on desktop.\nThe post Introducing Firefox&#8217;s new Site Isolation Security Architecture appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/05/introducing-firefox-new-site-isolation-security-architecture/",
          "publishedOn": "2021-05-18T15:45:15.000Z",
          "wordCount": 2125,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Introducing Firefox’s new Site Isolation Security Architecture"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "One month ago, we started a discussion with the community about proposed revisions to clarify GitHub’s policies on security research, malware, and exploits with the goal to enable, welcome, and encourage dual-use security research and",
          "link": "https://github.blog/2021-06-04-updates-to-our-policies-regarding-exploits-malware-and-vulnerability-research/",
          "publishedOn": "2021-06-04T16:00:30.000Z",
          "wordCount": 761,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Updates to our policies regarding exploits, malware, and vulnerability research"
        },
        {
          "description": "We&#8217;ve seen some amazing community projects this last month. This was a huge month for your community with hundreds of new releases. There’s everything from world-changing tech to weekend hobbies. It was almost too hard",
          "link": "https://github.blog/2021-06-04-release-radar-may-2021/",
          "publishedOn": "2021-06-04T09:00:57.000Z",
          "wordCount": 1478,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · May 2021 Edition"
        },
        {
          "description": "GitHub Enterprise Server 3.1 is now generally available for all customers. It helps customers work with large, busy repositories, while enabling developers to develop and deploy with less effort than ever. This release includes: GitHub",
          "link": "https://github.blog/2021-06-03-github-enterprise-server-3-1-is-now-generally-available/",
          "publishedOn": "2021-06-03T16:00:48.000Z",
          "wordCount": 423,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.1 is now generally available"
        },
        {
          "description": "In May, we experienced two incidents resulting in significant impact to multiple GitHub services.",
          "link": "https://github.blog/2021-06-02-github-availability-report-may-2021/",
          "publishedOn": "2021-06-03T00:00:00.000Z",
          "wordCount": 766,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: May 2021"
        },
        {
          "description": "We’re proud to share the new and improved Social Impact at GitHub website, and we’re really excited to share what our team has been working on! GitHub’s mission is to advance human progress. Our part",
          "link": "https://github.blog/2021-06-01-github-social-impact-driving-change-social-sector/",
          "publishedOn": "2021-06-01T16:00:35.000Z",
          "wordCount": 652,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Github Social Impact: How we’re driving change with social sector organizations"
        },
        {
          "description": "Over the years, GitHub engineers have developed many ways to observe how our systems behave. We mostly make use of statsd for metrics, the syslog format for plain text logs and OpenTracing for request traces.",
          "link": "https://github.blog/2021-05-26-why-and-how-github-is-adopting-opentelemetry/",
          "publishedOn": "2021-05-26T19:20:09.000Z",
          "wordCount": 1152,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Why (and how) GitHub is adopting OpenTelemetry"
        },
        {
          "description": "Table of contents Executive summary Key findings Key takeaways for developers and software teams About the study What we found Interruptions and meetings have a large influence on our days Take a minute to reflect",
          "link": "https://github.blog/2021-05-25-octoverse-spotlight-good-day-project/",
          "publishedOn": "2021-05-25T15:00:43.000Z",
          "wordCount": 4730,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Octoverse Spotlight 2021: The Good Day Project—Personal analytics to make your work days better"
        },
        {
          "description": "The theme for Ludum Dare 48 was “deeper and deeper,” which inspired over ten thousand people to create almost four thousand games together over a weekend. As you can imagine, there were quite a lot",
          "link": "https://github.blog/2021-05-19-ludum-dare-48-staff-picks/",
          "publishedOn": "2021-05-19T22:34:44.000Z",
          "wordCount": 1611,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Ludum Dare 48 staff picks"
        },
        {
          "description": "GitHub is the home for software development teams and is the place where they collaborate and build. For larger organizations, you might have a dedicated reporting team that wants to export this activity at a",
          "link": "https://github.blog/2021-05-18-github-artifact-exporter-open-source-release/",
          "publishedOn": "2021-05-18T15:59:19.000Z",
          "wordCount": 742,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Artifact Exporter open source release"
        },
        {
          "description": "Today we’re introducing The ReadME Podcast, a GitHub podcast that takes a peek behind the curtain of some of the most impactful open source projects, and the developers who make them happen. Join me and",
          "link": "https://github.blog/2021-05-17-introducing-readme-podcast/",
          "publishedOn": "2021-05-17T16:00:02.000Z",
          "wordCount": 615,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Headphones on, volume up: Introducing The ReadME Podcast"
        },
        {
          "description": "As developers, the ability to collaborate through video (for example, pair programming, demos, etc.) is an extremely important part of a software workflow, especially for communities and teams that are distributed. At GitHub, we’ve utilized",
          "link": "https://github.blog/2021-05-13-video-uploads-available-github/",
          "publishedOn": "2021-05-13T16:00:13.000Z",
          "wordCount": 854,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Video uploads now available across GitHub"
        },
        {
          "description": "This year, thousands of students from around the world came together and redefined the world we live in, how we learn, and how we move forward. We are honored to be part of the experience",
          "link": "https://github.blog/2021-05-11-join-github-june-5-celebrate-class-of-2021/",
          "publishedOn": "2021-05-11T22:08:56.000Z",
          "wordCount": 699,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Join GitHub on June 5 to celebrate the Class of 2021"
        },
        {
          "description": "GitHub has been at the forefront of security key adoption for many years. We were an early adopter of Universal 2nd Factor (&#8220;U2F&#8221;) and were also one of the first sites to transition to Webauthn.",
          "link": "https://github.blog/2021-05-10-security-keys-supported-ssh-git-operations/",
          "publishedOn": "2021-05-10T17:20:08.000Z",
          "wordCount": 1539,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Security keys are now supported for SSH Git operations"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}