{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2021/12/apache-log4j-vulnerability.html",
          "author": null,
          "description": "Like many other companies, we’re closely following the multiple CVEs regarding Apache Log4j 2. Our security teams are investigating any potential impact on Google products and services and are focused on protecting our users and customers.\nWe encourage anyone who manages environments containing Log4j 2 to update to the latest version.\nBased on findings in our ongoing investigations, here is our list of product and service updates as of December 17th (CVE-2021-44228 & CVE-2021-45046):\nAndroid is not aware of any impact to the Android Platform or Enterprise. At this time, no update is required for this specific vulnerability, but we encourage our customers to ensure that the latest security updates are applied to their devices.\nChrome OS  releases and infrastructure are not using versions of Log4j affected by the vulnerability.\nChrome Browser releases, infrastructure and admin console are not using versions of Log4j affected by the vulnerability.\nGoogle Cloud has a specific advisory dedicated to updating customers on the status of GCP and Workspace products and services. \nGoogle Marketing Platform, including Google Ads is not using versions of Log4j affected by the vulnerability. This includes Display & Video 360, Search Ads 360, Google Ads, Analytics (360 and free), Optimize 360, Surveys 360  & Tag Manager 360. \nYouTube  is not using versions of Log4j affected by the vulnerability.  \nWe will continue to update this advisory with the latest information.",
          "link": "http://security.googleblog.com/2021/12/apache-log4j-vulnerability.html",
          "publishedOn": "2021-12-18T02:08:00.002Z",
          "wordCount": 586,
          "title": "Apache Log4j Vulnerability"
        },
        {
          "id": "http://security.googleblog.com/2021/12/understanding-impact-of-apache-log4j.html",
          "author": null,
          "description": "Posted by James Wetter and Nicky Ringland, Open Source Insights Team \n\n\n\n\nMore than 35,000 Java packages, amounting to over 8% of the Maven Central repository (the most significant Java package repository), have been impacted by the recently disclosed log4j vulnerabilities (1, 2), with widespread fallout across the software industry. The vulnerabilities allow an attacker to perform remote code execution by exploiting the insecure JNDI lookups feature exposed by the logging library log4j. This exploitable feature was enabled by default in many versions of the library.\n\n\nThis vulnerability has captivated the information security ecosystem since its disclosure on December 9th because of both its severity and widespread impact. As a popular logging tool, log4j is used by tens of thousands of s…",
          "link": "http://security.googleblog.com/2021/12/understanding-impact-of-apache-log4j.html",
          "publishedOn": "2021-12-17T17:25:00.000Z",
          "wordCount": 1850,
          "title": "Understanding the Impact of Apache Log4j Vulnerability"
        },
        {
          "id": "http://security.googleblog.com/2021/12/improving-oss-fuzz-and-jazzer-to-catch.html",
          "author": null,
          "description": "Posted by Jonathan Metzman, Google Open Source Security Team\n\n\nThe discovery of the Log4Shell vulnerability has set the internet on fire. Similar to shellshock and heartbleed, Log4Shell is just the latest catastrophic vulnerability in software that runs the internet. Our mission as the Google Open Source Security Team is to secure the open source libraries the world depends on, such as Log4j. One of our capabilities in this space is OSS-Fuzz, a free fuzzing service that is used by over 500 critical open source projects and has found more than 7,000 vulnerabilities in its lifetime. \nWe want to empower open source developers to secure their code on their own. Over the next year we will work on better automated detection of non-memory corruption vulnerabilities such as Log4Shell. We have star…",
          "link": "http://security.googleblog.com/2021/12/improving-oss-fuzz-and-jazzer-to-catch.html",
          "publishedOn": "2021-12-16T22:04:00.017Z",
          "wordCount": 759,
          "title": "Improving OSS-Fuzz and Jazzer to catch Log4Shell"
        },
        {
          "id": "http://security.googleblog.com/2021/12/empowering-next-generation-of-android.html",
          "author": null,
          "description": "Posted by Jon Bottarini, Security Program Manager & Lena Katib, Strategic Partnerships Manager\n\nThe external security researcher community plays an integral role in making the Google Play ecosystem safe and secure. Through this partnership with the community, Google has been able to collaborate with third-party developers to fix thousands of security issues in Android applications before they are exploited and reward security researchers for their hard work and dedication.  \nIn order to empower the next generation of Android security researchers, Google has collaborated with industry partners including HackerOne and PayPal to host a number of Android App Hacking Workshops. These workshops are an effort designed to educate security researchers and cybersecurity students of all skill levels …",
          "link": "http://security.googleblog.com/2021/12/empowering-next-generation-of-android.html",
          "publishedOn": "2021-12-14T18:00:00.001Z",
          "wordCount": 783,
          "title": "Empowering the next generation of Android Application Security Researchers"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/6/1525",
          "author": null,
          "description": "It’s our 3rd annual New Year’s party! We welcome a new panelist, review our (failed) resolutions from last year, discuss what’s trending in the web world, and even set some new (failed) resolutions for this year.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nDivya – Twitter, GitHub, LinkedIn, Website\nChristopher Hiller – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNotes and Links\nYou Will Be Able to Draw By the End of this Book",
          "link": "https://changelog.com/jsparty/207",
          "publishedOn": "2022-01-07T17:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 207: New Year's Party! 🍾",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/207/js-party-207.mp3",
            "length": "51903030",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9Ojl",
          "author": "Jerod Santo",
          "description": "Chip Huyen:\nIn the last year, I’ve talked to ~30 companies in different industries about their challenges with real-time machine learning. I’ve also worked with quite a few to find the solutions. This post outlines the solutions for (1) online prediction and (2) continual learning, with step-by-step use cases, considerations, and technologies required for each level.\nDiscuss on Changelog News",
          "link": "https://huyenchip.com//2022/01/02/real-time-machine-learning-challenges-and-solutions.html",
          "publishedOn": "2022-01-07T14:59:00.000Z",
          "wordCount": null,
          "title": "Real-time machine learning: challenges and solutions",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1532",
          "author": null,
          "description": "Our award winning ready survey game show is back, this time live from GopherCon 2021!\nGo Time panelists Natalie & Jon join forces with Go Team members Steve Francia, Katie Hockman, Julie Qui, and Rob Findley to battle it out and see who can better guess what the GopherCon gophers had to say!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nFireHydrant – The reliability platform for teams of all sizes. With FireHydrant, teams achieve reliability at scale by enabling speed and consistency from a service deployment to an unexpected outage. Try FireHydrant free for 14 days at firehydrant.io\n\n    \nGitLab – The DevOps platform that empowers organizations to maximize the overall return on software development by delivering software faster, more efficiently, while strengthening security and compliance. Identify and address blockers immediately, focus on delivering value — not maintaining integrations, automate security and compliance. Get started with their free tier (no credit card required). Learn more at about.gitlab.com/solutions/devops-platform\n\n    \nChangelog++ – You love our content and you want to take it to the next level by showing your support. We’ll take you closer to the metal with no ads, extended episodes, outtakes, bonus content, a deep discount in our merch store (soon), and more to come. Let’s do this!\n\n    \nFeaturing\nSteve Francia – Twitter, GitHub\nKatie Hockman – Twitter, GitHub\nJulie Qiu – Twitter, GitHub\nRob Findley – \nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nJon Calhoun – Twitter, GitHub, Website\nNotes and Links\nWatch the session from GopherCon 2021",
          "link": "https://changelog.com/gotime/211",
          "publishedOn": "2022-01-06T19:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 211: Gophers Say! GopherCon Edition",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/211/go-time-211.mp3",
            "length": "52876634",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eZRw",
          "author": "Jerod Santo",
          "description": "B. Cameron Gain on The New Stack:\nDespite an ample amount of documentation and demos made available by Grafana Labs and community members, Grafana can be a challenge to set up (although those that do get its dashboards working generally sing its praises). Many manual configurations and steps are required when installing the different dashboard options. Once installed, many users can be overwhelmed with the number of logs and other data to process for monitoring and observability.\nGrafana sure does produce pretty (useful) dashboards 👇, but I do find it overwhelming at times.\n\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/will-grafana-become-easier-to-use-in-2022/",
          "publishedOn": "2022-01-06T16:18:00.000Z",
          "wordCount": null,
          "title": "Will Grafana become easier to use in 2022?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O2aG",
          "author": "Jerod Santo",
          "description": "Martin Heinz on the tools/techniques for finding bottlenecks in your Python code. And fixing them, fast.\nThe first rule of optimization is to not do it. If you really have to though, then optimize where appropriate. Use the above profiling tools to find bottlenecks, so you don’t waste time optimizing some inconsequential piece of code. It’s also useful to create a reproducible benchmark for the piece of code you’re trying to optimize, so that you can measure the actual improvement.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/64",
          "publishedOn": "2022-01-06T15:21:00.000Z",
          "wordCount": null,
          "title": "Profiling and analyzing performance of Python programs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RRMP",
          "author": "Jerod Santo",
          "description": "Luis Artola:\nI built my own laptop over the holiday break and it’s a developer’s dream come true. I took a chance and ordered a Framework Laptop DIY Edition. I’m so glad I did. The Framework is an excellent platform to customize and build a very capable and stable Linux machine for development. Here’s what I love about it and things that could be better.\n\nDiscuss on Changelog News",
          "link": "https://luisartola.com/framework-laptop-with-ubuntu-review/",
          "publishedOn": "2022-01-06T14:30:00.000Z",
          "wordCount": null,
          "title": "Reviewing the Framework laptop with Ubuntu",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1511",
          "author": null,
          "description": "In our first 2022 episode, Alexis Richardson, co-founder and CEO of Weaveworks, is talking to Gerhard about going fully remote, what a great team looks like, and GitOps. While you may have heard of GitOps, now is a good time to check out opengitops.dev.\nThe most interesting part of today’s conversation is the missing cloud native App Store. While Apple revolutionised the world with the App Store and the iPhone, we don’t yet have something similar for cloud native apps. You may be thinking “But what about OperatorHub?”, or all the Helm registries out there? The registry fragmentation, operator deprecations and lack of curation are not what people have in mind when they think App Store. But there is more to it, so let’s hear how Alexis thinks about this.\nDiscuss on Changelog News\nJoin Change…",
          "link": "https://changelog.com/shipit/34",
          "publishedOn": "2022-01-05T23:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 34: Where is the cloud native App Store?",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/34/ship-it-34.mp3",
            "length": "44950994",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bNad",
          "author": "Konrad",
          "description": "Back in the olden days, I would just put a mysqldump > dump.sql in a crontab and called it a day. When I started to host more and more stuff with docker, I first just migrated that approach to docker and put it all in a container. That still required me to mess around with config files. Once I started to host postgres containers it all got even more complicated. Thus, I needed a new solution.\nI built this tool to make backups easy: Simply point it to a host running docker containers and it will automatically inspect and find all mysql/mariadb and postgres containers and do backups of them on a schedule. No configuration required, it “just works”.\nDiscuss on Changelog News",
          "link": "https://kolaente.dev/konrad/docker-db-backup",
          "publishedOn": "2022-01-05T21:30:00.000Z",
          "wordCount": null,
          "title": "Simple, zero-fuss docker database backups",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/P5ao",
          "author": "Finnian Anderson",
          "description": "There’s lots of info out there about building a simple app with Turbo, but there’s very limited content about architecting apps, scaling or building anything that’s not simply a blog.\nIn this post, I go into details about building a real production app with Hotwire and what we learnt as a team, plus some of the things we don’t like and the problems we bumped into.\nDiscuss on Changelog News",
          "link": "https://finnian.io/blog/hotwire-in-the-real-world/",
          "publishedOn": "2022-01-05T20:43:00.000Z",
          "wordCount": null,
          "title": "Hotwire in the real world",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3MO",
          "author": "Alex Strick van Linschoten",
          "description": "ZenML is an extensible MLOps framework to create production-ready machine learning pipelines. Built for data scientists, it has a simple, flexible syntax, is cloud and tool agnostic, and has interfaces/abstractions that are catered towards ML workflows.\nThe code base was recently completely rewritten with better abstractions and to set us up for our ongoing growth and inclusion of more integrations with tools that data scientists love to use.\nDiscuss on Changelog News",
          "link": "https://github.com/zenml-io/zenml",
          "publishedOn": "2022-01-05T16:43:00.000Z",
          "wordCount": null,
          "title": "ZenML helps data scientists work across the full stack",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1552",
          "author": null,
          "description": "In the second of the “AI in Africa” spotlight episodes, we welcome guests from Radiant Earth to talk about machine learning for earth observation. They give us a glimpse into their amazing data and tooling for working with satellite imagery, and they talk about use cases including crop identification and tropical storm wind speed estimation.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMe, Myself, and AI – A podcast on artificial intelligence and business produced by MIT Sloan Management Review and Boston Consulting Group. Each episode, Sam Ransbotham and Sheervin Khodabandeh talk to AI leaders from organizations like Nasdaq, Spotify, Starbucks, and IKEA. Me, Myself, and AI is available wherever you get your podcasts. Just search Me, Myself, and AI.\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFeaturing\nHamed Alemohammad – Twitter\nAbba Barde – Twitter, LinkedIn\nJoyce Nabende – Twitter\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nRadiant Earth\nML for Earth Observation online course\n“Spot the crop” challenge\nOpen for Good Alliance",
          "link": "https://changelog.com/practicalai/162",
          "publishedOn": "2022-01-05T14:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 162: 🌍 AI in Africa - Radiant Earth",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/162/practical-ai-162.mp3",
            "length": "42189444",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/DzAp",
          "author": "Jerod Santo",
          "description": "This project provides a tiny .emacs file to set up Emacs quickly. This document provides a detailed description of how to set it up and get started with Emacs.\nFurther this project also provides a tiny convenience command named em to start Emacs server and edit files using Emacs server. This helps in using Emacs efficiently.\n\nDiscuss on Changelog News",
          "link": "https://github.com/susam/emfy",
          "publishedOn": "2022-01-04T17:26:00.000Z",
          "wordCount": null,
          "title": "A dark/sleek Emacs setup for general purpose editing and programming",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2Ve",
          "author": "Jerod Santo",
          "description": "Previously, we compiled a Go program into a WebAssembly and then converted it into C++ files to make it run on Nintendo Switch. Now, I have succeeded in compiling a Go program into a native binary for Nintendo Switch, and also running a game there. I replaced system calls with C function calls using the -overlay option.\n\nDiscuss on Changelog News",
          "link": "https://ebiten.org/blog/native_compiling_for_nintendo_switch.html",
          "publishedOn": "2022-01-04T16:39:00.000Z",
          "wordCount": null,
          "title": "Compiling a Go program into a native binary for Nintendo Switch™",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/13A6",
          "author": "Adam Stacoviak",
          "description": "Oliver Brotchie developed this CSS fingerprinting technique that requires no Javascript or Cookies to function and avoids anti-tracking methods such as NoScript, VPNs or browser extensions.\nCSS Fingerprinting is a technique of tracking and gathering information on site visitors. This method exploits the nature of CSS to track various characteristics about the visitor’s browser and device, which can later be used to either identify or track said visitor.\nRight now, at current spec, this method doesn’t scale, but with the next upcoming draft of the CSS specification, CSS Values 4, it will become far more scalable and precise.\nDiscuss on Changelog News",
          "link": "https://csstracking.dev/",
          "publishedOn": "2022-01-04T15:51:44.000Z",
          "wordCount": null,
          "title": "CSS fingerprinting",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gdzW",
          "author": "Jerod Santo",
          "description": "If you ever get into an “oh snap!” situation where you think you just lost days of work, checkout a dura branch and recover.\nWithout dura, you use Ctrl-Z in your editor to get back to a good state. That’s so 2021. Computers crash and Ctrl-Z only works on files independently. Dura snapshots changes across the entire repository as-you-go, so you can revert to “4 hours ago” instead of “hit Ctrl-Z like 40 times or whatever”. Finally, some sanity.\nThis sounds a lot like how Fossil works out of the box, except maybe even more paranoid because Fossil will propagate every commit whereas Dura propagates all changes even before they’re committed.\nDiscuss on Changelog News",
          "link": "https://github.com/tkellogg/dura",
          "publishedOn": "2022-01-04T15:25:00.000Z",
          "wordCount": null,
          "title": "Dura is a background process that watches your Git repos",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X6aZ",
          "author": "Jerod Santo",
          "description": "I’ve been an iStat Menus user for years, but I only use the network and CPU widgets today. In fact, with my new MacBook Pro Max, the CPU monitor is pretty useless at this point. It rarely ever makes a blip!\nThis looks like a fine open source alternative. I’ll give it a try and report back.\n\nDiscuss on Changelog News",
          "link": "https://github.com/exelban/stats",
          "publishedOn": "2022-01-03T20:48:00.000Z",
          "wordCount": null,
          "title": "A macOS system monitor in your menu bar",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1551",
          "author": null,
          "description": "Here’s a little bonus episode before we get back to your regularly scheduled Go Time. We’re calling it the funny bits. It’s a compilation of times we cracked up making the show for y’all. If you dig it, holler at Jerod. If you don’t, email Mat Ryer.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nKat Zień – Twitter, GitHub, Website\nL Körbes – Twitter, GitHub, Website\nDaniel Martí – Twitter, GitHub, LinkedIn, Website\nRoberto Clapis – Twitter, GitHub\nCarl Johnson – Twitter, GitHub, Website\nAndré Eriksson – Twitter, GitHub, Website\nCarolyn Van Slyck – Twitter, GitHub, Website\nKatie Hockman – Twitter, GitHub\nJay Conrod – Twitter, GitHub, Website\nTeiva Harsanyi – Twitter, GitHub, Website\nsam boyer – Twitter, GitHub\nCarlisia Thompson – Twitter, GitHub, LinkedIn\nIan Lopshire – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nMark Bates – Twitter, GitHub, Website\nAngelica Hill – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nNotes and Links\n#161: Go Panic!\n#166: Indecent (language) Proposals: Part 1\n#168: Indecent (language) Proposals: Part 2\n#171: go:embed\n#173: Releasing with (and without) GoReleaser\n#180: Are frameworks getting an Encore?\n#184: All about Porter\n#187: Fuzzing in the standard library\n#190: How to make mistakes in Go\n#196: Building actually maintainable software\n#200: Gophers Say What?!\n#202: Maintaining ourselves",
          "link": "https://changelog.com/gotime/funny-bits-2021",
          "publishedOn": "2022-01-03T18:30:00.000Z",
          "wordCount": null,
          "title": "Go Time The funny bits from 2021",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/funny-bits-2021/go-time-funny-bits-2021.mp3",
            "length": "27148733",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/d3a8",
          "author": "Jerod Santo",
          "description": "RSS-Bridge is a PHP project capable of generating RSS and Atom feeds for websites that don’t have one. It can be used on webservers or as a stand-alone application in CLI mode.\nI made a very poor-man’s version of this as my first ever Sinatra app way back in the day. It’s cool to see that vision live on, but it sucks that tools like this have to exist. It seems that the author agrees with me on that:\nWe want to share with friends, using open protocols: RSS, Atom, XMPP, whatever. Because no one wants to have your service with your applications using your API force-feeding them. Friends must be free to choose whatever software and service they want.\nWe are rebuilding bridges you have willfully destroyed.\nDiscuss on Changelog News",
          "link": "https://github.com/RSS-Bridge/rss-bridge",
          "publishedOn": "2022-01-03T16:07:00.000Z",
          "wordCount": null,
          "title": "The RSS feed for websites missing it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6OAq",
          "author": "Jerod Santo",
          "description": "OpenDrop is a command-line tool that allows sharing files between devices directly over Wi-Fi. Its unique feature is that it is protocol-compatible with Apple AirDrop which allows to share files with Apple devices running iOS and macOS.\nSuper cool, but with a disclaimer: this is the result of reverse engineering the transfer protocol, so the odds of it being flakey (especially as Apple ships OS updates) are high. It’d be rad if Apple would publish an AirDrop-compatible specification for the community to rally around.\nYou know, like they did with FaceTime. 😉\nDiscuss on Changelog News",
          "link": "https://github.com/seemoo-lab/opendrop",
          "publishedOn": "2022-01-03T15:19:00.000Z",
          "wordCount": null,
          "title": "AirDrop files directly from your CLI with OpenDrop",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1466",
          "author": null,
          "description": "Merry Shipmas! This is our special Christmas episode which sums up two months of very early mornings and a few late nights. After many twists and turns, stuff which didn’t work out, as well as pleasant surprises, this is what we ended up with:\n🎁 PR #395 - CI/CD Lego set with Guillaume de Rouville & Joel Longtine\n🎁 PR #396 - Continuous CPU profiling with Frederic Branczyk\n🎁 PR #399 - Auto-restoring Kubernetes clusters with Dan Mangum & Muvaffak Onuş\nWhile we initially intended to have five Christmas presents in total, only three got delivered in time. We planned, worked hard and eventually shipped the best we could just in time for this special Christmas episode. Our hope is that the latest additions to our changelog.com GitHub repository will help you just as much as they will help our …",
          "link": "https://changelog.com/shipit/33",
          "publishedOn": "2021-12-24T12:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 33: 🎄 Merry Shipmas 🎁",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/33/ship-it-33.mp3",
            "length": "85855392",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1528",
          "author": null,
          "description": "Our 4th annual year-end wrap-up episode! We don’t naval gaze often, but when we do… we make sure you get your money’s worth. Reflections, most popular episodes, our favs, and new this year: listener voice mails. Thanks for listening! 💚\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped data produced by sensors, applications, and infrastructure. Learn about the wide range of use cases of InfluxDB at influxdata.com/changelog\n\n    \nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build intern…",
          "link": "https://changelog.com/podcast/473",
          "publishedOn": "2021-12-20T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 473: State of the \"log\" 2021",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/473/the-changelog-473.mp3",
            "length": "107390296",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1519",
          "author": null,
          "description": "We’re joined by Eran Yahav — talking about AI assistants for developers. Eran has been working on this problem for more than a decade. We talk about his path to now and how the idea for Tabnine came to life, this AI revolution taking place and the role it will play in developer productivity, and we talk about the elephant in the room - how Tabnine compares to GitHub Copilot, and what they’re doing to make Tabnine the AI assistant for every developer regardless of the IDE or editor you choose.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nInfluxData – InfluxDB empowers developers to build IoT, analytics, and monitoring software. It’s purpose-built to handle massive volumes and countless sources of time-stamped d…",
          "link": "https://changelog.com/podcast/472",
          "publishedOn": "2021-12-17T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 472: AI-assisted development is here to stay",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/podcast/472/the-changelog-472.mp3",
            "length": "73832369",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/DzPp",
          "author": "Jerod Santo",
          "description": "This is the first (of probably many) “playing with generics” post we’ll see now that Go 1.18 is in beta with official support for the controversial feature.\nThis post aims to describe my initial experience converting my markphelps/optional library from using code generation to using generics instead. Hopefully, after reading this post you’ll have a better understanding of what generics can do for you and what they can’t.\nMark shares lots of good tips along the way. His findings are quite positive:\nI ❤️ that I was able to delete 95% of my code because of generics.\nI think that generics will be very beneficial to maintainers who create libraries for things like my own as well as for searching, sorting, transformations, and the like. I can also see some them being extremely helpful for creating well-tested libraries around the various concurrency patterns that are sometimes tricky to get right.\nDiscuss on Changelog News",
          "link": "https://markphelps.me/posts/trying-out-generics-in-go/",
          "publishedOn": "2021-12-17T18:41:00.000Z",
          "wordCount": null,
          "title": "Trying out generics in Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/k2Me",
          "author": "Jerod Santo",
          "description": "Arnold Galovics:\nMicroservices are getting natural and we almost feel like we’ve been always living in the world of microservices. Lately when I talked to other developers and asked how they would start a greenfield project, almost certainly the answer was, well, one microservice for this, another one for this, another one for user management, one more for authentication, another for authorization, one more for session management, and the list could go on.\nI’m gonna try to shed some light on what nobody is talking about when it comes to microservices. And yeah, it’s gonna be a first-hand experience from a past projects I worked on.\nThis excellent piece gave me some serious deja vu of [Kelsey Hightower’s monoliths are the future. I’m quite looking forward to Arnold’s upcoming “chapter 2” of the story.\nDiscuss on Changelog News",
          "link": "https://arnoldgalovics.com/microservices-in-production/",
          "publishedOn": "2021-12-17T17:54:00.000Z",
          "wordCount": null,
          "title": "Don’t start with microservices – monoliths are your friend",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1505",
          "author": null,
          "description": "Jerod, Nick, and a node_modules-worthy collection of JS friends played an intense game of Frontend Feud at React Advanced London’s after-party back in October. Today, you get to play along with us!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are using Retool to power their internal apps. Learn more and try it for free at retool.com/changelog\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFastly – Compute@Edge free for 3 months — plus up to $100k a month in credit for an additional 6 months. Fastly’s Edge cloud network and modern approach to serverless computing allows you to deploy and run complex logic at the edge with unparalleled security and blazing fast computational speed. Head to fastly.com/podcast to take advantage of this limited time promotion!\n\n    \nFeaturing\nMichael Chan – Twitter, GitHub, Website\nYuraima Estevez – Twitter, GitHub, Website\nBrandon Dail – Twitter, GitHub, Website\nTara Z. Manicsic – Twitter, GitHub, Website\nNick Nisi – Twitter, GitHub, Website\nColby Fayock – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nJS Party Merch!\nJavaScript’s security model is based",
          "link": "https://changelog.com/jsparty/206",
          "publishedOn": "2021-12-17T16:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 206: Frontend Feud: React Advanced Edition",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/jsparty/206/js-party-206.mp3",
            "length": "63715826",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X6MZ",
          "author": "Jerod Santo",
          "description": "Turns out the pass command on your local Linux box can be used for a bunch of encryption-related things in addition to what most of us use it for: managing a user’s password.\nOne cool example is you can hide API keys from shoulder surfers (and history’s memory) by storing the key encrypted on disk and using pass to access it at runtime:\ncurl -H \"API-Key: $(pass provider/api_key)\" ...\n\nDiscuss on Changelog News",
          "link": "https://vitalyparnas.com/guides/pass/",
          "publishedOn": "2021-12-17T15:37:00.000Z",
          "wordCount": null,
          "title": "Clever uses of pass, the Unix password manager",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1499",
          "author": null,
          "description": "In 2014 Gerhard joined CloudCredo, a startup co-founded by Colin Humphreys, Paula Kennedy & Chris Hedley. They stuck together through two acquisitions: Pivotal & VMware. This year, Colin, Paula & Chris co-founded Syntasso, the Platform-as-a-Product startup.\nToday they all get together to talk about about what it takes to build a platform team, why Team Topologies is a good conversation starter and why a curated blend of off-the-shelf, composed, and self-created services are required in any organisation operating at scale.\nYour hunch is right, all of them used to share the same Pivotal London office with Tammer Saleh, our guest from episode 31. Chris used to win all table tennis matches without even breaking a sweat, and today Gerhard gets his comeback. Touché!\nDiscuss on Changelog News\nJoi…",
          "link": "https://changelog.com/shipit/32",
          "publishedOn": "2021-12-17T14:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 32: Crossing the platform gap",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/shipit/32/ship-it-32.mp3",
            "length": "68916345",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/wkab",
          "author": "Jerod Santo",
          "description": "A post from back in June resurfaced this week in light of the big Rails 7 release.\nI learned to code in the JavaScript stack and am building a JavaScript based product. I never questioned this stack: many companies default to it, JS everywhere seems good, and the community is big. But for my new side project I decided to try Rails because despite some perception that Ruby on Rails is ‘over’, people in HN comments say it was somehow more enjoyable than the newer Node based stack. Having tried it I can say wow - coming from the current Javascript ecosystem makes discovering Rails a revelation.\nIf you make your technology choices because of “perception that $TECHNOLOGY is ‘over’”, you are missing out on a world of potentially great options.\nDiscuss on Changelog News",
          "link": "https://nikodunk.com/a-node-js-developer-discovers-rails/",
          "publishedOn": "2021-12-17T14:30:00.000Z",
          "wordCount": null,
          "title": "From Node to Ruby on Rails",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1531",
          "author": null,
          "description": "You had questions, the Go Team had answers! Topics covered include generics (of course), governance (of course), Go 2, text editors, GitHub Copilot, garbage collection, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug issues, and more. Head to info.sourcegraph.com/changelog and click the button “Try Sourcegraph now” to get started.\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nLinode – Get $100 in free credit to get started on Linode – Linode is our cloud of choice and the home of Changelog.com. Head to linode.com/changelog OR text CHANGELOG to 474747 to get instant access to that $100 in free credit.\n\n    \nFeaturing\nSameer Ajmani – Twitter, GitHub\nKeith Randall – GitHub, Website\nAlice Merrick – Twitter, LinkedIn\nRob Findley – \nCameron Balahan – Twitter\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links",
          "link": "https://changelog.com/gotime/210",
          "publishedOn": "2021-12-16T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 210: Mat asks the Go Team anything",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/gotime/210/go-time-210.mp3",
            "length": "55996698",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EQPj",
          "author": "Jerod Santo",
          "description": "DHH announcing the 7th major release of Ruby on Rails:\nThis version of Rails has been years in the conceptual making. It’s the fulfillment of a vision to present a truly full-stack approach to web development that tackles both the front- and back-end challenges with equal vigor. An omakase menu that includes everything from the aperitif to the dessert.\nThere’s a lot to like about the new Node-free approach to the frontend, at-work encryption added to Active Record, a new auto-loading strategy, and more. Congrats to the hundreds of contributors who worked on this major milestone!\nDiscuss on Changelog News",
          "link": "https://rubyonrails.org/2021/12/15/Rails-7-fulfilling-a-vision",
          "publishedOn": "2021-12-16T16:25:00.000Z",
          "wordCount": null,
          "title": "Rails 7.0: fulfilling a vision",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2510",
          "author": "Liana Leahy",
          "description": "This is a fancified excerpt of Liana Leahy from JS party #203. Liana spent 20 years as a developer before transitioning to product, so she knows what she’s talking about here. To get the full experience you should listen while you read.\n🎧  Click here to listen along while you read. It's better!   🎧\nBefore making a move into product management, make the most of your technical career. The stories and experiences you gather as a developer will help you. But let’s say you’ve been in the software development field for a number of years, and you’re looking for your next challenge. Here’s a list of “You know you’re a PM if…” statements to help you decide if this career is right for you.\nIf you’re the type of person who likes to know what features are on the roadmap…\nIf you’re questioning why a new feature is gonna be useful…\nIf you like to understand the problem that a feature is trying to solve…\nIf you like to be involved in finding the solutions…\nIf you care about the quality of the customer experience, as well as the quality of the code…\nIf you love measuring success with quantifiable analytics and you don’t mind talking with users and other stakeholders…\nIf you make sure the conversations that get alignment across teams happen, you’re the glue… and you might be a Product Manager.\nIf you’re comfortable with the 80/20 rule, and can solve for the most common use cases and balance the trade-offs and edge cases…\nIf you have a calm and upbeat demeanor, even when chaos swirls around you…\nYou might be a Product Manager!\n\n  \nSubscribe to our YouTube channel for more clips like this, live show recordings, and more ✌️\n\n\nDiscuss on Changelog News",
          "link": "https://changelog.com/posts/you-might-be-a-product-manager-if",
          "publishedOn": "2021-12-16T15:39:28.000Z",
          "wordCount": null,
          "title": "Developers: you might be a Product Manager if...",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LpPn",
          "author": "Jerod Santo",
          "description": "We laugh so that we do not have time to cry. (via Zachary Taylor in our community Slack)\n\nDiscuss on Changelog News",
          "link": "https://log4jmemes.com/",
          "publishedOn": "2021-12-16T15:08:00.000Z",
          "wordCount": null,
          "title": "Need a laugh? log4jmemes.com delivers exactly what you expect from it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bNMd",
          "author": "Jerod Santo",
          "description": "Julia Evans has a cool new web tool for experimenting with DNS. She wrote up why she created it and some of the tech behind the tool on her announcement post:\nMess With DNS gives you a real subdomain, and it’s running a real DNS server (the address is mess-with-dns1.wizardzines.com). The interesting thing about DNS is that it’s a global system with many different computers interacting, and so I wanted people to be able to actually see that system in action.\n\nDiscuss on Changelog News",
          "link": "https://messwithdns.net/",
          "publishedOn": "2021-12-16T14:19:00.000Z",
          "wordCount": null,
          "title": "Mess with DNS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/q0nq",
          "author": "Jerod Santo",
          "description": "Russ Cox, for the Go team:\nGenerics are the most significant change to Go since the release of Go 1, and certainly the largest single language change we’ve ever made. With any large, new feature, it is common for new users to discover new bugs, and we don’t expect generics to be an exception to this rule; be sure to approach them with appropriate caution.\nIt didn’t make the headline, but fuzzing (tests that automatically find inputs which cause your program to crash or return invalid answers) also made it in the build, which our Go Time team has been quite excited about as well.\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/go1.18beta1",
          "publishedOn": "2021-12-15T15:19:00.000Z",
          "wordCount": null,
          "title": "Go's 1.18 Beta 1 is available, with generics",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3Ml",
          "author": "Jerod Santo",
          "description": "The Supabase folks have open sourced a work-in-progress native PostgreSQL extension adding GraphQL support. First, they surveyed the field and liked what they saw from Graphile and Hasura, but…\nwe host free-tier projects on VMs with 1 GB of memory. After tallying the resources reserved for PostgreSQL, PostgREST, Kong, GoTrue, and a handful of smaller services, we were left with a total memory budget of … 0 MB 😬. Unsurprisingly, our pathological memory target disqualified any option that required launching another process in those VMs.\nBy their estimates, this effort will reduces the platform’s memory requirements by 525 TB/hours every month. Seems worth it!\nDiscuss on Changelog News",
          "link": "https://supabase.com/blog/2021/12/03/pg-graphql",
          "publishedOn": "2021-12-15T14:31:00.000Z",
          "wordCount": null,
          "title": "A native GraphQL extension for PostgreSQL",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1546",
          "author": null,
          "description": "The time has come! OpenAI’s API is now available with no waitlist. Chris and Daniel dig into the API and playground during this episode, and they also discuss some of the latest tool from Hugging Face (including new reinforcement learning environments). Finally, Daniel gives an update on how he is building out infrastructure for a new AI team.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline made for developers. RudderStack is the smart customer data pipeline. Connect your whole customer data stack. Warehouse-first, open source Segment alternative.\n\n    \nMe, Myself, and AI – A podcast on artificial intelligence and business produced by MIT Sloan Management Review and Boston Consulting Group. Each episode, Sam Ransbotham and Sheervin Khodabandeh talk to AI leaders from organizations like Nasdaq, Spotify, Starbucks, and IKEA. Me, Myself, and AI is available wherever you get your podcasts. Just search Me, Myself, and AI.\n\n    \nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nOpenAI’s API Now Available with No Waitlist\nHugging Face SnowballFight beta\nHugging Face Data Measurements Tool\nPandas Tutor\nClearML",
          "link": "https://changelog.com/practicalai/161",
          "publishedOn": "2021-12-14T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 161: OpenAI and Hugging Face tooling",
          "itunes": {},
          "enclosure": {
            "url": "https://chtbl.com/track/A551A9/https://cdn.changelog.com/uploads/practicalai/161/practical-ai-161.mp3",
            "length": "48791481",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/53m9",
          "author": "Jerod Santo",
          "description": "Austin Gil writes an excellent post on how to get more team members involved with accessibility by sharing tools they’ll actually use. He covers tools for designers, developers, editor plugins, frontend frameworks, stylesheets, and even CI/CD integrations.\n(This was also a big topic of discussion in JS party #204: JavaScript will kill you in the Apocalypse.)\nDiscuss on Changelog News",
          "link": "https://austingil.com/making-accessibility-more-accessible/",
          "publishedOn": "2021-12-14T15:37:00.000Z",
          "wordCount": null,
          "title": "Making accessibility more accessible",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W3Mg",
          "author": "Jerod Santo",
          "description": "We have been researching the Log4J RCE (CVE-2021-44228) since it was released, and we worked in preventing this vulnerability with our customers. We are open-sourcing an open detection and scanning tool for discovering and fuzzing for Log4J RCE CVE-2021-44228 vulnerability. This shall be used by security teams to scan their infrastructure for Log4J RCE, and also test for WAF bypasses that can result in achiving code execution on the organization’s environment.\n\nDiscuss on Changelog News",
          "link": "https://github.com/fullhunt/log4j-scan",
          "publishedOn": "2021-12-14T14:13:00.000Z",
          "wordCount": null,
          "title": "An accurate, extensive scanner for finding vulnerable log4j hosts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/q0nw",
          "author": "Jerod Santo",
          "description": "We will be working with other ECMA members and the wider JS community on the next iterations of JavaScript, in the TC39 working group. We will be pushing for features and improvements to the language that benefit everyone, but especially users of server-side JavaScript.\nSpecific features they plan to push forward are better support for non-JS assets in the ES module graph, better support for explicit resource management, and more extensive standard library functions for async iteration. Oh, and this:\nAs TypeScript is a core part of the Deno ecosystem, we are also very interested in pushing for even closer alignment of TypeScript and JavaScript in the future.\nDiscuss on Changelog News",
          "link": "https://deno.com/blog/deno-joins-tc39",
          "publishedOn": "2021-12-13T21:35:00.000Z",
          "wordCount": null,
          "title": "Deno joins TC39",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Z3M2",
          "author": "Jerod Santo",
          "description": "Rauno Metsa:\nI’m a developer and I love to write code. I enjoy watching my brain come up with creative solutions for complex problems.\nSo, I often find myself with a blog post that’s ready to be submitted to Hacker News, or a tweet that’s ready to be sent, but postponing it.\nSound familiar? If so, read the story to learn how he got over it and started benefiting from his new-found confidence.\nDiscuss on Changelog News",
          "link": "https://raumet.com/marketing",
          "publishedOn": "2021-12-13T20:49:00.000Z",
          "wordCount": null,
          "title": "Marketing is scary for a solo developer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ykMk",
          "author": "Jerod Santo",
          "description": "A rebuttal by Kailash Nadh to the aforelinked post.\nlarge for-profit corporations started their widespread consumption of FOSS, ever since countless “unicorns” raised infinite amounts of funding on valuations built pretty much entirely on FOSS, ever since FOSS got co-opted into corporatisation and capitalisation. And yet, countless maintainers of critical and widely used FOSS struggle to make a living.\nWhose fault is this? I do not believe that this is FOSS’ fault as a conceptual framework or a system. If FOSS was broken, the internet as we know it today wouldn’t exist; the countless marvels of technology that we take for granted and techno-economies that thrive on them wouldn’t exist; millions of software developers (like me) who learnt to write code with FOSS and learnt to make a living with that knowledge wouldn’t exist.\nDiscuss on Changelog News",
          "link": "https://nadh.in/blog/open-source-is-not-broken/",
          "publishedOn": "2021-12-13T15:31:00.000Z",
          "wordCount": null,
          "title": "\"Open source\" is not broken",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JLoq",
          "author": "Jerod Santo",
          "description": "The post-log4j-zero-day thinkpieces started rolling in over the weekend. I’m happy about that. We need to discuss this stuff. Here’s what Christine Dodrill’s TL;DR:\nIf you want me to make you useful software, pay me. If you use software made by others in their spare time and find it useful, pay them. This should not be a controversial opinion. This should not be a new thing. This should already be the state of the world and it is amazingly horrible for us to have the people that make the things that make our software work at all starve and beg for donations.\nThe entire article is worth considering.\nDiscuss on Changelog News",
          "link": "https://christine.website/blog/open-source-broken-2021-12-11",
          "publishedOn": "2021-12-13T14:36:00.000Z",
          "wordCount": null,
          "title": "\"Open source\" is broken",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0812release/",
          "author": null,
          "description": "Our latest release is for you, the people. You asked for better sounds, we designed a completely new set of sounds for 0.8.12. You asked for better longitudinal control in stop and go, so we put that in 0.8.12. You asked for a model that doesn’t take exits, 0.8.12 has that too. We really like 0.8.12, and we think you will too. Merry Christmas!",
          "link": "https://blog.comma.ai/0812release/",
          "publishedOn": "2021-12-15T12:00:00.000Z",
          "wordCount": 1290,
          "title": "🎄 openpilot 0.8.12 🎄"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/around-the-globe/google-africa/how-abigail-annkah-using-ai-improve-maps-africa/",
          "author": null,
          "description": "As a university student, Abigail Annkah fell in love with mathematics, which soon led to her interest in artificial intelligence. After graduating from the African Institute for Mathematical Sciences, Abigail made it through the competitive process to become an AI resident at Google Research, Accra. After her residency, Google offered her a job and she’s now a research software engineer working on several high-profile projects.\nAs Google grows its presence in Accra, we spoke to Abigail about the mapping project that motivates her, starting a new job while becoming a mother and the importance of inspiring young girls to enter STEM careers.\n\nHow did your science background lead you to Google?\nI did my undergraduate degree in Bachelor of Science Statistics at the University of Ghana, finishin…",
          "link": "https://blog.google/around-the-globe/google-africa/how-abigail-annkah-using-ai-improve-maps-africa/",
          "publishedOn": "2022-01-06T12:00:00.000Z",
          "wordCount": 1625,
          "title": "How Abigail Annkah is using AI to improve maps in Africa"
        },
        {
          "id": "https://blog.google/technology/research/2021-year-review-google-quantum-ai/",
          "author": null,
          "description": "Google’s Quantum AI team has had a productive 2021. Despite ongoing global challenges, we’ve made significant progress in our effort to build a fully error-corrected quantum computer, working towards our next hardware milestone of building an error-corrected quantum bit (qubit) prototype. At the same time, we have continued our commitment to realizing the potential of quantum computers in various applications. That's why we published results in top journals, collaborated with researchers across academia and industry, and expanded our team to bring on new talent and expertise.\n\n\n\nAn update on hardware\n\n\nThe Quantum AI team is determined to build an error-corrected quantum computer within the next decade, and to simultaneously use what we learn along the way to deliver helpful—and even trans…",
          "link": "https://blog.google/technology/research/2021-year-review-google-quantum-ai/",
          "publishedOn": "2021-12-30T18:00:00.000Z",
          "wordCount": 2075,
          "title": "2021 Year in Review: Google Quantum AI"
        },
        {
          "id": "https://blog.google/products/earth/archaeologist-fights-tomb-raiders-google-earth/",
          "author": null,
          "description": "In the summer, Dr. Gino Caspari’s day starts at 5:30 a.m. in Siberia, where he studies the ancient Scythians with the Swiss National Science Foundation. There, he looks for burial places of these nomadic warriors who rode through Asia 2,500 years ago. The work isn’t easy, from dealing with extreme temperatures, to swamps covered with mosquitos. But the biggest challenge is staying one step ahead of tomb raiders.\nIt’s believed that more than 90% of the tombs — called kurgans — have already been destroyed by raiders looking to profit off what they find, but Gino is looking for the thousands he believes remain scattered across Russia, Mongolia and Western China. To track his progress, he began mapping these burial sites using Google Earth. “There’s a plethora of open data sources out there, b…",
          "link": "https://blog.google/products/earth/archaeologist-fights-tomb-raiders-google-earth/",
          "publishedOn": "2021-12-17T17:00:00.000Z",
          "wordCount": 1286,
          "title": "This archaeologist fights tomb raiders with Google Earth"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=18119",
          "author": "Daniel Stenberg",
          "description": "There has been eight weeks since 7.80.0. Release presentation Numbers the 205th release1 change56 days (total: 8,636)121 bug-fixes (total: 7,518)189 commits (total: 28,055)0 new public libcurl function (total: 86)1 new curl_easy_setopt() option (total: 295)1 new curl command line option (total: 244)53 contributors, 25 new (total: 2,558)32 authors, 14 new (total: 990)0 security fixes (total: 111)0 … Continue reading curl 7.81.0 – more percent →",
          "link": "https://daniel.haxx.se/blog/2022/01/05/curl-7-81-0-more-percent/",
          "publishedOn": "2022-01-05T08:03:22.000Z",
          "wordCount": 1540,
          "title": "curl 7.81.0 – more percent"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17924",
          "author": "Daniel Stenberg",
          "description": "Every year is a curl year. I’m saving my bigger summary for curl’s 24th birthday in March, but when reaching the end of a calendar year it feels natural and even fun to look back and highlight some of the things we accomplished and what happened during this particular lap around the sun. I decided … Continue reading The curl year 2021 →",
          "link": "https://daniel.haxx.se/blog/2021/12/21/the-curl-year-2021/",
          "publishedOn": "2021-12-21T22:13:28.000Z",
          "wordCount": 1643,
          "title": "The curl year 2021"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=17920",
          "author": "Daniel Stenberg",
          "description": "I’ve talked on this topic before but I realized I never did a proper blog post on the topic. So here it is: how we develop curl to keep it safe. The topic of supply chain security is one that is discussed frequently these days and every so often there’s a very well used (open … Continue reading Keeping curl safe →",
          "link": "https://daniel.haxx.se/blog/2021/12/13/keeping-curl-safe/",
          "publishedOn": "2021-12-13T10:00:47.000Z",
          "wordCount": 2939,
          "title": "Keeping curl safe"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "author": null,
          "description": "Twitter Notebook is Twitter’s internal notebook solution. It provides a first-class development environment to Data Scientist and Machine Learning practitioners at Twitter. This blog shares features o",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/advancing-jupyter-notebooks-at-twitter---part-1--a-first-class-d",
          "publishedOn": "2021-12-31T12:28:15.540Z",
          "wordCount": 2841,
          "title": "Advancing Jupyter Notebooks at Twitter - Part 1"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "author": null,
          "description": "In this blog, we describe how we separate Twitter’s pacing system from the serving stack to an independent service.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/how-we-built-twitter-s-highly-reliable-ads-pacing-service",
          "publishedOn": "2021-12-17T12:27:32.255Z",
          "wordCount": 2822,
          "title": "How We Built Twitter’s Highly Reliable Ads Pacing Service"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "author": null,
          "description": "In this post, we show how tools from the fields of differential geometry and algebraic topology can be used to reinterpret GNNs and address some of their common plights in a principled way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-through-the-lens-of-differential-geometry-",
          "publishedOn": "2021-12-15T12:27:43.015Z",
          "wordCount": 2629,
          "title": "GNNs through the lens of differential geometry and algebraic topology"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "author": null,
          "description": "This blog post shares optimization findings to speed up Transformer-based models’ CPU inference and improve computational demand in Google Cloud.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/speeding-up-transformer-cpu-inference-in-google-cloud",
          "publishedOn": "2021-12-12T12:26:25.342Z",
          "wordCount": 2671,
          "title": "Speeding up Transformer CPU inference in Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2021/12/a-deep-dive-into-nso-zero-click.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ol{margin:0;padding:0}table td,table th{padding:0}.c13{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#b7b7b7;border-top-width:1pt;border-right-width:1pt;border-left-color:#b7b7b7;vertical-align:top;border-right-color:#b7b7b7;border-left-width:1pt;border-top-style:solid;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#b7b7b7;border-bottom-style:solid}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:\"Courier New\";font-style:normal}.c5{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:\"Arial\";font-style:normal}.c20{padding-top:20pt;padding-bottom:…",
          "link": "https://googleprojectzero.blogspot.com/2021/12/a-deep-dive-into-nso-zero-click.html",
          "publishedOn": "2021-12-15T17:00:00.000Z",
          "wordCount": 3515,
          "title": "A deep dive into an NSO zero-click iMessage exploit: Remote Code Execution"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47506",
          "author": "Xavier Harding",
          "description": "Sara Soueidan is an independent Web UI and design engineer, author, speaker, and trainer from Lebanon. When Sara isn’t offering keynote speeches at conferences (she’s done so a dozen times) she’s writing books like “Codrops CSS Reference” and “Smashing Book 5.” Currently, she’s working on a new course, \"Practical Accessibility,\" meant to teach devs and designers ways to make their products accessible. In 2015, Sara was voted Developer of the Year in the net awards, and shortlisted for the Outstanding Contribution of the Year award. She also won an O’Reilly Web Platform Award for “exceptional leadership, creativity, and collaboration in the development of JavaScript, HTML, CSS, and the supporting Web ecosystem.”\nWe chatted with Sara about front-end web development, the importance of design and her appreciation of birds.\nThe post Hacks Decoded: Sara Soueidan, Award-Winning UI Design Engineer and Author appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/12/hacks-decoded-sara-soueidan-award-winning-ui-design-engineer-and-author/",
          "publishedOn": "2021-12-30T15:13:51.000Z",
          "wordCount": 3597,
          "title": "Hacks Decoded: Sara Soueidan, Award-Winning UI Design Engineer and Author"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=62275",
          "author": "Scott Sanders",
          "description": "In December, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2022-01-05-github-availability-report-december-2021/",
          "publishedOn": "2022-01-05T21:34:45.000Z",
          "wordCount": 238,
          "title": "GitHub Availability Report: December 2021"
        },
        {
          "id": "https://github.blog/?p=62222",
          "author": "Xavier René-Corail",
          "description": "The GitHub Security Lab’s CodeQL bounty program fuels GitHub Advanced Security with queries written by the open source community.",
          "link": "https://github.blog/2022-01-05-how-the-community-powers-github-advanced-security-with-codeql-queries/",
          "publishedOn": "2022-01-05T18:18:04.000Z",
          "wordCount": 1244,
          "title": "How the community powers GitHub Advanced Security with CodeQL queries"
        },
        {
          "id": "https://github.blog/?p=62241",
          "author": "Becca Crockett",
          "description": "As the year winds down, we're highlighting some of the incredible work from GitHub’s engineers, product teams, and security researchers.",
          "link": "https://github.blog/2021-12-28-githubs-top-10-blog-posts-of-2021/",
          "publishedOn": "2021-12-28T17:00:37.000Z",
          "wordCount": 544,
          "title": "GitHub’s top 10 blog posts of 2021"
        },
        {
          "id": "https://github.blog/?p=62205",
          "author": "Rose Coogan",
          "description": "GitHub was honored to contribute to the Santa Clara Principles on Transparency and Accountability in Content Moderation 2.0.",
          "link": "https://github.blog/2021-12-21-how-github-contributed-santa-clara-principles-update/",
          "publishedOn": "2021-12-21T17:55:56.000Z",
          "wordCount": 1162,
          "title": "How GitHub contributed to the Santa Clara Principles update"
        },
        {
          "id": "https://github.blog/?p=62090",
          "author": "Alvaro Munoz",
          "description": "In this post, I’ll discuss how to apply OWASP Proactive Control C2: Leverage security frameworks and libraries.",
          "link": "https://github.blog/2021-12-20-how-to-leverage-security-frameworks-and-libraries-for-secure-code/",
          "publishedOn": "2021-12-20T17:47:15.000Z",
          "wordCount": 2195,
          "title": "How to leverage security frameworks and libraries for secure code"
        },
        {
          "id": "https://github.blog/?p=62032",
          "author": "Pulkit Agarwal",
          "description": "When you want to create a workflow in the Actions tab of your repository, the recommendations are now based on an analysis of repo content.",
          "link": "https://github.blog/2021-12-17-getting-started-with-github-actions-just-got-easier/",
          "publishedOn": "2021-12-17T17:35:29.000Z",
          "wordCount": 506,
          "title": "Getting started with GitHub Actions just got easier!"
        },
        {
          "id": "https://github.blog/?p=62042",
          "author": "Ian Olsen",
          "description": "Codespaces is a great tool for technical hiring exercises and helps level the playing field for candidates.",
          "link": "https://github.blog/2021-12-16-technical-interviews-via-codespaces/",
          "publishedOn": "2021-12-16T17:59:56.000Z",
          "wordCount": 1073,
          "title": "Technical interviews via Codespaces"
        },
        {
          "id": "https://github.blog/?p=61995",
          "author": "Brian Douglas",
          "description": "Looking to avoid security vulnerabilities, buttons that don’t work, slow site speeds, or manually writing release notes? This one's for you.",
          "link": "https://github.blog/2021-12-16-5-automations-every-developer-should-be-running/",
          "publishedOn": "2021-12-16T17:04:20.000Z",
          "wordCount": 1488,
          "title": "5 automations every developer should be running"
        },
        {
          "id": "https://github.blog/?p=62004",
          "author": "Pavel Avgustinov",
          "description": "This blog post tells the story of why we built a new search engine optimized for code.",
          "link": "https://github.blog/2021-12-15-a-brief-history-of-code-search-at-github/",
          "publishedOn": "2021-12-15T18:35:29.000Z",
          "wordCount": 3094,
          "title": "A brief history of code search at GitHub"
        },
        {
          "id": "https://github.blog/?p=61983",
          "author": "Brittany O'Shea",
          "description": "Use GitHub’s security features to assess Apache Log4j exposure and, where possible, mitigate this vulnerability within your GitHub repositories.",
          "link": "https://github.blog/2021-12-14-using-githubs-security-features-identify-log4j-exposure-codebase/",
          "publishedOn": "2021-12-14T19:46:00.000Z",
          "wordCount": 736,
          "title": "Using GitHub’s security features to help identify Log4j exposure in your codebase"
        },
        {
          "id": "https://github.blog/?p=61878",
          "author": "Alvaro Munoz",
          "description": "Defining your security requirements is the most important proactive control you can implement for your project. Here's how.",
          "link": "https://github.blog/2021-12-14-how-to-define-security-requirements-for-your-oss-project/",
          "publishedOn": "2021-12-14T17:11:00.000Z",
          "wordCount": 1781,
          "title": "How to define security requirements for your OSS project"
        },
        {
          "id": "https://github.blog/?p=61926",
          "author": "Jill Moné-Corallo",
          "description": "On Thursday, December 9, 2021, GitHub was made aware of a vulnerability in the Log4j logging framework, CVE-2021-44228.",
          "link": "https://github.blog/2021-12-13-githubs-response-to-log4j-vulnerability-cve-2021-44228/",
          "publishedOn": "2021-12-13T19:06:34.000Z",
          "wordCount": 532,
          "title": "GitHub’s response to Log4j vulnerability CVE-2021-44228"
        },
        {
          "id": "https://github.blog/?p=61901",
          "author": "Sidi Merzouk",
          "description": "We shipped a ton of updates in November, from the push notification for PR review activities on the go, to an easy way to create Markdown links.",
          "link": "https://github.blog/2021-12-13-whats-new-from-github-changelog-november-2021-recap/",
          "publishedOn": "2021-12-13T17:45:31.000Z",
          "wordCount": 1610,
          "title": "What’s new from GitHub Changelog? November 2021 recap"
        },
        {
          "id": "https://github.blog/?p=61873",
          "author": "Peter Cihon",
          "description": "Last week, GitHub joined the Internet Governance Forum to spread awareness of developers’ initiatives and public policy interests.",
          "link": "https://github.blog/2021-12-13-github-at-the-un-internet-governance-forum/",
          "publishedOn": "2021-12-13T17:01:07.000Z",
          "wordCount": 1347,
          "title": "GitHub at the UN Internet Governance Forum"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": []
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/vulnerability-management/log4shell-attack-evolution",
          "author": "HackerOne",
          "description": "HackerOne has unique visibility into the global response to Log4Shell, seeing in real time how organizations responded and remediated. Last week HackerOne’s CISO Chris Evans and Co-founder Jobert Abma shared findings from our platform.",
          "link": "https://www.hackerone.com/vulnerability-management/log4shell-attack-evolution",
          "publishedOn": "2022-01-06T23:52:54.000Z",
          "wordCount": 1185,
          "title": "Log4Shell: Attack Evolution"
        },
        {
          "id": "https://hackerone.com/hacker-powered-security-report/top-5-takeaways-2021-hacker-powered-security-report-industry",
          "author": "vincent@hackerone.com",
          "description": "For the fifth year in a row, HackerOne published a report that provides insights from the world’s largest database of vulnerabilities and bug bounty customer programs. Here are the top five findings:",
          "link": "https://www.hackerone.com/hacker-powered-security-report/top-5-takeaways-2021-hacker-powered-security-report-industry",
          "publishedOn": "2021-12-21T17:50:00.000Z",
          "wordCount": 894,
          "title": "Top 5 Takeaways from the 2021 Hacker-Powered Security Report: Industry Insights"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/cwe-common-weakness-enumeration-why-it-important",
          "author": "vincent@hackerone.com",
          "description": "Are you wondering about CWE? We explain CWE (Common Weakness Enumeration) and why this community-based initiative is essential in cybersecurity",
          "link": "https://www.hackerone.com/vulnerability-management/cwe-common-weakness-enumeration-why-it-important",
          "publishedOn": "2021-12-16T17:50:00.000Z",
          "wordCount": 1520,
          "title": "CWE [Common Weakness Enumeration] | Why It Is Important"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/log4j-vulnerability-activity-hackerone-platform",
          "author": "HackerOne",
          "description": "This post is about the severe and widespread Log4j vulnerability. It gives a technical overview of the vulnerability, mitigations HackerOne has put in place to protect our platform and customers, and the related vulnerability submission activity HackerOne is seeing on its platform.",
          "link": "https://www.hackerone.com/vulnerability-management/log4j-vulnerability-activity-hackerone-platform",
          "publishedOn": "2021-12-13T19:50:00.000Z",
          "wordCount": 1013,
          "title": "Log4j Vulnerability Activity on the HackerOne Platform"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}