{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/07/dns-over-http3-in-android.html",
          "author": null,
          "description": "Posted by Matthew Maurer and Mike Yu, Android team\n   To help keep Android users’ DNS queries private, Android supports encrypted   DNS. In addition to existing support for DNS-over-TLS, Android now supports   DNS-over-HTTP/3 which has a number of improvements over DNS-over-TLS. \n  Most network connections begin with a DNS lookup. While transport security may   be applied to the connection itself, that DNS lookup has traditionally not   been private by default: the base DNS protocol is raw UDP with no encryption.   While the internet has migrated to TLS over time, DNS has a bootstrapping   problem. Certificate verification relies on the domain of the other party,   which requires either DNS itself, or moves the problem to DHCP (which may be   maliciously controlled). This issue is mitigate…",
          "link": "http://security.googleblog.com/2022/07/dns-over-http3-in-android.html",
          "publishedOn": "2022-07-19T16:59:00.001Z",
          "wordCount": 1596,
          "title": "DNS-over-HTTP/3 in Android"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/14/1699",
          "author": null,
          "description": "Our today’s guest spent 4 days building a feature for his side project so that we could ship it together on Ship It!, while recording. The feature is called rave mode, and the context is Bass, an interpreted functional scripting language written in Go, riffing on the ideas of Kernel & Clojure. When the local build runs, you can now press r to synchronise the beats of your currently playing Spotify track with the build output. For a demo, see bass v0.9.0 release.\nPlease welcome Alex Suraci, a.k.a. vito, the creator of Concourse CI and Bass.\nThis episode is dedicated to the late John Shutt, the creator of Kernel.\nYour ideas continue in Bass.\nThank you for getting them out into the world.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads di…",
          "link": "https://changelog.com/shipit/64",
          "publishedOn": "2022-08-04T17:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 64: Bass: the beat drop after Concourse",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/64/ship-it-64.mp3",
            "length": "88344525",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1690",
          "author": null,
          "description": "Our award winning worthy survey game show is back, this time Mat Ryer hosts it live on stage at GopherCon Europe 2022!\nGo Time’s Natalie Pistunovich joins forces with Ronna Steinberg & Robert Burke to battle it out  with V Körbes, Tamir Bahar & Konrad Richie. Let’s see who can better guess what the GopherCon Europe gophers had to say!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nNatalie Pistunovich – Twitter, GitHub\nRonna Steinberg – Twitter, GitHub\nRobert Burke – Twitter, GitHub, Website\nV Körbes – Twitter, GitHub, Website\nTamir Bahar – Twitter, GitHub\nKonrad Reiche – Twitter, GitHub, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nDonate to GoBridge\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/241",
          "publishedOn": "2022-08-04T16:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 241: Gophers Say! GopherCon EU Edition",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/241/go-time-241.mp3",
            "length": "39514622",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/RdEP",
          "author": "Jerod Santo",
          "description": "This is an attempt to build a locally hosted version of GitHub Copilot. It uses the SalesForce CodeGen models inside of NVIDIA’s Triton Inference Server with the FasterTransformer backend.\nOnce you get it all set up, you can point VS Code’s Copilot plugin at it!\nDiscuss on Changelog News",
          "link": "https://github.com/moyix/fauxpilot",
          "publishedOn": "2022-08-04T15:19:00.000Z",
          "wordCount": null,
          "title": "FauxPilot – an open source GitHub Copilot server",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1PO",
          "author": "Dylan Paulus",
          "description": "Don’t stress, we all break production. These are the tips I wished I had. Not which framework to learn, or how to ace that programming interview (all useful!), but what to expect when you land your first software job.\nDiscuss on Changelog News",
          "link": "https://www.dylanpaulus.com/tips-for-new-software-engineers/",
          "publishedOn": "2022-08-04T14:31:00.000Z",
          "wordCount": null,
          "title": "Advice for new software engineers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3LzN",
          "author": "Jerod Santo",
          "description": "Suraj Pillai, singing fzf’s praises:\nI’m a CLI junkie, addicted to Vim motions, and never miss an opportunity to bring those two in to any part of my workflow. Naturally, I love to geek out about command line utilities and am always on the lookout for the next tool that can improve my productivity or just make CLI more fun to use. I can confidently say that Fzf is one of the handful of tools I’ve discovered over the years that has done both and has,thus, significantly improved the quality of my command line life.\nDiscuss on Changelog News",
          "link": "https://medium.com/@Suraj_Pillai/fzf-the-tool-that-will-transform-your-cli-life-91148d54de6",
          "publishedOn": "2022-08-04T13:45:00.000Z",
          "wordCount": null,
          "title": "Fzf: a tool that will transform your CLI life",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WX6",
          "author": "Jerod Santo",
          "description": "I have to admit, I enjoy making fun of PHP. Mostly because the language itself is a fractal of bad design. But I (try to) do it with love, because language design is just one part of what makes a programming environment good. This post is a nice reminder of the many reasons why PHP and JavaScript are awesome.\nOver the last twenty years, I have used over a dozen languages professionally, from C to Common Lisp, from Java to Python, from C++ to Typescript.\nYet, I love janky programming languages. In particular, I really enjoy PHP and JavaScript.\nHere’s why.\nI particularly agree with the point at the end about legacy codebases, many of which are powered by PHP and JS:\nA legacy codebase means that the product is performing well. It means that I can often make immediate and impactful improvements.\nFor me, nothing comes close to the pleasure of improving a product with many users.\nDiscuss on Changelog News",
          "link": "https://the.scapegoat.dev/why-i-love-php-and-javascript/",
          "publishedOn": "2022-08-03T14:29:00.000Z",
          "wordCount": null,
          "title": "Why I still love PHP and JavaScript after 20+ years",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1Yp",
          "author": "Jerod Santo",
          "description": "A lot of ink is spent on the “monoliths vs. microservices” debate, but the real issue behind this debate is about whether distributed system architecture is worth the developer time and cost overheads. By thinking about the real operational considerations of our systems, we can get some insight into whether we actually need distributed systems for most things.\nScaling up has always been easier than scaling out. It’s amazing what one beefy server can do these days…\nDiscuss on Changelog News",
          "link": "https://specbranch.com/posts/one-big-server/",
          "publishedOn": "2022-08-03T13:38:00.000Z",
          "wordCount": null,
          "title": "Use one big server",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1792",
          "author": null,
          "description": "Every year Mozilla releases an Internet Health Report that combines research and stories exploring what it means for the internet to be healthy. This year’s report is focused on AI. In this episode, Solana and Bridget from Mozilla join us to discuss the power dynamics of AI and the current state of AI worldwide. They highlight concerning trends in the application of this transformational technology along with positive signs of change.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nSolana Larsen – Twitter, LinkedIn\nBridget Todd – Twitter\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nThe Internet Health Report 2022\nFacts of the AI Power Imbalance\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/187",
          "publishedOn": "2022-08-02T20:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 187: AI IRL & Mozilla's Internet Health Report",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/187/practical-ai-187.mp3",
            "length": "41594533",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Jgnq",
          "author": "Jerod Santo",
          "description": "This library is the spiritual successor to the one we covered late last year, now with generics.\n\nDiscuss on Changelog News",
          "link": "https://github.com/bokwoon95/sq",
          "publishedOn": "2022-08-02T15:18:00.000Z",
          "wordCount": null,
          "title": "A type-safe struct mapper and query builder for Go (using generics)",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JgGp",
          "author": "Feross Aboukhadijeh",
          "description": "Tabler is fully responsive and compatible with all modern browsers. Thanks to its modern, user-friendly design you can create a fully functional interface that users will love! Choose the layouts and components you need and customize them to make your design consistent and eye-catching. Every component has been created with attention to detail to make your interface beautiful!\nLooks great!\nDiscuss on Changelog News",
          "link": "https://github.com/tabler/tabler",
          "publishedOn": "2022-08-02T14:27:00.000Z",
          "wordCount": null,
          "title": "Tabler is a free and open source HTML dashboard UI kit built on Bootstrap",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqQ8",
          "author": "Jerod Santo",
          "description": "What’s this? Basically:\nA Raspberry Pi CM4\nWiFi, 8GB RAM\nUp to 16TB of SSD Storage\nAn App Store, backups, remote access, and much more\nBatch 1 is shipping now, but they’re taking pre-orders for batch 2, which ships in October. Starts at $159 and goes up from there.\n\nDiscuss on Changelog News",
          "link": "https://pibox.io/",
          "publishedOn": "2022-08-02T13:40:00.000Z",
          "wordCount": null,
          "title": "PiBox is your tiny personal server for self-hosting",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW6n",
          "author": "Jerod Santo",
          "description": "Greg Kogan:\nI used to think being swamped was a good sign. I’m doing stuff! I’m making progress! I’m important! I have an excuse to make others wait! Then I realized being swamped just means I’m stuck in the default state, like a ball that settled to a stop in the deepest part of an empty pool, the spot where rainwater has collected into a puddle.\nGood analogy. Better sentiment. Reminds me of Woody Zuill’s thoughtson productivity vs effectiveness.\nDiscuss on Changelog News",
          "link": "https://www.gkogan.co/blog/swamped/",
          "publishedOn": "2022-08-01T20:37:00.000Z",
          "wordCount": null,
          "title": "Being swamped is normal and not impressive",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1791",
          "author": null,
          "description": "Oleksii Trekhleb has a new drawing app, Zach Leatherman did some markdown generator speed tests, Jorge Fioranelli built a framework for Engineering Managers, Crockford got interviewed on Evrone & Daniel Sieger wrote up his clean coding advice.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly\nFounders Talk #93\nOk! So…\nWhich generator builds markdown the fastest?\nA framework for Engineering Managers\nDouglas Crockford interview with Evrone\nYour code doesn’t have to be a mess\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-01",
          "publishedOn": "2022-08-01T19:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: OkSo, Markdown generator speeds, Egr Mgr framework, Crockford says retire JS & messy code not required",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-01/the-changelog-news-2022-08-01.mp3",
            "length": "6838364",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ZoPl",
          "author": "Gerhard Lazu",
          "description": "Remember The Changelog #481 - Making the command line glamorous?\nYou can now make your shell scripts glamorous too. No Go required, just pure shell.\n\nDiscuss on Changelog News",
          "link": "https://github.com/charmbracelet/gum",
          "publishedOn": "2022-08-01T15:25:00.000Z",
          "wordCount": null,
          "title": "A tool for glamorous shell scripts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/49Q7",
          "author": "Jerod Santo",
          "description": "Million makes creating user interfaces as easy as React, but with faster performance and smaller bundle size for the end user. By computing the user interface beforehand with a compiler, Million reduces the overhead of traditional Virtual DOM.\nOkay cool… but why should I use Million if I can just use Preact if I need something a bit more lightweight?\nWhile alternative libraries like Preact reduce bundle sizes by efficient code design, Million takes it a step further by leveraging compilation to make a quantum leap in improving bundle size and render speed.\nWatch the video or get started with the docs.\nDiscuss on Changelog News",
          "link": "https://github.com/aidenybai/million",
          "publishedOn": "2022-08-01T14:33:00.000Z",
          "wordCount": null,
          "title": "What if React's API and Svelte's compiler had a baby",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1751",
          "author": null,
          "description": "This week we’re joined again by Ben Ubois and we’re talking about RSS. Yes, RSS…the tech that never seems to die and yet so many of us rely on it daily. Ben is the creator of Feedbin, which is self-described as “a nice place to read on the web.” Ben is also the maker of a new app on iOS for people who like podcasts. It’s called Airshow and you can download it at airshow.fm. Ben catches us up on the state of Feedbin, we discuss the nine lives of RSS and its foundational utility for the indie web, the possibilities and short-comings of RSS, we get deep in the weeds on the Podcast 2.0 spec and the work being done on <podcast:chapters>, and Ben also shares the details on his new app called Airshow.\nDiscuss on Changelog News\nChangelog++ members get a bonus 20 minutes at the end of this episode …",
          "link": "https://changelog.com/podcast/499",
          "publishedOn": "2022-07-29T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 499: Long live RSS!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/499/the-changelog-499.mp3",
            "length": "98660309",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1702",
          "author": null,
          "description": "KBall and Juri dive deep into monorepos, their benefits and gotchas, and how Nx helps you improve the performance and maintainability of a monorepo setup.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nHasura – Create dynamic high-performance GraphQL & REST APIs from your database(s) in minutes with granular authorization and caching baked in. All without touching your underlying database. Go from data to API in minutes. Get started for free at hasura.io/jsparty\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nJuri Strumpflohner – Twitter, GitHub, LinkedIn\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nNX\nNX Github\nMonorepo.tools\nESLint and TypeScript\nTaming Code Organization with Module Boundaries in Nx\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/236",
          "publishedOn": "2022-07-29T17:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 236: The magic of monorepos",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/236/js-party-236.mp3",
            "length": "57862408",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/PpNm",
          "author": "Jerod Santo",
          "description": "Ok! So… there’s a cool new drawing app from Oleksii Trekhleb. “Draw to explain. Draw to grasp.” Check the demo video or just give it a try and see what you can dream up!\n\nDiscuss on Changelog News",
          "link": "https://okso.app",
          "publishedOn": "2022-07-29T16:06:00.000Z",
          "wordCount": null,
          "title": "A drawing app to express, grasp, and organize your thoughts and ideas",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Rd9r",
          "author": "Martin Heinz",
          "description": "With every Python release, there are new modules being added and new and better ways of doing things get introduced. We all get used to using the good old Python libraries, but it’s time say goodbye to os.path, random, pytz, namedtuple and many more obsolete Python libraries and start using the latest and greatest ones instead.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/77",
          "publishedOn": "2022-07-29T15:15:00.000Z",
          "wordCount": null,
          "title": "It's time to say goodbye to these obsolete Python libraries",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2lYZ",
          "author": "Jamie Tanna",
          "description": "How using OpenAPI (previously called Swagger) has led to being able to ship a new service more effectively, by removing the need to write scaffolding, and instead focus on the business logic.\nDiscuss on Changelog News",
          "link": "https://deliveroo.engineering/2022/06/27/openapi-design-first.html",
          "publishedOn": "2022-07-29T14:23:00.000Z",
          "wordCount": null,
          "title": "Shipping services more quickly with design-first OpenAPI contracts",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8lZM",
          "author": "Jerod Santo",
          "description": "This framework allows software engineering managers to have meaningful conversations with their direct reports around the expectations of each position and how to plan for the next level in their career ladder.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jorgef/engineeringladders",
          "publishedOn": "2022-07-29T13:37:00.000Z",
          "wordCount": null,
          "title": "A framework for Engineering Managers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njAg",
          "author": "Jerod Santo",
          "description": "Partytown is a lazy-loaded library to help relocate resource intensive scripts into a web worker, and off of the main thread. Its goal is to help speed up sites by dedicating the main thread to your code, and offloading third-party scripts to a web worker.\nEven with a fast and highly tuned website following all of today’s best practices, it’s all too common for your performance wins to be erased the moment third-party scripts are added. By third-party scripts we mean code that is embedded within your site, but not directly under your control. A few examples include: analytics, metrics, ads, A/B testing, trackers, etc.\nI learned of this library during our fascinating discussion with Miško Hevery on (next week’s) JS Party.\nDiscuss on Changelog News",
          "link": "https://partytown.builder.io/",
          "publishedOn": "2022-07-28T19:49:00.000Z",
          "wordCount": null,
          "title": "Partytown runs 3rd-party scripts from a web worker",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1713",
          "author": null,
          "description": "Go 1.18 was a major release where we saw the introduction of generics into the language as well as other notables such as fuzzing and workspaces. With Go 1.19 slated to come out next month, one has to wonder what’s next. Are we in store to be blown away by new and major features like we saw in 1.18? Not exactly but there are still lots of improvements to be on the lookout for.\nJoining Mat & Johnny to touch on some of the most interesting ones is Carl Johnson, himself a contributor to the 1.19 release.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights —…",
          "link": "https://changelog.com/gotime/240",
          "publishedOn": "2022-07-28T18:35:38.000Z",
          "wordCount": null,
          "title": "Go Time 240: What's new in Go 1.19",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/240/go-time-240.mp3",
            "length": "71014858",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ojOO",
          "author": "Jerod Santo",
          "description": "Do you ever send the output of a process to /dev/null and regret it, but can’t afford to stop and restart the process? catp is here for you!\n\nDiscuss on Changelog News",
          "link": "https://github.com/rapiz1/catp",
          "publishedOn": "2022-07-28T16:04:00.000Z",
          "wordCount": null,
          "title": "`catp` prints the output of a running process",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mb12",
          "author": "Jerod Santo",
          "description": "chiark is my “colo” - a server I run, which lives in a data centre in London. It hosts ~200 users with shell accounts, various websites and mailing lists, moderators for a number of USENET newsgroups, and countless other services…\nchiark’s last major OS upgrade was to jessie (Debian 8, released in April 2015). That was in 2016.\nA harrowing tale of planning and peril. Surprisingly, it went quite well!\nDiscuss on Changelog News",
          "link": "https://diziet.dreamwidth.org/11840.html",
          "publishedOn": "2022-07-28T15:17:00.000Z",
          "wordCount": null,
          "title": "Upgrading from Debian Jessie i386 to Bullseye amd64 after ~30 years",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1681",
          "author": null,
          "description": "We know that many of you listen to this podcast while running 🏃‍♀️ or cycling 🚴‍♂️ Hey Dan!\nHow many of you cycled to a conference? Gerhard knows a single person that cycled 764 miles for 8 days straight from Switzerland to Spain for this year’s KubeCon EU. His name is Johann Gyger, a CNCF ambassador & a cloud consultant at Peak Scale. Johann is a cloud engineer at heart that is all in on sustainability. He is the main reason why Gerhard is super excited to talk about electric cars & Dagger at the Swiss Cloud Native Day this September.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance m…",
          "link": "https://changelog.com/shipit/63",
          "publishedOn": "2022-07-27T21:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 63: KubeVelo 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/63/ship-it-63.mp3",
            "length": "72201048",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/49Ep",
          "author": "Jerod Santo",
          "description": "Reading other people’s code is a sure-fire way to improve as a developer. But what about as a database designer? The same process applies!\nThis post by Shekhar Gulati is him sharing what he learned by applying that principle to GitLab’s schema.\nI learnt a lot from the GitLab schema. They don’t blindly apply the same practices to all the table designs. Each table makes the best decision based on its purpose, the kind of data it stores, and its rate of growth.\nMore posts like this, please!\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/07/08/my-notes-on-gitlabs-postgres-schema-design/",
          "publishedOn": "2022-07-27T15:26:00.000Z",
          "wordCount": null,
          "title": "My notes on GitLab’s Postgres schema design",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7gG",
          "author": "Jerod Santo",
          "description": "Sean Moriarity:\nA common argument against using Nx for a new machine learning project is its perceived lack of a library/support for some common task that is available in Python. In this post, I’ll do my best to highlight areas where this is not the case, and compare and contrast Elixir projects with their Python equivalents. Additionally, I’ll discuss areas where the Elixir ecosystem still comes up short, and using Nx for a new project might not be the best idea.\nSean is a prominent member of the Elixir community, so that’s the perspective on display here, but it’s a thorough and well-reasoned comparison. He concludes:\nWhile there are still many gaps in the Elixir ecosystem, the progress over the last year has been rapid. Almost every library I’ve mentioned in this post is less than two years old, and I suspect there will be many more projects to fill some of the gaps I’ve mentioned in the coming months.\nDiscuss on Changelog News",
          "link": "https://dockyard.com/blog/2022/07/12/elixir-versus-python-for-data-science",
          "publishedOn": "2022-07-27T14:18:00.000Z",
          "wordCount": null,
          "title": "Elixir versus Python for data science",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgnp",
          "author": "Jerod Santo",
          "description": "Ben Johnson is at it again.\nLiteFS is a FUSE-based file system for replicating SQLite databases across a cluster of machines. It works as a passthrough file system that intercepts writes to SQLite databases in order to detect transaction boundaries and record changes on a per-transction level in LTX files.\nI believe Ben was alluding to this (then unreleased) tool on his recent Ship It! appearance…\nDiscuss on Changelog News",
          "link": "https://github.com/superfly/litefs",
          "publishedOn": "2022-07-26T20:56:00.000Z",
          "wordCount": null,
          "title": "A distributed SQLite replication system",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1753",
          "author": null,
          "description": "In this Fully-Connected episode, Chris and Daniel explore the geopolitics, economics, and power-brokering of artificial intelligence.  What does control of AI mean for nations, corporations, and universities?  What does control or access to AI mean for conflict and autonomy?  The world is changing rapidly, and the rate of change is accelerating.  Daniel and Chris look behind the curtain in the halls of power.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nSource articles for our conversation\nThe Geopolitics Of Artificial Intelligence\nGeopolitical implications of AI and digital surveillance adoption\nArtificial intelligence is already upending geopolitics\nHuge “foundation models” are turbo-charging AI progress\nLearning Resource\nNational Artificial Intelligence Initiative\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/186",
          "publishedOn": "2022-07-26T20:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 186: The geopolitics of artificial intelligence",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/186/practical-ai-186.mp3",
            "length": "44955916",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zDbk",
          "author": "Jerod Santo",
          "description": "John Goerzen built a computer for his 3yo, installed Debian on it, and set up a GUI for it.\nThe looks of shock I get from people when I explain, as if it’s perfectly natural, that my child has been able to log in by himself to a Linux shell since age 3, are amusing and astounding. Especially considering that it is really not that hard.\nIt’s not that hard, but it is so foreign to people that they’re quickly impressed by such things. Still, John decided to introduce his kids to a GUI eventually:\nJacob mastered the basics of xmonad really quickly. Alt-Shift-C to close a window. Alt-Shift-Q to quit back to the “big black screen”. Alt-Shift-Enter to get a terminal window.\nWe launched thunar (the XFCE file manager) and plugged in his camera. He had a good deal of fun looking at photos and videos from it. But then I dropped the true highlight of the day for him: I offered to install Tuxpaint for him. That’s probably his favorite program of all time.\nTux Paint!\nDiscuss on Changelog News",
          "link": "https://lifehacker.com/i-raised-my-kids-on-the-command-line-and-they-love-it-5974087",
          "publishedOn": "2022-07-26T19:44:00.000Z",
          "wordCount": null,
          "title": "I raised my kids on the command line... and they love it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8l2M",
          "author": "Jerod Santo",
          "description": "Daniel Sieger:\nIf you’ve been developing software for a while, you know that code has this natural tendency to turn into a mess. Keeping software simple over time is a challenge that keeps me thinking. My last post left you hanging without much concrete advice. This time I will outline a few high-level strategies to keep software simple.\nDiscuss on Changelog News",
          "link": "https://www.danielsieger.com/blog/2022/07/25/your-code-doesnt-have-to-be-a-mess.html",
          "publishedOn": "2022-07-26T18:45:00.000Z",
          "wordCount": null,
          "title": "Your code doesn't have to be a mess",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1755",
          "author": null,
          "description": "Brandur thinks soft deletion probably isn’t worth it, the orange website delivers a high quality discussion on data structures, Podge O’Brien drops satirical management advice, team pico delivers prose.sh, Mat Ryer shares his thoughts on estimations & Matt Rickard’s thoughts on RSS have us thinking about it as well.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSoft Deletion Probably Isn’t Worth It\nAsk HN: What are some cool but obscure data structures you know about?\nHow to drive away your best engineers\nGo Time #236: Thoughts on velocity\nprose.sh\nThoughts on RSS\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-07-25",
          "publishedOn": "2022-07-25T18:25:00.000Z",
          "wordCount": null,
          "title": "The Changelog Soft deletion, obscure data structures, driving away your best engineers, a blog platform for hackers & moar RSS",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-07-25/the-changelog-news-2022-07-25.mp3",
            "length": "6493581",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/qMww",
          "author": "Jerod Santo",
          "description": "Ben Congdon explains why he’s enthusiastic about stacked PRs (and how they differ from stacked commits). We discussed many of these benefits in our conversation with the Graphite guys, but that’s just one way of going about the practice. Ben also lists out a few helpers tools for going about it.\nDiscuss on Changelog News",
          "link": "https://benjamincongdon.me/blog/2022/07/17/In-Praise-of-Stacked-PRs/",
          "publishedOn": "2022-07-25T15:34:00.000Z",
          "wordCount": null,
          "title": "In praise of stacked PRs",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1688",
          "author": null,
          "description": "This week we’re joined by On Freund, former VP of Engineering at WeWork and now co-founder & CEO of Wilco. WeWork you may have heard of, but Wilco maybe not (yet).\nWe get into the details behind the tech and scaling of WeWork, comparisons of the fictional series on Apple TV+ called WeCrashed and how much of that is true. Then we move on to Wilco which is what has On’s full attention right now. Wilco has the potential to be the next big thing for developers to acquire new skills. Wilco aims to be the ultimate simulator to gain new skills on a real-life tech stack. If you want to skip ahead, you can request access at trywilco.com/changelog — they are moving our listeners to the top of the waiting list.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they …",
          "link": "https://changelog.com/podcast/498",
          "publishedOn": "2022-07-24T03:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 498: From WeWork to upskilling at Wilco",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/498/the-changelog-498.mp3",
            "length": "85257002",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1677",
          "author": null,
          "description": "What’s this? A Frontend Feud! The ShopTalk guys return to defend their championship over Syntax against new contenders: Una and Adam from The CSS Podcast!\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nFeaturing\nChris Coyier – Twitter, GitHub, Website\nDave Rupert – Twitter, GitHub, Website\nUna Kravets – Twitter, GitHub, Website\nAdam Argyle – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nNick Nisi – Twitter, GitHub, Website\nNotes and Links\nWatch the video on our YouTube channel\nShout out to Una’s Twitter!\nShout out to OneWheel!\nShout out to ShopTalk Show!\nShout out to The CSS Podcast!\nShout out to JS Party?\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/235",
          "publishedOn": "2022-07-22T16:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 235: Frontend Feud: ShopTalk vs CSS Podcast",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/235/js-party-235.mp3",
            "length": "56685963",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/N1LO",
          "author": "Jerod Santo",
          "description": "This looks very opinionated with the tech it chooses (Node, Express, MongoDB, React, TypeScript). But if you like those choices, that probably means you’ll like what they’ve cooked up.\nPayload gives you everything you need, but then steps back and lets you build what you want in JavaScript or TypeScript - with no unnecessary complexity brought by GUIs. You’ll understand how your CMS works because you will have written it exactly how you want it.\nBring your own Express server and do whatever you need on top of Payload. Payload doesn’t impose anything on you or your app.\nCompletely control the Admin panel by using your own React components. Swap out fields or even entire views with ease.\nUse your data however and wherever you need thanks to auto-generated, yet fully extensible REST, GraphQL, and Local Node APIs.\nDiscuss on Changelog News",
          "link": "https://github.com/payloadcms/payload",
          "publishedOn": "2022-07-22T13:45:00.000Z",
          "wordCount": null,
          "title": "A headless, code-first CMS built with TypeScript",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/nj0G",
          "author": "Jerod Santo",
          "description": "User Uptrenda asked HN about their favorite data structures, sharing their own to get it started:\nI’ll start: bloom filters. Lets you test if a value is definitely NOT in a list of pre-stored values (or POSSIBLY in a list - with adjustable probability that influences storage of the values.)\nGood use-case: routing. Say you have a list of 1 million IPs that are black listed. A trivial algorithm would be to compare every element of the set with a given IP. The time complexity grows with the number of elements. Not so with a bloom filter! A bloom filter is one of the few data structures whose time complexity does not grow with the number of elements due to the ‘keys’ not needing to be stored (‘search’ and ‘insert’ is based on the number of hash functions.)\nThe responses are numerous with a lot of signal, which is increasingly rare on the orange website these days. Worth a read!\nDiscuss on Changelog News",
          "link": "https://news.ycombinator.com/item?id=32186203",
          "publishedOn": "2022-07-22T12:57:00.000Z",
          "wordCount": null,
          "title": "A thread of cool but obscure data structures",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1718",
          "author": null,
          "description": "How do beginners learn Go? This episode is meant to engage both non-Go users that listen to sister podcasts here on Changelog, or any Go-curious programmers out there, as well as encourage those that have started to learn Go and want to level up beyond the basics. On this episode we’re aiming to answer questions about how to learn Go, identify resources that are available, and where you can go to continue your learning journey.\nDiscuss on Changelog News\nChangelog++ members save 8 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebas…",
          "link": "https://changelog.com/gotime/239",
          "publishedOn": "2022-07-21T14:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 239: Go for beginners ♻️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/239/go-time-239.mp3",
            "length": "62195364",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1683",
          "author": null,
          "description": "Gerhard’s transition to a senior engineer started 10 years ago, when he embraced the vim mindset, functional core & imperative shell, and was inspired to seek simplicity in his code & infrastructure. Most of it can be traced back to one person: Gary Bernhardt, the creator of Execute Program, Destroy all Software and the now famous Wat idea.\nFew stick around long enough to understand the long-term impact of their decisions on production systems. Even fewer are able to talk about them as well as Gary does.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the …",
          "link": "https://changelog.com/shipit/62",
          "publishedOn": "2022-07-20T16:35:00.000Z",
          "wordCount": null,
          "title": "Ship It! 62: Operational simplicity is a gift to you",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/62/ship-it-62.mp3",
            "length": "56043050",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/eEQn",
          "author": "Jerod Santo",
          "description": "This article confirms my biases because I’ve always despised every soft delete implementation I’ve come up with. Most of them have looked something like what the author describes:\nthe technique has some major downsides. The first is that soft deletion logic bleeds out into all parts of your code. All our selects look something like this:\nSELECT *\nFROM customer\nWHERE id = @id\n    AND deleted_at IS NULL;\n\nAnd forgetting that extra predicate on deleted_at can have dangerous consequences as it accidentally returns data that’s no longer meant to be seen.\nORMs help with this, but not enough. You set it as a default scope and then there’s that one time where you also want the deleted records so you come up with a custom query or dig into your ORM and try to find how to bypass the rule. Yuck!\nHe goes on to describe other problems as well. Maybe it’s all a big case of YAGNI?\nOnce again, soft deletion is theoretically a hedge against accidental data loss. As a last argument against it, I’d ask you to consider, realistically, whether undeletion is something that’s ever actually done.\nWhen I worked at Heroku, we used soft deletion.\nWhen I worked at Stripe, we used soft deletion.\nAt my job right now, we use soft deletion.\nAs far as I’m aware, never once, in ten plus years, did anyone at any of these places ever actually use soft deletion to undelete something.\nDiscuss on Changelog News",
          "link": "https://brandur.org/soft-deletion",
          "publishedOn": "2022-07-20T14:24:00.000Z",
          "wordCount": null,
          "title": "Soft deletion probably isn't worth it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7YOd",
          "author": "Jerod Santo",
          "description": "Like the data-centric sibling of your favorite programming environment. It provides an easy-to-use interface for weak supervision as well as extensive data management, neural search and monitoring to ensure that the quality of your training data is as good as possible.\nThis won’t rid you of the need to manually label, but it’ll save you time in the process!\n\nDiscuss on Changelog News",
          "link": "https://github.com/code-kern-ai/refinery",
          "publishedOn": "2022-07-20T13:35:00.000Z",
          "wordCount": null,
          "title": "Kern AI's refinery is a data-centric IDE for NLP",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1716",
          "author": null,
          "description": "In this Fully-Connected episode, Daniel and Chris explore DALL-E 2, the amazing new model from Open AI that generates incredibly detailed novel images from text captions for a wide range of concepts expressible in natural language.  Along the way, they acknowledge that some folks in the larger AI community are suggesting that sophisticated models may be approaching sentience, but together they pour cold water on that notion.  But they can’t seem to get away from DALL-E’s images of raccoons in space, and of course, who would want to?\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDALL·E: Creating Images from Text\nHow DALL-E 2 Actually Works\nGoogle - Raccoons in Space!\nOn the Dangers of Stochastic Parrots: Can Language Models Be Too Big? 🦜\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/185",
          "publishedOn": "2022-07-19T20:10:00.000Z",
          "wordCount": null,
          "title": "Practical AI 185: DALL-E is one giant leap for raccoons! 🔭",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/185/practical-ai-185.mp3",
            "length": "39828109",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/4/1672",
          "author": null,
          "description": "This week Adam is taking the show off the beaten path to speak with Adam Miller, the founder and CEO of Revel Bikes. Yes that’s right, this episode features a founder of a bike brand, not a tech brand.\nAdam Miller’s journey to create Revel Bikes is paved with many ups and many downs, a failed partnership, super scrappy weeks and months traveling the world to find the best manufacturing partners, the latest innovations in suspension tech and modern geometry to hit the mountain biking scene, a strong team that’s been with him every step of the way (many of which are as close as family), and truly some of the best premium bikes available on the market today.\nBTW, Adam (host) is an owner of a Revel bike — he has a T1000 colorway Rascal that he’s ridden on downhill trails, all-day epics, and ev…",
          "link": "https://changelog.com/founderstalk/93",
          "publishedOn": "2022-07-19T20:00:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 93: Building the best mountain bikes in the world",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/93/founders-talk-93.mp3",
            "length": "102564894",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9llJ",
          "author": "Jerod Santo",
          "description": "Only 5% of Indie Hackers products make $100k/year…\nA sobering statistic, but with a caveat: this only accounts for the 937 products that have their revenue verified by Stripe. The 5% is low, but that’s for a high bar of $100k/year. It gets worse:\nA prevalent thinking is that making money as an indie developer is hard and most of the products end up with no revenue at all. Products on Indie Hackers seem to confirm this as more than 54% of the products are not making any revenue at all.\nThe post also breaks down the best performing product categories. ‘Wearables’ looks like a good one.\n(We love the Indie Hackers community and know how hard it is to make it on your own. This post is not intended to denigrate anyone, just provide information.)\nDiscuss on Changelog News",
          "link": "https://scrapingfish.com/blog/indie-hackers-revenue",
          "publishedOn": "2022-07-19T14:21:00.000Z",
          "wordCount": null,
          "title": "How much money do Indie Hackers products make?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Pppm",
          "author": "Adam Stacoviak",
          "description": "Matt Rickard, yes this Matt Rickard from episode #463 of The Changelog, shared some thoughts (an unordered list) about the forces acting on RSS.\nHe sets the stage by sharing a swath of think pieces written on the subject.\nNo technology other than RSS has had more think pieces written proclaiming the death of RSS (2006, 2009, 2010, 2012, 2013) and the rebirth of RSS (2009, 2010, 2011, 2018, 2018, 2019).\nHere are two points (of several shared) that stood out to me.\nSubstack has revitalized the blogging movement by giving away free hosting and email lists, and a business model for supporting writers. As email newsletters grow, RSS is a decent alternative to an increasingly cluttered email inbox.\nCreator incentives work against RSS. The protocol does not benefit content creators because it doesn’t give them any insight into their audience (number of subscribers, emails, or other data).\nWhat are your thoughts in his thoughts? What’s next for RSS?\nDiscuss on Changelog News",
          "link": "https://matt-rickard.com/thoughts-on-rss/",
          "publishedOn": "2022-07-18T19:29:35.000Z",
          "wordCount": null,
          "title": "Thoughts on RSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWW6",
          "author": "Jerod Santo",
          "description": "This isn’t the first attempt at making regular expressions more approachable, but it’s the first one I’ve seen that also brings type safety to the table. Example code:\nimport { createRegExp, exactly, oneOrMore, digit } from 'magic-regexp'\n\n// Quick-and-dirty semver\ncreateRegExp(\n  oneOrMore(digit)\n    .as('major')\n    .and('.')\n    .and(oneOrMore(digit).as('minor'))\n    .and(exactly('.').and(oneOrMore(char).as('patch')).optionally())\n)\n// /(?<major>(\\d)+)\\.(?<minor>(\\d)+)(\\.(?<patch>(.)+))?/\n\nDiscuss on Changelog News",
          "link": "https://github.com/danielroe/magic-regexp",
          "publishedOn": "2022-07-18T18:02:00.000Z",
          "wordCount": null,
          "title": "A compiled-away, type-safe, readable RegExp alternative",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1717",
          "author": null,
          "description": "Anthony Hobday has 37 ways to spice up your designs, James Bennett has opinions on open source and PyPi security, Alicia Sykes compiled some awesome security/privacy options, ContextKeeper layouts out the real price of context switching, and Nick Nisi tells us all about jqq. Bam! Bam! Bam!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog News\n37 Easy Ways to Spice Up Your UI Designs\nYes, I have opinions on your open source contributions\nawesome-privacy\nWhat’s the real cost of interruption and context switching?\njqq: an interactive wrapper around jq\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-07-18",
          "publishedOn": "2022-07-18T16:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog Spicy designs, more open source opinions, privacy-focused services, the real cost of context switching & jqq",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-07-18/the-changelog-news-2022-07-18.mp3",
            "length": "7088616",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Rddr",
          "author": "Jerod Santo",
          "description": "Testing distributed systems under hard failures like network partitions and instance termination is critical, but it’s also important we test them under less catastrophic conditions because this is what they most often experience. Comcast is a tool designed to simulate common network problems like latency, bandwidth restrictions, and dropped/reordered/corrupted packets.\nIt works by wrapping up some system tools in a portable(ish) way. On BSD-derived systems such as OSX, we use tools like ipfw and pfctl to inject failure. On Linux, we use iptables and tc. Comcast is merely a thin wrapper around these controls.\nTFW you come up with the perfect name for your open source project ✨\nDiscuss on Changelog News",
          "link": "https://github.com/tylertreat/comcast",
          "publishedOn": "2022-07-18T14:36:00.000Z",
          "wordCount": null,
          "title": "Comcast simulates trash network connections so you can build better systems",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1685",
          "author": null,
          "description": "This week we’re talking with Daniel Thompson about Tauri and their journey to their recent 1.0 release. Tauri is often compared to Electron - it’s a toolkit that lets you build software for all major desktop operating systems using web technologies. It was built for the security-focused, privacy-respecting, and environmentally-conscious software engineering community. The core libraries are written in Rust and the UI layer can be written using virtually any frontend framework. We get into all the details, why Rust, how the project was formed, their resistance (thus far) to venture capital, their full commitment to the freedom virtues of open source, and all the technical bits you need to know to consider it for your next multi-platform project.\nDiscuss on Changelog News\nChangelog++ members…",
          "link": "https://changelog.com/podcast/497",
          "publishedOn": "2022-07-15T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 497: Build tiny multi-platform apps with Tauri and web tech",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/497/the-changelog-497.mp3",
            "length": "93847913",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mllj",
          "author": "Jerod Santo",
          "description": "Scanners Box also known as scanbox, is a powerful hacker toolkit, which has collected more than 10 categories of open source scanners from Github, including subdomain, database, middleware and other modular design scanner etc. But for other Well-known scanning tools, such as nmap, w3af, brakeman, arachni, nikto, metasploit, aircrack-ng will not be included in the scope of collection.\nToolkit might be a bit misleading. I was imagning some kind of Docker container or Linux distro with all the tools baked in. This is more of a collection of tools (which is why we applied the Awesome topic to it) that you can pick and choose from. Nice collection, though!\nDiscuss on Changelog News",
          "link": "https://github.com/We5ter/Scanners-Box",
          "publishedOn": "2022-07-15T16:57:00.000Z",
          "wordCount": null,
          "title": "A powerful open source toolkit for hackers & security automation",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1696",
          "author": null,
          "description": "Deno team member Luca Casonato joins Jerod & Feross to tell us about Fresh – a next generation web framework, built for speed, reliability, and simplicity.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nLuca Casonato – Twitter, GitHub\nJerod Santo – Twitter, GitHub\nFeross Aboukhadijeh – Twitter, GitHub, Website\nNotes and Links\nFresh docs\nIslands Architecture\nDeno’s Discord\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/234",
          "publishedOn": "2022-07-15T16:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 234: Deno's Fresh new web framework",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/234/js-party-234.mp3",
            "length": "47421117",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/4/1715",
          "author": null,
          "description": "This week Adam is joined by Robert Ross founder and CEO of FireHydrant — the glue layer between your tech stack and your teams to mitigate and resolve incidents at scale.\nRobert shares his journey to become a software engineer, his time at DigitalOcean, this idea of incident management as a platform and how he shifted his focus from creating courses on incident management to recognizing the value of the software he was creating for the course to what is now known as FireHydrant. We also talk through his first experience in raising capital, what happens when the bar is raised on the reliability of the worlds software, and why their mantra is “Hire great people, who build, sell and market a great product, and you’ll have a great company.”\nDiscuss on Changelog News\nChangelog++ members save 9 …",
          "link": "https://changelog.com/founderstalk/92",
          "publishedOn": "2022-07-15T15:30:00.000Z",
          "wordCount": null,
          "title": "Founders Talk 92: Enabling a world where all software is reliable",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/founderstalk/92/founders-talk-92.mp3",
            "length": "103665491",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJJ9",
          "author": "Erik Kennedy",
          "description": "Ever been working on a design that feels too plain? Let’s look at a few dozen simple ways to spice things up. Get ready to bookmark this page, because you’ll want to reference this list in the future. It’s unbelievable how many incredible pro-level designs feature solid foundations plus a few techniques listed below.\nDiscuss on Changelog News",
          "link": "https://www.learnui.design/blog/spice-up-designs.html",
          "publishedOn": "2022-07-15T14:19:00.000Z",
          "wordCount": null,
          "title": "Easy ways to spice up your designs",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1667",
          "author": null,
          "description": "A conversation with Ronna Steinberg, who was an OOP developer for many years, and now is a Go Google Developer Expert. Ronna has been thinking about Go and OOP for awhile, asking herself whether or not Go is an object oriented programming language. Tune in to find out her answer and hear some of the options gophers have for object oriented design.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD and enterprise services to the cloud or on premise. They’re inviting our listeners to join the closed beta at akuity.io/changelog. The platform is a versatile Kubernetes operator for handling cluster deployments the GitOps way. Deploy your apps instantly and monitor their state — get minimum overhead, maximum impact, and enterprise readiness from day one.\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nFeaturing\nRonna Steinberg – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nIan Lopshire – Twitter, GitHub\nNotes and Links\nRonna’s GopherCon EU workshop\nRob Pike is critical of OOP\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/238",
          "publishedOn": "2022-07-14T20:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 238: Might Go actually be OOP?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/238/go-time-238.mp3",
            "length": "57698983",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lOOV",
          "author": "Adam Stacoviak",
          "description": "Matija Sosic (Co-founder & CEO at Wasp) shares what he thinks programming is going to look like in the near future.\nWhen thinking about how ML code generation affects the overall development process, there is one thing to consider that often doesn’t immediately spring to mind when looking at the impressive Copilot examples. The question is - what happens with the code once it is generated? Who is responsible for it and who will maintain and refactor it in the future?\nAlthough ML code generation helps with getting the initial code written, it cannot do much beyond that - if that code is to be maintained and changed in the future … the developer still needs to fully own and understand it.\nGenerated code accepted blindly is creating tech debt!\nIn other words, it means Copilot and similar solutions do not reduce the code complexity nor the amount of knowledge required to build features, they just help write the initial code faster, and bring the knowledge/examples closer to the code (which is really helpful). If a developer accepts the generated code blindly, they are just creating tech debt and pushing it forward.\nDiscuss on Changelog News",
          "link": "https://wasp-lang.dev/blog/2022/06/24/ML-code-gen-vs-coding-by-hand-future",
          "publishedOn": "2022-07-14T19:19:01.000Z",
          "wordCount": null,
          "title": "ML code generation vs coding by hand",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/044e",
          "author": "Jerod Santo",
          "description": "Tom Wright:\nThis year marks 15 years since FizzBuzz was popularised as an interview tool for developers. I’m a big fan and have watched over 100 candidates try their hand at my version of the task. In today’s blog post I’d like to take a moment to celebrate what makes FizzBuzz so helpful, discuss some common patterns I’ve observed in the many attempts I’ve witnessed, and finally explore some tweaks that can be deployed to keep the challenge fresh.\nTom’s version of FizzBuzz is a pair programming task that follows strict TDD:\nIn proper pair programming style, the candidate is encouraged to discuss their approach with the interviewer. Likewise, they are free to use any online reference materials if they forget a method name or some syntax.\nIn this post he shares 3 common variants of the challenge including one that requires a pair of Azure Functions?!\nDiscuss on Changelog News",
          "link": "https://blog.tdwright.co.uk/2022/07/14/fizzbuzz-is-fizzbuzz-years-old-and-still-a-powerful-tool/",
          "publishedOn": "2022-07-14T17:41:00.000Z",
          "wordCount": null,
          "title": "FizzBuzz is FizzBuzz years old",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pjjy",
          "author": "Jerod Santo",
          "description": "Large data-hungry corporations dominate the digital world but with little, or no respect for your privacy. Migrating to open-source applications with a strong emphasis on security will help stop corporations, governments, and hackers from logging, storing or selling your personal data.\nDiscuss on Changelog News",
          "link": "https://github.com/lissy93/awesome-privacy",
          "publishedOn": "2022-07-14T16:53:00.000Z",
          "wordCount": null,
          "title": "A curated list of privacy & security-focused software and services",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDgY",
          "author": "Justin Dorfman",
          "description": "Matt Holt (creator of Caddy) gives a deep dive into how the web server works and some of the design decisions and patterns that make it reliable, extensible, and delightful.\nOne of the interesting things about the design of Caddy is that its core is just configuration management. It pushes out all other functionality into modules so that basically the only thing left in core is accepting and reacting to configuration changes.\nDiscuss on Changelog News",
          "link": "https://sourcegraph.com/notebooks/Tm90ZWJvb2s6MTM2Nw==",
          "publishedOn": "2022-07-14T15:58:00.000Z",
          "wordCount": null,
          "title": "How Caddy 2 works, a deep dive into the source",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1657",
          "author": null,
          "description": "Today we talk with two lovely folks from Transistor.fm: Jason Pearl, Senior Software Developer & Jon Buda, co-founder. Gerhard was curious to find out about their setup & how did it change with the launch of the new podcast website builder. After all, you have been hearing us talk about our setup for years, so it was high-time to challenge some assumptions and learn how another team is solving similar problems.\nTL;DL: keeping it simple is at the root of smooth operations & stable systems.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD and enterprise services to the cloud or on premise. They’re inviting our …",
          "link": "https://changelog.com/shipit/61",
          "publishedOn": "2022-07-13T22:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 61: The ops & infra behind Transistor.fm",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/61/ship-it-61.mp3",
            "length": "66988265",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W11g",
          "author": "Jerod Santo",
          "description": "Aaron Francis:\nThe goal is not to become famous, the goal is to increase the chances of luck finding us. For me, one of the most helpful ways to think about this has always been the concept of the “Luck Surface Area,” described in an old post by Jason Roberts. He wrote (and note, the emphasis is mine):\nThe amount of serendipity that will occur in your life, your Luck Surface Area, is directly proportional to the degree to which you do something you’re passionate about combined with the total number of people to whom this is effectively communicated.\nGoing further, he codifies it into a formula where:\nLuck = [Doing Things] * [Telling People]\nThis reminds me a bit of John Gruber’s Obsession Times Voice. Not exactly the same, but there’s a healthy overlap that I find provocative.\nDiscuss on Changelog News",
          "link": "https://github.com/readme/guides/publishing-your-work",
          "publishedOn": "2022-07-13T14:10:00.000Z",
          "wordCount": null,
          "title": "Publishing your work increases your luck",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/499Q",
          "author": "Jerod Santo",
          "description": "Gather round while Jim Grey tells a (long) tale.\nMy 33rd anniversary in the software industry was the Sunday that just passed, July 3. I remember the date because my second day on the job was a paid holiday!\nI want to show you just how far our industry has come and how much we’ve learned.\nThe more things change:\nLots of things we all take for granted didn’t exist. The Internet existed but not the Web. Software was delivered to customers on tapes or floppy disks. The CD burner was still a few years in the future. Java didn’t exist, JavaScript didn’t exist, .NET didn’t exist.\nThe more they stay the same:\nThere was a holy war over text editors. IDEs weren’t a thing yet, so we all coded in a text editor. I was firmly in the Emacs camp, but most of my co-workers loved vi.\nDiscuss on Changelog News",
          "link": "https://dev.jimgrey.net/2022/07/05/working-in-the-software-industry-circa-1989/",
          "publishedOn": "2022-07-13T13:24:00.000Z",
          "wordCount": null,
          "title": "Working in the software industry, circa 1989",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1712",
          "author": null,
          "description": "Coqui is a speech technology startup that making huge waves in terms of their contributions to open source speech technology, open access models and data, and compelling voice cloning functionality. Josh Meyer from Coqui joins us in this episode to discuss cloning voices that have emotion, fostering open source, and how creators are using AI tech.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJosh Meyer – Twitter, GitHub\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nCoqui\nBibleTTS - Data and models for African langauges\nCoqui TTS Hugging Face Space\nCoqui on Github\nJoshua’s previous Practical AI episode about Common Voice\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/184",
          "publishedOn": "2022-07-12T15:10:00.000Z",
          "wordCount": null,
          "title": "Practical AI 184: Cloning voices with Coqui",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/184/practical-ai-184.mp3",
            "length": "50325885",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1711",
          "author": null,
          "description": "Jarred Sumner’s Bun comes out of the oven, Jeremy Brown doesn’t want you prematurely optimizing, Armin Ronacher’s not excited about his “critical” Python package, Daniel Thompson from Tauri thinks you should check out Rustlings, and we draw a straight line between Functional Programming jargon and boujee Gen Z slang.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nBun\nKubernetes is a red flag\nCongratulations: We Now Have Opinions on Your Open Source Contributions\nRustlings\nFunctional Programming Jargon\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-07-11",
          "publishedOn": "2022-07-11T18:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog Bun, K8s is a red flag, \"critical\" open source packages, Rustlings & FP jargon in simple terms",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-07-11/the-changelog-news-2022-07-11.mp3",
            "length": "6452364",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/zDD4",
          "author": "Jerod Santo",
          "description": "Nick Nisi shared this with me recently and it’s cool, so I thought I’d pass it along. Here’s Nick describing it:\nAnd it is a visual wrapper around jq, that kind of does the fzf type thing where as you’re writing out your query, it’s live showing you a preview in virtual text of exactly what would get returned by what you’re querying as you go. So you can use that as a nice tool to build out your jq syntax, or your jq query, and in real time get that feedback.\nThe only bummer is that it’s written in Ruby. Don’t get me wrong, I love Ruby. But it requires you to have Ruby tooling on your machine to use jqq, which many people don’t have or want. BUT it’s a mere 241 lines of code, so porting it to something a little more portable shouldn’t be too much work…\nDiscuss on Changelog News",
          "link": "https://github.com/jcsalterego/jqq",
          "publishedOn": "2022-07-11T14:43:00.000Z",
          "wordCount": null,
          "title": "An interactive wrapper around `jq`",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8llj",
          "author": "Jerod Santo",
          "description": "Vaultless as in you do not need to manage a password vault.\nInstead of storing your passwords in a vault it derives your password on the fly from your master password and supplied realm string (for example, resource URL).\nHow cool is that?! Here’s an example use:\ngokey -p super-secret-master-password -r example.com\n\nDiscuss on Changelog News",
          "link": "https://github.com/cloudflare/gokey",
          "publishedOn": "2022-07-11T13:57:00.000Z",
          "wordCount": null,
          "title": "A simple vaultless password manager in Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1679",
          "author": null,
          "description": "Today we have a special treat: Bryan Cantrill, co-founder and CTO of Oxide Computer! You may know Bryan from his work on DTrace. He worked at Sun for many years, then Oracle, and finally Joyent before starting Oxide.\nWe dig deep into their company’s mission/principles/values, hear how it it all started with a VC’s blank check that turned out to be anything but, and learn how Oxide’s integrated approach to hardware & software sets them up to compete with the established players by building servers as they should be.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps fo…",
          "link": "https://changelog.com/podcast/496",
          "publishedOn": "2022-07-08T19:40:00.000Z",
          "wordCount": null,
          "title": "The Changelog 496: Oxide builds servers (as they should be)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/496/the-changelog-496.mp3",
            "length": "89693560",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V1Je",
          "author": "Jerod Santo",
          "description": "Robb Owen:\nWhy let JS have all the fun? With mix-blend-mode finally gaining wide browser-support, we now have access to many of most common shading techniques in CSS. With some choice images and a bit of careful layering it’s possible to build some surprisingly high-quality effects without the need for introducing any JS dependencies.\nIf you’ve ever used Photoshop’s Blend Modes… you can basically do that in CSS now. So cool! Check out Robb’s entire article. He includes a lot of great examples.\nDiscuss on Changelog News",
          "link": "https://robbowen.digital/wrote-about/css-blend-mode-shaders/",
          "publishedOn": "2022-07-08T15:46:00.000Z",
          "wordCount": null,
          "title": "Holograms, light-leaks and how to build CSS-only shaders",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1700",
          "author": null,
          "description": "OSS developer Jessica Sachs joins Jerod & Kball to discuss re-launching and maintaining Faker.js after it was abandoned last January, Component Driven Development & Neopets!\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nFeaturing\nJessica Sachs – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nOpen source developer corrupts his own files, impacting millions\n🎧 JS Party #210: What’s in your package.json?\nComponent Driven User Interfaces\nThe Neopets HTML Guide\nHistoire - A new way to write stories\nSvelte Summit 2022\n🎧 JS Party #148: Thank you, Dr. Bahmutav!\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/233",
          "publishedOn": "2022-07-08T15:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 233: Accidentally testable",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/233/js-party-233.mp3",
            "length": "59268711",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/y7kb",
          "author": "Jerod Santo",
          "description": "PocketBase is an open source Go backend, consisting of:\nembedded database (SQLite) with realtime subscriptions\nbuilt-in files and users management\nconvenient Admin dashboard UI\nand simple REST-ish API\nFor docs and examples, head to pocketbase.io/docs\nDiscuss on Changelog News",
          "link": "https://github.com/pocketbase/pocketbase",
          "publishedOn": "2022-07-08T14:14:00.000Z",
          "wordCount": null,
          "title": "PocketBase – an open source realtime backend in one file",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1641",
          "author": null,
          "description": "In our 6th Kaizen, we talk with Jerod about all the things that we cleaned up after migrating changelog.com from a managed Kubernetes to Fly.io. We deleted the K8s cluster and moved wildcard cert management to Fastly & all our vanity domain certs to Fly.io. We migrated the Docker Engine that our GitHub Actions is using - PR #416 has all the details. We did a few other things in preparation for our secrets plan. Thank you Maikel Vlasman, James Harr, Adrian Mester, Omri Gabay & Owen Valentine for kicking it off in our Slack #shipit channel.\nGerhard’s favourite improvement: the new shipit.show domain.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database…",
          "link": "https://changelog.com/shipit/60",
          "publishedOn": "2022-07-08T11:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 60: Kaizen! Post-migration cleanup",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/60/ship-it-60.mp3",
            "length": "64932264",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1710",
          "author": null,
          "description": "We’re talking about the tools we use every day help us to be productive! This show will be a great introduction for those new to Go tooling, with some discussion around what we think of them after using some of them for many years.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJaana Dogan – Twitter, GitHub, Website\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nGolangCI-Lint — “5x faster than gometalinter”\nvim-go\nHow can I track tool dependencies for a module?\ngo/packages\nGolint — a linter for Go source code\nconprof — Continuous profiling\nfunc Walk\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/237",
          "publishedOn": "2022-07-07T18:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 237: Go tooling ♻️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/237/go-time-237.mp3",
            "length": "65087720",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/oj9R",
          "author": "Jerod Santo",
          "description": "We’ve linked this up before, but I’m re-upping it because Tauri co-creator Daniel Thompson raved yesterday during our (shipping soon) conversation for The Changelog. He thinks it’s the best way to learn Rust.\nDiscuss on Changelog News",
          "link": "https://github.com/rust-lang/rustlings",
          "publishedOn": "2022-07-07T16:04:00.000Z",
          "wordCount": null,
          "title": "Small exercises to get you used to reading and writing Rust code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mbda",
          "author": "Jerod Santo",
          "description": "Lockdown Mode is the first major capability of its kind designed to offer an extreme, optional protection for the very small number of users who face grave, targeted threats to their digital security.\nIt blocks non-image attachment types in Messages, disables JIT compilation in Safari, blocks incoming FaceTime calls from unknown senders, won’t let the phone connect to a computer via a wired connection, and disables the ability to install new configuration profiles.\nDiscuss on Changelog News",
          "link": "https://www.apple.com/newsroom/2022/07/apple-expands-commitment-to-protect-users-from-mercenary-spyware/",
          "publishedOn": "2022-07-07T15:01:00.000Z",
          "wordCount": null,
          "title": "Apple adds a Lockdown Mode for \"extreme protection\"",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2515",
          "author": "Lee Robinson",
          "description": "This post is a fancified excerpt from Lee Robinson’s guest appearance on The Changelog podcast. Lee is the VP of Developer Experience at Vercel, so he really knows his stuff on this topic! To get the full experience you should listen while you read 💯\n🎧  Click here to listen along while you read. It's better!   🎧\nThe way that I run my Developer Relations team focuses on three different things:\nEducation 🧑‍🏫\nCommunity 🤝\nProduct 🎁\nBut first, a caveat\nThe way DevRel teams or organizations are structured at companies kind of depends on where it falls in that company’s priorities. So for a developer tooling company where their bread and butter is talking to developers, it’s probably gonna have an elevated position in the company. It’s incredibly important to their business and to their co…",
          "link": "https://changelog.com/posts/three-pillars-of-developer-relations",
          "publishedOn": "2022-07-07T14:08:01.000Z",
          "wordCount": null,
          "title": "The three pillars of Developer Relations",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eZaw",
          "author": "Jerod Santo",
          "description": "Philip Walton:\nWhile most teams I talk to would love to be able to run A/B tests to accurately assess the performance impact of certain changes, the problem is pretty much every popular A/B testing tool on the market has such a negative impact on load performance that they’re essentially unusable for this purpose.\nIf you’re just trying to determine which of two marketing headlines converts better, then perhaps this performance difference isn’t so bad. But if you’re wanting to run an A/B test to determine whether inlining your CSS in the <head> of your pages will improve your FCP, well, those popular A/B testing tools are just not going to cut it.\nHe goes on to describe his process for running performant A/B tests on his static site using Cloudflare workers to swap in/out his experiments.\nDiscuss on Changelog News",
          "link": "https://philipwalton.com/articles/performant-a-b-testing-with-cloudflare-workers/",
          "publishedOn": "2022-07-07T14:02:00.000Z",
          "wordCount": null,
          "title": "Performant A/B testing with Cloudflare workers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwdk",
          "author": "Oleh K.",
          "description": "This library implements a component which lived in my head rent-free for a very long time, but I couldn’t find React implementation of it at all, not even a single one. That’s why I decided to implement it myself. It provides a toast component, which is linked to a particular component on a page, which enables developers to provide located feedback (instead of page-wise feedback which you can provide with normal toast)\nDiscuss on Changelog News",
          "link": "https://github.com/OlegWock/react-local-toast",
          "publishedOn": "2022-07-07T13:10:00.000Z",
          "wordCount": null,
          "title": "React local toast",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/laikad/",
          "author": null,
          "description": "Laikad: Faster position for navigation and a higher accuracy for driving.",
          "link": "https://blog.comma.ai/laikad/",
          "publishedOn": "2022-08-03T00:00:00.000Z",
          "wordCount": 1392,
          "title": "Enhancing live localization using Laika"
        },
        {
          "id": "https://blog.comma.ai/0815release/",
          "author": null,
          "description": "The most important openpilot release yet!",
          "link": "https://blog.comma.ai/0815release/",
          "publishedOn": "2022-07-18T00:00:00.000Z",
          "wordCount": 2981,
          "title": "openpilot 0.8.15"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": []
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=19577",
          "author": "Daniel Stenberg",
          "description": "Hi Daniel, My name is Emma Irwin, and I am a program manager at Microsoft, specifically working in the open source program’s office (OSPO). One of the programs I lead is the FOSS fund. This may sound a bit odd, but normally I send an email notice to project winners, yet someone pointed out that … Continue reading Microsoft FOSS Fund Winner: curl →",
          "link": "https://daniel.haxx.se/blog/2022/07/22/microsoft-foss-fund-winner-curl/",
          "publishedOn": "2022-07-22T21:30:13.000Z",
          "wordCount": 454,
          "title": "Microsoft FOSS Fund Winner: curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19571",
          "author": "Daniel Stenberg",
          "description": "When I (in spite of knowing better) talk to ordinary people about what I do for a living and the project I work on, one of the details about it that people have the hardest time to comprehend, is the fact that I really and truly don’t know a lot about who uses my code. … Continue reading I don’t know who uses my code →",
          "link": "https://daniel.haxx.se/blog/2022/07/21/i-dont-know-who-uses-my-code/",
          "publishedOn": "2022-07-20T22:00:15.000Z",
          "wordCount": 644,
          "title": "I don’t know who uses my code"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19565",
          "author": "Daniel Stenberg",
          "description": "Today on July 20 2022, curl turns exactly 8888 days old. It was born on March 20, 1998 when curl 4.0 was shipped. The number 8 is considered a lucky number in several Asian cultures and I figure we can view this as a prequel to the planned curl version 8 release we intend to … Continue reading curl is 8888 days old →",
          "link": "https://daniel.haxx.se/blog/2022/07/20/curl-is-8888-days-old/",
          "publishedOn": "2022-07-20T08:04:12.000Z",
          "wordCount": 351,
          "title": "curl is 8888 days old"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19553",
          "author": "Daniel Stenberg",
          "description": "For C programmers like me, who want to write portable programs that can get built and run on the widest possible array of machines and platforms, we often need to write conditional code. Code that use #ifdefs for particular conditions. Such ifdefs expressions often need to check for a particular compiler, an operating system or … Continue reading predef is our friend →",
          "link": "https://daniel.haxx.se/blog/2022/07/13/predef-is-our-friend/",
          "publishedOn": "2022-07-12T22:12:02.000Z",
          "wordCount": 526,
          "title": "predef is our friend"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-08-05T12:20:17.291Z",
          "wordCount": 1324,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-08-04T12:19:36.029Z",
          "wordCount": 1606,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-08-01T12:20:56.137Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-07-31T12:18:41.798Z",
          "wordCount": 1483,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-07-21T12:20:18.715Z",
          "wordCount": 1840,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-07-20T12:19:42.886Z",
          "wordCount": 1353,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-07-16T12:16:06.150Z",
          "wordCount": 2032,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-07-15T12:20:10.438Z",
          "wordCount": 1273,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-07-11T12:21:13.345Z",
          "wordCount": 833,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-07-10T12:17:02.638Z",
          "wordCount": 983,
          "title": "Introducing a new Swift package for Apache Thrift"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": []
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=66373",
          "author": "Tina Heidinger",
          "description": "From hosting private packages in a private repository to tightening your security profile with GITHUB_TOKEN, here are five simple ways you can streamline your workflow with GitHub Packages.",
          "link": "https://github.blog/2022-08-04-5-simple-things-you-can-do-with-github-packages-to-level-up-your-workflows/",
          "publishedOn": "2022-08-04T16:00:08.000Z",
          "wordCount": 1727,
          "title": "5 simple things you can do with GitHub Packages to level up your workflows"
        },
        {
          "id": "https://github.blog/?p=66395",
          "author": "Jakub Oleksy",
          "description": "In July, we experienced one incident that resulted in degraded performance for Codespaces. This report also acknowledges two incidents that impacted multiple GitHub.com services in June.",
          "link": "https://github.blog/2022-08-03-github-availability-report-july-2022/",
          "publishedOn": "2022-08-03T16:00:30.000Z",
          "wordCount": 1041,
          "title": "GitHub Availability Report: July 2022"
        },
        {
          "id": "https://github.blog/?p=66368",
          "author": "Ashley Bass",
          "description": "Attention all students! Make managing your virtual hackathon events even easier with the new Hackathon in the Cloud Experience.",
          "link": "https://github.blog/2022-08-02-streamline-virtual-hackathon-events-with-the-new-hackathon-in-the-cloud-experience/",
          "publishedOn": "2022-08-02T13:00:52.000Z",
          "wordCount": 688,
          "title": "Streamline virtual hackathon events with the new Hackathon in the Cloud Experience"
        },
        {
          "id": "https://github.blog/?p=66247",
          "author": "Klint Finley",
          "description": "Marketing your open source project can be intimidating, but three experts share their insider tips and tricks for how to get your hard work on the right people’s radars.",
          "link": "https://github.blog/2022-07-28-marketing-for-maintainers-how-to-promote-your-project-to-both-users-and-contributors/",
          "publishedOn": "2022-07-28T17:00:14.000Z",
          "wordCount": 3262,
          "title": "Marketing for maintainers: Promote your project to users and contributors"
        },
        {
          "id": "https://github.blog/?p=66323",
          "author": "Jessica Lord",
          "description": "GitHub Sponsors expands globally with 30 newly supported regions, bringing the total to 68.",
          "link": "https://github.blog/2022-07-28-github-sponsors-available-in-30-new-regions-2/",
          "publishedOn": "2022-07-28T13:00:07.000Z",
          "wordCount": 1362,
          "title": "GitHub Sponsors available in 30 new regions"
        },
        {
          "id": "https://github.blog/?p=66132",
          "author": "Michelle Mannering",
          "description": "It’s been a crazy couple of months with the end of financial year and lots of products shipping. Our community has been hard at work shipping projects too. These projects can include everything from world-changing technology to developer tooling, and weekend hobbies. Here are some of these open source projects that released major updates this […]",
          "link": "https://github.blog/2022-07-27-release-radar-jun-2022/",
          "publishedOn": "2022-07-27T17:10:05.000Z",
          "wordCount": 1484,
          "title": "Release Radar · June 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66164",
          "author": "Man Yue Mo",
          "description": "In this post I’ll exploit CVE-2022-20186, a vulnerability in the Arm Mali GPU kernel driver and use it to gain arbitrary kernel memory access from an untrusted app on a Pixel 6. This then allows me to gain root and disable SELinux. This vulnerability highlights the strong primitives that an attacker may gain by exploiting errors in the memory management code of GPU drivers.",
          "link": "https://github.blog/2022-07-27-corrupting-memory-without-memory-corruption/",
          "publishedOn": "2022-07-27T17:00:35.000Z",
          "wordCount": 5637,
          "title": "Corrupting memory without memory corruption"
        },
        {
          "id": "https://github.blog/?p=66298",
          "author": "Mario Rodriguez",
          "description": "Today, we are announcing the general availability of the new and improved Projects powered by GitHub Issues. GitHub Projects connects your planning directly to the work your teams are doing in GitHub and flexibly adapts to whatever your team needs at any point.",
          "link": "https://github.blog/2022-07-27-planning-next-to-your-code-github-projects-is-now-generally-available/",
          "publishedOn": "2022-07-27T16:00:10.000Z",
          "wordCount": 1436,
          "title": "Planning next to your code – GitHub Projects is now generally available"
        },
        {
          "id": "https://github.blog/?p=66225",
          "author": "tuves",
          "description": "Today, we’re launching GitHub Community, which brings together GitHub Community Forum, GitHub Education Forum, and product feedback into a free, in-product, single space for all user-to-user interactions.",
          "link": "https://github.blog/2022-07-26-launching-github-community-powered-by-github-discussions/",
          "publishedOn": "2022-07-26T17:00:36.000Z",
          "wordCount": 614,
          "title": "Launching GitHub Community: Powered by GitHub Discussions"
        },
        {
          "id": "https://github.blog/?p=66264",
          "author": "Myles Borins",
          "description": "New npm security enhancements include an improved login and publish experience with the npm CLI, connected GitHub and Twitter accounts, and a new CLI command to verify the integrity of packages in npm.",
          "link": "https://github.blog/2022-07-26-introducing-even-more-security-enhancements-to-npm/",
          "publishedOn": "2022-07-26T16:00:06.000Z",
          "wordCount": 1366,
          "title": "Introducing even more security enhancements to npm"
        },
        {
          "id": "https://github.blog/?p=66203",
          "author": "lukewar",
          "description": "GitHub Issues is a core component of how developers get things done and, as we built more project planning capabilities into GitHub, we’ve found some fun and unique ways to use the new projects experience for personal productivity.",
          "link": "https://github.blog/2022-07-21-tips-tricks-for-using-github-projects-for-personal-productivity/",
          "publishedOn": "2022-07-21T16:00:51.000Z",
          "wordCount": 751,
          "title": "Tips & tricks for using GitHub projects for personal productivity"
        },
        {
          "id": "https://github.blog/?p=66194",
          "author": "Evi Liu",
          "description": "We strive to understand how developers collaborate and work on GitHub, and we sometimes partner with academics to better understand how we can improve our products. Here's how we did that to build and evolve GitHub Discussions.",
          "link": "https://github.blog/2022-07-20-heres-how-academic-research-is-shaping-github-discussions/",
          "publishedOn": "2022-07-20T15:58:14.000Z",
          "wordCount": 1769,
          "title": "Here’s how academic research is shaping GitHub Discussions"
        },
        {
          "id": "https://github.blog/?p=66178",
          "author": "Damian Brady",
          "description": "From incorporating accessibility testing to implementing blue-green deployment models, here are six practical and strategic ways to improve your CI/CD pipeline.",
          "link": "https://github.blog/2022-07-19-6-strategic-ways-to-level-up-your-ci-cd-pipeline/",
          "publishedOn": "2022-07-19T16:15:27.000Z",
          "wordCount": 2519,
          "title": "6 strategic ways to level up your CI/CD pipeline"
        },
        {
          "id": "https://github.blog/?p=66128",
          "author": "Rizel Scarlett",
          "description": "July's Open Source Monthly features Zag.js, which leverages state machines to make framework agnostic components.",
          "link": "https://github.blog/2022-07-18-open-source-monthly-july-2022-edition/",
          "publishedOn": "2022-07-18T16:06:57.000Z",
          "wordCount": 1219,
          "title": "Open Source Monthly: July 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66107",
          "author": "Albert Ziegler",
          "description": "We surveyed more than 2,000 developers about whether GitHub Copilot helped them be more productive and improved their coding. Then, we matched this qualitative feedback and subjective perception with quantitative data around objective usage measurements and productivity.",
          "link": "https://github.blog/2022-07-14-research-how-github-copilot-helps-improve-developer-productivity/",
          "publishedOn": "2022-07-14T16:05:19.000Z",
          "wordCount": 1394,
          "title": "Research: How GitHub Copilot helps improve developer productivity"
        },
        {
          "id": "https://github.blog/?p=65802",
          "author": "Michelle Mannering",
          "description": "Read about the six key themes, and tips for each, that ensure sustainable and healthy open source communities.",
          "link": "https://github.blog/2022-07-07-healthy-and-sustainable-communities/",
          "publishedOn": "2022-07-07T18:00:44.000Z",
          "wordCount": 1601,
          "title": "Top tips for creating a healthy and sustainable open source community"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18513",
          "author": "Nubank Editorial",
          "description": "The Nu Way of Working is our hybrid work model that was created so people could collaborate more in person and still keep the flexibility of remote work. Check out how it will work.\nThe post Nu Way of Working: Nubank’s new hybrid work model appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-way-of-working-nubanks-new-hybrid-work-model/",
          "publishedOn": "2022-08-05T01:00:07.000Z",
          "wordCount": 3666,
          "title": "Nu Way of Working: Nubank’s new hybrid work model"
        },
        {
          "id": "https://building.nubank.com.br/?p=18519",
          "author": "Matt Swann - Chief Technology Officer at Nubank",
          "description": "Cyber security is no longer a concern reserved to the IT field. Financial institutions are embedding safety into the business.\nThe post How to create a security strategy based on customer’s trust appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/matt-swann-how-to-create-a-security-strategy-based-on-customers-trust/",
          "publishedOn": "2022-08-02T19:29:34.000Z",
          "wordCount": 3258,
          "title": "How to create a security strategy based on customer’s trust"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/live-hacking-events/h1-702-las-vegas-day-2-hacking-zoom",
          "author": "jesse@hackerone.com",
          "description": "Welcome back to our first day of in-person hacking! We had some lovely people greeting you today for your check-in. Again, we want all of our hacker",
          "link": "https://www.hackerone.com/live-hacking-events/h1-702-las-vegas-day-2-hacking-zoom",
          "publishedOn": "2022-08-05T04:37:17.000Z",
          "wordCount": 839,
          "title": "H1-702 Las Vegas Day 2: Hacking with Zoom!"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-two-hcktivity-con",
          "author": "jesse@hackerone.com",
          "description": "After a day of rest, we were ready to launch into our first day of H1-702! What makes today special is the return of H@cktivity Con, previousl",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-two-hcktivity-con",
          "publishedOn": "2022-08-04T02:24:10.000Z",
          "wordCount": 943,
          "title": "H1-702 Las Vegas Day Two: H@cktivity Con!"
        },
        {
          "id": "https://hackerone.com/live-hacking-events/h1-702-las-vegas-day-0-setup",
          "author": "jesse@hackerone.com",
          "description": "Hackers! We have made it to Las Vegas! We are here for a live hacking event (LHE). All live hacking events are amazing, but this LHE has a special p",
          "link": "https://www.hackerone.com/live-hacking-events/h1-702-las-vegas-day-0-setup",
          "publishedOn": "2022-08-02T23:06:37.000Z",
          "wordCount": 940,
          "title": "H1-702 Las Vegas Day 0: Setup!"
        },
        {
          "id": "https://hackerone.com/penetration-testing/benchmark-analysis-annual-pentest-and-code-review-coverage",
          "author": "Sean Ryan",
          "description": "Security leaders often struggle to keep pace with the evolving nature of their respective attack surfaces. Many fall behind in their ability to identi",
          "link": "https://www.hackerone.com/penetration-testing/benchmark-analysis-annual-pentest-and-code-review-coverage",
          "publishedOn": "2022-07-14T16:00:00.000Z",
          "wordCount": 1732,
          "title": "Benchmark Analysis: Annual Pentest and Code Review Coverage"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/5-articles-get-you-speed-bug-bounty-programs",
          "author": "HackerOne",
          "description": "Many organizations use bug bounty programs to help them protect their ever-expanding attack surface and achieve attack resistance. Bug bounties, with ethical hackers at the helm, uncover critical and severe vulnerabilities before bad actors and deliver better protection against cyberattacks. But what is a bug bounty, and should your organization have one?",
          "link": "https://www.hackerone.com/vulnerability-management/5-articles-get-you-speed-bug-bounty-programs",
          "publishedOn": "2022-07-07T19:00:00.000Z",
          "wordCount": 1111,
          "title": "5 Articles to Get You Up-to-Speed on Bug Bounty Programs"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/1288bcab2873",
          "author": "Netflix Technology Blog",
          "description": "By Bo Lei, Guilherme Pires, James Shao, Kasturi Chatterjee, Sujay Jain, Vlad Sydorenko",
          "link": "https://netflixtechblog.com/data-mesh-a-data-movement-and-processing-platform-netflix-1288bcab2873?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-01T18:20:37.000Z",
          "wordCount": 1637,
          "title": "Data Mesh — A Data Movement and Processing Platform @ Netflix"
        },
        {
          "id": "https://medium.com/p/989599029109",
          "author": "Netflix Technology Blog",
          "description": "by Aryan Mehra,  with Farnaz Karimdady Sharifabad, Prasanna Vijayanathan, Chaïna Wade, Vishal Sharma and Mike Schassberger",
          "link": "https://netflixtechblog.com/formulating-out-of-memory-kill-prediction-on-the-netflix-app-as-a-machine-learning-problem-989599029109?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-07-21T21:16:36.000Z",
          "wordCount": 2180,
          "title": "Formulating ‘Out of Memory Kill’ Prediction on the Netflix App as a Machine Learning Problem"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-july-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-review-july-2022",
          "publishedOn": "2022-07-29T12:40:28.000Z",
          "wordCount": null,
          "title": "Portfolio Review: July 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fda63529f-3134-4f61-846d-05981c50f003_700x466.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-6",
          "author": "Market Radar",
          "description": "A mix of charts on stocks, indices and crypto",
          "link": "https://marketradar.substack.com/p/charts-to-watch-6",
          "publishedOn": "2022-07-11T12:45:16.000Z",
          "wordCount": null,
          "title": "Charts to Watch #6",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fad82a015-6366-4139-ab9c-391859295d2b_1280x794.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": [
        {
          "id": "https://betterexplained.com/?p=12748",
          "author": "kalid",
          "description": "Quick confession? I never fully learned the trig derivatives. Sure, I memorized $\\sin' = \\cos$ and $\\cos' = -\\sin $ like everyone else, but the derivative of tangent? Cosecant? Forget it, magic spells. After years of searching, there's a middle ground between tedious derivation and rote memorization. Aha moment: all trig functions change using the […]",
          "link": "https://betterexplained.com/articles/trig-derivatives/",
          "publishedOn": "2022-08-03T20:18:29.000Z",
          "wordCount": 1440,
          "title": "How to Learn Trig Derivatives",
          "enclosure": {
            "url": "https://betterexplained.com/wp-content/uploads/trig/derivatives/TrigDerivativeTable.mp4",
            "length": "10296927",
            "type": "video/mp4"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}