{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Sam Heft-Luthy, Product Manager, Privacy &amp; Data Protection Office&nbsp;\n\nWhat happens to our digital accounts when we stop using them? It’s a question we should all ask ourselves, because when we are no longer keeping tabs on what’s happening with old accounts, they can become targets for cybercrime.\nIn fact, quite a few recent high-profile breaches targeted inactive accounts. The Colonial Pipeline ransomware attack came through an inactive account that didn’t use multifactor authentication, a…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/l65GmjhLgBc/google-protects-your-accounts-even-when.html",
          "publishedOn": "2021-10-05T13:00:00.001Z",
          "wordCount": 968,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Google Protects Your Accounts – Even When You No Longer Use Them"
        },
        {
          "description": "Posted by Meder Kydyraliev and Kim Lewandowski, Google Open Source Security Team\nOver the past year we have made a number of investments to strengthen the security of critical open source projects, and recently announced our $10 billion commitment to cybersecurity defense including $100 million to support third-party foundations that manage open source security priorities and help fix vulnerabilities. \nToday, we are excited to announce our sponsorship for the Secure Open Source (SOS) pilot program run by th…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/KaGn0C1cM2Q/introducing-secure-open-source-pilot.html",
          "publishedOn": "2021-10-01T14:22:00.000Z",
          "wordCount": 1088,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing the Secure Open Source Pilot Program"
        },
        {
          "description": "Posted by Guoli Ma, Sebastian Lekies &amp; Claudio Criscione, Google Vulnerability Management Team\n\nOne year ago, we published the Tsunami security scanner with the goal of detecting high severity, actively exploited vulnerabilities with high confidence. In the last several months, the Tsunami scanner team has been working closely with our vulnerability rewards program, Bug Hunters, to further improve Tsunami's security detection capabilities.\nToday, we are announcing a new experimental Patch Reward Program…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/QEPIl_i_moY/announcing-new-patch-reward-program-for.html",
          "publishedOn": "2021-09-28T13:00:00.002Z",
          "wordCount": 687,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing New Patch Reward Program for Tsunami Security Scanner"
        },
        {
          "description": "Posted by Priya Wadhwa and Appu Goundan, Google Open Source Security Team\n\n\nA few months ago we announced that we started signing all distroless images with cosign, which allows users to verify that they have the correct image before starting the build process. Signing our images was our first step towards fully securing the distroless supply chain. Since then, we’ve implemented even more accountability in our supply chain and are excited to announce that distroless builds have achieved SLSA 2. SLSA is a se…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/21fk7__SXrc/distroless-builds-are-now-slsa-2.html",
          "publishedOn": "2021-09-22T16:00:00.001Z",
          "wordCount": 6509,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Distroless Builds Are Now SLSA 2"
        },
        {
          "description": "Adrian Taylor, Andrew Whalley, Dana Jansens and Nasko Oskov, Chrome security team \nSecurity is a cat-and-mouse game. As attackers innovate, browsers always have to mount new defenses to stay ahead, and Chrome has invested in ever-stronger multi-process architecture built on sandboxing and site isolation. Combined with fuzzing, these are still our primary lines of defense, but they are reaching their limits, and we can no longer solely rely on this strategy to defeat in-the-wild attacks. \nLast year, we showe…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/XKkN9QXslxE/an-update-on-memory-safety-in-chrome.html",
          "publishedOn": "2021-09-21T17:00:00.001Z",
          "wordCount": 1040,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "An update on Memory Safety in Chrome"
        },
        {
          "description": "Posted by Kaylin Trychon, Google Open Source Security Team&nbsp;\n\nWe recently pledged to provide $100 million to support third-party foundations that manage open source security priorities and help fix vulnerabilities. As part of this commitment, we are excited to announce our support of the Open Source Technology Improvement Fund (OSTIF) to improve security of eight open-source projects.\nGoogle’s support will allow OSTIF to launch the Managed Audit Program (MAP), which will expand in-depth security reviews…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/J6olq6dpQeo/google-supports-open-source-technology.html",
          "publishedOn": "2021-09-15T18:17:00.003Z",
          "wordCount": 621,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Google Supports Open Source Technology Improvement Fund"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "I’ve heard way less people throwing SQL under the bus than I did back in the high-hype NoSQL days, but this article by Justin Etheredge does a good job of laying out some of the advantages and disadvantages of the RDBMS side of the fence:\nThe next time you hear someone describe relational databases as yesterday’s technology, or the next time you see someone assume a relational database can’t handle the needs of their unproven MVP, stop and ask them how they are going to account for the tradeoffs they’re mak…",
          "link": "https://www.simplethread.com/relational-databases-arent-dinosaurs-theyre-sharks/",
          "publishedOn": "2021-10-11T20:44:00.000Z",
          "wordCount": 1937,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Relational databases aren’t dinosaurs, they’re sharks"
        },
        {
          "description": "Bryan Braughn has been making good use of his Checkboxland library (which makes it easy to display text and animations on a grid of checkboxes). He’s made games, image transfers, and even videos like the one below. But then, some introspection:\nThis whole process has been fun but I really ought to stop.\nI got nerd sniped, hard. Sure it’s harmless fun, but I’m starting to feel guilty spending months tinkering on these things when I’ve got the tools and skills to put actually useful stuff into the world. I fe…",
          "link": "https://www.bryanbraun.com/2021/09/21/i-keep-making-things-out-of-checkboxes/",
          "publishedOn": "2021-10-11T16:24:00.000Z",
          "wordCount": 712,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I keep making things out of checkboxes"
        },
        {
          "description": "dos-like is a programming library/framework, kind of like a tiny game engine, for writing games and programs with a similar feel to MS-DOS productions from the early 90s.\nRather than writing code that would run on a real DOS machine, dos-like is about making programs which run on modern platforms like Windows, Mac and Linux, but which attempts to recreate the look, feel, and sound of old DOS programs.\n\nDiscuss on Changelog News",
          "link": "https://github.com/mattiasgustavsson/dos-like",
          "publishedOn": "2021-10-11T14:41:00.000Z",
          "wordCount": 749,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A modern app engine with a nostalgic feel"
        },
        {
          "description": "Today we’re talking to Matt Rickard about his blog post, Reflections on 10,000 Hours of Programming. Matt was clear to mention that these reflections are purely about coding, not career advice or other soft skills. These reflections are just about deliberately writing code for 10,000 hours, which also correlates with the number of hours needed to master a skill.\nIf you count the reflections we cover on the show and be the first to comment on this episode, we’ll get in touch and send you a coupon code to use…",
          "link": "https://changelog.com/podcast/463",
          "publishedOn": "2021-10-08T21:00:00.000Z",
          "wordCount": 543,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 463: Lessons from 10k hours of programming"
        },
        {
          "description": "Doug Martin joins Nick to talk to us about building GraphQL backends in TypeScript with NestJS and his project, nestjs-query. We talk about what NestJS is and its built-in support for GraphQL and REST, and then dive into how NestJS-query extends it to generate code for you.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nAuth0 – The for developers, by developers identity platform built for the cloud era that secures billions of lo…",
          "link": "https://changelog.com/jsparty/196",
          "publishedOn": "2021-10-08T16:30:00.000Z",
          "wordCount": 417,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 196: Building GraphQL backends with NestJS"
        },
        {
          "description": "We’ve had some excellent discussions about API design over the years. Add to the list this piece by Joël Quenneville at Thoughtbot where he borrows a mental model from the world of MOBA games:\nIn gaming, MOBA (multiplayer online battle arena) players have a mental framework for describing just what kind of player is empowered by different characters. This framework describes all characters in terms of two statistics: their skill floor and their skill ceiling.\nDiscuss on Changelog News",
          "link": "https://thoughtbot.com/blog/who-is-empowered-by-your-design",
          "publishedOn": "2021-10-08T15:30:00.000Z",
          "wordCount": 857,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Who is empowered by your API design?"
        },
        {
          "description": "This piece by Lucas F Costa starts off right where I live:\nThere are many ways of estimating how long a software project will take. All of them are a waste of time.\nIt then goes on to describe a different way of doing it:\nInstead of making “informed” guesses or multiplying estimations by N, we can embrace the randomness and variability involved in writing software and use more suitable statical methods, in this case, stochastic modeling techniques, to devise better forecasts. One of these techniques is the …",
          "link": "https://lucasfcosta.com/2021/09/20/monte-carlo-forecasts.html",
          "publishedOn": "2021-10-08T13:35:00.000Z",
          "wordCount": 4630,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to replace estimations and guesses with a Monte Carlo simulation"
        },
        {
          "description": "We’re celebrating our 200th episode with a crazy game of Gophers Say! Mat Ryer hosts two epic teams including Go Time OGs Carlisia, Erik, and Brian!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Securely access any computing resource anywhere. Engineers and security teams can unify access to SSH servers, Kubernetes clusters, web applications, and databases across all environments. Try Teleport today in the cloud, self…",
          "link": "https://changelog.com/gotime/200",
          "publishedOn": "2021-10-07T17:30:00.000Z",
          "wordCount": 412,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 200: Gophers Say What!?"
        },
        {
          "description": "Jim Salter writing for Ars Technica:\nIn our main Windows 11 review posted earlier this week, we covered the majority of new features and design decisions in Microsoft’s newest consumer OS—and it feels reasonable to characterize the overall impression given there as “lukewarm.” The good news is that we still hadn’t covered the best part of Windows 11: Linux.\nIf you could travel back in time and read this headline to college-me… I would’ve laughed you out of the room. Also, why didn’t you tell me about Bitcoi…",
          "link": "https://arstechnica.com/gadgets/2021/10/the-best-part-of-windows-11-is-a-revamped-windows-subsystem-for-linux/",
          "publishedOn": "2021-10-07T14:28:00.000Z",
          "wordCount": 1520,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The best part of Windows 11 is basically Linux"
        },
        {
          "description": "Which conference sessions do you remember the most and why? Those with a little theatre, live demos and audience participation are the ones that have stuck with me.\nI don’t think that I actually heard the term “live demo” until I went to my first Dockercon event in 2016. The implication was that some demos wouldn’t be run live and would be staged, rehearsed or faked.\nWe take a quick look at the origins of live conference demos, some of the people who do them best. Then we take a look at why having traffic t…",
          "link": "https://blog.alexellis.io/kubecon-demos-like-a-boss/",
          "publishedOn": "2021-10-07T13:34:00.000Z",
          "wordCount": 1861,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Do your demos like a boss at KubeCon"
        },
        {
          "description": "In this article, we’ll train the car to do self-parking using a genetic algorithm. You can also launch the  Self-parking Car Evolution Simulator to see the evolution process directly in your browser.\n\nDiscuss on Changelog News",
          "link": "https://trekhleb.dev/blog/2021/self-parking-car-evolution/",
          "publishedOn": "2021-10-06T15:56:00.000Z",
          "wordCount": 6297,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A self-parking car in 500 lines of code"
        },
        {
          "description": "In this post, I expand upon Michael Nygard’s post Documenting Architecture Decisions. Michael defines architecturally significant decisions as those decisions that affect the structure, non-functional characteristics, dependencies, interfaces, or construction techniques. I add examples to each of the five decisions categories.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2021/09/28/architecturally-significant-decisions/",
          "publishedOn": "2021-10-06T15:02:00.000Z",
          "wordCount": 1526,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Examples of architecturally significant decisions"
        },
        {
          "description": "There are a lot of HTTP client tools out there. This one is neat because of its simple/repeatable plain text API that I’d imagine works great for writing integration tests.\n# Get home:\nGET https://example.net\n\nHTTP/1.1 200\n[Captures]\ncsrf_token: xpath &quot;string(//meta[@name='_csrf_token']/@content)&quot;\n\n# Do login!\nPOST https://example.net/login?user=toto&amp;password=1234\nX-CSRF-TOKEN: {{csrf_token}}\n\nHTTP/1.1 302\n\nDiscuss on Changelog News",
          "link": "https://hurl.dev/index.html",
          "publishedOn": "2021-10-06T13:21:00.000Z",
          "wordCount": 463,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A CLI that runs HTTP requests defined in a simple plain text format"
        },
        {
          "description": "Today we have a very special episode, where Gerhard gets to share his favourite learnings from Steve Jobs. If it wasn’t for his determination to build a better personal computer, Gerhard would have most likely continued with a career in physics.\nWe know what you’re thinking: it’s crazy and impossible to interview Steve Jobs, but on his 10th memorial anniversary, Gerhard was determined to combine the things that Steve said with his passion for computers, automation, and infrastructure.\nLive your life and shi…",
          "link": "https://changelog.com/shipit/22",
          "publishedOn": "2021-10-05T21:00:00.000Z",
          "wordCount": 453,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 22: It's crazy and impossible"
        },
        {
          "description": "Tivadar Danka is an educator and content creator in the machine learning space, and he is writing a book to help practitioners go from high school mathematics to mathematics of neural networks.  His explanations are lucid and easy to understand.  You have never had such a fun and interesting conversation about calculus, linear algebra, and probability theory before!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Sma…",
          "link": "https://changelog.com/practicalai/152",
          "publishedOn": "2021-10-05T20:15:00.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 152: The mathematics of machine learning"
        },
        {
          "description": "Turns out Niek and his team were also inspired by other Todo or Die implementations:\nLately, there is some talk about Todo or Die plugins in languages. According to your latest newsletter, it is now supported in Rust, Ruby, Python, and Elixir. We’ve now added support for TypeScript as a language server plugin!\nFor now, it has a minimal feature set, because this was created in a day during our company’s Innovation Day, but we have lots of ideas to extend the project.\nDiscuss on Changelog News",
          "link": "https://www.npmjs.com/package/typescript-todo-or-die-plugin",
          "publishedOn": "2021-10-05T14:46:00.000Z",
          "wordCount": 235,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Todo Or Die? TypeScript can do that"
        },
        {
          "description": "Kubegres is fully integrated with Kubernetes’ lifecycle as it runs as an operator written in Go. It is minimalist in terms of codebase compared to other open-source Postgres operators. It has the minimal and yet robust required features to manage a cluster of PostgreSql on Kubernetes. We aim keeping this project small and simple.\nWe’ve struggled with running Postgres inside K8s around these parts. Maybe this would’ve helped?\nDiscuss on Changelog News",
          "link": "https://www.kubegres.io",
          "publishedOn": "2021-10-05T13:47:00.000Z",
          "wordCount": 702,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Kubegres is a K8s operator for deploying Postgres clusters"
        },
        {
          "description": "It’s common for me to get excited about a personal project, put a bunch of time into it, and then lose interest. As much as possible, I want these projects to continue working; upkeep isn’t fun. What does designing for minimum maintenance look like?\nGreat question!\nDiscuss on Changelog News",
          "link": "https://www.jefftk.com/p/designing-low-upkeep-software",
          "publishedOn": "2021-10-04T15:10:00.000Z",
          "wordCount": 712,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Designing low upkeep software"
        },
        {
          "description": "Local development of remote/cloud functions has been various levels of painful ever since the computing trend started its rise, so it makes a lot of sense why Cloudflare would invest in easing that pain. Now they get to say developing with Cloudflare Workers is:\n🎉 Fun: develop workers easily with detailed logging, file watching and pretty error pages supporting source maps.\n🔋 Full-featured: supports most Workers features, including KV, Durable Objects, WebSockets, modules and more.\n⚡ Fully-local: test and…",
          "link": "https://github.com/cloudflare/miniflare",
          "publishedOn": "2021-10-04T14:19:00.000Z",
          "wordCount": 1144,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A first-party, fully-local simulator for Cloudflare Workers"
        },
        {
          "description": "This incredibly cool DIY e-ink calendar uses a Raspberry Pi Zero WH to do its thing. Here’s how it works:\nThrough PiSugar2’s web interface, the onboard RTC can be set to wake and trigger the RPi to boot up daily at a time of your preference. Upon boot, a cronjob on the RPi is triggered to run a Python script that fetches calendar events from Google Calendar for the next few weeks, and formats them into the desired layout before displaying it on the E-Ink display. The RPi then shuts down to conserve battery.…",
          "link": "https://github.com/speedyg0nz/MagInkCal",
          "publishedOn": "2021-10-04T13:26:01.000Z",
          "wordCount": 1667,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "MagInkCal syncs your Google calendar with a framable e-ink display"
        },
        {
          "description": "This week we’re joined by Brittany Dionigi, Director of Platform Engineering at Articulate, and we’re talking about how organizations can take a more intentional approach to supporting the growth of their engineers through learning-focused engineering.\nBrittany has been a software engineer for more than 10 years, and learned formal educational and classroom-based learning strategies as a Technical Lead &amp; Senior Instructor at Turing School of Software &amp; Design. We talk through a ton of great topics; …",
          "link": "https://changelog.com/podcast/462",
          "publishedOn": "2021-10-01T21:00:00.000Z",
          "wordCount": 602,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 462: Learning-focused engineering"
        },
        {
          "description": "Muffin fairies, thumb wars, and fruit transit can only mean one thing: Explain it Like I’m 5! We’re also covering the news, discussing the effects of remote work, and agreeing it’s OK to ignore the frontend dev scene for awhile.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool For Startups – More and more startups are using Retool to focus their time on their core product. That’s exactly why Retool launched “Retool For Start…",
          "link": "https://changelog.com/jsparty/195",
          "publishedOn": "2021-10-01T19:30:00.000Z",
          "wordCount": 514,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 195: Do you know the muffin fairy?"
        },
        {
          "description": "kbar is a plug-n-play React component that gives you a super slick UI for free:\nWith macOS’s Spotlight and Linear’s command+k experience in mind, kbar aims to be a simple abstraction to add a fast and extensible command+k menu to your site.\nAdding command+k mode to your web app is the new adding vim mode to your web app.\nDiscuss on Changelog News",
          "link": "https://kbar.vercel.app/",
          "publishedOn": "2021-10-01T16:27:00.000Z",
          "wordCount": 9,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A fully extensible command+k interface for your site"
        },
        {
          "description": "If you already know what JupyterLab is, then I don’t have to tell you why this might be exciting/useful. If you don’t, well, here’s what JupyterLab is:\nJupyterLab is the next-generation user interface for Project Jupyter offering all the familiar building blocks of the classic Jupyter Notebook (notebook, terminal, text editor, file browser, rich outputs, etc.) in a flexible and powerful user interface. JupyterLab will eventually replace the classic Jupyter Notebook.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jupyterlab/jupyterlab_app",
          "publishedOn": "2021-10-01T15:40:00.000Z",
          "wordCount": 839,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A desktop app for JupyterLab (based on Electron)"
        },
        {
          "description": "In this episode, we will be exploring the tiny world of Go and Hardware. We are joined by three gophers, Vladimir Vivien, Tobias Theel, and Ron Evans, who will be discussing the use of Linux API (V4L2) to control video hardware and capture image data in realtime, programming Bluetooth devices, working on WiFi communication using an Arduino Nano 33 IoT NINA chip, and much more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSource…",
          "link": "https://changelog.com/gotime/199",
          "publishedOn": "2021-09-30T15:00:00.000Z",
          "wordCount": 577,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 199: Go on hardware: TinyGo in the wild"
        },
        {
          "description": "Good ideas get legs and run. It appears that “self-destructing” TODO comments is a good idea, because the concept has now been implemented in Rust, Ruby, Python, and Elixir (as a credo check). Here’s some insight on that decision shared by the package author, Brian Underwood:\nI talked with a couple of other people on the Elixir Slack about it when I started and we all liked the idea of doing it as a check (like with credo) as opposed to at runtime because that could fail on production (not very with the “st…",
          "link": "https://hex.pm/packages/credo_todo_or_die",
          "publishedOn": "2021-09-30T14:48:00.000Z",
          "wordCount": 228,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Todo or Die, now for Elixir too"
        },
        {
          "description": "Things go wrong all the time. We all make mistakes. And that is okay. What is not okay, is to think that it won’t happen, or that there will be someone else around when it does. In that moment, it doesn’t matter who wrote that module, package or microservice. But there is a better way to think about this, and there is an approach that makes people actually look forward to incidents.\nIt all starts with thinking of incidents as opportunities to learn, and then share those learnings with everyone, so that you …",
          "link": "https://changelog.com/shipit/21",
          "publishedOn": "2021-09-30T14:00:00.000Z",
          "wordCount": 591,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 21: Learning from incidents"
        },
        {
          "description": "This may seem silly at first, but DeepfakeHTTP actually has a bunch of interesting use cases:\nCreating the product PoC or demo before even starting out with the backend\nREST, GraphQL, and other API prototyping and testing\nHiding critical enterprise infrastructure behind a simple static facade\nHacking and fine-tuning HTTP communications on both server and client sides\nDiscuss on Changelog News",
          "link": "https://github.com/xnbox/DeepfakeHTTP",
          "publishedOn": "2021-09-30T13:28:00.000Z",
          "wordCount": 1530,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "DeepfakeHTTP – Your 100% static dynamic backend"
        },
        {
          "description": "This is a super cool feature of Lighthouse (use it in PageSpeed Insights or Chrome Canary) that produces a visualization of JavaScript dependencies. Sourcemaps are required to get the per-module breakdown like you see below in GitHub’s results.\n\nDiscuss on Changelog News",
          "link": "https://sia.codes/posts/lighthouse-treemap/",
          "publishedOn": "2021-09-29T17:08:00.000Z",
          "wordCount": 1498,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Explore your JS dependencies with Lighthouse Treemap"
        },
        {
          "description": "This cool open source project provides transparent client-side encryption to be used with your cloud file storage of choice. Which choices, you ask?\nWorks with Dropbox, Google Drive, OneDrive, MEGA, pCloud, ownCloud, Nextcloud and any other cloud storage service which synchronizes with a local directory\n\nDiscuss on Changelog News",
          "link": "https://cryptomator.org/",
          "publishedOn": "2021-09-29T16:21:00.000Z",
          "wordCount": 916,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Cryptomator – put a lock on your cloud files"
        },
        {
          "description": "Chris Coyier does a great job rounding up and summarizing conversations around #AppleBrowserBan:\nJust last week I got one of those really?! 🤨 faces when this fact came up in conversation amongst smart and engaged fellow web developers: there is no browser choice on iOS. It’s all Safari. You can download apps that are named Chrome or Firefox, or anything else, but they are just veneer over Safari. If you’re viewing a website on iOS, it’s Safari.\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/ios-browser-choice/",
          "publishedOn": "2021-09-29T14:02:00.000Z",
          "wordCount": 1798,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "On (the lack of) iOS browser choice"
        },
        {
          "description": "Polarity Mapping is a framework to “help problems be solved in a realistic and multidimensional manner” (see here for more info). In this week’s fully connected episode, Chris and Daniel use this framework to help them discuss how an organization can strike a good balance between human intelligence and AI. AI can’t solve everything and humans need to be in-the-loop with many AI solutions.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSpo…",
          "link": "https://changelog.com/practicalai/151",
          "publishedOn": "2021-09-28T21:20:00.000Z",
          "wordCount": 435,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 151: Balancing human intelligence with AI"
        },
        {
          "description": "Recently I discovered additional reasons to write tests for my code! Besides obvious and well-known ones described in books and many blog posts, I realized that the process of writing tests has also psychological effects for me. These effects are especially helpful in cases of hotfixes that need to be deployed as soon as possible.\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/why-do-i-write-tests/",
          "publishedOn": "2021-09-28T14:28:00.000Z",
          "wordCount": 409,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Why do I write tests?"
        },
        {
          "description": "When most teams complain about poor quality, they usually mean reliability woes; however, quality spans a more extensive spectrum and can mean many things. This post posits a quality hierarchy that identifies the pertinent challenges and helps with making the right tradeoffs.\nDiscuss on Changelog News",
          "link": "https://abdulapopoola.com/2021/09/22/no-surprises-a-framework-for-software-quality/",
          "publishedOn": "2021-09-28T13:36:00.000Z",
          "wordCount": 1872,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A framework for software quality (no surprises)"
        },
        {
          "description": "In this video I kick the tires on Mat Ryer’s xbar, an open source utility that lets you “put anything in your macOS menu bar.” I get it to tell us dad jokes, keep us abreast of Covid case counts, and write a custom plugin that pulls from Plausible Analytics to display changelog.com’s real-time visitor count.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=Ai6HquEyEak",
          "publishedOn": "2021-09-27T21:42:00.000Z",
          "wordCount": 25,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Let's use xbar to show changelog.com's real-time visitors in the menu bar"
        },
        {
          "description": "Eugene Yan, in a post titled The first rule of machine learning: start without machine learning:\nApplying machine learning effectively is tricky. You need data. You need a robust pipeline to support your data flows. And most of all, you need high-quality labels. As a result, most of the time, my first iteration doesn’t involve machine learning at all.\nEugene is stating the obvious with this post, but hey sometimes you just gotta state it. What’s even more interesting to me is how nicely the format generaliz…",
          "link": "https://eugeneyan.com/writing/first-rule-of-ml/",
          "publishedOn": "2021-09-27T14:57:00.000Z",
          "wordCount": 1624,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The first rule of X: start without X"
        },
        {
          "description": "Datree is a CLI tool that supports Kubernetes admins in their roles, by preventing developers from making errors in Kubernetes configurations that can cause clusters to fail in production. Our CLI tool is open source, enabling it to be supported by the Kubernetes community.\nIt’s far more effective than manual processes, such as sending an email to a slew of developers, begging them to set various limits, which likely falls on deaf ears because developers are already overwhelmed.\nIn addition the CIL, Datree …",
          "link": "https://github.com/datreeio/datree",
          "publishedOn": "2021-09-27T14:05:00.000Z",
          "wordCount": 1125,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Datree is a CLI to ensure K8s manifests and Helm charts follow best practices"
        },
        {
          "description": "In this post, I cover in a step by step manner how to do software estimation for project bids where there is limited clarity and a lot of ambiguity. I cover how we can use an uncertainty factor to cover the unknowns, questions/things to ask/consider at each step of the software estimation process, and some practical advice. This process is based on estimates I have done for multiple projects in the last couple of years.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2021/09/23/doing-software-estimation-within-constraints-of-hofstadters-law-and-parkinsons-law/",
          "publishedOn": "2021-09-27T13:18:00.000Z",
          "wordCount": 3136,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "My software estimation process"
        },
        {
          "description": "This week we’re talking with Evan Weaver about Fauna — the database for a new generation of applications. Fauna is a transactional database delivered as a secure and scalable cloud API with native GraphQL. It’s the first implementation of its kind based on the Calvin paper as opposed to Spanner. We cover Evan’s history leading up to Fauna, deep details on the Calvin algorithm, the CAP theorem for databases, what it means for Fauna to be temporal native, applications well suited for Fauna, and what’s to come…",
          "link": "https://changelog.com/podcast/461",
          "publishedOn": "2021-09-24T21:30:00.000Z",
          "wordCount": 524,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 461: Fauna is rethinking the database"
        },
        {
          "description": "This is our second Kaizen episode, where Adam, Jerod &amp; Gerhard talk about changelog.com improvements since episode 10. OK, so Gerhard deleted the DNS API token. Not only did he take the time to understand how that happened, so that he could actually learn from his mistake, but now we have a system in place so that we can share learnings from incidents. By the way, these are publicly available in our #incidents Slack channel.\nA great and unexpected thing that happened since we recorded this, is Jerod fix…",
          "link": "https://changelog.com/shipit/20",
          "publishedOn": "2021-09-24T20:00:00.000Z",
          "wordCount": 633,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 20: Kaizen! Five incidents later"
        },
        {
          "description": "Chris McCord gives a deep history on Phoenix LiveView, going all the way back to the state of Ruby on Rails in 2013 up to the present. A 30-minute read! (LiveView-based uploads looks particularly interesting to me, since I’m rewriting how our uploads work at the moment.)\nDiscuss on Changelog News",
          "link": "https://fly.io/blog/how-we-got-to-liveview/",
          "publishedOn": "2021-09-24T18:50:00.000Z",
          "wordCount": 3590,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How we got to LiveView"
        },
        {
          "description": "Mitch and Andrew from the 1Password team talk with Amal and Nick about the company’s transition to Electron and web technologies, and how the company utilized its existing web stack to shape the future of its desktop experience.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance…",
          "link": "https://changelog.com/jsparty/194",
          "publishedOn": "2021-09-24T16:00:00.000Z",
          "wordCount": 456,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 194: 1Password is all in on its web stack"
        },
        {
          "description": "This is part 1 of a 5-part series on learning Astro, a new-kid-on-the-block static site builder that’s capturing the hearts of web developers due to its Bring Your Own Framework (BYOF) approach and Zero Emitted JS (ZEJS?) by default.\nThroughout this series, I’ll walk you, step-by-step, through building an Astro-based blog(codenamed: Astro-Ink). You’ll discover more of Astro, its benefits, and super-interesting constructs and patterns that Astro brings to the table.\nDiscuss on Changelog News",
          "link": "https://aalam.in/blog/astro-get-up-and-running",
          "publishedOn": "2021-09-24T13:31:00.000Z",
          "wordCount": 2678,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Get up & running with Astro"
        },
        {
          "description": "Ever wonder how new features get added to the go command? Or where tools like gopls come from? Well, there’s an open team that handles just those things.\nJust like the programming language itself, many of the tools that Go engineers use everyday are discussed and developed in the open. In this episode we’ll talk about this team, how it started, where it’s going, and how you can get involved.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\n…",
          "link": "https://changelog.com/gotime/198",
          "publishedOn": "2021-09-23T20:30:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 198: The little known team that keeps Go going"
        },
        {
          "description": "This is a continuation of bashtop and bpytop only in C++. Linux today, but macOS &amp; BSD are planned.\n\nDiscuss on Changelog News",
          "link": "https://github.com/aristocratos/btop",
          "publishedOn": "2021-09-23T20:19:01.000Z",
          "wordCount": 2885,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "BTOP++ is a power resource monitor for Linux"
        },
        {
          "description": "Craig Kerstiens on the little wins coming in Postgres 14, which is scheduled for the end of September:\nPostgres is, and for some time will continue to be, the first database I turn to. As Postgres focuses on the little things, it just deepens my commitment to it. Why look elsewhere when the bond just grows over time? So today I wanted to call some extra attention to those little things, the ones that don’t get the spotlight, but simply make a developer’s life better.\nHe goes on to highlight the JSON syntax …",
          "link": "https://blog.crunchydata.com/blog/postgres-14-its-the-little-things",
          "publishedOn": "2021-09-23T19:30:00.000Z",
          "wordCount": 1177,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Postgres 14: it's the little things"
        },
        {
          "description": "Trisha Gee writes (because Someone Is Wrong On The Internet):\nThe problem is not that we shouldn’t write readable code. Of course we should aim to write readable code, if only for our own poor selves further down the line (there is no one less capable of reading my code the following week than me). The problem is that these two issues are not mutually exclusive. It’s not “write readable code” or “learn to read code”. That’s like saying, “I’m going to drive really economically so I don’t need to put petrol i…",
          "link": "https://trishagee.com/2020/09/07/reading-code-is-a-skill/",
          "publishedOn": "2021-09-23T13:57:00.000Z",
          "wordCount": 3361,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reading code is a skill"
        },
        {
          "description": "I’ve never gone full mouseless (nor do I necessarily recommend it), but there’s extreme productivity wins to be mined by keeping your hands on the home row as much as possible.\nBuilding a development environment with the shell as a keystone offers multiple benefits. You can use tools that fit nicely with each other, you can customize everything depending on your own needs, and the biggest of all, you can control your entire development environment with your keyboard. This can save a lot of cognitive energy …",
          "link": "https://www.smashingmagazine.com/2021/09/mouseless-development-environment/",
          "publishedOn": "2021-09-23T13:10:00.000Z",
          "wordCount": 4144,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to build your own mouseless development environment"
        },
        {
          "description": "Dan Moren writing for Six Colors:\nSafari Keyword Search is a little tool that allows you to define shortcuts for searching specific sites. For example, you could type “imdb George Clooney” to be taken directly to the IMDb search results for George Clooney, or “w iPhone 13” to go straight to the Wikipedia page for the iPhone 13. You can also define your own shortcuts, so, for example, I’ve defined “sc” as a Google search limited to sixcolors.com, which helps me quickly turn up articles here…\nOn iOS 15, Mobil…",
          "link": "https://sixcolors.com/post/2021/09/safari-keyword-search-hits-2-0-comes-to-ios/",
          "publishedOn": "2021-09-22T14:35:00.000Z",
          "wordCount": 472,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Safari Keyword Search hits 2.0, comes to iOS"
        },
        {
          "description": "Nice is a highly customizable and lightweight framework for crafting CLI apps.\nNice respects idiomatic Go code and focuses to be clear, efficient and easy to write and maintain.\nYou can use it as a full-featured non-opinionated framework or use any nice packages as stand-alone libraries.\nI’m a big fan of the similar projects section in the README. Classy!\n\nDiscuss on Changelog News",
          "link": "https://github.com/SuperPaintman/nice",
          "publishedOn": "2021-09-22T13:47:00.000Z",
          "wordCount": 693,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A highly customizable and lightweight framework for crafting Go CLIs"
        },
        {
          "description": "Will McGugan is a full-stack developer and Python expert who is offering up free reviews for any/all qualifying open source projects.What a great idea/service to the community!\nThe reviews will focus on API design and general architection of your project with a view to making them a) more maintainable b) future proof and c) user friendly, but will avoid anything that a linter could do for you. Reviews are intended to be constructive and hopefully give advice you can act on, but are in no way a “grade”.\nI wo…",
          "link": "https://github.com/willmcgugan/codereviews",
          "publishedOn": "2021-09-21T19:05:00.000Z",
          "wordCount": 686,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Free code reviews for open source Python projects"
        },
        {
          "description": "As you start developing an AI/ML based solution, you quickly figure out that you need to run workflows. Not only that, you might need to run those workflows across various kinds of infrastructure (including GPUs) at scale. Ville Tuulos developed MetaFlow while working at Netflix to help data scientists scale their work. In this episode, Ville tells us a bit more about MetaFlow, his new book on data science infrastructure, and his approach to helping scale ML/AI work.\nDiscuss on Changelog News\nJoin Changelog…",
          "link": "https://changelog.com/practicalai/150",
          "publishedOn": "2021-09-21T14:45:00.000Z",
          "wordCount": 387,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 150: From notebooks to Netflix scale with MetaFlow"
        },
        {
          "description": "Encore now supports the two most highly requested features from our users!\nNative support for building REST APIs\nSupport for ORMs and other database query helpers\nEncore v0.17 also comes with improvements to authentication, and lots of minor improvements and bug fixes!\nDiscuss on Changelog News",
          "link": "https://encore.dev/blog/encore-v0.17",
          "publishedOn": "2021-09-21T14:00:00.000Z",
          "wordCount": 736,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Time to REST — Encore v0.17 is released"
        },
        {
          "description": "Alexey Milovidov, announcing the formation of a (VC funded) corporation around ClickHouse, an open source analytics DBMS:\nToday I’m happy to announce ClickHouse Inc., the new home of ClickHouse. The development team has moved from Yandex and joined ClickHouse Inc. to continue building the fastest (and the greatest) analytical database management system. The company has received nearly $50M in Series A funding led by Index Ventures and Benchmark with participation by Yandex N.V. and others. I created ClickHo…",
          "link": "https://clickhouse.com/blog/en/2021/clickhouse-inc/",
          "publishedOn": "2021-09-20T19:33:00.000Z",
          "wordCount": null,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Introducing ClickHouse, Inc."
        },
        {
          "description": "Seed is a Rust framework that uses an Elm-like architecture to help you build fast and reliable web apps that run on WebAssembly. Here’s why you might want to use it:\nSeed allows you to develop the front-end with all the benefits of Rust, meaning speed, safety, and too many more things to count.\nThe Seed templating system uses a macro syntax that makes Rustaceans feel right at home. This means linting, formatting, and commenting will work, and it’s all in Rust. This is opposed to a JSX-like syntax that reli…",
          "link": "https://github.com/seed-rs/seed",
          "publishedOn": "2021-09-20T18:45:00.000Z",
          "wordCount": 1069,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Seed – build your frontend in Rust"
        },
        {
          "description": "Following thanks to all contributors, the blog notes:\nMost applications that worked with OpenSSL 1.1.1 will still work unchanged and will simply need to be recompiled (although you may see numerous compilation warnings about using deprecated APIs). Some applications may need to make changes to compile and work correctly, and many applications will need to be changed to avoid the deprecations warnings.\nAnd points out a couple of new features:\nOpenSSL 3.0 introduces a number of new concepts that application d…",
          "link": "https://www.openssl.org/blog/blog/2021/09/07/OpenSSL3.Final/",
          "publishedOn": "2021-09-20T17:51:00.000Z",
          "wordCount": 661,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "OpenSSL 3.0: API and license changes"
        },
        {
          "description": "After seeing TODO or die in Rust here a few days ago, I wanted to have the same feature available in Python. No reason this should only be available in Ruby and Rust. Python deserved better TODOs too!\nDiscuss on Changelog News",
          "link": "https://github.com/achedeuzot/py-todo-or-die",
          "publishedOn": "2021-09-20T16:58:00.000Z",
          "wordCount": 742,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Todo or Die - Python Edition"
        },
        {
          "description": "This post is a confession of an “egocentric maniac” (his words) and how damaging code review can be:\nThis review I kicked off the article with? I didn’t send it. Instead I gave the guy a couple of comments and politely asked to fix a couple of things. No big deal if the code’s not good, I can fix it myself it I need to. But I can’t fix the psyche of a guy broken by dozens of harsh reviews.\nMy personality today isn’t my disease. It’s a disease of the whole industry, at least in Russia. Our mentality is predi…",
          "link": "https://habr.com/en/post/440736/",
          "publishedOn": "2021-09-20T16:08:00.000Z",
          "wordCount": 1828,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I ruin developers’ lives with my code reviews and I'm sorry"
        },
        {
          "description": "This week we’re joined by Adam Jacob, CEO of System Initiative and Co-Founder of Chef, about open source business models and the model he thinks is the right one to choose, his graceful exit from Chef and some of the details behind Chef’s acquisition in 2020 for $220 million…in cash, and how his perspective on open source has or has not changed as a result. Adam also shared as much stealth mode details as he could about System Initiative.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get c…",
          "link": "https://changelog.com/podcast/460",
          "publishedOn": "2021-09-17T20:30:00.000Z",
          "wordCount": 545,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 460: The business model of open source"
        },
        {
          "description": "Russel Goldenberg &amp; Caitlyn Ralph from The Pudding join Amelia &amp; Nick to talk about how they create data-driven, interactive articles, how the team works on both The Pudding’s data journalism articles and Polygraph’s client work. We also dive into how the team works with contractors and how the company manages itself using a Holocratic method.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and P…",
          "link": "https://changelog.com/jsparty/193",
          "publishedOn": "2021-09-17T16:30:00.000Z",
          "wordCount": 447,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 193: Puddin' together cool data-driven essays"
        },
        {
          "description": "Chris Fidao:\nI’ve been using AWS “professionally” since about 2015. In that time, I’ve made lots of mistakes.\nOther than occasionally deleting production data, the mistakes all arose from ignorance - there’s so much to know about AWS that it’s easy to miss something important.\nHere’s a collection of the most commonly missed things when using AWS with Laravel Forge!\nLearning from your mistakes is powerful. Learning from other people’s mistakes can be just as powerful without the major drawback of, you know, …",
          "link": "https://laravel-news.com/aws-mistakes",
          "publishedOn": "2021-09-17T15:12:00.000Z",
          "wordCount": 1199,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mistakes I've made in AWS"
        },
        {
          "description": "This week Emile Vauge, founder &amp; CEO of Traefik, joins Gerhard to share a story that started as a solution to a 2000 microservices challenge, the real-world implications of shipping many times a day for years, and the difficulties of sustaining an inclusive and healthy open-source community while building a product company.\nWorking every day on keeping the open-source community in sync with the core team was an important lesson. The second learning was around big changes between major versions.\nThe jour…",
          "link": "https://changelog.com/shipit/19",
          "publishedOn": "2021-09-17T14:25:00.000Z",
          "wordCount": 536,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 19: Real-world implications of shipping many times a day"
        },
        {
          "description": "At the moment, there is only a dozen emoji sets, most of them from big tech companies. These emoji are visually adapted to the respective appearance of their software platforms. In addition, the usage rights are often very restrictive (e.g. the terms of use of Apple’s emoji).\nThat is why we have developed OpenMoji as the first open source and independent emoji system to date. When designing the OpenMoji system, we have developed visual guidelines that are not linked to a specific branding. In addition, our …",
          "link": "https://openmoji.org/",
          "publishedOn": "2021-09-17T13:51:00.000Z",
          "wordCount": 680,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "OpenMoji – open source emojis for the rest of us"
        },
        {
          "description": "Natalie sits down with Go book authors Bill Kennedy &amp; Sau Sheong Chang to discuss the ins and outs of writing (and reading) books about Go!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Move fast, even in big codebases. Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to you and your organization: find example code, explore and read code, debug is…",
          "link": "https://changelog.com/gotime/197",
          "publishedOn": "2021-09-16T18:20:00.000Z",
          "wordCount": 388,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 197: Books that teach Go"
        },
        {
          "description": "Wise words from Rach Smith:\nWhat I’ve learnt through experience is that the number of languages I’ve learned or the specific frameworks I’ve gained experience with matters very little. What actually matters is my ability to up-skill quickly and effectively. My success so far has nothing to do with the fact I know React instead of Vue, or have experience with AWS and not Azure. What has contributed to my success is the willingness to learn new tools as the need arises.\nDiscuss on Changelog News",
          "link": "https://rachsmith.com/i-completely-ignored-the-front-end-development-scene-for-6-months-it-was-fine/",
          "publishedOn": "2021-09-16T15:05:00.000Z",
          "wordCount": 599,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I completely ignored the front end development scene for 6 months. It was fine"
        },
        {
          "description": "The author of this site handed a neural network brief text descriptions of a bunch of movies and let it generate image that represent each. Read how he did it or just have fun trying to guess the movie titles from the images. Harder than I thought it’d be!\n\nDiscuss on Changelog News",
          "link": "https://noahveltman.com/aimovies/",
          "publishedOn": "2021-09-16T14:15:00.000Z",
          "wordCount": 271,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "AI movie posters"
        },
        {
          "description": "In this article, three experts discuss some of the key findings of the State of Technical Debt 2021 report including the impact of technical debt on engineering teams, the pros and cons of dealing with maintenance work continuously, the future of technical debt, and what each engineering teams can do to communicate the importance of dealing with technical debt to leadership.\nRemember, not all tech debt is bad, but even good tech debt has its ramifications. Solid insights here.\nDiscuss on Changelog News",
          "link": "https://www.infoq.com/articles/reduce-technical-debt/",
          "publishedOn": "2021-09-15T15:47:00.000Z",
          "wordCount": 5688,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Technical debt isn't technical: what companies can do to reduce technical debt"
        },
        {
          "description": "Here’s how Tom Payne describes his project:\nchezmoi is a popular dotfile manager (currently over 4.5K stars on GitHub and increasing quickly). chezmoi helps you get your prefered environment synchronized across multiple machines (e.g. your home desktop, your work laptop, and a temporary development container in the cloud) while easily coping with differences from machine to machine and keeping all your secrets safe either with your password manager or encryption. Using chezmoi feels very much like using git…",
          "link": "https://github.com/twpayne/chezmoi",
          "publishedOn": "2021-09-15T14:52:00.000Z",
          "wordCount": 1627,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Easy, secure dotfiles management with chezmoi"
        },
        {
          "description": "Any AI play that lacks an underlying data strategy is doomed to fail, and a big part of any data strategy is labeling. Michael, from Label Studio, joins us in this episode to discuss how the industry’s perception of data labeling is shifting. We cover open source tooling, validating labels, and integrating ML/AI models in the labeling loop.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRudderStack – Smart customer data pipeline …",
          "link": "https://changelog.com/practicalai/149",
          "publishedOn": "2021-09-14T20:30:00.000Z",
          "wordCount": 357,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 149: Trends in data labeling"
        },
        {
          "description": "A (short) must-read piece from rachelbythebay:\n“Everyone knows” that code is something you type into a computer, that gets interpreted by a computer, and is run by a computer. But that’s not really the end of it. Before that, it’s being “run” on whoever’s working on it. After that, it’s “running” on whoever’s digging into it to fix a bug or add some feature.\nYou can throw all kinds of wicked, nasty, complicated, Klein-bottle-wannabe tricks into code and the computer will shrug and slog on through it.\nTry fe…",
          "link": "https://rachelbythebay.com/w/2021/09/05/clever/",
          "publishedOn": "2021-09-14T14:51:00.000Z",
          "wordCount": 478,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Code runs on people. Please keep it simple."
        },
        {
          "description": "This is phoboslab’s entry in this year’s JS 13k Games competition. Stunning what you can accomplish with so little. View the source right here and play the game (desktop only) right here.\n\nDiscuss on Changelog News",
          "link": "https://js13kgames.com/entries/q1k3",
          "publishedOn": "2021-09-14T13:48:00.000Z",
          "wordCount": 181,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An homage to Quake in 13kb of JS"
        },
        {
          "description": "I read about KDL (pronounced “cuddle”) over the weekend. Color me impressed!\nKat (and others) put a lot of thought into this.\nKDL is a document language with xml-like semantics that looks like you’re invoking a bunch of CLI commands! It’s meant to be used both as a serialization format and a configuration language, much like JSON, YAML, or XML.\nCheck out the FAQ for all the common objections (like why not YAML or TOML or ETC) as well as a note about the XKCD comic you’re probably thinking about. Here’s hopi…",
          "link": "https://kdl.dev/",
          "publishedOn": "2021-09-13T22:12:00.000Z",
          "wordCount": 1448,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The KDL document language"
        },
        {
          "description": "Chris Coyier on some of the new(ish) CSS compilers (such as Assembler) and how they’re flipping the script:\nThe popular Tailwind framework supports it. It kind of flips the mental model of Tailwind on its head, to me. Rather than providing a huge pile of CSS utility classes to use — then “purging” what is unused — it only creates what it needs to begin with.\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/just-in-time-css/",
          "publishedOn": "2021-09-13T14:14:00.000Z",
          "wordCount": 2121,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "“Just in Time” CSS"
        },
        {
          "description": "The latest Phoenix release ditches webpack and npm for esbuild and… nothing?\nOf course, these are just the defaults — docs for Elixir’s esbuild clearly state that NPM is still supported and you can always pass --no-assets and do things 100% your way. But it’s easy to underestimate the power of defaults, especially those that cover area outside of target audience’s expertise — which is the case of Phoenix devs and JS bundlers.\nIn this post, the author lays out how they stitched together an esbuild + npm setu…",
          "link": "https://cloudless.studio/wrapping-your-head-around-assets-in-phoenix-1-6",
          "publishedOn": "2021-09-13T13:26:00.000Z",
          "wordCount": null,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wrapping your head around assets in Phoenix 1.6"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": [
        {
          "description": "In the past, we’ve had blog posts every two years, describing the various building blocks of openpilot that work together to drive your car. With each iteration, you’ll notice that openpilot has simultaneously become much simpler (service/car abstraction, end-to-end) and much more complex (infrastructure, testing, models), while getting undeniably better. It’s been two years since that last post, so in keeping with tradition, here we go - how does openpilot work?\nHow Does openpilot Work?\nopenpilot is comma’…",
          "link": "https://blog.comma.ai/openpilot-services/",
          "publishedOn": "2021-10-11T18:00:00.000Z",
          "wordCount": 1598,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "How openpilot works in 2021"
        },
        {
          "description": "In the past, we’ve had blog posts every two years, describing the various building blocks of openpilot that work together to drive your car. With each iteration, you’ll notice that openpilot has simultaneously become much simpler (service/car abstraction, end-to-end) and much more complex (infrastructure, testing, models), while getting undeniably better. It’s been two years since that last post, so in keeping with tradition, here we go - how does openpilot really work?\nHow Does openpilot Really Work?\nopenp…",
          "link": "https://blog.comma.ai/openpilot-tour/",
          "publishedOn": "2021-09-22T18:00:00.000Z",
          "wordCount": 1475,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "How openpilot works - Take 3"
        },
        {
          "description": "A getting started guide for openpilot development\nTime required: ~30 minutes\nSet up your development environment (Ubuntu 20.04)\n# clone openpilot into your home directory\ncd ~\ngit clone --recurse-submodules https://github.com/commaai/openpilot.git\n\n# setup ubuntu environment\nopenpilot/tools/ubuntu_setup.sh\n\n# build openpilot\ncd openpilot &amp;&amp; scons -j$(nproc)\n\n\nTODO: Add Windows and Mac instructions.\nRun a route replay and ui\nTODO: you might have to log in to access the demo route. see the replay read…",
          "link": "https://blog.comma.ai/turning-the-speed-blue/",
          "publishedOn": "2021-09-14T18:00:00.000Z",
          "wordCount": 522,
          "sourceHref": "https://blog.comma.ai/feed.xml",
          "sourceTitle": "comma.ai blog",
          "title": "Turning the speed blue"
        }
      ]
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "My life has always involved centering the voices of those historically marginalized in order to foster equitable communities. Growing up, I lived in a small suburb just outside of Cleveland, Ohio and I was fortunate enough to attend Laurel School, an all-girls school focused on encouraging young women to think critically and solve difficult world problems. But my lived experience at school was so different from kids who lived even on my same street. I was grappling with watching families around me contend w…",
          "link": "https://blog.google/technology/ai/what-made-me-want-fight-fair-ai/",
          "publishedOn": "2021-10-08T15:00:00.000Z",
          "wordCount": 1895,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "What made me want to fight for fair AI"
        },
        {
          "description": "Over guacamole and corn chips at a party, a friend mentions that her favorite phone game uses augmented reality. Another friend points her phone at the host and shouts, \"Watch out—a t-rex is sneaking up behind you.\" Eager to join the conversation, you blurt, \"My blender has an augmented reality setting.\"\n\n\nIf only you had looked up augmented reality in Google's Machine Learning Glossary, which defines over 460 terms related to artificial intelligence, you’d know what the heck your friends are talking about.…",
          "link": "https://blog.google/technology/ai/ml-glossary-five-years-new-language/",
          "publishedOn": "2021-10-06T19:00:00.000Z",
          "wordCount": 978,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "The ML Glossary: Five years of new language"
        },
        {
          "description": "Today, there’s more information accessible at people’s fingertips than at any point in human history. And advances in artificial intelligence will radically transform the way we use that information, with the ability to uncover new insights that can help us both in our daily lives and in the ways we are able to tackle complex global challenges.\nAt our Search On livestream event today, we shared how we’re bringing the latest in AI to Google’s products, giving people new ways to search and explore information…",
          "link": "https://blog.google/products/search/how-ai-making-information-more-useful/",
          "publishedOn": "2021-09-29T17:45:00.000Z",
          "wordCount": 1676,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "How AI is making information more useful"
        },
        {
          "description": "Look around you right now and consider everything that was created by an inventor. The computer you’re reading this article on, the internet necessary to load this article, the electricity that powers the screen, even the coffee maker you used this morning. \n\nTo recognize the incredible contributions of those inventors and the benefits they bring to our everyday life, the National Inventors Hall of Fame has inducted a new group of honorees every year since 1973. In this year’s combined inductee class of 202…",
          "link": "https://blog.google/technology/ai/marian-croak-inventors-hall-fame/",
          "publishedOn": "2021-09-21T14:30:00.000Z",
          "wordCount": 1777,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Googler Marian Croak is now in the Inventors Hall of Fame"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "In the curl project we keep track of and say thanks to every single contributor. That includes persons who report bugs or security problems, who run infrastructure for us, who assist in debugging or fixing problems as well as those who author code or edit the website. Those who have contributed to make curl to &#8230; Continue reading One new contributor every 3.4 days &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/10/04/one-new-contributor-every-3-4-days/",
          "publishedOn": "2021-10-04T20:53:21.000Z",
          "wordCount": 1059,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "One new contributor every 3.4 days"
        },
        {
          "description": "For some TLS connections you want the secrets you exchange over them to remain private for decades to come. So what if someone in the future produces a computer system that can crack all the common current encryption algorithms in no time and they already have past secret communications stored? Such a possible future computer &#8230; Continue reading Post-Quantum curl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/10/04/post-quantum-curl/",
          "publishedOn": "2021-10-04T06:08:27.000Z",
          "wordCount": 1041,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Post-Quantum curl"
        },
        {
          "description": "I work a lot on my own. I mean, I plan a lot of what to do on a daily basis myself, I execute a lot of it myself and I push my code and changes to various git repositories, often solo. I work quite a lot. In a lot of the cases, I work &#8230; Continue reading My weekly reports &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/30/my-weekly-reports/",
          "publishedOn": "2021-09-30T14:57:22.000Z",
          "wordCount": 976,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "My weekly reports"
        },
        {
          "description": "I&#8217;ve been traveling this road for a while. Here&#8217;s my collection of 15 of the most common mistakes and issues people will run into when writing applications and services that use libcurl. I&#8217;ve also done recorded presentations on this topic that you can watch if you prefer that medium. Most of these issues are shared &#8230; Continue reading Common mistakes when using libcurl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/27/common-mistakes-when-using-libcurl/",
          "publishedOn": "2021-09-27T07:28:34.000Z",
          "wordCount": 2281,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Common mistakes when using libcurl"
        },
        {
          "description": "September 25, 2001 is the official release date for Mac OS X 10.1. Exactly twenty years ago today. Mac OS X 10.1 This was the first macOS release from Apple that bundled curl. It was a complete surprise to me as well when I realized this had happened. Nobody had told me about it ahead &#8230; Continue reading curl&#8217;s first twenty years on the mac &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/25/curls-first-twenty-years-on-the-mac/",
          "publishedOn": "2021-09-24T22:02:28.000Z",
          "wordCount": 1642,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl’s first twenty years on the mac"
        },
        {
          "description": "In April 2019 we launched the current curl bug-bounty program under the Hackerone umbrella and from my point of view it has been nothing but a raging success. Until today we&#8217;ve paid almost 17,000 USD in rewards and and the average payment amount has been increasing all the time. The reward money in this program &#8230; Continue reading curl joins the reborn IBB bug-bounty program &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/23/curl-joins-the-reborn-ibb-bug-bounty-program/",
          "publishedOn": "2021-09-23T05:56:12.000Z",
          "wordCount": 1330,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl joins the reborn IBB bug-bounty program"
        },
        {
          "description": "Within 24 hours of the previous release, 7.79.0, we got a bug-report filed that identified a pretty serious regression in the HTTP/2 code that we deemed required a fairly quick fix instead of waiting a full release cycle for it. So here&#8217;s 7.79.1 with several bug-fixes that we managed to queue up and merge in &#8230; Continue reading curl 7.79.1 &#8211; patched up and ready &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/22/curl-7-79-1-patched-up-and-ready/",
          "publishedOn": "2021-09-22T06:22:43.000Z",
          "wordCount": 1316,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.79.1 – patched up and ready"
        },
        {
          "description": "WebSockets has been one of the most requested features and protocol to add to curl and libcurl in the annual user survey. Repeatedly, over the last few years. WebSockets is not perfectly suitable to be done by libcurl since it&#8217;s not really an upload or download transfer protocol, but is more something like &#8220;a TCP &#8230; Continue reading You wanted WebSockets? &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/16/you-wanted-websockets/",
          "publishedOn": "2021-09-16T20:57:46.000Z",
          "wordCount": 1139,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "You wanted WebSockets?"
        },
        {
          "description": "The curl factory has once again cranked out a new curl release. Release presentation Numbers the 202nd release3 changes56 days (total: 8,580)128 bug-fixes (total: 7,270)186 commits (total: 27,651)0 new public libcurl function (total: 85)0 new curl_easy_setopt() option (total: 290)0 new curl command line option (total: 242)62 contributors, 25 new (total: 2,484)41 authors, 16 new (total: &#8230; Continue reading curl 7.79.0 &#8211; secure local cookies &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/15/curl-7-79-0-secure-local-cookies/",
          "publishedOn": "2021-09-15T06:24:59.000Z",
          "wordCount": 1488,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.79.0 – secure local cookies"
        },
        {
          "description": "There&#8217;s plan for version 8 being forged! Let me just take you back a bit in time first.. The early days When we first created libcurl, we bumped the major version number of the project from the previous version 6 to version 7. In late summer of 2000 we shipped curl and libcurl 7.1 as &#8230; Continue reading Heading towards curl eight &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/09/13/heading-towards-curl-eight/",
          "publishedOn": "2021-09-13T10:22:42.000Z",
          "wordCount": 1658,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Heading towards curl eight"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "In this post, we will discuss our recent work on neural graph diffusion networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/graph-neural-networks-as-neural-diffusion-pdes",
          "publishedOn": "2021-10-11T12:26:00.869Z",
          "wordCount": 2888,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Graph Neural Networks as Neural Diffusion PDEs"
        },
        {
          "description": "Sharing learnings from the first algorithmic bias bounty challenge",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/learnings-from-the-first-algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-10-11T12:26:00.619Z",
          "wordCount": 1416,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings from the first algorithmic bias bounty challenge"
        },
        {
          "description": "As part of this year’s DEFCON AI Village, we’re trying something radical by introducing the industry’s first algorithmic bias bounty competition.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/algorithmic-bias-bounty-challenge",
          "publishedOn": "2021-10-11T12:26:00.603Z",
          "wordCount": 885,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Introducing Twitter’s first algorithmic bias bounty challenge"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-09-14T12:25:23.132Z",
          "wordCount": 2283,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-09-14T12:25:23.118Z",
          "wordCount": 3223,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-09-14T12:25:23.104Z",
          "wordCount": 1793,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-09-14T12:25:22.872Z",
          "wordCount": 1452,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "How Twitter moved from a home grown logging platform to the commercially available Splunk and the challenges we’ve encountered along the way.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/logging-at-twitter-updated",
          "publishedOn": "2021-09-14T12:25:22.860Z",
          "wordCount": 2391,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Logging at Twitter: Updated"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-09-14T12:25:22.838Z",
          "wordCount": 2221,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "Describe how the Observability team applied Flame graphs to a novel use case (internal usage of Twitter’s time series database) outside of their typical application",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/applying-flame-graphs-outside-of-performance-analysis",
          "publishedOn": "2021-09-13T12:28:03.910Z",
          "wordCount": 1292,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Applying flame graphs outside of performance analysis"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "ul.lst-kix_do14k59gl4sr-0{list-style-type:none}ul.lst-kix_do14k59gl4sr-1{list-style-type:none}ul.lst-kix_do14k59gl4sr-2{list-style-type:none}ul.lst-kix_do14k59gl4sr-3{list-style-type:none}.lst-kix_u927wi79aeqb-0>li:before{content:\"-  \"}.lst-kix_u927wi79aeqb-1>li:before{content:\"-  \"}.lst-kix_u927wi79aeqb-2>li:before{content:\"-  \"}.lst-kix_do14k59gl4sr-2>li:before{content:\"-  \"}ul.lst-kix_do14k59gl4sr-4{list-style-type:none}.lst-kix_u927wi79aeqb-5>li:before{content:\"-  \"}ul.lst-kix_do14k59gl4sr-5{list-style-…",
          "link": "https://googleprojectzero.blogspot.com/2021/09/fuzzing-closed-source-javascript.html",
          "publishedOn": "2021-09-14T17:14:00.000Z",
          "wordCount": 3272,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "Fuzzing Closed-Source JavaScript Engines with Coverage Feedback"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "We explain how a bug bounty program identifies vulnerabilities, discuss the program’s benefits, and detail its challenges.",
          "link": "https://www.hackerone.com/new-program-launch/bug-bounty-benefits-why-you-need-bug-bounty-program",
          "publishedOn": "2021-10-06T17:00:00.000Z",
          "wordCount": 1340,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Bug Bounty Benefits | Why You Need a Bug Bounty Program"
        },
        {
          "description": "​​​​​​​We explain how a bug bounty program identifies vulnerabilities, discuss the program’s benefits, and detail its challenges.",
          "link": "https://www.hackerone.com/bounty/bug-bounty-benefits-why-you-need-bug-bounty-program",
          "publishedOn": "2021-10-06T16:50:00.000Z",
          "wordCount": 1313,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Bug Bounty Benefits | Why You Need a Bug Bounty Program"
        },
        {
          "description": "Security leaders have a lot on their plates in these later stages of the continuing COVID-19 pandemic. In a 2021 survey by Gartner, over three-quarters (76%) of respondents reported increased demand for new digital products or services during the pandemic — and 83% expected this demand to continue to increase. This imperative for transformation has been coming straight from the top: 69% of boards report accelerating digital business initiatives in response to COVID-19.",
          "link": "https://www.hackerone.com/company-news/navigating-safe-successful-return-office-5-tips-security-leaders",
          "publishedOn": "2021-10-04T16:50:00.000Z",
          "wordCount": 1937,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Navigating a Safe, Successful Return to Office: 5 Tips for Security Leaders"
        },
        {
          "description": "Are you wondering about vulnerability remediation? We give you a step-by-step guide to addressing vulnerabilities in your system.",
          "link": "https://www.hackerone.com/vulnerability-remediation-step-step-guide",
          "publishedOn": "2021-09-30T17:10:10.000Z",
          "wordCount": 1183,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Remediation | A Step-by-Step Guide"
        },
        {
          "description": "Last week, HackerOne held its fifth annual one-of-a-kind global Security@ conference featuring the best-kept secret in cybersecurity—hackers.",
          "link": "https://www.hackerone.com/ethical-hacker/how-hackers-best-kept-secret-cybersecurity-can-help-your-organization-protect-its",
          "publishedOn": "2021-09-28T15:50:00.000Z",
          "wordCount": 1164,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hackers—the Best Kept Secret in Cybersecurity—Can Help Your Organization Protect its Assets and Improve Security"
        },
        {
          "description": "Widespread digital transformation means increased cloud security risk. Learn how human intelligence—hacker-powered security—can help your organization defend against new attack vectors, mitigate risk, and improve cloud security.",
          "link": "https://www.hackerone.com/application-security/top-5-cloud-security-risks-how-hacker-powered-security-can-help",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 1012,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "The Top 5 Cloud Security Risks: How Hacker-Powered Security Can Help"
        },
        {
          "description": "Time is not kind to the security of an organization. The longer you wait, the weaker you are. The more things drag out, the higher the risk of breach. Delays in responding to threats, incidents, and compromises mean exponential cost increases. \n\nYour organization doesn’t have to be completely secure (which is not even possible), but it has to be more secure than the other targets of the adversary. You must make it unattractive or at least very costly for anyone to try to compromise your digital systems.",
          "link": "https://www.hackerone.com/from-the-ceo/time-issue-your-own-cyber-executive-order",
          "publishedOn": "2021-09-20T15:00:00.000Z",
          "wordCount": 1178,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Time to Issue Your Own Cyber Executive Order"
        },
        {
          "description": "Curious about vulnerability testing techniques? We explain processes such as vulnerability assessments, vulnerability scanning, and penetration testing.",
          "link": "https://www.hackerone.com/vulnerability-management/vulnerability-testing-best-techniques-assessing-risks",
          "publishedOn": "2021-09-17T19:00:00.000Z",
          "wordCount": 1455,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Testing | Best Techniques for Assessing Risks"
        },
        {
          "description": "Curious about vulnerability testing techniques? We explain processes such as vulnerability assessments, vulnerability scanning, and penetration testing.",
          "link": "https://www.hackerone.com/vulnerability-testing-best-techniques-assessing-risks",
          "publishedOn": "2021-09-17T19:00:00.000Z",
          "wordCount": 1421,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Vulnerability Testing | Best Techniques for Assessing Risks"
        },
        {
          "description": "Challenges for Traditional Security Teams \n\nTraditional security teams are typically reactive. They’re seen as change-resistant, out of sync with development, and unable to predict or understand risk. For teams to go from reacting to cyberattacks to strategically and tactically planning for risk reduction, they need to plan and prioritize.",
          "link": "https://www.hackerone.com/vulnerability-management/how-hacker-powered-security-can-help-security-teams-become-more-data",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 1313,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hacker-Powered Security Can Help Security Teams Become More Data-Driven"
        },
        {
          "description": "Challenges for Traditional Security Teams \n\nTraditional security teams are typically reactive. They’re seen as change-resistant, out of sync with development, and unable to predict or understand risk. For teams to go from reacting to cyberattacks to strategically and tactically planning for risk reduction, they need to plan and prioritize.",
          "link": "https://www.hackerone.com/how-hacker-powered-security-can-help-security-teams-become-more-data-driven",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 1300,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Hacker-Powered Security Can Help Security Teams Become More Data-Driven"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "Firefox 93 comes with lots of lovely updates including AVIF image format support, filling of XFA-based forms in its PDF viewer and protection against insecure downloads by blocking downloads relying on insecure connections.\nThe post Lots to see in Firefox 93! appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/10/lots-to-see-in-firefox-93/",
          "publishedOn": "2021-10-08T16:45:37.000Z",
          "wordCount": 690,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Lots to see in Firefox 93!"
        },
        {
          "description": "Last year, during lockdown, many discovered the importance of PDF forms when having to deal remotely with administrations and large organizations like banks. Firefox supported displaying PDF forms, but it didn’t support filling them: users had to print them, fill them by hand, and scan them back to digital form. We decided it was time to reinvest in the PDF viewer (PDF.js) and support filling PDF forms within Firefox to make our users' lives easier.\nThe post Implementing form filling and accessibility in th…",
          "link": "https://hacks.mozilla.org/2021/10/implementing-form-filling-and-accessibility-in-the-firefox-pdf-viewer/",
          "publishedOn": "2021-10-07T15:13:02.000Z",
          "wordCount": 3001,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Implementing form filling and accessibility in the Firefox PDF viewer"
        },
        {
          "description": "In a world where data and AI are reshaping society, people currently have no tangible way to put their data to work for the causes they believe in. To address this, we built the Rally platform, a first-of-its-kind tool that enables you to contribute your data to specific studies and exercise consent at a granular level. Mozilla Rally puts you in control of your data while building a better Internet and a better society. \nThe post Control your data for good with Rally appeared first on Mozilla Hacks - the We…",
          "link": "https://hacks.mozilla.org/2021/10/control-your-data-for-good-with-rally/",
          "publishedOn": "2021-10-06T14:55:48.000Z",
          "wordCount": 558,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Control your data for good with Rally"
        },
        {
          "description": "Starting with Firefox 93, Firefox will monitor available system memory and, should it ever become so critically low that a crash is imminent, Firefox will respond by unloading memory-heavy but not actively used tabs. This feature is currently enabled on Windows and will be deployed later for macOS and Linux as well.\nThe post Tab Unloading in Firefox 93 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/10/tab-unloading-in-firefox-93/",
          "publishedOn": "2021-10-05T16:52:07.000Z",
          "wordCount": 2132,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Tab Unloading in Firefox 93"
        },
        {
          "description": "The MDN Web Docs team is pleased to sponsor Write the Docs Prague 2021, which is being held remotely this year. We’re excited to join hundreds of documentarians to learn more about collaborating with writers, developers, and readers to make better documentation. We plan to take part in all that the conference has to offer, including the Writing Day, Job Fair, and the virtual hallway track.\nThe post MDN Web Docs at Write the Docs Prague 2021 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/10/mdn-web-docs-at-write-the-docs-prague-2021/",
          "publishedOn": "2021-10-01T12:46:37.000Z",
          "wordCount": 311,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "MDN Web Docs at Write the Docs Prague 2021"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "On September 28, 2021, we received notice from the developer Axosoft regarding a vulnerability in a dependency of their popular git GUI client - GitKraken. An underlying issue with a dependency, called `keypair`, resulted in the GitKraken client generating weak SSH keys.",
          "link": "https://github.blog/2021-10-11-github-security-update-revoking-weakly-generated-ssh-keys/",
          "publishedOn": "2021-10-11T17:00:22.000Z",
          "wordCount": 638,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub security update: revoking weakly-generated SSH keys"
        },
        {
          "description": "The Northern Hemisphere has hit fall, and the southern is starting to warm into summer. September has been a busy time for our community. Maintainers have been getting their repositories ready for Hacktoberfest, joining us",
          "link": "https://github.blog/2021-10-08-release-radar-aug-2021/",
          "publishedOn": "2021-10-08T18:55:48.000Z",
          "wordCount": 1313,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · September 2021 Edition"
        },
        {
          "description": "Giving back to open source projects is a great way to practice skills you don’t get to use in your day job. Check out ways to get involved!",
          "link": "https://github.blog/2021-10-07-githubs-guide-hacktoberfest-2021/",
          "publishedOn": "2021-10-07T18:44:14.000Z",
          "wordCount": 1081,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub’s guide to Hacktoberfest 2021"
        },
        {
          "description": "Today, we’re adding a proxy on top of the GitHub Advisory Database that speaks the `npm audit` protocol.  This means that every version of the npm CLI that supports security audits is now talking directly to the GitHub Advisory Database.",
          "link": "https://github.blog/2021-10-07-github-advisory-database-now-powers-npm-audit/",
          "publishedOn": "2021-10-07T16:05:05.000Z",
          "wordCount": 647,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Advisory Database now powers npm audit"
        },
        {
          "description": "In September, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2021-10-06-github-availability-report-september-2021/",
          "publishedOn": "2021-10-06T16:18:14.000Z",
          "wordCount": 269,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: September 2021"
        },
        {
          "description": "If you think about it, 13kB isn’t really a lot. The image above is 81kB. This page weighs over 3MB (waaay more if you include the videos). That’s why it’s so incredibly impressive that the",
          "link": "https://github.blog/2021-10-05-13-tiny-and-terrific-entries-from-the-js13kgames-competition/",
          "publishedOn": "2021-10-05T16:00:31.000Z",
          "wordCount": 835,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "13 tiny and terrific entries from the js13kGames competition"
        },
        {
          "description": "GitHub Releases has a new look and updated tools to make it easier for open source communities to create and share high-quality releases with auto-generated release notes.",
          "link": "https://github.blog/2021-10-04-beta-github-releases-improving-release-experience/",
          "publishedOn": "2021-10-04T18:07:00.000Z",
          "wordCount": 750,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "A new public beta of GitHub Releases: How we’re improving the release experience"
        },
        {
          "description": "GitHub's bug bounty team is excited to kick off Cybersecurity Awareness Month with a spotlight on two security researchers who participate in the GitHub Security Bug Bounty Program.",
          "link": "https://github.blog/2021-10-01-cybersecurity-spotlight-bug-bounty-researchers-chen-robert-ginkoid/",
          "publishedOn": "2021-10-01T18:21:36.000Z",
          "wordCount": 1273,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Cybersecurity spotlight on bug bounty researchers @chen-robert and @ginkoid"
        },
        {
          "description": "Manage your company in the cloud with more control and governance using enterprise managed users.",
          "link": "https://github.blog/2021-09-30-enterprise-managed-users-generally-available-github-enterprise-cloud/",
          "publishedOn": "2021-09-30T16:00:22.000Z",
          "wordCount": 692,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Enterprise managed users are now generally available for GitHub Enterprise Cloud"
        },
        {
          "description": "Today, we’re excited to announce that GitHub Enterprise Server 3.2 is generally available. This release brings over 70 new features and changes that improve developer experience and deliver new security capabilities.",
          "link": "https://github.blog/2021-09-28-github-enterprise-server-3-2-generally-available/",
          "publishedOn": "2021-09-28T16:21:10.000Z",
          "wordCount": 502,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.2 is now generally available"
        },
        {
          "description": "As part of GitHub's strong commitment to developer privacy, we are excited to announce updates to our privacy agreements in line with new legal requirements and our own robust data protection practices.",
          "link": "https://github.blog/2021-09-27-revised-enterprise-dpa-new-standard-contractual-clauses/",
          "publishedOn": "2021-09-28T00:51:12.000Z",
          "wordCount": 542,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Revised enterprise DPA with new standard contractual clauses"
        },
        {
          "description": "In 2019, to meet GitHub's growth and availability challenges, we set a plan in motion to improve our tooling and ability to partition relational databases.",
          "link": "https://github.blog/2021-09-27-partitioning-githubs-relational-databases-scale/",
          "publishedOn": "2021-09-27T16:02:13.000Z",
          "wordCount": 2210,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Partitioning GitHub’s relational databases to handle scale"
        },
        {
          "description": "npm access tokens will now follow the established format of GitHub authentication tokens.",
          "link": "https://github.blog/2021-09-23-announcing-npms-new-access-token-format/",
          "publishedOn": "2021-09-23T17:19:34.000Z",
          "wordCount": 538,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Announcing npm’s new access token format"
        },
        {
          "description": "We’re excited to announce that the GitHub Advisory Database now includes curated security advisories on the Rust ecosystem!",
          "link": "https://github.blog/2021-09-23-github-advisory-database-now-supports-rust/",
          "publishedOn": "2021-09-23T16:09:35.000Z",
          "wordCount": 564,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Advisory Database now supports Rust"
        },
        {
          "description": "If you're a GitHub Enterprise Cloud customer, you can now set up a stream of audit log and Git events to Splunk or an Azure Event Hub.",
          "link": "https://github.blog/2021-09-16-audit-log-streaming-public-beta/",
          "publishedOn": "2021-09-16T17:32:09.000Z",
          "wordCount": 868,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Audit log streaming is now in public beta"
        },
        {
          "description": "In August of 2020, we started highlighting stories that showcase how developers, maintainers, and organizations are moving humanity forward through The ReadME Project.",
          "link": "https://github.blog/2021-09-14-the-readme-project-a-look-back-community-stories/",
          "publishedOn": "2021-09-14T16:00:10.000Z",
          "wordCount": 566,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "The ReadME Project: A look back at the community stories that shape us"
        },
        {
          "description": "What did we ship in August? Codespaces, Discussions, and lots of other updates, from the general availability of the dark high contrast theme to an auto-generated table of contents for wikis.",
          "link": "https://github.blog/2021-09-13-whats-new-from-github-changelog-august-2021-recap/",
          "publishedOn": "2021-09-13T17:01:15.000Z",
          "wordCount": 1370,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? August 2021 Recap"
        },
        {
          "description": "Announcing recipients of the GitHub Open Source Grants and opening of GitHub Sponsors in India.",
          "link": "https://github.blog/2021-09-12-recipients-open-source-grants-github-sponsors-india/",
          "publishedOn": "2021-09-13T03:30:45.000Z",
          "wordCount": 654,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Announcing recipients of the GitHub Open Source Grants and GitHub Sponsors now open in India"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "Executives from Brazil, the USA, Colombia, and Mexico join the\nThe post Nubank enhances leadership hiring in different countries appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/leadership-hiring/",
          "publishedOn": "2021-10-11T21:43:48.000Z",
          "wordCount": 3310,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank enhances leadership hiring in different countries"
        },
        {
          "description": "Learn how Nubank selects candidates for the job of Analytics Engineer and what you need to know to join this team\nThe post How is the selection process for Analytics Engineers at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-is-the-selection-process-for-analytics-engineers-at-nubank/",
          "publishedOn": "2021-10-06T20:34:05.000Z",
          "wordCount": 4744,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "How is the selection process for Analytics Engineers at Nubank?"
        },
        {
          "description": "How Nubank switched to a Contract and Acceptance testing strategy to scale to over 1k engineers\nThe post Why We Killed Our End-to-End Test Suite appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/why-we-killed-our-end-to-end-test-suite/",
          "publishedOn": "2021-09-24T14:58:34.000Z",
          "wordCount": 4862,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Why We Killed Our End-to-End Test Suite"
        },
        {
          "description": "Nubank customers will have access to products and services from Creditas, a digital lending platform, by the end of the year. \nThe post Nubank and Creditas announce partnership appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-creditas/",
          "publishedOn": "2021-09-14T00:43:53.000Z",
          "wordCount": 3224,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank and Creditas announce partnership"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}