{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Kristoffer Janke, Information Security Engineer\n\nAre you ready for no sleep, no chill and a lot of hacking? Our annual Google CTF is back!\n\nThe competition kicks off on Saturday July 17 00:00:01 AM UTC  and runs through Sunday July 18 23:59:59 UTC. Teams can register at http://goo.gle/ctf. \n\nJust like last year, the top 16 teams will qualify for our Hackceler8 speed run and the chance to take home a total of $30,301.70 in prize money.\n\n\n\nAs we reminisce on last years event, we’d be remiss if we di…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/bBP3hKokMb4/get-ready-for-2021-google-ctf.html",
          "publishedOn": "2021-06-18T13:11:00.004Z",
          "wordCount": 640,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Get ready for the 2021 Google CTF"
        },
        {
          "description": "Posted Kim Lewandowski, Google Open Source Security Team &amp; Mark Lodato, Binary Authorization for Borg Team&nbsp;\n\nSupply chain integrity attacks—unauthorized modifications to software packages—have been on the rise in the past two years, and are proving to be common and reliable attack vectors that affect all consumers of software. The software development and deployment supply chain is quite complicated, with numerous threats along the source ➞ build ➞ publish workflow. While point solutions do exist f…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/hZ31glCO8Qg/introducing-slsa-end-to-end-framework.html",
          "publishedOn": "2021-06-16T15:36:00.029Z",
          "wordCount": 4482,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing SLSA, an End-to-End Framework for Supply Chain Integrity"
        },
        {
          "description": "Posted by Joel Galenson and Matthew Maurer, Android Team \nOne of the main challenges of evaluating Rust for use within the Android platform was ensuring we could provide sufficient interoperability with our existing codebase. If Rust is to meet its goals of improving security, stability, and quality Android-wide, we need to be able to use Rust anywhere in the codebase that native code is required. To accomplish this, we need to provide the majority of functionality platform developers use. As we discussed p…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/C0H0OlKgVRY/rustc-interop-in-android-platform.html",
          "publishedOn": "2021-06-08T17:00:00.002Z",
          "wordCount": 2688,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Rust/C++ interop in the Android Platform"
        },
        {
          "description": "Posted by Dan Lorenc, Priya Wadhwa, Open Source Security Team\n\nIf you've been paying attention to the news at all lately, you've probably noticed that software supply chain attacks are rapidly becoming a big problem. Whether you're trying to prevent these attacks, responding to an ongoing one or recovering from one, you understand that knowing what is happening in your CI/CD pipeline is critical. \nFortunately, the Kubernetes-native Tekton project –  an open-source framework for creating CI/CD systems – was …",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/2ZJ7vsPEBZU/verifiable-supply-chain-metadata-for.html",
          "publishedOn": "2021-06-08T16:02:00.006Z",
          "wordCount": 2641,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Verifiable Supply Chain Metadata for Tekton"
        },
        {
          "description": "Posted by Anna Hupa,&nbsp; Marc Henson, and Martin Straka, Google VRP Team&nbsp;\n\n\n\nOur Abuse Bug Bounty program has proved tremendously successful in the past three years since its introduction – thanks to our incredibly engaged community of researchers. Their contributions resulted in +1,000 valid bugs, helping us raise the bar in combating product abuse.\nAs a result of this continued success, today we are announcing a new experimental Abuse Research Grants Program in addition to the already existing Vuln…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/tKjA9YjPiSk/announcing-new-abuse-research-grants.html",
          "publishedOn": "2021-06-04T13:03:00.006Z",
          "wordCount": 629,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing New Abuse Research Grants Program"
        },
        {
          "description": "Posted by Badr Salmi, Google Safe Browsing &amp; Varun Khaneja, Chrome Security \nIn 2020 we launched Enhanced Safe Browsing, which you can turn on in your Chrome security settings, with the goal of substantially increasing safety on the web. These improvements are being built on top of existing security mechanisms that already protect billions of devices. Since the initial launch, we have continuously worked behind the scenes to improve our real-time URL checks and apply machine learning models to warn on p…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/-aonhXBJuDM/new-protections-for-enhanced-safe.html",
          "publishedOn": "2021-06-03T17:00:00.024Z",
          "wordCount": 944,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "New protections for Enhanced Safe Browsing users in Chrome"
        },
        {
          "description": "Posted by Jon Markoff and Sean Smith, Android Security and Privacy Team\n\n \nIntegrating security into your app development lifecycle can save a lot of time, money, and risk. That’s why we’ve launched Security by Design on Google Play Academy to help developers identify, mitigate, and proactively protect against security threats. \nThe Android ecosystem, including Google Play, has many built-in security features that help protect developers and users. The course Introduction to app security best practices take…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/2vy9ZDhnfjU/introducing-security-by-design.html",
          "publishedOn": "2021-05-26T17:00:00.003Z",
          "wordCount": 739,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Security By Design"
        },
        {
          "description": "Research Team: Salman Qazi, Yoongu Kim, Nicolas Boichat, Eric Shiu &amp; Mattias Nissler&nbsp;\n\nToday, we are sharing details around our discovery of Half-Double, a new Rowhammer technique that capitalizes on the worsening physics of some of the newer DRAM chips to alter the contents of memory.\nRowhammer is a DRAM vulnerability whereby repeated accesses to one address can tamper with the data stored at other addresses. Much like speculative execution vulnerabilities in CPUs, Rowhammer is a breach of the sec…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/Y2QoJFBaTug/introducing-half-double-new-hammering.html",
          "publishedOn": "2021-05-25T15:59:00.000Z",
          "wordCount": 862,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Introducing Half-Double: New hammering technique for DRAM Rowhammer bug"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "By George Pirocanac\n\n\n\n\nA familiar question every software developer and team grapples with is, “How much testing is enough to qualify a software release?” A lot depends on the type of software, its purpose, and its target audience. One would expect a far more rigorous approach to testing commercial search engne than a simple smartphone flashlight application. Yet no matter what the application, the question of how much testing is sufficient can be hard to answer in definitive terms. A better approach is to…",
          "link": "http://feedproxy.google.com/~r/blogspot/RLXA/~3/dnjDixzItKU/how-much-testing-is-enough.html",
          "publishedOn": "2021-06-15T15:04:00.000Z",
          "wordCount": 2633,
          "sourceHref": "http://googletesting.blogspot.com/atom.xml",
          "sourceTitle": "Google Testing Blog",
          "title": "How Much Testing is Enough?"
        }
      ]
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "AugLy is a great library to utilize for augmenting your data in model training, or to evaluate the robustness gaps of your model! We designed AugLy to include many specific data augmentations that users perform in real life on internet platforms like Facebook’s – for example making an image into a meme, overlaying text/emojis on images/videos, reposting a screenshot from social media. While AugLy contains more generic data augmentations as well, it will be particularly useful to you if you’re working on a p…",
          "link": "https://github.com/facebookresearch/AugLy",
          "publishedOn": "2021-06-21T20:50:00.000Z",
          "wordCount": 1204,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A data augmentations library for audio, image, text, and video"
        },
        {
          "description": "On this episode we’re talking with our good friend Mat Ryer whom you may know from the Go Time podcast. Mat created an awesome open source tool for putting just about anything in your Mac’s toolbar. It was originally written in Objective-C, but it just got a big rewrite in Go and abig  rename from BitBar to xbar.\nIf you don’t use a Mac don’t hit skip on this episode quite yet! There are lessons to be learned for anyone interested in hacking on tools to make your life better. Plus, with this rewrite Mat has …",
          "link": "https://changelog.com/podcast/446",
          "publishedOn": "2021-06-21T20:00:00.000Z",
          "wordCount": 512,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 446: xbar puts anything in your macOS menu bar"
        },
        {
          "description": "You sigh. Maybe the compilation didn’t work? You recompile and run it again. Nope. Still the same problem. You stare out the window.\nThis post is about ways of getting unstuck on a problem when you do not (yet) have all the relevant knowledge. It focuses on the problem with the ego when being a more seasoned programmer and the difficulty on admitting that you don’t know (yet).\nFrom there we go through the steps on being unstuck and making that ego more inflated and annoying.\nDiscuss on Changelog News",
          "link": "https://www.iamjonas.me/2021/06/getting-unstuck.html",
          "publishedOn": "2021-06-21T15:23:00.000Z",
          "wordCount": 1804,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Getting unstuck"
        },
        {
          "description": "Super Mario World Widescreen is your beloved Mario World SNES game but in the 16:9 resolution. This is possible by expanding the horizontal resolution by 96 pixels, increasing resolution from 256x224 to 352x224. Since the original SNES does not have this resolution, the emulator focused into high definition mods bsnes-hd must be used.\nI love how open source hackers give classic games like this new life by applying their skill and ingenuity to a property they love. I wonder if having it in widescreen changes…",
          "link": "https://github.com/VitorVilela7/wide-snes",
          "publishedOn": "2021-06-21T14:37:00.000Z",
          "wordCount": 1003,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Super Mario World modded to be 16:9"
        },
        {
          "description": "This week we’re talking with Pia Mancini about the latest updates to the mission of Open Collective. Earlier this year Open Collective announced “Funds for Open Source.” The idea is simple, make it easy for companies to invest in open source, and they will. Also, since recording this episode, Pia and the team at Open Collective along with Gitcoin announced fundoss.org as part of Maintainer Week announcements. And right now, they have a matching fund of $75,000 dollars funding open source that you can suppor…",
          "link": "https://changelog.com/podcast/445",
          "publishedOn": "2021-06-18T21:00:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 445: Funds for open source"
        },
        {
          "description": "Yulia Startsev from Mozilla’s SpiderMonkey team joins Jerod &amp; Feross to talk compilers, going back to get your Master’s, making decisions as a group, process of shepherding a feature through TC39, how Firefox actually works, and LavaMoats. Yes, LavaMoats.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find…",
          "link": "https://changelog.com/jsparty/180",
          "publishedOn": "2021-06-18T16:00:00.000Z",
          "wordCount": 422,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 180: Of spiders and monkeys"
        },
        {
          "description": "This animated “children’s” book is spectacularly good. It centers around a growing community of otters, their struggles to communicate efficiently, and one little otter named Nixie’s great idea that changed the forest forever.\nPut, put, put your events\n\nDiscuss on Changelog News",
          "link": "https://www.gentlydownthe.stream/",
          "publishedOn": "2021-06-18T14:27:00.000Z",
          "wordCount": 94,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An illustrated guide to Apache Kafka"
        },
        {
          "description": "DenoDB has a fully-typed API (which is great for editor integration) and supports a whole host of backends: MySQL/Maria, SQLite, Postgres, and MongoDB.\nBroad database support is great for library adoption, but as a user I’d prefer something that leans in to a specific ecosystem, which usually lets you squeeze more out of it.\nRegardless of that, it’s great to see the Deno community building foundational tools like this.\nDiscuss on Changelog News",
          "link": "https://github.com/eveningkid/denodb",
          "publishedOn": "2021-06-18T13:40:00.000Z",
          "wordCount": 893,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Deno gets an ORM"
        },
        {
          "description": "What you will see next is a highly subjective, non-exhaustive unordered list of principles that, if you follow, I can guarantee will lead you to become a bad developer…\nIf your goal, fellow reader, is to become a good developer instead, don’t worry. Remember that via negativa is way more powerful than via positiva. That means that knowing what not to do is safer and easier to figure out than exactly what to do. So pay attention to the following topics and decide which type of developer you want to be.\nI (di…",
          "link": "https://rafaelquintanilha.com/how-to-become-a-bad-developer/",
          "publishedOn": "2021-06-17T18:30:00.000Z",
          "wordCount": 1355,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to become a bad developer"
        },
        {
          "description": "A bad CLI can easily discourage users from interacting with it. Building successful CLIs requires attention to detail and empathy for the user in order to create a good user experience. It is very easy to get wrong.\nIn this guide I have compiled a list of best practices across areas of focus which aim to optimize for an ideal user experience when interacting with a CLI application.\nDiscuss on Changelog News",
          "link": "https://github.com/lirantal/nodejs-cli-apps-best-practices",
          "publishedOn": "2021-06-17T17:39:00.000Z",
          "wordCount": 6140,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The largest Node.js CLI Apps best practices list ✨"
        },
        {
          "description": "Porter lets you package your application artifacts, client tools, configuration and deployment logic together as a versioned bundle that you can distribute, and then install with a single command. Written entirely in Go, we speak to one of the creators about running an open source project, the importance of documentation, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nTeleport – Teleport Access Plane lets you access any…",
          "link": "https://changelog.com/gotime/184",
          "publishedOn": "2021-06-17T16:00:00.000Z",
          "wordCount": 414,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 184: All about Porter"
        },
        {
          "description": "Yejun Su is using Numerical Elixir’s new Livebook project for more than just Numerical Things.\nBefore Livebook, I write code in IEx, which is a REPL. It has some helpers to ease the way to explore code, but in my opinion, Livebook exceeds in two factors:\nCode history\nexport ERL_AFLAGS=&quot;-kernel shell_history enabled&quot; in the shell profile file. You can also search the IEx code history with Ctrl-r and apply it. But as Livebook is essentially a notebook, you can see all texts and evaluation results wi…",
          "link": "https://goofansu.medium.com/livebook-driven-development-50f82e66fbff",
          "publishedOn": "2021-06-17T14:50:00.000Z",
          "wordCount": 784,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Livebook-driven development"
        },
        {
          "description": "Utopia is an integrated design and development environment for React. It uses React code as the source of truth, and lets you make real time changes to components by editing it and using a suite of design tools. It’s early software, but you can try it today, look at an example project, or read about it on our blog!\n\nDiscuss on Changelog News",
          "link": "https://github.com/concrete-utopia/utopia",
          "publishedOn": "2021-06-17T13:42:00.000Z",
          "wordCount": 2465,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An integrated design and development environment for React"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Ian Miell, author of Docker in Practice as well as Learn Git, Bash, and Terraform the Hard Way. They talk about being comfortable with the uncomfortable, focusing on the tech while keeping a holistic view of the business. Following the money is key. Ian explains this concept really well, and Gerhard feels fairly confident you will be better off if you pay attention. Let us know in the comments!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get close…",
          "link": "https://changelog.com/shipit/6",
          "publishedOn": "2021-06-17T11:00:00.000Z",
          "wordCount": 475,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 6: Follow the money"
        },
        {
          "description": "Matthew Gerstman:\nI’ve been tasked with leading frontend. As a result, I’ve been teaching a whole lot of people about the web.\nKnowing where we came from can help us figure out where we should go. It’s also a mountain of technical debt, and we’re collectively building on top of it.\nForgive me if I skip the wonderful stories of Macromedia Flash, Java in the browser, or whatever other detour you can think of. While those were important to development of the web, most of us will never run into them again.\nThe …",
          "link": "https://www.matthewgerstman.com/tech/history-of-the-web/",
          "publishedOn": "2021-06-16T15:52:00.000Z",
          "wordCount": 3550,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "History of the web: part 1"
        },
        {
          "description": "You’ve probably seen many of these commands hit Changelog News over the years, but now you can see them all again in one hand-curated place. Who knows, maybe one or two will be new to you. I hadn’t heard of curlie previously, which looks like a nice merging of cur and httpie.\nDiscuss on Changelog News",
          "link": "https://github.com/ibraheemdev/modern-unix",
          "publishedOn": "2021-06-16T13:34:00.000Z",
          "wordCount": 727,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Modern alternatives to Unix commands"
        },
        {
          "description": "Prestige rivals rich HTTP clients such as Postman and Insomnia by being… less rich. BUT. All you have to do is fire it up in your browser and type out some plain text. So straight forward!\n\nDiscuss on Changelog News",
          "link": "https://prestigemad.com/",
          "publishedOn": "2021-06-15T18:40:00.000Z",
          "wordCount": 38,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A text-based HTTP client in your browser"
        },
        {
          "description": "A quick list of 23 skills for varying levels of seniority, from senior, to staff, and beyond. My favorites from the list are How to listen to other engineers’ ideas without feeling threatened (#10) and How to pick your battles (#18) .\nEveryone else’s favorite, according to the top highlight,  is How to get someone promoted (#19).\nDiscuss on Changelog News",
          "link": "https://skamille.medium.com/an-incomplete-list-of-skills-senior-engineers-need-beyond-coding-8ed4a521b29f",
          "publishedOn": "2021-06-15T15:56:00.000Z",
          "wordCount": 649,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An incomplete list of skills senior engineers need, beyond coding"
        },
        {
          "description": "William Falcon wants AI practitioners to spend more time on model development, and less time on engineering. PyTorch Lightning is a lightweight PyTorch wrapper for high-performance AI research that lets you train on multiple-GPUs, TPUs, CPUs and even in 16-bit precision without changing your code! In this episode, we dig deep into Lightning, how it works, and what it is enabling. William also discusses the Grid AI platform (built on top of PyTorch Lightning). This platform lets you seamlessly train 100s of …",
          "link": "https://changelog.com/practicalai/138",
          "publishedOn": "2021-06-15T14:45:00.000Z",
          "wordCount": 549,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 138: Multi-GPU training is hard (without PyTorch Lightning)"
        },
        {
          "description": "When it comes to scaling, we might need to think about:\ndata storage, if we store more and more data and it becomes expensive or slow working with them\nfast INSERTs and UPDATES for write-heavy workloads\nmaking SELECT queries faster because of their complexity or because they need to query huge amounts of data\nconcurrency if we have many clients interacting with the database\nIn this article, I will present some basic ideas and starting points on scaling traditional SQL databases.\nDiscuss on Changelog News",
          "link": "https://stribny.name/blog/2020/07/scaling-relational-sql-databases/",
          "publishedOn": "2021-06-14T17:07:00.000Z",
          "wordCount": 2487,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Scaling relational SQL databases"
        },
        {
          "description": "WWDC21 wasn’t the most exciting Apple keynote ever (especially for those of us hoping for some new hardware), but there were a lot of software things announced. Apple continues to iterate on Swift, and the new 5.5 beta has some really cool stuff in it. InfoQ has the rundown on its two flagship improvements.\nDiscuss on Changelog News",
          "link": "https://www.infoq.com/news/2021/06/swift-async-await-actors/",
          "publishedOn": "2021-06-14T14:19:00.000Z",
          "wordCount": 3439,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Swift 5.5 brings async/await and actor support"
        },
        {
          "description": "Don Watkins:\nMark Van Doren said, “the art of teaching is the art of assisting discovery.” I saw that play out in this classroom using open source tools. More students need opportunities like this to help them gain a quality education. The Raspberry Pi 400 is a great form factor for teaching and learning.\nSuch a cool program that’d be easy to reproduce in your local library.\nDiscuss on Changelog News",
          "link": "https://opensource.com/article/21/6/teach-python-raspberry-pi",
          "publishedOn": "2021-06-14T13:24:00.000Z",
          "wordCount": 1401,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How I teach Python on the Raspberry Pi 400 at the public library"
        },
        {
          "description": "Tanner joins Nick to talk about his projects, react-query and react table, and discuss scratching your own itch in a maintainable way with open source.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy to build internal tools. Instead of building internal tools from scratch, the world’s best teams, from startups to Fortune 500s, are …",
          "link": "https://changelog.com/jsparty/179",
          "publishedOn": "2021-06-11T17:30:00.000Z",
          "wordCount": 390,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 179: Building on the TanStack"
        },
        {
          "description": "OldOS is a testament to the days of yesteryear, showcasing what iOS once was ten years ago. The ethos of the app is to merge the technologies of today with a pixel-perfect recreation of the user experience of the past. The vast majority of apps in OldOS are fully functional — meaning they seamlessly integrate with the data on your phone to deliver a live, emulator-esque experience. What does this mean? Well, you can play your music in iPod, get directions in Maps, surf the web in Safari, view the current we…",
          "link": "https://github.com/zzanehip/The-OldOS-Project",
          "publishedOn": "2021-06-11T15:17:00.000Z",
          "wordCount": 1022,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Recreating a fully functional version of iOS 4 in SwiftUI"
        },
        {
          "description": "This bold statement starts a long Twitter thread by Brantly Millegan:\n“Sign-In w/ Ethereum” is the future of login for every app on the Internet, crypto-related or not. Not just an idea, it’s already the norm for web3 &amp; will spread.\nThis idea was the most interesting/exciting thing for me that came out of our NFT talk with Mikeal Rogers. Could cryptocurrency be the carrot that attracts the masses to obtain a public/private key pair and be financially incentivized to secure it? If so, this makes for a fa…",
          "link": "https://twitter.com/brantlymillegan/status/1402388133086367751",
          "publishedOn": "2021-06-11T14:26:00.000Z",
          "wordCount": 196,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "\"The Ethereum community has accidentally solved a major problem of the Internet: Single Sign-On\""
        },
        {
          "description": "This episode was recorded live from GopherCon Europe 2021!\nNatalie &amp; Mat host three amazing devs who gave talks that showcase using Go in unusual ways: Dr. Joakim Kennedy is tracking Go in malware, Mathilde Raynal is building quantum-resistant cryptography algorithms, and Preslav Rachev is creating digital art.\nWe hear from our speakers how they got into Go, how they made the choice to use Go for their unusual use case, and how it compares to other languages for their specific needs.\nWe also chat about …",
          "link": "https://changelog.com/gotime/183",
          "publishedOn": "2021-06-10T15:45:00.000Z",
          "wordCount": 475,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 183: Using Go in unusual ways"
        },
        {
          "description": "When it comes to open source, we came for the code, but we stayed for the people. Some of the best, brightest, &amp; kindest people we’ve met over our years doing The Changelog are maintainers of open source software.\nWe’ve been working (alongside others) to support, encourage, and shine our spotlight on these amazing people for awhile now, so it was exciting to hear that our friends at GitHub and Tidelift were organizing Maintainer Week.\nIf you listened to our Maintainer Week episode, then you already know…",
          "link": "https://changelog.com/posts/thank-a-maintainer-on-us",
          "publishedOn": "2021-06-10T11:05:00.000Z",
          "wordCount": 611,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Thank a maintainer on us!"
        },
        {
          "description": "Maintainer Week is finally here and we’re excited to make this an annual thing! If Maintainer Week is new to you, check out episode #442 with Josh Simmons and Kara Sowles.\nToday we’re talking Brett Cannon. Brett is Dev Manager of the Python Extension for VS Code, Python Steering Council Member, and core team member for Python. He recently shared a blog post The social contract of open source, so we invited Brett to join us for Maintainer Week to discuss this topic in detail.\nThank a maintainer on us! We’re …",
          "link": "https://changelog.com/podcast/444",
          "publishedOn": "2021-06-10T11:00:00.000Z",
          "wordCount": 489,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 444: Every commit is a gift"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Dave Farley, co-author of Continuous Delivery and the inventor of the Deployment Pipeline. Today, most of us ship code the way we do because 25 years ago, Dave cared enough to drive the change that we now call CI/CD. He is one of the great software engineers: opinionated, perseverant &amp; focused since the heydays of the internet. Dave continues inspiring and teaching us all via his newly launched YouTube channel, courses and recent books. The apprentice finally mee…",
          "link": "https://changelog.com/shipit/5",
          "publishedOn": "2021-06-09T21:00:00.000Z",
          "wordCount": 552,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 5: The foundations of Continuous Delivery"
        },
        {
          "description": "Miroslav Nikolov:\nYou may not be a project manager. Perhaps you are a developer who likes to code and solve technical challenges. The organizational matter is something you care less about. After all, your company is likely relying on some agile methods and there are product owners and/or SCRUM masters to handle the process. You just need to build new features.\nWhile that’s true you have to sometimes get out of your comfort zone.\nDiscuss on Changelog News",
          "link": "https://webup.org/blog/arguments-for-a-project-kickoff-strategy/",
          "publishedOn": "2021-06-09T17:57:00.000Z",
          "wordCount": 854,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Arguments for a project kickoff strategy"
        },
        {
          "description": "When we had Adam Wathan on JS Party, I asked him if anybody besides the Tailwind team were working on component libraries. He said yes, but didn’t name any off the top of his head. Well, add DaisyUI to the list.\nYour HTML doesn’t need to be messy. DaisyUI adds component classes to Tailwind CSS. Classes like btn, card, etc… No need to deal with hundreds of utility classes.\nNo script dependencies. 2KB gzipped. Worth a look.\nDiscuss on Changelog News",
          "link": "https://daisyui.com/",
          "publishedOn": "2021-06-09T17:09:00.000Z",
          "wordCount": 1279,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "DaisyUI – component classes for Tailwind"
        },
        {
          "description": "Adam and Jerod sit down to answer a listener question (Hi, Alex! 👋) about how we podcast. Not how we create podcasts, but how we consume podcasts. Along the way we share an update on our comments feature, discuss the Apple Podcasts rollout debacle (and how it affected us launching Ship It!), and give a few personal recommendations of podcasts we’re listening to.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nFeaturing\nAdam Stacoviak &nda…",
          "link": "https://changelog.com/backstage/17",
          "publishedOn": "2021-06-09T15:10:00.000Z",
          "wordCount": 290,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Backstage 17: Consuming podcasts like PB&J"
        },
        {
          "description": "LJ Miranda:\nWhen I first saw “Avengers: Endgame” in theaters, I noticed that their time travel rule is quite similar to the Git branching model. Referred to as the time heist, our heroes travelled through time to recover the stones…\nI had to truncate that pull quote to avoid Avengers spoilers. If you’ve seen the movie (or don’t care about getting spoiled) there’s some good Git knowledge to be gained from this analogy.\nDiscuss on Changelog News",
          "link": "https://ljvmiranda921.github.io/notebook/2021/06/05/avengers-git/",
          "publishedOn": "2021-06-09T13:59:00.000Z",
          "wordCount": 1402,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What can \"Avengers: Endgame\" teach us about Git?"
        },
        {
          "description": "Chris and Daniel sit down to chat about some exciting new AI developments including wav2vec-u (an unsupervised speech recognition model) and meta-learning (a new book about “How To Learn Deep Learning And Thrive In The Digital World”). Along the way they discuss engineering skills for AI developers and strategies for launching AI initiatives in established companies.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Med…",
          "link": "https://changelog.com/practicalai/137",
          "publishedOn": "2021-06-08T18:00:00.000Z",
          "wordCount": 409,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 137: Learning to learn deep learning 📖"
        },
        {
          "description": "Althttpd is a simple webserver that has run the sqlite.org website since 2004. Althttpd strives for simplicity, security, and low resource usage.\nAs of 2018, the althttpd instance for sqlite.org answers about 500,000 HTTP requests per day (about 5 or 6 per second) delivering about 50GB of content per day (about 4.6 megabits/second) on a $40/month Linode. The load average on this machine normally stays around 0.1 or 0.2. About 19% of the HTTP requests are CGI to various Fossil source-code repositories.\nRicha…",
          "link": "https://sqlite.org/althttpd/doc/trunk/althttpd.md",
          "publishedOn": "2021-06-08T15:57:00.000Z",
          "wordCount": 2049,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Richard Hipp's single file webserver written in C"
        },
        {
          "description": "Brendan Gregg tells a tale from 2005:\nThis is the story of the most unbelievable demo I’ve been given in world of open source. You can’t make this stuff up.\nI don’t want to ruin it, so I’ll just say that it’s not unbelievable in the way you might think it’s unbelievable.\nDiscuss on Changelog News",
          "link": "https://brendangregg.com/blog/2021-06-04/an-unbelievable-demo.html",
          "publishedOn": "2021-06-08T15:06:00.000Z",
          "wordCount": 2557,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An unbelievable demo"
        },
        {
          "description": "This week we’re joined by Ryan Dahl, Node.js creator, and now the creator of Deno - a simple, modern and secure runtime for JavaScript and TypeScript that uses V8 and is built in Rust.\nWe talk with Ryan about the massive success of Node and how it impacted his life, how he eventually created Deno and what he’s doing differently this time around. We also talk about The Deno Company, and what’s in store for Deno Delpoy.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, a…",
          "link": "https://changelog.com/podcast/443",
          "publishedOn": "2021-06-08T12:00:00.000Z",
          "wordCount": 485,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 443: Exploring Deno Land 🦕"
        },
        {
          "description": "Powered by Mediapipe, TensorFlow, and Jeeliz.\n\nDiscuss on Changelog News",
          "link": "https://handsfree.dev",
          "publishedOn": "2021-06-07T16:31:00.000Z",
          "wordCount": 2044,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Add face, hand, and pose tracking to your projects in a snap ✨👌"
        },
        {
          "description": "I was clueless how big and competitive a marketplace Chrome extensions are until Oleg Anashkin decided to document all of the proposals he’s received over the years to monetize Hover Zoom+. His reasoning:\nThe main reason I continue to maintain this extension is because I can hardly trust others to not fall for one of these offers. I’m fortunate to have a job that pays well enough to allow me to keep my moral compass and ignore all of these propositions. I realize that not everyone has the same financial sec…",
          "link": "https://github.com/extesy/hoverzoom/discussions/670",
          "publishedOn": "2021-06-07T15:03:00.000Z",
          "wordCount": 9240,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Chrome extension devs get hit up incessantly with monetization proposals"
        },
        {
          "description": "We first talked fuzzing with Katie Hockman back in August of 2020. Fast-forward 10 months and native fuzzing in Go is ready for beta testing! Here’s Katie explaining fuzzing, for the uninitiated:\nFuzzing is a type of automated testing which continuously manipulates inputs to a program to find issues such as panics or bugs. These semi-random data mutations can discover new code coverage that existing unit tests may miss, and uncover edge case bugs which would otherwise go unnoticed. Since fuzzing can reach t…",
          "link": "https://blog.golang.org/fuzz-beta",
          "publishedOn": "2021-06-07T13:53:00.000Z",
          "wordCount": 747,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go's fuzzing effort now in beta"
        },
        {
          "description": "Eric Simons and the StackBlitz team recently announced WebContainers which let you run Node.js natively in your browser! This has BIG implications and leaves us with many BIG questions like: how did they do it, why did they do it, and where does it go from here? Tune in! Keyword: BIG\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes it fast and easy …",
          "link": "https://changelog.com/jsparty/178",
          "publishedOn": "2021-06-04T16:35:00.000Z",
          "wordCount": 391,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 178: Running Node natively in the browser"
        },
        {
          "description": "Nick Janetakis shares a few patterns he’s picked up based on using Docker since 2014 for many freelance projects. He also posted a timestamped video version on YouTube if you’d prefer to watch over reading.\nDiscuss on Changelog News",
          "link": "https://nickjanetakis.com/blog/best-practices-around-production-ready-web-apps-with-docker-compose",
          "publishedOn": "2021-06-04T15:29:00.000Z",
          "wordCount": 7003,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Best practices around production ready web apps with Docker Compose"
        },
        {
          "description": "Most people who use GraphQL haven’t read the spec, often because it sounds or looks intimidating. This post simply and cogently shares the essentials of the query language section of the spec.\nDiscuss on Changelog News",
          "link": "https://blog.graphql.guide/the-graphql-spec-simplified-93005ce0671f",
          "publishedOn": "2021-06-04T14:39:00.000Z",
          "wordCount": 2168,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The GraphQL spec, simplified"
        },
        {
          "description": "If you updated your Firefox to version 89 and were not-so-pleasantly surprised by the brand new Proton interface, this Lepton project may be of interest to you. Lepton doesn’t throw Proton out with the bath water, but aims to improve some key aspects the author didn’t appreciate.\nDiscuss on Changelog News",
          "link": "https://github.com/black7375/Firefox-UI-Fix",
          "publishedOn": "2021-06-04T13:48:00.000Z",
          "wordCount": 896,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An attempt to improve Firefox's new Proton UI"
        },
        {
          "description": "Open Source Insights is an experimental service developed and hosted by Google to help developers better understand the structure, construction, and security of open source software packages. The service examines each package, constructs a full, detailed graph of its dependencies and their properties, and makes the results available to anyone who could benefit from them. The goal is to provide developers with a picture of how their software is put together, how that changes as dependencies change, and what …",
          "link": "https://deps.dev/",
          "publishedOn": "2021-06-03T18:03:00.000Z",
          "wordCount": 11,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Google's experimental Open Source Insights project"
        },
        {
          "description": "In the past decade a variety of games have emerged where players need to create an AI to play the game rather than play the game directly. In this episode we speak with the creator of one of those games - Battlesnake. Brad Van Vugt joins us to talk about building a game engine using Go, making programming games easier for beginners to get started with, the long term vision for games like Battlesnake, and more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make …",
          "link": "https://changelog.com/gotime/182",
          "publishedOn": "2021-06-03T16:20:00.000Z",
          "wordCount": 459,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 182: Go Battlesnake Go!"
        },
        {
          "description": "I hadn’t heard of Prosus prior to this announcement, so if you’re at all like me, this is for you:\nProsus invests globally across a range of online platforms focused on areas such as food delivery, classifieds and fintech. It also maintains a more than $200 billion holding in Tencent. Prosus’ parent company, Naspers Ltd., acquired the Tencent stake in 2001 for $34 million.\nTurning $34 million into $200 billion is quite the feat. They’re a savvy bunch, if nothing else. Joel Spolsky also wrote about the acqui…",
          "link": "https://www.wsj.com/articles/software-developer-community-stack-overflow-sold-to-tech-giant-prosus-for-1-8-billion-11622648400",
          "publishedOn": "2021-06-03T14:57:00.000Z",
          "wordCount": 1622,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Stack Overflow sold to tech giant Prosus for $1.8 billion"
        },
        {
          "description": "Due to concerns over control of user information, multiple volunteers have resigned from Freenode to found Libera Chat. This FAQ notes:\nWhat it appears to come down to, is that Andrew Lee is attempting to essentially take over the network by drowning staff in lawyers.\nDiscuss on Changelog News",
          "link": "https://libera.chat/news/welcome-to-libera-chat",
          "publishedOn": "2021-06-03T13:55:00.000Z",
          "wordCount": 372,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Libera Chat –  a next-gen IRC network for FOSS projects"
        },
        {
          "description": "Craig Kerstiens:\nPostgres has had “JSON” support for nearly 10 years now. I put JSON in quotes because well, 10 years ago when we announced JSON support we kinda cheated. We validated JSON was valid and then put it into a standard text field. Two years later in 2014 with Postgres 9.4 we got more proper JSON support with the JSONB datatype. My colleague @will likes to state that the B stands for better. In Postgres 14, the JSONB support is indeed getting way better.\nA small but solid improvement to how you q…",
          "link": "https://blog.crunchydata.com/blog/better-json-in-postgres-with-postgresql-14",
          "publishedOn": "2021-06-02T18:17:00.000Z",
          "wordCount": 1391,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Better JSON in Postgres with PostgreSQL 14"
        },
        {
          "description": "This is the resource that Una Kravets said we’d put in the show notes on JS Party #176. I thought it was worth a direct linking in News as well, since it’s so freakin’ well-done and useful:\nYou’ll learn CSS fundamentals like the box model, cascade and specificity, flexbox, grid and z-index. And, along with these fundamentals, you’ll learn about functions, color types, gradients, logical properties and inheritance to make you a well-rounded front-end developer, ready to take on any user interface.\nDiscuss on…",
          "link": "https://web.dev/learn/css/",
          "publishedOn": "2021-06-02T15:22:00.000Z",
          "wordCount": 1040,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An evergreen CSS course and reference to level up your web styling expertise"
        },
        {
          "description": "This isn’t merely a speech-to-text thing. It also provides intent recognition, which makes it great for doing voice commands. For example, when trained with this template, the following command:\n$ voice2json transcribe-wav \\\n      &lt; turn-on-the-light.wav | \\\n      voice2json recognize-intent | \\\n      jq .\n\nProduces this JSON event:\n{\n    &quot;text&quot;: &quot;turn on the light&quot;,\n    &quot;intent&quot;: {\n        &quot;name&quot;: &quot;LightState&quot;\n    },\n    &quot;slots&quot;: {\n        &quo…",
          "link": "https://github.com/synesthesiam/voice2json",
          "publishedOn": "2021-06-02T13:42:00.000Z",
          "wordCount": 893,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Command-line tools for speech and intent recognition on Linux"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Ben Ford, former Royal Marine and founder of Commando Development, about the OODA loop (observe, orient, decide, act). Shipping is just a small part of it. The OODA loop that you know is probably the wrong one. We explore Mission &amp; Command, Situational Awareness and a few other practices that will help you deal with complexity as you code and ship. As a former Royal Marine Commando, Ben learned these skills the hard way, and then refined them over many years as a…",
          "link": "https://changelog.com/shipit/4",
          "publishedOn": "2021-06-02T11:00:00.000Z",
          "wordCount": 535,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 4: OODA for operational excellence"
        },
        {
          "description": "Tuhin Srivastava tells Daniel and Chris why BaseTen is the application development toolkit for data scientists.  BaseTen’s goal is to make it simple to serve machine learning models, write custom business logic around them, and expose those through API endpoints without configuring any infrastructure.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernete…",
          "link": "https://changelog.com/practicalai/136",
          "publishedOn": "2021-06-01T22:00:00.000Z",
          "wordCount": 369,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 136: The fastest way to build ML-powered apps"
        },
        {
          "description": "JupyterLite is a JupyterLab distribution that runs entirely in the browser built from the ground up using JupyterLab components and extensions.\nTry it now with JupyterLab and/or RetroLab.\nDiscuss on Changelog News",
          "link": "https://github.com/jtpio/jupyterlite",
          "publishedOn": "2021-06-01T19:41:00.000Z",
          "wordCount": 1057,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Wasm powered Jupyter running in the browser"
        },
        {
          "description": "Boring avatars is a tiny JavaScript React library that generates custom, SVG-based, round avatars from any username and color palette.\nCool, but it’d be even cooler if it detached from React so we could all use it. It’d also be nice if you could opt to having the initials overlay the gradient.\n\nDiscuss on Changelog News",
          "link": "https://github.com/boringdesigners/boring-avatars",
          "publishedOn": "2021-06-01T14:44:00.000Z",
          "wordCount": 669,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A little React library to replace your boring fallback avatars"
        },
        {
          "description": "Sometimes to solve a problem we tend to choose a set of tools we got used to. How often we pick a tool just because we know it, and not necessarily because it’s the right one for a task at hand? These are my rules to overcome that.\nDiscuss on Changelog News",
          "link": "https://sul.im/blog/a-hacker-mindset/",
          "publishedOn": "2021-06-01T13:37:00.000Z",
          "wordCount": 517,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A hacker mindset"
        },
        {
          "description": "This week is all about Maintainer Week — it’s a week long event starting June 7th for open source maintainers to gather, share, and be celebrated. We’re joined by Josh Simmons (Ecosystem Strategy Lead at Tidelift &amp; President of Open Source Initiative) and Kara Sowles (Senior Open Source Program Manager at GitHub). Of course we love open source maintainers, that’s why we’re so excited about Maintainer Week and making it an annual thing. Today we talk through all the details of this event, what we can exp…",
          "link": "https://changelog.com/podcast/442",
          "publishedOn": "2021-05-28T21:00:00.000Z",
          "wordCount": 478,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 442: Maintainer week!"
        },
        {
          "description": "Debugging containerized workloads is a daily task for everyone who works with Kubernetes, which can be made much simpler with kubectl debug - a beta feature of Kubernetes. In the article you will learn how to make it available in your cluster, how it works, as well as some examples how you can use it to easily debug both Kubernetes Pods and worker Nodes.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/49",
          "publishedOn": "2021-05-28T16:29:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The easiest way to debug Kubernetes workloads"
        },
        {
          "description": "Brian LeRoux has been building the web long enough to see many ways we produce HTML come in and go out of fashion. On this episode, he joins Amal &amp; Nick to discuss the past, present, and potential future of rendering patterns on the web. SSR, ISR, &amp; DSR (oh my!)\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by doing — Python, data, AI, machine learning, Kubernetes, Docker, and more. Just open y…",
          "link": "https://changelog.com/jsparty/177",
          "publishedOn": "2021-05-28T15:30:00.000Z",
          "wordCount": 406,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 177: Let's talk rendering patterns"
        },
        {
          "description": "Docker images can leak runtime secrets, build secrets, and even just some secret files you have lying around. Learn how to leak them, and (probably more usefully) how to avoid leaks.\nDiscuss on Changelog News",
          "link": "https://pythonspeed.com/articles/leaking-secrets-docker/",
          "publishedOn": "2021-05-28T14:49:00.000Z",
          "wordCount": 1320,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to (not) use Docker to share your password with hackers"
        },
        {
          "description": "This is an opinionated list that goes so far as to tell you what to avoid and some options to use instead. I’d love if they’d also tell you why to avoid things. For example, under the Photo Editing and Management section they say to avoid VSCO. Yeah but why?!\nDiscuss on Changelog News",
          "link": "https://github.com/pluja/awesome-privacy",
          "publishedOn": "2021-05-28T14:03:00.000Z",
          "wordCount": 4613,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A curated list of services and alternatives that respect your privacy"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Alex Koutmos about Elixir observability using PromEx. Why do we need to understand how our setup behaves? What is PromEx and where does PromEx fit in changelog.com?\nBonus! Tune in to our LIVE Friday evening deploy 😱 of Erlang 24 in the context of changelog.com. Check the show notes for a link on YouTube. Bring your own popcorn 🍿\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The…",
          "link": "https://changelog.com/shipit/3",
          "publishedOn": "2021-05-28T12:20:00.000Z",
          "wordCount": 463,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 3: Elixir observability using PromEx"
        },
        {
          "description": "This week on Ship It! Gerhard is joined by Constance Caramanolis, Principal Engineer at Splunk and former maintainer of Envoy Proxy, and Stephen Augustus, Head of Open Source at Cisco &amp; self-proclaimed Caesar of Systems. Constance and Stephen are the KubeCon + CloudNativeCon co-chairs. Join us to find out what happens before and after KubeCon gets shipped.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRender – The Zero DevOp…",
          "link": "https://changelog.com/shipit/2",
          "publishedOn": "2021-05-28T12:10:00.000Z",
          "wordCount": 441,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 2: Shipping KubeCon EU 2021"
        },
        {
          "description": "Welcome to Ship It! This is a new show from Changelog about shipping software - and all the details, challenges, and problems that surface. Changelog SRE Gerhard Lazu is taking us on a journey into the world of shipping code, infrastructure, ops, and the people making it happen.\nShipping is near and dear to every developers’ heart. We do it every day. It’s the essential first step. You have to ship it to share your ideas with the world. New episodes ship weekly.\nDiscuss on Changelog News\nJoin Changelog++ to…",
          "link": "https://changelog.com/shipit/1",
          "publishedOn": "2021-05-28T12:00:00.000Z",
          "wordCount": 300,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 1: Introducing Ship It!"
        },
        {
          "description": "In this episode, we will talk about building for Blockchain in Go. We are joined by two of the co-founders of Prysmatic Labs (a company behind the upgrades to the Ethereum network). Raul Jordan and Preston Van Loon tell Angelica how they started the company, as well as what it’s like to build technical infrastructure for the Ethereum blockchain using Go.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nO&#39;Reilly Media – Learn by…",
          "link": "https://changelog.com/gotime/181",
          "publishedOn": "2021-05-27T15:30:00.000Z",
          "wordCount": 411,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 181: Building for Ethereum in Go"
        },
        {
          "description": "WireGuard Easy uses Docker to set up WireGuard VPN along with a web UI for easy management. While this may be the easiest way to get up and running, I’d still advise checking out Algo VPN as well since it’s also pretty easy and has been designed/configured with maximum security in mind. Still, this looks cool and the web admin UI makes it quite approachable as well.\n\nDiscuss on Changelog News",
          "link": "https://github.com/WeeJeWel/wg-easy",
          "publishedOn": "2021-05-27T14:13:00.000Z",
          "wordCount": 737,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The easiest way to install & manage WireGuard on any Linux host"
        },
        {
          "description": "rpg-cli is a bare-bones JRPG-inspired terminal game written in Rust. It can work as an alternative to cd where you randomly encounter enemies as you change directories.\nYou’ll want to practice a bit first, then once you get good at it go ahead and override the builtin cd by adding this function to your bash profile.\ncd () {\n   rpg-cli &quot;$@&quot;\n   builtin cd &quot;$(rpg-cli --pwd)&quot;\n}\n\n\nDiscuss on Changelog News",
          "link": "https://github.com/facundoolano/rpg-cli",
          "publishedOn": "2021-05-27T13:27:00.000Z",
          "wordCount": 1275,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "rpg-cli —your filesystem as a dungeon!"
        },
        {
          "description": "Chris Manson goes into detail about the benefits of a clean git history and describes some tips and tricks that really help you clean up your branches and Pull Requests.\nDiscuss on Changelog News",
          "link": "https://simplabs.com/blog/2021/05/26/keeping-a-clean-git-history/",
          "publishedOn": "2021-05-26T15:44:00.000Z",
          "wordCount": 3325,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The magic of keeping a clean Git history"
        },
        {
          "description": "Today we’re sharing a special crossover episode from The Changelog podcast here on Practical AI. Recently, Daniel Whitenack joined Jerod Santo to talk with José Valim, Elixir creator, about Numerical Elixir. This is José’s newest project that’s bringing Elixir into the world of machine learning. They discuss why José chose this as his next direction, the team’s layered approach, influences and collaborators on this effort, and their awesome collaborative notebook that’s built on Phoenix LiveView.\nDiscuss on…",
          "link": "https://changelog.com/practicalai/135",
          "publishedOn": "2021-05-26T14:45:00.000Z",
          "wordCount": 445,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 135: Elixir meets machine learning"
        },
        {
          "description": "Works out of the box, no configuration required. Great alternative to TeamViewer and AnyDesk! You have full control of your data, with no concerns about security. You can use our rendezvous/relay server, set up your own, or write your own rendezvous/relay server.\nThe built-in file transfer and tunneling look great.\nDiscuss on Changelog News",
          "link": "https://github.com/rustdesk/rustdesk",
          "publishedOn": "2021-05-26T14:32:00.000Z",
          "wordCount": 929,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "An open source RDP client in Rust"
        },
        {
          "description": "Tom MacWright on the pendulum swinging back and forth between simple and “fancy”\nTechnology is seeing a little return to complexity. Dreamweaver gave way to hand-coding websites, which is now leading into Webflow, which is a lot like Dreamweaver. Evernote give way to minimal Markdown notes, which are now becoming Notion, Coda, or Craft. Visual Studio was “disrupted” by Sublime Text and TextMate, which are now getting replaced by Visual Studio Code. JIRA was replaced by GitHub issues, which is getting outmod…",
          "link": "https://macwright.com/2021/03/16/return-of-fancy-tools.html",
          "publishedOn": "2021-05-26T13:32:00.000Z",
          "wordCount": 537,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The return of fancy tools"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": []
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": []
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "curl is a command line tool and library for doing Internet data transfers. It has been around for a loooong time (over 23 years) but there is still a flood of new things being added to it and development being made, to take it further and to keep it relevant today and in the future. &#8230; Continue reading What goes into curl? &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/16/what-goes-into-curl/",
          "publishedOn": "2021-06-15T22:19:25.000Z",
          "wordCount": 2055,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "What goes into curl?"
        },
        {
          "description": "In the afternoon of October 17, 2013 we merged the first config file ever that would use Travis CI for the curl project using the nifty integration at GitHub. This was the actual introduction of the entire concept of building and testing the project on every commit and pull request for the curl project. Before &#8230; Continue reading Bye bye Travis CI &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/14/bye-bye-travis-ci/",
          "publishedOn": "2021-06-14T09:14:30.000Z",
          "wordCount": 1432,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Bye bye Travis CI"
        },
        {
          "description": "In 2012 I wrote a blog post titled curling the metalink, describing how we added support for metalink to curl. Today, we remove that support again. This is a very drastic move, and I feel obliged to explain it so here it goes! curl 7.78.0 will ship without metalink support. Metalink problems There were several &#8230; Continue reading Bye bye metalink in curl &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/07/bye-bye-metalink-in-curl/",
          "publishedOn": "2021-06-07T07:06:19.000Z",
          "wordCount": 1076,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Bye bye metalink in curl"
        },
        {
          "description": "When you use the name localhost in a URL, what does it mean? Where does the network traffic go when you ask curl to download http://localhost ? Is &#8220;localhost&#8221; just a name like any other or do you think it infers speaking to your local host on a loopback address? Previously curl http://localhost The name &#8230; Continue reading curl localhost as a local host &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/31/curl-localhost-as-a-local-host/",
          "publishedOn": "2021-05-31T13:39:49.000Z",
          "wordCount": 1792,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl localhost as a local host"
        },
        {
          "description": "Thanks to funding by ISRG (via Google), we merged the hyper powered HTTP back-end into curl earlier this year as an alternative HTTP/1 and HTTP/2 implementation. Previously, there was only one way to do HTTP/1 and 2 in curl. Backends Core libcurl functionality can be powered by optional and alternative backends in a way that &#8230; Continue reading Taking hyper-curl further &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/28/taking-hyper-curl-further/",
          "publishedOn": "2021-05-28T16:04:12.000Z",
          "wordCount": 915,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Taking hyper-curl further"
        },
        {
          "description": "Part 1. The beginning. (There will be at least one more part later on following up the progress.) On May 18, 2021 I posted a tweet that I was giving away curl stickers for free to anyone who&#8217;d submit their address to me. It looked like this: Everyone once in a while when I post &#8230; Continue reading Giving away an insane amount of curl stickers &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/28/giving-away-an-insane-amount-of-curl-stickers/",
          "publishedOn": "2021-05-28T06:28:28.000Z",
          "wordCount": 1673,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Giving away an insane amount of curl stickers"
        },
        {
          "description": "The official publication date of the relevant QUIC specifications is: May 27, 2021. I&#8217;ve done many presentations about HTTP and related technologies over the years. HTTP/2 had only just shipped when the QUIC working group had been formed in the IETF and I started to mention and describe what was being done there. I&#8217;ve explained &#8230; Continue reading QUIC is RFC 9000 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/27/quic-is-rfc-9000/",
          "publishedOn": "2021-05-27T21:56:02.000Z",
          "wordCount": 1099,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "QUIC is RFC 9000"
        },
        {
          "description": "Welcome to the 200th curl release. We call it 200 OK. It coincides with us counting more than 900 commit authors and surpassing 2,400 credited contributors in the project. This is also the first release ever in which we thank more than 80 persons in the RELEASE-NOTES for having helped out making it and we&#8217;ve &#8230; Continue reading curl 7.77.0 &#8211; 200 OK &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/26/curl-7-77-0-200-ok/",
          "publishedOn": "2021-05-26T06:39:30.000Z",
          "wordCount": 1719,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.77.0 – 200 OK"
        },
        {
          "description": "For the eighth consecutive year we run the annual curl user survey again in 2021. The form just went up and I would love to have you spend 10 minutes of your busy life to tell us how you think curl works, what doesn&#8217;t work and what we should do next. We have no tracking &#8230; Continue reading The curl user survey 2021 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/05/24/the-curl-user-survey-2021/",
          "publishedOn": "2021-05-24T05:59:57.000Z",
          "wordCount": 819,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "The curl user survey 2021"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research",
          "publishedOn": "2021-06-12T12:16:09.237Z",
          "wordCount": 1480,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-06-12T12:16:07.738Z",
          "wordCount": 2271,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform",
          "publishedOn": "2021-06-12T12:16:07.716Z",
          "wordCount": 4867,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-06-12T12:16:07.669Z",
          "wordCount": 3218,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks",
          "publishedOn": "2021-06-12T12:16:07.122Z",
          "wordCount": 1631,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan",
          "publishedOn": "2021-06-12T12:16:07.090Z",
          "wordCount": 2259,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-06-12T12:16:07.078Z",
          "wordCount": 2213,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks",
          "publishedOn": "2021-06-12T12:16:07.052Z",
          "wordCount": 3594,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-06-12T12:16:07.028Z",
          "wordCount": 1783,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-06-12T12:16:07.003Z",
          "wordCount": 1451,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning.html",
          "publishedOn": "2021-06-10T12:18:41.631Z",
          "wordCount": 3223,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache.html",
          "publishedOn": "2021-06-10T12:18:41.304Z",
          "wordCount": 2282,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform.html",
          "publishedOn": "2021-06-10T12:18:41.281Z",
          "wordCount": 4864,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data.html",
          "publishedOn": "2021-06-10T12:18:41.156Z",
          "wordCount": 1788,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks.html",
          "publishedOn": "2021-06-10T12:18:41.108Z",
          "wordCount": 1639,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks.html",
          "publishedOn": "2021-06-10T12:18:41.091Z",
          "wordCount": 3583,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research.html",
          "publishedOn": "2021-06-10T12:18:41.075Z",
          "wordCount": 1486,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan.html",
          "publishedOn": "2021-06-10T12:18:40.872Z",
          "wordCount": 2250,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks.html",
          "publishedOn": "2021-06-02T12:58:42.871Z",
          "wordCount": 2201,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Hundreds of HackerOne customers use our platform in their application security processes. For the most part, these are organizations using bug bounty to find vulnerabilities in their deployed applications. But there is so much more that we can do for development teams",
          "link": "https://www.hackerone.com/blog/hackerone-devsecops-0",
          "publishedOn": "2021-06-21T17:00:00.000Z",
          "wordCount": 1690,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "HackerOne in DevSecOps"
        },
        {
          "description": "Vulnerability scanning helps companies identify possible ways an attacker could exploit vulnerabilities that might cause outages, allow unauthorized network access, or acquisition of privileged information. Outdated software products, unpatched operating systems, and misconfigured hardware often lead to vulnerabilities.",
          "link": "https://www.hackerone.com/blog/what-vulnerability-scanning-and-how-do-it-right-0",
          "publishedOn": "2021-06-18T17:00:00.000Z",
          "wordCount": 1723,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What is Vulnerability Scanning? [And How to Do It Right]"
        },
        {
          "description": "Developers need to bring security into their workflows without pivoting to separate security tools to get vulnerability information. HackerOne has created an integration with GitHub to streamline the process of including more security in the Software Development Life Cycle.",
          "link": "https://www.hackerone.com/blog/how-hackerone-and-github-now-work-better-together",
          "publishedOn": "2021-06-17T21:00:00.000Z",
          "wordCount": 711,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How HackerOne and GitHub Now Work Better Together"
        },
        {
          "description": "We recently sat down with Abhijith Chandrashekar, PSIRT Manager at Citrix, to discuss why Citrix continues to expand their bug bounty program and learn about their cloud security and scope expansion plans. Read on to see what he had to say.",
          "link": "https://www.hackerone.com/blog/citrixs-hacker-powered-security-growth-plan-qa-abhijith-chandrashekar",
          "publishedOn": "2021-06-16T15:00:00.000Z",
          "wordCount": 1610,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Citrix’s Hacker-Powered Security Growth Plan: Q&A with Abhijith Chandrashekar"
        },
        {
          "description": "Penetration testing, aka pen testing or ethical hacking, attempts to attempt to breach a system's security for the purpose of vulnerability identification. Testing is done in an authorized and structured manner to report and rectify so that weaknesses can be reported and rectified.",
          "link": "https://www.hackerone.com/blog/what-penetration-testing-how-does-it-work-step-step-0",
          "publishedOn": "2021-06-14T20:00:00.000Z",
          "wordCount": 2384,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What is Penetration Testing? How Does It Work Step-by-Step?"
        },
        {
          "description": "It's been 60 days since the DoD's Defense Industrial Base Vulnerability Disclosure Program (DIB-VDP) pilot launched. In this blog, DC3 and HackerOne sit down to talk about the pilot’s early successes, learnings to date, and their goals for the future.",
          "link": "https://www.hackerone.com/blog/60-days-insights-dods-defense-industrial-base-vulnerability-disclosure-program-pilot-1",
          "publishedOn": "2021-06-11T15:00:00.000Z",
          "wordCount": 1897,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "60 days of insights from the DoD’s Defense Industrial Base Vulnerability Disclosure Program Pilot"
        },
        {
          "description": "HackerOne sat down with DDS and Army program leaders and one of the security researchers who hacked the Army. We discussed why Hack the matters, the results that were uncovered in Hack the Army 3.0, and their plans for the future of cybersecurity within the DoD and the U.S. Military. Read on to see what they had to say.",
          "link": "https://www.hackerone.com/blog/announcing-hack-army-30-results-conversation-defense-digital-service-us-army-and-hack-army-0",
          "publishedOn": "2021-06-10T12:00:00.000Z",
          "wordCount": 2503,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Announcing Hack the Army 3.0 Results: A Conversation with Defense Digital Service, U.S. Army, and Hack the Army 3.0’s Top Hacker"
        },
        {
          "description": "Reducing risk is the fundamental reason organizations invest in cybersecurity. As the threat landscape grows and evolves, organizations need a proactive approach to building and protecting their security posture.",
          "link": "https://www.hackerone.com/blog/build-resilient-security-posture-vulnerability-intelligence-and-cybersecurity-ratings",
          "publishedOn": "2021-06-07T19:00:00.000Z",
          "wordCount": 1072,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Build a Resilient Security Posture with Vulnerability Intelligence and Cybersecurity Ratings"
        },
        {
          "description": "In March, Amazon sponsored HackerOne’s 10-day, virtual hacking event, which attracted more than 50 security researchers to identify potential vulnerabilities across Amazon’s core assets. Read on for highlights from the event.",
          "link": "https://www.hackerone.com/blog/hack-hard-have-fun-increase-security",
          "publishedOn": "2021-06-04T13:00:00.000Z",
          "wordCount": 1278,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Hack Hard. Have Fun. Increase Security"
        },
        {
          "description": "Last week, HackerOne joined WhiteSource, AWS, and IGT for a roundtable discussion about the new security challenges of digital transformation. The panel discussed cloud security, software supply chain security, and vulnerability disclosure programs as examples of proactive approaches organizations can take to mitigate their risk.",
          "link": "https://www.hackerone.com/blog/how-digital-transformation-changes-organizations-security-challenges",
          "publishedOn": "2021-06-03T16:00:00.000Z",
          "wordCount": 861,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How Digital Transformation Changes An Organization's Security Challenges"
        },
        {
          "description": "Microsoft says the state-backed Russian hacker group Nobelium—the same actor behind the 2020 SolarWinds attacks—took control of the State Department’s United States Agency for International Development email system. This bold attack, expected to be ongoing, breached federal government supplier systems sending out official-looking emails to over 3,000 accounts across more than 150 organizations.",
          "link": "https://www.hackerone.com/blog/microsoft-says-russian-solarwinds-hackers-hit-us-government-agencies-again",
          "publishedOn": "2021-06-02T15:05:00.000Z",
          "wordCount": 653,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Microsoft Says: Russian SolarWinds Hackers Hit U.S. Government Agencies Again"
        },
        {
          "description": "Server-side request forgery (or SSRF) vulnerabilities are particularly dangerous because they can lead to total system compromise. Discover where they’re most common, explore real-world examples, and learn prevention tips from hackers.",
          "link": "https://www.hackerone.com/blog/spotlight-server-side",
          "publishedOn": "2021-05-25T14:00:00.000Z",
          "wordCount": 1374,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Spotlight on the Server-Side"
        },
        {
          "description": "Last week’s U.S. Presidential Executive Order underscores the critical status of #cybersecurity in the U.S. Today, HackerOne CEO Marten Mickos shares his perspective on how private sector CEOs should take action and make security a collective internal priority for organizations.",
          "link": "https://www.hackerone.com/blog/time-issue-your-own-cyber-executive-order",
          "publishedOn": "2021-05-24T16:00:00.000Z",
          "wordCount": 1045,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Time to Issue Your Own Cyber Executive Order"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "When implementing a language feature for JavaScript, an implementer must make decisions about how the language in the specification maps to the implementation. Private fields is an example of where the specification language and implementation reality diverge, at least in SpiderMonkey– the JavaScript engine which powers Firefox. To understand more, I’ll explain what private fields are, a couple of models for thinking about them, and explain why our implementation diverges from the specification language.\nTh…",
          "link": "https://hacks.mozilla.org/2021/06/implementing-private-fields-for-javascript/",
          "publishedOn": "2021-06-08T15:26:19.000Z",
          "wordCount": 2659,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Implementing Private Fields for JavaScript"
        },
        {
          "description": "Firefox 89 has smartened up and brings with it a slimmed-down, slightly more minimalist interface.\nAlong with this new look, we get some great styling features including a force-colours feature for media queries and better control over how fonts are displayed. The long-awaited top-level await keyword for JavaScript modules is now enabled, as well as the PerformanceEventTiming interface, which is another addition to the performance suite of APIs: 89 really has been working out!\nThe post Looking fine with Fir…",
          "link": "https://hacks.mozilla.org/2021/06/looking-fine-with-firefox-89/",
          "publishedOn": "2021-06-01T15:19:01.000Z",
          "wordCount": 823,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Looking fine with Firefox 89"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "Throughout the beta, we added features to improve the experience of using the Container registry. Today, we’re excited to announce that the Container registry is generally available as part of GitHub Packages!",
          "link": "https://github.blog/2021-06-21-github-packages-container-registry-generally-available/",
          "publishedOn": "2021-06-21T19:04:56.000Z",
          "wordCount": 934,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Packages Container registry is generally available"
        },
        {
          "description": "The latest version of GitHub Desktop allows you to squash commits, squash and merge, reorder, amend your last commit, check out a branch from a previous commit, and more.",
          "link": "https://github.blog/2021-06-16-github-desktop-2-9-squashing-reordering-amending/",
          "publishedOn": "2021-06-16T16:00:57.000Z",
          "wordCount": 676,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Desktop 2.9 includes squashing, reordering, amending, and more!"
        },
        {
          "description": "What began as a small group effort in 2015 has now turned into a global initiative here at GitHub to amplify Black voices and talent in the tech community.",
          "link": "https://github.blog/2021-06-10-blacktocats-turn-five/",
          "publishedOn": "2021-06-10T19:03:23.000Z",
          "wordCount": 941,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Blacktocats turn five"
        },
        {
          "description": "In May, GitHub shipped a total of 20 new features. We love what we do, but we know it’s a lot to keep up with. So we’re trying something new on the GitHub Blog—a monthly recap of everything that shipped to Changelog in the past month. Check out some of the updates you might have missed.",
          "link": "https://github.blog/2021-06-10-whats-new-from-github-changelog-may-2021-recap/",
          "publishedOn": "2021-06-10T17:32:32.000Z",
          "wordCount": 739,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? May 2021 Recap"
        },
        {
          "description": "polkit is a system service installed by default on many Linux distributions. It’s used by systemd, so any Linux distribution that uses systemd also uses polkit. As a member of GitHub Security Lab, my job is to help improve the security of open source software by finding and reporting vulnerabilities. A few weeks ago, I found a privilege escalation vulnerability in polkit.",
          "link": "https://github.blog/2021-06-10-privilege-escalation-polkit-root-on-linux-with-bug/",
          "publishedOn": "2021-06-10T16:00:52.000Z",
          "wordCount": 2932,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Privilege escalation with polkit: How to get root on Linux with a seven-year-old bug"
        },
        {
          "description": "GitHub secret scanning has been securing our users’ code by scanning for and revoking secrets since 2015. Recently, we’ve focused on scanning for package registry credentials as well&#8212;a significant and important expansion on our original",
          "link": "https://github.blog/2021-06-08-securing-open-source-supply-chain-scanning-package-registry-credentials/",
          "publishedOn": "2021-06-08T16:00:30.000Z",
          "wordCount": 1679,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Securing the open source supply chain by scanning for package registry credentials"
        },
        {
          "description": "One month ago, we started a discussion with the community about proposed revisions to clarify GitHub’s policies on security research, malware, and exploits with the goal to enable, welcome, and encourage dual-use security research and",
          "link": "https://github.blog/2021-06-04-updates-to-our-policies-regarding-exploits-malware-and-vulnerability-research/",
          "publishedOn": "2021-06-04T16:00:30.000Z",
          "wordCount": 761,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Updates to our policies regarding exploits, malware, and vulnerability research"
        },
        {
          "description": "We&#8217;ve seen some amazing community projects this last month. This was a huge month for your community with hundreds of new releases. There’s everything from world-changing tech to weekend hobbies. It was almost too hard",
          "link": "https://github.blog/2021-06-04-release-radar-may-2021/",
          "publishedOn": "2021-06-04T09:00:57.000Z",
          "wordCount": 1478,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Release Radar · May 2021 Edition"
        },
        {
          "description": "GitHub Enterprise Server 3.1 is now generally available for all customers. It helps customers work with large, busy repositories, while enabling developers to develop and deploy with less effort than ever. This release includes: GitHub",
          "link": "https://github.blog/2021-06-03-github-enterprise-server-3-1-is-now-generally-available/",
          "publishedOn": "2021-06-03T16:00:48.000Z",
          "wordCount": 423,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Enterprise Server 3.1 is now generally available"
        },
        {
          "description": "In May, we experienced two incidents resulting in significant impact to multiple GitHub services.",
          "link": "https://github.blog/2021-06-02-github-availability-report-may-2021/",
          "publishedOn": "2021-06-03T00:00:00.000Z",
          "wordCount": 766,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: May 2021"
        },
        {
          "description": "We’re proud to share the new and improved Social Impact at GitHub website, and we’re really excited to share what our team has been working on! GitHub’s mission is to advance human progress. Our part",
          "link": "https://github.blog/2021-06-01-github-social-impact-driving-change-social-sector/",
          "publishedOn": "2021-06-01T16:00:35.000Z",
          "wordCount": 652,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Github Social Impact: How we’re driving change with social sector organizations"
        },
        {
          "description": "Over the years, GitHub engineers have developed many ways to observe how our systems behave. We mostly make use of statsd for metrics, the syslog format for plain text logs and OpenTracing for request traces.",
          "link": "https://github.blog/2021-05-26-why-and-how-github-is-adopting-opentelemetry/",
          "publishedOn": "2021-05-26T19:20:09.000Z",
          "wordCount": 1152,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Why (and how) GitHub is adopting OpenTelemetry"
        },
        {
          "description": "Table of contents Executive summary Key findings Key takeaways for developers and software teams About the study What we found Interruptions and meetings have a large influence on our days Take a minute to reflect",
          "link": "https://github.blog/2021-05-25-octoverse-spotlight-good-day-project/",
          "publishedOn": "2021-05-25T15:00:43.000Z",
          "wordCount": 4730,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Octoverse Spotlight 2021: The Good Day Project—Personal analytics to make your work days better"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "A huge part of Nubank’s Data Science team has been recently focusing on leveraging causal inference along with traditional machine learning to solve some of our toughest problems. This post aims at explaining why causal inference is such a powerful tool to solve business problems with data.\nThe post Beyond prediction machines appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/beyond-prediction-machines/",
          "publishedOn": "2021-06-16T20:29:14.000Z",
          "wordCount": 4455,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Beyond prediction machines"
        },
        {
          "description": "Series G becomes the largest private capital raise by a technology company in Latin America ever.\nThe post Nubank closes a second extension to its Series G round raising it to US$1.15B appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/investors-largest-private-capital-raise-in-latam/",
          "publishedOn": "2021-06-08T12:00:09.000Z",
          "wordCount": 3332,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank closes a second extension to its Series G round raising it to US$1.15B"
        },
        {
          "description": "The deal is an extension of the Series G round raised earlier this year for US$400 million\nThe post Nubank raises US$500 million from Berkshire Hathaway appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/investors-berkshire-hathaway/",
          "publishedOn": "2021-06-08T11:58:19.000Z",
          "wordCount": 3321,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank raises US$500 million from Berkshire Hathaway"
        },
        {
          "description": "Former Apple, Nike, and NBA Exec. will lead global marketing efforts as NuBank expands, following the brand's recent repositioning \nThe post Nubank appoints Arturo Nuñez as Chief Marketing Officer appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/arturo-nunez-new-nubank-chief-marketing-officer/",
          "publishedOn": "2021-06-02T16:02:45.000Z",
          "wordCount": 3319,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank appoints Arturo Nuñez as Chief Marketing Officer"
        },
        {
          "description": "Platformization has been a trend for a while, but how do we do this? How do you go from a product perspective to abstractions on a platform? We want to share with you a real case that we consider one of the greatest challenges taken by Nubank so far!\nThe post Nubank Credit Card from Product to Platform mindset appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-credit-card-from-product-to-platform-mindset/",
          "publishedOn": "2021-05-25T18:52:09.000Z",
          "wordCount": 4491,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Nubank Credit Card from Product to Platform mindset"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}