{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/06/game-on-2022-google-ctf-is-here.html",
          "author": null,
          "description": "Posted by Jan Keller, Technical Entertainment Manager, Bug Hunters \n\n\n\n\n\n\nAre you ready to put your hacking skills to the test? It’s Google CTF time!\nThe competition kicks off on July 1 2022 6:00 PM UTC and runs through July 3 2022 6:00 PM UTC. Registration is now open at http://goo.gle/ctf.\nIn true old Google CTF fashion, the top 8 teams will qualify for our Hackceler8 speedrunning meets CTFs competition. The prize pool stands similar to previous years at more than $40,000.\n\n\n\n\n\n\nWe can’t wait to see whether PPP will be able to defend their crown. For those of you looking to satisfy your late-night hacking hunger: past year's challenges, including Hackceler8 2021 matches, are open-sourced here. On top of that there are hours of Hackceler8 2020 videos to watch!\nIf you are just starting out in this space, last year’s Beginner’s Quest is a great resource to get started. For later in the year, we have something mysterious planned - stay tuned to find out more!\n\n\nWhether you’re a seasoned CTF player or just curious about cyber security and ethical hacking, we want you to join us. Sign up to expand your skill set, meet new friends in the security community, and even watch the pros in action. For the latest announcements, see g.co/ctf, subscribe to our mailing list, or follow us on @GoogleVRP. Interested in bug hunting for Google? Check out bughunters.google.com. See you there!",
          "link": "http://security.googleblog.com/2022/06/game-on-2022-google-ctf-is-here.html",
          "publishedOn": "2022-06-21T16:00:00.002Z",
          "wordCount": 717,
          "title": "Game on! The 2022 Google CTF is here."
        },
        {
          "id": "http://security.googleblog.com/2022/06/sbom-in-action-finding-vulnerabilities.html",
          "author": null,
          "description": "Posted by Brandon Lum and Oliver Chang, Google Open Source Security Team\n\n\n\nThe past year has seen an industry-wide effort to embrace Software Bills of Materials (SBOMs)—a list of all the components, libraries, and modules that are required to build a piece of software. In the wake of the 2021 Executive Order on Cybersecurity, these ingredient labels for software became popular as a way to understand what’s in the software we all consume. The guiding idea is that it’s impossible to judge the risks of particular software without knowing all of its components—including those produced by others. This increased interest in SBOMs saw another boost after the National Institute of Standards and Technology (NIST) released its Secure Software Development Framework, which requires SBOM information t…",
          "link": "http://security.googleblog.com/2022/06/sbom-in-action-finding-vulnerabilities.html",
          "publishedOn": "2022-06-14T16:00:00.002Z",
          "wordCount": 2179,
          "title": "SBOM in Action: finding vulnerabilities with a Software Bill of Materials"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/1/1709",
          "author": null,
          "description": "We’re listening! This week’s experimental, super-brief Monday edition of “The Changelog” has the following new features: It’s longer, there’s no background music during the stories, and it includes stories previously not featured in the newsletter.\nIf you like this better than the last one, would listen to it, and want us to keep it going… let us know in the comments or by tweeting @changelog!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly\nChangelog Weekly #412\nThe 4.5 Kinds of DevTool Platforms\nThings you should know about databases\nStart all of your commands with a comma\nOne Decade of Lobsters\nThe really important job interview questions engineers should ask (but don’t)\n2053: A Go Odyssey with Ron Evans\nupptime\nOxide Computer\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-07-04",
          "publishedOn": "2022-07-05T20:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog DevTool platform types, things to know about databases, starting with commas, Lobsters turns 10 &  Upptime",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-07-04/the-changelog-news-2022-07-04.mp3",
            "length": "7979651",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/1W3r",
          "author": "Jerod Santo",
          "description": "Functional programming is powerful in many ways, but it can be difficult for devs to learn because the jargon stops them in their tracks. If that’s been your experience, this glossary of terms and examples might help. Pair that with listening to Eric Normand talk about FP in simple terms with us on The Changelog and JS Party and you’ll be well on your way.\nDiscuss on Changelog News",
          "link": "https://github.com/hemanth/functional-programming-jargon",
          "publishedOn": "2022-07-05T14:30:00.000Z",
          "wordCount": null,
          "title": "FP jargon in simple terms",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1zb",
          "author": "Jerod Santo",
          "description": "Jeremy Brown:\nIt feels bizarre saying this, having spent so much of my life advocating for and selling a distribution of Kubernetes and consulting services to help folks get the most of out it, but here goes! YOU probably shouldn’t use Kubernetes and a bunch of other “cool” things for your product.\nThis post turns out to be less about Kubernetes and more about premature optimization and doing more with less. Also it’s about Kubernetes. 😉\nDiscuss on Changelog News",
          "link": "https://www.jeremybrown.tech/8-kubernetes-is-a-red-flag-signalling-premature-optimisation/",
          "publishedOn": "2022-07-05T13:41:00.000Z",
          "wordCount": null,
          "title": "Kubernetes is a red flag signalling premature optimisation",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1646",
          "author": null,
          "description": "Adam and Jerod are joined once again by James Long. He was on the podcast five years ago discussing the surprise success of Prettier, an opinionated code formatter that’s still in use to this day. This time around we’re going deep on Actual, his personal finance system James built as a business for over 4 years before recently opening it up and making it 100% free.\nHas James given up on the business? Or will this move Actual(ly) breathe new life into a piece of software that’s used and beloved by many? Tune in to find out.\nDiscuss on Changelog News\nChangelog++ members get a bonus 27 minutes at the end of this episode and zero ads. Join today!\nSponsors\nInfluxData – The time series platform for building and operating time series applications — InfluxDB empowers developers to build IoT, analy…",
          "link": "https://changelog.com/podcast/495",
          "publishedOn": "2022-07-01T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 495: Actual(ly) opening up",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/495/the-changelog-495.mp3",
            "length": "92129355",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwOg",
          "author": "Jerod Santo",
          "description": "Brenton Cleeland starts a lot of projects. Django is his go-to framework, so he’s settled on these common steps he performs right after django-admin startproject\nMove the SECRET_KEY into an environment variable\nChange the database configuration to DATABASE_URL\nSet up a custom user model\nCreate your Django app\nMake a base.html\nGibo and Git Init\nDiscuss on Changelog News",
          "link": "https://brntn.me/blog/six-things-i-do-every-time-i-start-a-django-project/",
          "publishedOn": "2022-07-01T19:25:00.000Z",
          "wordCount": null,
          "title": "Six things I do every time I start a Django project",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/EqQd",
          "author": "Jerod Santo",
          "description": "A collection of ASCII data structures, state machines, logical structures, and more.\nPeople tend to be visual: we use pictures to understand problems. Mainstream programming languages, on the other hand, operate in an almost completely different kind of abstract space, leaving a big gap between programs and pictures. This piece is about pictures drawn using a text character set and then embedded in source code.\nDiscuss on Changelog News",
          "link": "https://blog.regehr.org/archives/1653",
          "publishedOn": "2022-07-01T18:38:00.000Z",
          "wordCount": null,
          "title": "Explaining code using ASCII art",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1676",
          "author": null,
          "description": "Jerod, Nick & Ali partake in a few rounds of Story of the Week, TIL, and I’m Excited about $X. Oh, and is TypeScript the new Java? Nick responds and emotes all over the place! 😆\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nJerod Santo – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nStory of the Week\nDeno raises $21m\n\nRyan Dahl on The Changelog #443\nKitson Kelly on JS Party #127\nGitHub Copilot pricing announced\nAmazon Codewhisperer\nBrave Search Goggles\nRIP Atom\n\nhello, Zed\nToday I Learned\nSimon Willison’s CSV/SQlite one-liner\nfzf\njqq\nMikeal’s TypeScript tweet\nI’m Excited About $X\nSvelte Origins doc\nNoclip\nlofi.co\nWork from home with me 3 HRS\nKan Jam\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/232",
          "publishedOn": "2022-07-01T16:40:00.000Z",
          "wordCount": null,
          "title": "JS Party 232: Sophisticated Cornhole",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/232/js-party-232.mp3",
            "length": "56277331",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJom",
          "author": "Jerod Santo",
          "description": "I logged upptime a couple years ago, but every time it crosses my path I’m so impressed by how stinkin’ clever the setup is that I just had to share it again.\n\nDiscuss on Changelog News",
          "link": "https://github.com/upptime/upptime",
          "publishedOn": "2022-07-01T15:05:00.000Z",
          "wordCount": null,
          "title": "Free uptime monitor and status page powered entirely by GitHub",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1yW",
          "author": "Jerod Santo",
          "description": "After many years of gradual improvement Vim now takes a big step with a major release. Besides many small additions the spotlight is on a new incarnation of the Vim script language: Vim9 script.\nOne of Neovim’s major draws is that you can avoid Vim script altogether and use Lua instead. It looks like the Vim team is addressing the two major complaints folks have with Vim script: performance and its obscure syntax:\nThe main goal of Vim9 script is to drastically improve performance. This is accomplished by compiling commands into instructions that can be efficiently executed. An increase in execution speed of 10 to 100 times can be expected.\nA secondary goal is to avoid Vim-specific constructs and get closer to commonly used programming languages, such as JavaScript, TypeScript and Java.\nLegacy scripts will continue to work, of course. The Vim team has no plans to drop legacy support in the foreseeable future. Learn more about Vim9 script here or with :help vim9 inside Vim itself.\nDiscuss on Changelog News",
          "link": "https://www.vim.org/vim90.php",
          "publishedOn": "2022-07-01T14:19:00.000Z",
          "wordCount": null,
          "title": "Vim's big 9.0 release brings with it a new scripting language",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1686",
          "author": null,
          "description": "A deep discussion on that tension between development speed and software quality. What is velocity? How does it differ from speed? How do we measure it? How do we optimize it?\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.io\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD and enterprise services to the cloud or on premise. They’re inviting our listeners to join the closed beta at akuity.io/changelog. The platform is a versatile Kubernetes operator for handling cluster deployments the GitOps way. Deploy your apps instantly and monitor their state — get minimum overhead, maximum impact, and enterprise readiness from day one.\n\n    \nFeaturing\nNatalie Pistunovich – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nNoise: A Flaw in Human Judgment\nMindset: The New Psychology of Success\nHow to Use the Fibonacci Scale in Agile Estimation\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/236",
          "publishedOn": "2022-06-30T16:40:00.000Z",
          "wordCount": null,
          "title": "Go Time 236: Thoughts on velocity",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/236/go-time-236.mp3",
            "length": "73684637",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V1Re",
          "author": "Jerod Santo",
          "description": "I love the name “YOLO” for this because it’s single-stage, but I have to laugh that it’s now on its sixth version. You only live once… six times? 😆\n\nDiscuss on Changelog News",
          "link": "https://github.com/meituan/YOLOv6",
          "publishedOn": "2022-06-30T15:10:00.000Z",
          "wordCount": null,
          "title": "A single-stage object detection framework for industrial applications",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgq0",
          "author": "Jerod Santo",
          "description": "VirtualBuddy can virtualize macOS 12 and later on Apple Silicon, with the goal of offering features that are useful to developers who need to test their apps on multiple versions of macOS, especially betas.\n\nDiscuss on Changelog News",
          "link": "https://github.com/insidegui/VirtualBuddy",
          "publishedOn": "2022-06-30T14:24:00.000Z",
          "wordCount": null,
          "title": "VirtualBuddy lets you virtualize macOS 12 and later on Apple Silicon",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1654",
          "author": null,
          "description": "Ben Johnson, the creator of Litestream, joined Fly.io a few weeks after we migrated changelog.com - episode 50 has all the details. That was pure coincidence. What was not a coincidence, is Gerhard jumping at the opportunity to talk to Ben about Postgres vs SQLite with Litestream.\nThe prospect of running a cluster of our app instances spread across all regions, with local SQLite & Litestream replication, is mind boggling. Let’s find out from Ben what will it take to get there.  Thanks Kürt for kicking off this dream.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry hel…",
          "link": "https://changelog.com/shipit/59",
          "publishedOn": "2022-06-29T21:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 59: Postgres vs SQLite with Litestream",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/59/ship-it-59.mp3",
            "length": "71260024",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1Rk",
          "author": "Jerod Santo",
          "description": "Miguel Grinberg built a SQLite-backed web app for the blogging team at Twilio to track their effectiveness that started to respond slugishly when it grew much bigger than he expected (6.5 million individual daily traffic records, and with a user base that grew to over 200 employees).\nHe thought this might be a good time to switch to Postgres, but he wasn’t sure if the wins he expected would be realized:\nHaving publicly professed my dislike of performance benchmarks, I resisted the urge to look up any comparisons online, and instead embarked on a series of experiments to accurately measure the performance of these two databases for the specific use cases of this application.\nIn this in-depth article on Twilio’s blog (no doubt being tracked by Miguel’s web app as we speak) he goes into the details of his efforts with lots of interesting findings along the way (even a plot twist!). I’ll leave you with this statement from the end:\nIf you are going to take one thing away from this article, I hope it is that the only benchmarks that are valuable are those that run on your own platform, with your own stack, with your own data, and with your own software. And even then, you may need to add custom optimizations to get the best performance.\nDiscuss on Changelog News",
          "link": "https://www.twilio.com/blog/sqlite-postgresql-complicated",
          "publishedOn": "2022-06-29T14:55:00.000Z",
          "wordCount": null,
          "title": "SQLite or PostgreSQL? It's complicated!",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ojkR",
          "author": "Jerod Santo",
          "description": "James Hawkins, after being on a team that’s interviewed over 725 people:\nIt’s normal for candidates not to ask harder questions about our company, so they usually miss out on a chance to (i) de-risk our company’s performance and (ii) to increase the chances they’ll like working here.\nDoes the company have product-market fit? How much runway does the company have? Does their spending look within reason? What’s the culture like? And more tough questions that you really should be asking before accepting that offer.\nDiscuss on Changelog News",
          "link": "https://posthog.com/blog/what-to-ask-in-interviews",
          "publishedOn": "2022-06-29T14:06:00.000Z",
          "wordCount": null,
          "title": "Really important job interview questions engineers should ask (but don't)",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1694",
          "author": null,
          "description": "Drausin Wulsin, Director of ML at Immunai, joins Daniel & Chris to talk about the role of AI in immunotherapy, and why it is proving to be the foremost approach in fighting cancer, autoimmune disease, and infectious diseases.\nThe large amount of high dimensional biological data that is available today, combined with advanced machine learning techniques, creates unique opportunities to push the boundaries of what is possible in biology.\nTo that end, Immunai has built the largest immune database called AMICA that contains tens of millions of cells. The company uses cutting-edge transfer learning techniques to transfer knowledge across different cell types, studies, and even species.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nDrausin Wulsin – LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nImmunai\nImmunai Fact Sheet\nDrausin Wulsin | LinkedIn\nDrausin Wulsin | Google Scholar\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/183",
          "publishedOn": "2022-06-28T19:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 183: AI's role in reprogramming immunity",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/183/practical-ai-183.mp3",
            "length": "47408495",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/GWm9",
          "author": "Jerod Santo",
          "description": "The P in PRQL (pronounced “Prequel”) stands for Pipelined, which I’m convinced is a great way of writing and reasoning about queries:\nA PRQL query is a linear pipeline of transformations\nEach line of the query is a transformation of the previous line’s result. This makes it easy to read, and simple to write.\nIt compiles to SQL, which means it’s compatible with most databases already and there are currently bindings for Python, JS & Rust, which is the compiler itself.\nTry it out in their web-based playground. (Thanks, Wasm!)\nDiscuss on Changelog News",
          "link": "https://prql-lang.org/",
          "publishedOn": "2022-06-28T15:47:00.000Z",
          "wordCount": null,
          "title": "PRQL is a modern language for transforming data",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE6N",
          "author": "Jerod Santo",
          "description": "This is a minimal implementation of DALL·E Mini.  It has been stripped to the bare essentials necessary for doing inference, and converted to PyTorch.  The only third party dependencies are torch for the torch model and flax for the flax model.\nHow much mini-er can it get from here? 🤔\nDiscuss on Changelog News",
          "link": "https://github.com/kuprel/min-dalle",
          "publishedOn": "2022-06-28T14:57:00.000Z",
          "wordCount": null,
          "title": "A minimal implementation of DALL·E Mini",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Rdwp",
          "author": "Jerod Santo",
          "description": "Excellent prose and super-useful diagrams make this post from architecture notes a 10/10 🏆\n\nDiscuss on Changelog News",
          "link": "https://architecturenotes.co/things-you-should-know-about-databases/",
          "publishedOn": "2022-06-28T14:05:00.000Z",
          "wordCount": null,
          "title": "Things you should know about databases",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1693",
          "author": null,
          "description": "We’re experimenting with something new: a super-brief Monday edition of “The Changelog” to help start your week off right and keep you up with the fast-moving software world.\nIf you like this, would listen to it, and want us to keep it going… let us know in the comments or by tweeting @changelog. If you’d rather we didn’t… also let us know!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly\nChangelog Weekly #412\nMarkwhen is like Markdown for timelines\nTauri 1.0 Release\nWhy products should be “slick”, not just viable\nI hate MVPs. So do your customers. Make it SLC instead.\nNo-one knows what they are doing\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-06-27",
          "publishedOn": "2022-06-27T17:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog Markwhen, Tauri 1.0, SLCs & imposters",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-06-27/the-changelog-news-2022-06-27.mp3",
            "length": "6454854",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/O5om",
          "author": "Jerod Santo",
          "description": "Rewind like video, see output in a pager, Vim-like keymaps, and more. “Viddy well, gopher. Viddy well.”\n\nDiscuss on Changelog News",
          "link": "https://github.com/sachaos/viddy",
          "publishedOn": "2022-06-27T14:13:00.000Z",
          "wordCount": null,
          "title": "Viddy – a modern watch command with time machine mode",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WOr",
          "author": "Jerod Santo",
          "description": "Brandon Rhodes’s solution to conflicts between his ~/bin scripts and system binaries: the humble comma\nI heartily recommend this technique to anyone with their own ~/bin/ directory who wants their command names kept clean, tidy, and completely orthogonal to any commands that the future might bring to your system. The approach has worked for me for something like a decade, so you should find it immensely robust. And, finally, it’s just plain fun.\nDiscuss on Changelog News",
          "link": "https://rhodesmill.org/brandon/2009/commands-with-comma/",
          "publishedOn": "2022-06-27T13:26:00.000Z",
          "wordCount": null,
          "title": "Start all of your commands with a comma",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1675",
          "author": null,
          "description": "Nick went to Amsterdam for JSNation & React Summit 2022 and he joins Jerod to report on all the goodness! He also sits down with two special guests involved with the confs to talk Jest Preview and GraphQL Cache\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nHung Nguyen – Twitter, GitHub, Website\nRaman Lally – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nNick’s Tweet thread\nYulia Startsev on JS Party #180\nHung on Twitter\nJest Preview\nJest Preview on GitHub\nOS Awards\nRaman’s talk at React Summit\nApollo Client\nReact Query\nGraphQL Tag\nGraphQL Code Generator\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/231",
          "publishedOn": "2022-06-24T19:15:00.000Z",
          "wordCount": null,
          "title": "JS Party 231: Ahoy hoy, JSNation & React Summit!",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/231/js-party-231.mp3",
            "length": "69131242",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1668",
          "author": null,
          "description": "Adam and Jerod are joined by Ken Kantzer, co-founder of PKC Security. Ken and his team performed upwards of 20 code audits on well-funded startups. Now that it’s 7 or 8 years later, he wrote up 16 surprising observations and things he learned looking back at the experience. We gotta discuss ’em all!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nIn…",
          "link": "https://changelog.com/podcast/494",
          "publishedOn": "2022-06-24T16:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 494: Lessons from 5 years of startup code audits",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/494/the-changelog-494.mp3",
            "length": "95547860",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlLw",
          "author": "Jerod Santo",
          "description": "⇄  Verifies across many different databases\n🔍 Outputs diffs of rows in detail\n🚨 Simple CLI/API to create monitoring and alerts\n🔁 Bridges column types of different formats and levels of precision\n🔥 Verify 25M+ rows in <10s, and 1B+ rows in ~5min\n♾️  Works for tables with 10s of billions of rows\nDiscuss on Changelog News",
          "link": "https://github.com/datafold/data-diff",
          "publishedOn": "2022-06-24T14:51:00.000Z",
          "wordCount": null,
          "title": "Efficiently diff rows across two different databases",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqkN",
          "author": "Jerod Santo",
          "description": "Speaking this morning at The Linux Foundation’s Open-Source Summit, Linus Torvalds talked up the possibilities of Rust within the Linux kernel and that it could be landing quite soon – possibly even for the next kernel cycle…\nThe Linux 5.20 merge window will open following the release of Linux 5.19 stable around the end of July, so at that point we’ll see if the Rust PR is submitted and lands for this next kernel version. It wouldn’t be too surprising with how things have been pacing and already having the blessing of Linus.\nLots of positivity about this in the attached comment thread.\nDiscuss on Changelog News",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-For-Linux-5.20-Possible",
          "publishedOn": "2022-06-24T14:05:00.000Z",
          "wordCount": null,
          "title": "Linus Torvalds: Rust for the kernel could possibly be merged for Linux 5.20",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6r1P",
          "author": "Jerod Santo",
          "description": "The Documentary tells the story of how Svelte came to be, what makes Svelte different, and how it changes the game as a JavaScript framework. Filmed in locations throughout Europe and the US, it features Svelte’s creator Rich Harris and members from the core community who contributed to making Svelte what it is today.\nLots of familiar faces in this one.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=kMlkCYL9qo0",
          "publishedOn": "2022-06-24T13:15:00.000Z",
          "wordCount": null,
          "title": "Svelte Origins: A JavaScript Documentary",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1674",
          "author": null,
          "description": "The year is 2053. The tabs-vs-spaces wars are long over. Ron Evans is the only Go programmer still alive on Earth. All he does is maintain old Go code. It’s terrible! He must find a way to warn his fellow gophers before it’s too late. Good thing he finally got that PDQ transmission system working…\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.io\n\n    \nLaunchDarkly – Fundamentally change how you deliver software. Innovate faster, deploy fearlessly, and make each release a masterpiece.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nRon Evans – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nNotes and Links\nNew merch!\nGraphite on The Changelog\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/235",
          "publishedOn": "2022-06-23T15:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 235: 2053: A Go Odyssey",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/235/go-time-235.mp3",
            "length": "53885792",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/04OO",
          "author": "Jerod Santo",
          "description": "Laravel Pint is a zero-dependency PHP code style fixer for minimalists - built on top of PHP-CS-Fixer. Pint makes it simple to ensure that your code style stays clean and consistent.\n\nDiscuss on Changelog News",
          "link": "https://github.com/laravel/pint",
          "publishedOn": "2022-06-23T14:45:00.000Z",
          "wordCount": null,
          "title": "Laravel Pint is a minimalist code style fixer for PHP",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pjXe",
          "author": "Jerod Santo",
          "description": "Goggles enable anyone, be it individuals or a community, to alter the ranking of Brave search by using a set of instructions (rules and filters). Anyone can create, apply, or extend a Goggle. Essentially Goggles act as a custom re-ranking on top of Brave’s search index.\nThis could be really cool! A few examples use cases:\nNo Pinterest - Rerank results to remove pages / threads hosted on Pinterest.\nRust programming - Rerank results to boost content related to the Rust programming language.\nHacker News / 1k short – Prioritizes domains popular with the Hacker News community, minus those that would rank among the top 1000 most-viewed websites.\nDiscuss on Changelog News",
          "link": "https://github.com/brave/goggles-quickstart",
          "publishedOn": "2022-06-23T13:53:00.000Z",
          "wordCount": null,
          "title": "Brave Search Goggles",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1648",
          "author": null,
          "description": "Rob Barnes (a.k.a. Devops Rob) and Rosemary Wang (author of Infrastructure as Code - Patterns & Practices) are joining us today to talk about infrastructure secrets.\nWhat do Rosemary and Rob think about committing encrypted secrets into a repository? How do they suggest that we improve on storing secrets in LastPass? And if we were to choose HashiCorp Vault, what do we need to know?\nThank you Thomas Eckert for the intro. Thank you Nabeel Sulieman (ep. 46) & Kelsey Hightower (ep. 44) for your gentle nudges towards improving our infra secrets management.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. Fire…",
          "link": "https://changelog.com/shipit/58",
          "publishedOn": "2022-06-22T20:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 58: How to keep a secret",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/58/ship-it-58.mp3",
            "length": "71089055",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/LW1g",
          "author": "Jerod Santo",
          "description": "Building products is a difficult and time-consuming effort. Figuring out what the problems, finding a potential solution to that problem, and then building that solution all take a decent chunk of time and effort. It’s due to this process that the minimum viable product was born. The motivation for building an MVP is still valid. Build something small and easy to test, launch quickly, and pivot or trash it if it doesn’t perform as desired.\nThere is another, less selfish way.\nI read an article by Jason Cohen a few years ago which changed the way I think about product development. Instead of building MVPs, we should be building SLCs. Something Simple, Loveable, and Complete.\nI like the thinking behind SLCs. So simple, so loveable, so…\nHat tip to Henry Snopek for linking this up in the #gotimefm channel of Gophers Slack! When it comes to thinking about your projects, Henry says:\nI like to use MVP for fast projects, and SLC for “effective” projects…\nYeah, I like that framing too. So simple, so loveable, so…\nDiscuss on Changelog News",
          "link": "https://herman.bearblog.dev/mvp-vs-slc/",
          "publishedOn": "2022-06-22T16:29:00.000Z",
          "wordCount": null,
          "title": "The problem is that your users hate MVPs",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1684",
          "author": null,
          "description": "While scaling up machine learning at Instacart, Montana Low and Lev Kokotov discovered just how much you can do with the Postgres database. They are building on that work with PostgresML, an extension to the database that lets you train and deploy models to make online predictions using only SQL. This is super practical discussion that you don’t want to miss!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMontana Low – Twitter, GitHub, LinkedIn\nLev Kokotov – GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nPostgresML website\nPostgresML on GitHub\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/182",
          "publishedOn": "2022-06-22T14:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 182: Machine learning in your database",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/182/practical-ai-182.mp3",
            "length": "47764312",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1RW",
          "author": "Jerod Santo",
          "description": "There’s a long history of timeline tools for the web, but most of them had you inserting the data into an XML file, a JSON object, or worse yet: the HTML itself. Markdown-style plain text to the rescue?\n\nDiscuss on Changelog News",
          "link": "https://markwhen.com/",
          "publishedOn": "2022-06-22T14:12:00.000Z",
          "wordCount": null,
          "title": "Markwhen is like Markdown for timelines",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDWY",
          "author": "Jerod Santo",
          "description": "Simon Willison figured out how to run a SQL query directly against a CSV file using the sqlite3 CLI:\nsqlite3 :memory: -cmd '.mode csv' -cmd '.import taxi.csv taxi' \\\n  'SELECT passenger_count, COUNT(*), AVG(total_amount) FROM taxi GROUP BY passenger_count'\n\nIe TL;DR’d the one-liner for ya, but you’ll have to go to Simon’s site for the explainer.\nDiscuss on Changelog News",
          "link": "https://til.simonwillison.net/sqlite/one-line-csv-operations",
          "publishedOn": "2022-06-21T17:19:00.000Z",
          "wordCount": null,
          "title": "One-liner for running queries against CSV files with SQLite",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW1o",
          "author": "Jerod Santo",
          "description": "While still in its infancy, MLOps has attracted machine learning engineers and software engineers in general. With every new paradigm comes new challenges and opportunities to learn. In this primer, we highlight a few available resources to upskill and inform yourself on the latest in the world of MLOps.\nGood resources, regardless of whether you think MLOps is its own thing or should be rolled into DevOps.\nDiscuss on Changelog News",
          "link": "https://github.com/dair-ai/MLOPs-Primer",
          "publishedOn": "2022-06-21T16:25:00.000Z",
          "wordCount": null,
          "title": "A collection of resources to learn about MLOps",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/bJWe",
          "author": "Jerod Santo",
          "description": "AppleInsider explains Apple’s new Private Access Tokens (PAT) tech announced at WWDC:\nUsing a new HTTP authentication method called PrivateToken, a server uses cryptography to verify a client passed an iCloud attestation check.\nWhen the client needs a token it contacts an attester — in this case, Apple — which performs the process using certificates stored in the device’s Secure Enclave.\nI’ve been waiting for someone to kill CAPTCHAs for us, but this will be an Apple-only solution for now:\nThe company is working to help make Private Access Tokens a web standard, but there is no mention of tokens working on Android or Windows. People on those platforms may have to put up with CAPTCHAs, for now — or wait for Microsoft’s and Google’s work on the matter.\nI believe this is the draft of the standard that they’re referring to. Cloudflare also has a nice article on their work in this space.\nDiscuss on Changelog News",
          "link": "https://appleinsider.com/articles/22/06/14/how-apple-could-kill-captchas-with-private-access-tokens",
          "publishedOn": "2022-06-21T15:35:00.000Z",
          "wordCount": null,
          "title": "How Apple could kill CAPTCHAs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1RX",
          "author": "Jerod Santo",
          "description": "Wise words from Andy Brice:\nWhen I was a child I assumed that all the adults running the world knew what they were doing. Now that I am an adult, I am under no such illusions…\nI’m going to let you in on a little secret. Most of us who are running businesses had no real idea what they were doing when they started, and still struggle with decisions now.\nI tell people this all the time when they ask me for advice. I’ll still give them my advice. But it comes with the disclaimer that I really have no idea what I’m doing. 😆\nDiscuss on Changelog News",
          "link": "https://successfulsoftware.net/2022/06/19/no-one-knows-what-they-are-doing/",
          "publishedOn": "2022-06-21T14:49:00.000Z",
          "wordCount": null,
          "title": "No-one knows what they are doing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZozM",
          "author": "Jerod Santo",
          "description": "Tauri is an app framework built with Rust. You build UIs for it using virtually any frontend JavaScript framework. It has three major tenets: security, privacy, and environment. Speaking to the latter:\nThe apps you make are lean and performant, which reduces electricity, storage space, and general natural resource consumption. Every byte saved is a leaf on a tree that gets to grow.\nThis project has gotten a lot of early interest because, well, people have been waiting for an Electron alternative to emerge. Now that Tauri is 1.0 I’m guessing adoption will really start to take off.\nEven more good news: we have an episode on Tauri in the hopper for ya 💪\nDiscuss on Changelog News",
          "link": "https://tauri.app/blog/tauri_1_0/",
          "publishedOn": "2022-06-20T16:49:00.000Z",
          "wordCount": null,
          "title": "Tauri (a cross-platform app toolkit) goes 1.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V12Z",
          "author": "Jerod Santo",
          "description": "Bunny Fonts is an open-source, privacy-first web font platform designed to put privacy back into the internet.\nWith a zero-tracking and no-logging policy, Bunny Fonts helps you stay fully GDPR compliant and puts your user’s personal data into their own hands. Additionally, you can enjoy lightning-fast load times thanks to bunny.net’s global CDN network to help improve SEO and deliver a better user experience.\nAll font in the collection are fully open source, which means you can use them without fees even in commercial offerings.\nDiscuss on Changelog News",
          "link": "https://fonts.bunny.net/about",
          "publishedOn": "2022-06-20T16:03:00.000Z",
          "wordCount": null,
          "title": "A GDPR compliant drop-in replacement for Google Fonts",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1649",
          "author": null,
          "description": "This week Lee Robinson joins us to talk about his journey as a DevRel. We talk about what it means to be a DevRel, what orgs they fall under, how he runs his team at Vercel, Lee’s three pillars of DevRel: education, community, and product, we compare the old days of DevRel vs now, and of course what makes a DevRel a good DevRel.\nDiscuss on Changelog News\nChangelog++ members get a bonus 3 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The …",
          "link": "https://changelog.com/podcast/493",
          "publishedOn": "2022-06-20T15:15:00.000Z",
          "wordCount": null,
          "title": "The Changelog 493: What even is a DevRel?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/493/the-changelog-493.mp3",
            "length": "72962772",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/JgXe",
          "author": "Jerod Santo",
          "description": "Many organizations such as Commoncrawl, WebRecorder, Archive.org and libraries around the world, use the warc format to archive and store web data.\nThe full datasets of these services range in the few pebibytes(PiB), making them impractical to query using non-distributed systems.\nThis project aims to make subsets such data easier to access and query using SQL.\nCrawl a site with wget and import it into WarcDB:\nwget --warc-file changelog \"https://changelog.com\"\n\nwarcdb import archive.warcdb changelog.warc.gz\n\nThen you can query away using SQL, such as this one to get all response headers:\nsqlite3 archive.warcdb <<SQL\nselect  json_extract(h.value, '$.header') as header, \n        json_extract(h.value, '$.value') as value\nfrom response,\n     json_each(http_headers) h\nSQL\n\nDiscuss on Changelog News",
          "link": "https://github.com/Florents-Tselai/WarcDB",
          "publishedOn": "2022-06-20T12:56:00.000Z",
          "wordCount": null,
          "title": "Web crawl data as SQLite databases",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1647",
          "author": null,
          "description": "Today we are talking with Frederic Branczyk, founder of Polar Signals & Prometheus maintainer. You may remember Frederic from episode 33 when we introduced Parca.dev.\nThis time, we talk about a database built for observability: FrostDB, formerly known as ArcticDB. eBPF generates a lot of high cardinality data, which requires a new approach to writing, persisting & then reading back this state.\nTL;DR FrostDB is sub zero cool & well worthy of its name.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nMongoDB – An integrated suite of cloud database and services — They have a FREE forever tier, so you can prove to yourself and to your team that they have everything you need. Check it out today at mongodb.com/…",
          "link": "https://changelog.com/shipit/57",
          "publishedOn": "2022-06-17T18:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 57: What do oranges & flame graphs have in common?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/57/ship-it-57.mp3",
            "length": "62854580",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/8l3k",
          "author": "Jerod Santo",
          "description": "Kevlin Henney’s keynote from DevTernity is full of wisdom. It’s long, but the top commenter on YouTube is a saint and provided timestamps for us. 🙌\n\nDiscuss on Changelog News",
          "link": "https://youtu.be/SUIUZ09mnwM",
          "publishedOn": "2022-06-17T17:00:00.000Z",
          "wordCount": null,
          "title": "Seven ineffective coding habits of many programmers",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1666",
          "author": null,
          "description": "Josh Goldberg joins Nick, Chris & a very nasally-sounding KBall for a fun conversation around TypeScript ESLint. They discuss why we need ESLint when we have TypeScript, some useful rules in typescript-eslint, how it works, and a few hot takes along the way!\nDiscuss on Changelog News\nChangelog++ members save 3 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFeaturing\nJosh Goldberg – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nChristopher Hiller – Twitter, GitHub, Website\nNotes and Links\n📘 Learning TypeScript\ntypescript-eslint.io\n@ts-expect-error\nExecute Program\nChris’s Amazon Profile\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/230",
          "publishedOn": "2022-06-17T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 230: ESLint and TypeScript",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/230/js-party-230.mp3",
            "length": "62350510",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/N1Ab",
          "author": "Jerod Santo",
          "description": "When you’re building a habit tracker app, you better have a good checkbox. The team at (Not Boring) set out to build such an app:\nIn trying to get a particularly tricky habit to stick, I tried dozens of apps and nothing worked for me. Recording an action felt like yet another chore. None could approach the most basic satisfaction of simply crossing out an item on a list.\nCould you design a simple action that felt as satisfying and infuse it with as much symbolism? Were we about to redesign the checkbox?\nI think you know where this is headed.\nThe end result is quite satisfying, but the journey through their design process is just 🤌\nDiscuss on Changelog News",
          "link": "https://www.andy.works/words/the-most-satisfying-checkbox",
          "publishedOn": "2022-06-17T16:07:00.000Z",
          "wordCount": null,
          "title": "The world's most satisfying checkbox",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW94",
          "author": "Jerod Santo",
          "description": "Bhupesh Varshney’s been using Vale (a syntax-aware prose linter) in his writing workflow and it has significantly impacted the words he chooses. Here’s how he describes the tool:\nJust like when writing software we use static analysis tools to find common problems, vale aims to help writers configure what words/prose to choose while writing technical documentation.\nNeovim is Bhupesh’s fav editor. In this post he walks through getting Vale all set up and running with it.\nDiscuss on Changelog News",
          "link": "https://bhupesh.me/writing-like-a-pro-with-vale-and-neovim/",
          "publishedOn": "2022-06-17T15:16:00.000Z",
          "wordCount": null,
          "title": "Writing like a pro with Vale & Neovim",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ml1R",
          "author": "Martin Heinz",
          "description": "As files, datasets and configurations grow, it gets increasingly difficult to navigate them. There are however many tools out there, that can help you to be more productive when dealing with large JSON and YAML files, complicated regular expressions, confusing SQL database relationships, complex development environments and many others.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/75",
          "publishedOn": "2022-06-17T14:24:00.000Z",
          "wordCount": null,
          "title": "Data and system visualization tools to boost your productivity",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1680",
          "author": null,
          "description": "This week we’re featuring an episode of Grafana’s Big Tent! LEGO Group principal engineer Nayana Shetty swaps observability survival stories (to drill or not to drill?) with hosts Mat Ryer and Matt Toback. The trio also reveals new and different observability strategies that have been successful and effective in their organizations.\nPlus: Nayana shares how she built her successful observability career brick by brick.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their custome…",
          "link": "https://changelog.com/gotime/234",
          "publishedOn": "2022-06-16T21:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 234: Observability in the wild: strategies that work",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/234/go-time-234.mp3",
            "length": "56544850",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y18l",
          "author": "Jerod Santo",
          "description": "I almost brought up the Law of Demeter on Go Time a couple weeks back:\nThat being said, sometimes you just have to follow the other person’s path until you realize when it doesn’t actually work for you. I’m totally fine with cargo-culting some sort of rule… I was gonna say the Law of Demeter, but that one’s too hard to explain. What’s a very simple – DRY, right?\nSee how quickly I abandoned ship there? Ok, it’s not that hard to explain. I just didn’t feel like taking the time to explain it when it wasn’t even my point. Good thing Double Agent Caleb Hearth did a nice write-up on Test Double’s blog about it!\nDiscuss on Changelog News",
          "link": "https://blog.testdouble.com/posts/2022-06-15-law-of-demeter/",
          "publishedOn": "2022-06-16T18:16:00.000Z",
          "wordCount": null,
          "title": "Understanding the Law of Demeter",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/oj24",
          "author": "Jerod Santo",
          "description": "Zach Leatherman breaks down what SSR means in various contexts (component frameworks, app frameworks. Here’s the gist, but the details are good to so def read Zach’s full post:\nApplication frameworks most often define SSR as the alternative to SSG (static site generation). A runtime server is used to render the components on request.\nComponent frameworks define SSR as generating static HTML from a component definition. They offer no preference as to whether this should or can happen at build time or at request-time.\nDiscuss on Changelog News",
          "link": "https://www.zachleat.com/web/ssr-overloaded/",
          "publishedOn": "2022-06-16T17:29:00.000Z",
          "wordCount": null,
          "title": "The many definitions of Server-Side Rendering",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WPP",
          "author": "Jerod Santo",
          "description": "We’re back on the conference scene, so a fresh batch of Changelog stickers was so necessary. Then we figured, why not post these on Merch for those who we don’t see at events?!\nWhile we’re at it, why not give them away as another Changelog++ perk?! So we did and we are 😎\n\nDiscuss on Changelog News",
          "link": "https://merch.changelog.com/products/changelog-sticker-pack",
          "publishedOn": "2022-06-16T15:15:00.000Z",
          "wordCount": null,
          "title": "New merch! Changelog sticker packs",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9l7g",
          "author": "Jerod Santo",
          "description": "Chain-bench is an open source tool for auditing your software supply chain stack for security compliance based on a new CIS Software Supply Chain benchmark.\nYou can run the tool from a CLI, assuming your code is hosted on GitHub (more SCM hosts coming soon):\nchain-bench scan --repository-url <REPOSITORY_URL> --access-token <TOKEN> -o <OUTPUT_PATH>\n\nI couldn’t find a comprehensive list of what checks are in the benchmark, but it appears they are referring to this guide. You can see what an example run’s results like like in the README.\nDiscuss on Changelog News",
          "link": "https://github.com/aquasecurity/chain-bench",
          "publishedOn": "2022-06-16T14:29:00.000Z",
          "wordCount": null,
          "title": "Chain-bench – a tool for auditing your software supply chain",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AX0y",
          "author": "Jerod Santo",
          "description": "Just copy/paste these SVGs into your HTML and you’re good to go!\n\nDiscuss on Changelog News",
          "link": "https://github.com/n3r4zzurr0/svg-spinners",
          "publishedOn": "2022-06-15T17:25:00.000Z",
          "wordCount": null,
          "title": "A collection of free SVG loading spinners ♻️",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eE9J",
          "author": "Jerod Santo",
          "description": "Kinda like Product Hunt, but focused on side projects. Post yours to see if people think it rocks (or not). Maybe you’ll find some motivation to continue working on it or feedback on what to work on next.\nDiscuss on Changelog News",
          "link": "https://mysideproject.rocks/",
          "publishedOn": "2022-06-15T14:07:00.000Z",
          "wordCount": null,
          "title": "A site for sharing your early-stage side projects with the world 🤘",
          "itunes": {}
        },
        {
          "id": "changelog.com/posts/2513",
          "author": "Gerhard Lazu",
          "description": "Now that everyone is back after KubeCon EU 2022, and all caught up with their notifications, it’s time for one more story of people, tech & upcoming #shipit episodes:\nKubeCon + CloudNativeCon Europe 2022 in 7by7 format \n\nThere are no words that would do justice to the amount of talented, hard-working & humble people that came together in the welcoming Valencia, Spain. The pictures above still fall short. There are 4k+ other pictures here that do a better job. This is my attempt to capture a fraction of the delight that was KubeCon CloudNativeCon EU 2022.\nI will start by focusing on the people that went above and beyond. You are the reason why the Cloud Native community thrives and goes from strength to strength. All your hard work and passion make this conference the best one in the world …",
          "link": "https://changelog.com/posts/kubecon-cloudnativecon-europe-2022",
          "publishedOn": "2022-06-15T13:21:47.000Z",
          "wordCount": null,
          "title": "The best bits from KubeCon EU 2022",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1673",
          "author": null,
          "description": "Could we create a digital human that processes data in a variety of modalities and detects emotions? Well, that’s exactly what NTT DATA Services is trying to do, and, in this episode, Theresa Kushner joins us to talk about their motivations, use cases, current systems, progress, and related ethical issues.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nTheresa Kushner – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDigital Humans videos:\nKia Showroom\nLearning Assistant\nTelco Retail\nKia, in car\nJapan Concierge\nVirtual Learning Buddy teaching kids to read:\nRelated blog post\nMore information about NTT DATA’s work with MIT Media Lab\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/181",
          "publishedOn": "2022-06-14T18:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 181: Digital humans & detecting emotions",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/181/practical-ai-181.mp3",
            "length": "41056628",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kw94",
          "author": "Jerod Santo",
          "description": "Total Cookie Protection is Firefox’s strongest privacy protection to date, confining cookies to the site where they were created, thus preventing tracking companies from using these cookies to track your browsing from site to site.\n\nDiscuss on Changelog News",
          "link": "https://blog.mozilla.org/en/products/firefox/firefox-rolls-out-total-cookie-protection-by-default-to-all-users-worldwide/",
          "publishedOn": "2022-06-14T15:52:00.000Z",
          "wordCount": null,
          "title": "Firefox rolls out Total Cookie Protection by default to all users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwbA",
          "author": "Jerod Santo",
          "description": "Sid and the GitLab team continue to enjoy their Rails-based “modular monolith”\nA modular monolith is the exact opposite of a distributed ball of mud: a well-structured, well-architected, highly modular program that runs as a single process and is as boring as possible.\nSid doesn’t pull any punches. No regrets!\nWouldn’t it be better to have a proper plugin interface? Or better yet, a services interface modeled on microservices? In a word: no. Not only do these approaches impose deployment and integration hurdles that go far beyond “I made a small change to the source code,” they often enforce architectural constraints too rigidly. Anticipating all the future extension points is a fool’s errand, one that we luckily did not embark on and do not have to.\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/why-were-sticking-with-ruby-on-rails-at-gitlab/",
          "publishedOn": "2022-06-14T15:04:00.000Z",
          "wordCount": null,
          "title": "Why we’re sticking with Ruby on Rails at GitLab",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9wz",
          "author": "Jerod Santo",
          "description": "Fresh is in the “SSR with client-side progressive enhancement” camp. I have to admit their list of ‘stand out’ features are quite appealing:\nNo JS is shipped to the client by default\nNo build step\nNo configuration required\nTypeScript support out of the box\nIf you’re feeling some JavaScript and/or Framework Fatigue, this won’t help. But competition pushes everyone (Next, Remix, etc) to improve. So, whether you check Fresh out or not, hopefully it’ll have a positive impact on your work.\nDiscuss on Changelog News",
          "link": "https://fresh.deno.dev/",
          "publishedOn": "2022-06-13T14:16:00.000Z",
          "wordCount": null,
          "title": "Fresh - a next-gen web framework for Deno",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqV0",
          "author": "Jerod Santo",
          "description": "dns.toys is a DNS server that takes creative liberties with the DNS protocol to offer handy utilities and services that are easily accessible via the command line.\nProvides world time, unit conversion, weather and more. All over DNS.\nDiscuss on Changelog News",
          "link": "https://www.dns.toys/",
          "publishedOn": "2022-06-13T13:23:00.000Z",
          "wordCount": null,
          "title": "Useful utilities and services over DNS",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1660",
          "author": null,
          "description": "This week Jesse Grosjean joins us to talk about his career as a solo indie Mac dev. Since 2004 Jesse has been building Mac apps under the company name Hog Bay Software producing hits such as WriteRoom, Taskpaper, and now Bike. We talk through the evolution of his apps, how he considers new features and improvements, why he chose and continues to choose the Mac platform, his business model and pricing for his apps, and what it takes to build his business around macOS and the driving force of the App Store.\nDiscuss on Changelog News\nChangelog++ members get a bonus 10 minutes at the end of this episode and zero ads. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the und…",
          "link": "https://changelog.com/podcast/492",
          "publishedOn": "2022-06-10T17:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 492: Two decades as a solo indie Mac dev",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/492/the-changelog-492.mp3",
            "length": "90146687",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1665",
          "author": null,
          "description": "KBall, Ali & Nick explore a new type of segment: “WTFJS” talking about wild and wooly “it’s not a bug it’s a feature” examples in the JavaScript language. They also dive into code maintainability, and end by discussing the whiplash shift in the tech industry from “hottest market for engineers in history” to “oh noes everything is stopping!”\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nAli Spittel – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nwww.jsfuck.com\nCross Browser Crazy\n0.30000000000000004.com/\nSandi Metz’s rules for developers\nInterview with Michael Chan on DRY\nCode Owners on Github\nYC “plan for the worst” memo\nSequoia “Adapting To Endure” deck\nlayoffs.fyi\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/229",
          "publishedOn": "2022-06-10T16:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 229: WTF, JS?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/229/js-party-229.mp3",
            "length": "61869558",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2514",
          "author": "Jerod Santo",
          "description": "I won’t call SQLite’s current moment a comeback, because the most used database engine in the world doesn’t have anything to come back from. I’m going with “renaissance”, because despite its already mass adoption, there has been something of a rebirth of interest from one software sector that had previously relegated it to dev & test environments1: web apps\nWe asked SQLite creator Richard Hipp about his database’s gap in penetration back when we first told the story of SQLite’s success in 2016:\nNow for a website where you’ve got a lot of write concurrency, you need to move to a client-server database engine because you need that server process there to coordinate the concurrency… There’s just no way to do that in a serverless database like SQLite. So for so many things you don’t have that …",
          "link": "https://changelog.com/posts/sqlite-web-renaissance",
          "publishedOn": "2022-06-10T14:04:00.000Z",
          "wordCount": null,
          "title": "SQLite's web renaissance",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jq4w",
          "author": "Jerod Santo",
          "description": "Nolan Lawson:\nAnyone who’s worked in the tech industry for long enough, especially at larger organizations, has seen it before. A legacy system exists: it’s big, it’s complex, and no one fully understands how it works. Architects are brought in to “fix” the system. They might wheel out a big whiteboard showing a lot of boxes and arrows pointing at other boxes, and inevitably, their solution is… to add more boxes and arrows. Nobody can subtract from the system; everyone just adds.\nNolan posits the center cannot hold and the current market shift from bull to bear might help bring the collapse of complex software. But it’s never that simple, is it?\nOne thing working in complexity’s favor, though, is that engineers like complexity. Admit it: as much as we complain about other people’s complexity, we love our own. We love sitting around and dreaming up new architectural diagrams that can comfortably sit inside our own heads – it’s only when these diagrams leave our heads, take shape in the real world, and outgrow the size of any one person’s head that the problems begin.\nDiscuss on Changelog News",
          "link": "https://nolanlawson.com/2022/06/09/the-collapse-of-complex-software/",
          "publishedOn": "2022-06-10T13:55:00.000Z",
          "wordCount": null,
          "title": "The collapse of complex software",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1663",
          "author": null,
          "description": "We’re trying something new this week: discussing the news! Natalie, Kris & Ian weigh in on GopherCon’s move to Chicago, Google DDoSing SourceHut, reflections on Go’s success, and a new/old proposal for anonymous function syntax.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes …",
          "link": "https://changelog.com/gotime/233",
          "publishedOn": "2022-06-09T21:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 233: Going through the news",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/233/go-time-233.mp3",
            "length": "59900500",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1oX",
          "author": "Jerod Santo",
          "description": "DALL-E can generate some amazing results, but we’re still in a phase of AI’s progress where having humans involved in the process is just better. Here’s how the authors of this workflow explain it:\nGenerative art is a creative process. While recent advances of DALL·E unleash people’s creativity, having a single-prompt-single-output UX/UI locks the imagination to a single possibility, which is bad no matter how fine this single result is. DALL·E Flow is an alternative to the one-liner, by formalizing the generative art as an iterative procedure.\n\nDiscuss on Changelog News",
          "link": "https://github.com/jina-ai/dalle-flow",
          "publishedOn": "2022-06-09T17:57:00.000Z",
          "wordCount": null,
          "title": "A human-in-the-loop workflow for creating HD images from text",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/49W4",
          "author": "Jerod Santo",
          "description": "mirrord works by letting you select a pod to mirror traffic from. It launches a privileged pod on the same node which enters the namespace of the selected pod and captures traffic from it.\nI was more excited before I realized this is a K8s thing, but still cool. Both a VS Code extension and a CLI.\nDiscuss on Changelog News",
          "link": "https://github.com/metalbear-co/mirrord",
          "publishedOn": "2022-06-09T17:08:00.000Z",
          "wordCount": null,
          "title": "mirrord lets you easily mirror traffic from prod to dev",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoqM",
          "author": "Jerod Santo",
          "description": "GitHub will archive all projects under the Atom org on December 15, 2022. Why?\nAtom has not had significant feature development for the past several years, though we’ve conducted maintenance and security updates during this period to ensure we’re being good stewards of the project and product. As new cloud-based tools have emerged and evolved over the years, Atom community involvement has declined significantly. As a result, we’ve decided to sunset Atom so we can focus on enhancing the developer experience in the cloud with GitHub Codespaces.\nAtom was co-founder and long-time CEO Chris Wanstrath’s baby. We first heard its story from project lead Nathan Sobo on The Changelog back in 2017. Here’s what he had to say about the end of Atom’s era:\nAs Atom’s sun sets, Zed’s sun is rising. We’re not done here.\nDiscuss on Changelog News",
          "link": "https://github.blog/2022-06-08-sunsetting-atom/",
          "publishedOn": "2022-06-09T14:49:00.000Z",
          "wordCount": null,
          "title": "GitHub officially says farewell to Atom",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1651",
          "author": null,
          "description": "Today we are talking with Maikel Vlasman, technical lead for a large Dutch machine construction company, and a cloud engineer by heart. We cover self-updating GitLab & ArgoCD, Maikel’s thinking behind dev environment setup and a Kubernetes workshop that he is preparing for his team. The goal is to function as a true DevOps team with shared responsibilities.\nThis conversation started as a thread in our community Slack - link in the show notes. Thank you Maikel for being a long-time Changelog listener and for reaching out to us - we enjoyed telling this story.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nAkuity – Akuity is a new platform (founded by Argo co-creators) that brings fully-managed Argo CD an…",
          "link": "https://changelog.com/shipit/56",
          "publishedOn": "2022-06-08T17:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 56: DevOps teams with shared responsibilities",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/56/ship-it-56.mp3",
            "length": "56668332",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qp3Q",
          "author": "Jerod Santo",
          "description": "One of the more interesting discussions that attracted some attention during KubeCon + CloudNativeCon was how, due to its design, WebAssembly (also known as Wasm) can replace Docker in many circumstances.\nWe were just discussing this with Swyx on JS Party. What an unexpected turn of events!\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/when-webassembly-replaces-docker/",
          "publishedOn": "2022-06-08T15:43:00.000Z",
          "wordCount": null,
          "title": "When WebAssembly replaces Docker",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zD4V",
          "author": "Jerod Santo",
          "description": "dot (aka Deepfake Offensive Toolkit) makes real-time, controllable deepfakes ready for virtual cameras injection. dot is created for performing penetration testing against e.g. identity verification and video conferencing systems, for the use by security analysts, Red Team members, and biometrics researchers.\nWhat’s crazy is dot deepfakes don’t require any additional training. 🤯\n\nDiscuss on Changelog News",
          "link": "https://github.com/sensity-ai/dot",
          "publishedOn": "2022-06-08T14:51:00.000Z",
          "wordCount": null,
          "title": "The Deepfake Offensive Toolkit",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Rb",
          "author": "Jerod Santo",
          "description": "Lars Wikman on the history of ID3 tags:\nIf you were a Winamp user back in the day, or curate an MP3 collection currently, you might recognize the humble ID3 tag. It is what the metadata in the MP3 file is made up of. First it was pretty limited in the version later dubbed ID3v1. Like any good 2.0 they added a ton more fields, features, removed character limits and it was suddenly ID3v2. The latest spec is ID3v2.4 while the most commonly adopted one seems to be ID3v2.3. I recently found myself having a reason to dig into this specification.\nI wonder what reason he might have to dig into this spec? Could it be for a soon-to-be-announced collab with his friends at Changelog? 😏\nThis post is not about the technical intricacies of the format… This is about a simpler time, where people saw the wild possibilities of music on computers and when people cared about files, damnit. This is about some of the most interesting and entertaining things I’ve run across while reading the spec.\nDiscuss on Changelog News",
          "link": "https://underjord.io/id3-specification-and-speculation.html",
          "publishedOn": "2022-06-07T19:36:00.000Z",
          "wordCount": null,
          "title": "What ID3v2 could have been",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/njn8",
          "author": "Jerod Santo",
          "description": "One of the smaller (but big for webdevs) announcements from yesterday’s WWDC keynote was Web Push coming to Safari. It’s built on three web standards all working together. What does it do, well it enables websites to “notify their users of time-sensitive or high-priority events, even if the user does not currently have the site open.”\nAs long as you’ve coded your web application to the standards you will be able to reach Safari 16 users on macOS Ventura. You don’t need to join the Apple Developer Program to send Web Push notifications.\nThat’s good news, but is this feature something users want? I can think of zero websites that I’ve allowed to send me notifications even when Safari is open, let alone when I’m not even browsing the web.\nJen Simmons posted a nice thread on Twitter alongside the announcement and fielded many people’s questions/concerns along the way.\nDiscuss on Changelog News",
          "link": "https://webkit.org/blog/12945/meet-web-push/",
          "publishedOn": "2022-06-07T17:08:00.000Z",
          "wordCount": null,
          "title": "Meet Web Push",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1Xl",
          "author": "Jerod Santo",
          "description": "Collection of thinking tools and frameworks to help you solve problems, make decisions and understand systems.\nMinto Pyramid? Abstraction laddering? A lot of these are new to me (and very well explained).\nDiscuss on Changelog News",
          "link": "https://untools.co/",
          "publishedOn": "2022-06-07T16:09:00.000Z",
          "wordCount": null,
          "title": "Tools for better thinking",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1670",
          "author": null,
          "description": "In this “fully connected” episode of the podcast, we catch up on some recent developments in the AI world, including a new model from DeepMind called Gato. This generalist model can play video games, caption images, respond to chat messages, control robot arms, and much more. We also discuss the use of AI in the entertainment industry (e.g., in new Top Gun movie).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDeepMind’s Gato:\nDeepMind article\nTNW article\nIceman’s voice in Top Gun:\nVariety article\nSonantic - the company behind the synthetic voice\nResponsible AI review processes: From a developer’s point of view\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/180",
          "publishedOn": "2022-06-07T15:15:00.000Z",
          "wordCount": null,
          "title": "Practical AI 180: Generalist models & Iceman's voice",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/180/practical-ai-180.mp3",
            "length": "39998966",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbYG",
          "author": "Jerod Santo",
          "description": "It uses IPFS for file storage and the Ethereum Name Service for discovery and syndication. Planet is a Mac app that makes managing such a setup reasonable. It also acts like an RSS reader app, letting you subscribe to other decentralized sites running on the network.\nDiscuss on Changelog News",
          "link": "https://www.planetable.xyz/",
          "publishedOn": "2022-06-07T14:21:00.000Z",
          "wordCount": null,
          "title": "Planet – decentralized blogs & websites powered by IPFS & ENS",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/research/mahima-pushkarna-interview/",
          "author": null,
          "description": "Five years ago, information designer Mahima Pushkarna joined Google to make data easier to understand. As a senior interaction designer on the People + AI Research (PAIR) team, she designed Data Cards to help everyone better understand the contexts of the data they are using. The Data Cards Playbook puts Google’s AI Principles into practice by providing opportunities for feedback, relevant explanations and appeal.\nRecently, Mahima’s paper on Data Cards (co-written with Googlers Andrew Zaldivar and Oddur Kjartansson) was accepted to the ACM Conference on Fairness, Accountability and Transparency (ACM FAccT). Let’s catch up with her and find out more about what brought her to Google.\nHow did your background lead you to the work you’re doing now?\nI've always been fascinated by conjuring up so…",
          "link": "https://blog.google/technology/research/mahima-pushkarna-interview/",
          "publishedOn": "2022-06-30T16:00:00.000Z",
          "wordCount": 1527,
          "title": "Mahima Pushkarna is making data easier to understand"
        },
        {
          "id": "https://blog.google/technology/ai/reducing-gender-based-harms-in-ai-with-sunipa-dev/",
          "author": null,
          "description": "Natural language processing (NLP) is a form of artificial intelligence that teaches computer programs how to take in, interpret, and produce language from large data sets. For example, grammar checkers use NLP to come up with grammar suggestions that help people write grammatically correct phrases. But as Google’s AI Principles note, it’s sometimes necessary to have human intervention to identify risks of unfair bias.\n\n\nSunipa Dev is a research scientist at Google who focuses on Responsible AI. Some of her work focuses specifically on ways to evaluate unfair bias in NLP outcomes, reducing harms for people with queer and non-binary identities. Sunipa’s work was recently featured at a workshop at the ACM Fairness, Accountability, and Transparency (FAcct) conference in Seoul, Korea.\n\n\nIn our …",
          "link": "https://blog.google/technology/ai/reducing-gender-based-harms-in-ai-with-sunipa-dev/",
          "publishedOn": "2022-06-29T16:00:00.000Z",
          "wordCount": 1457,
          "title": "Reducing gender-based harms in AI with Sunipa Dev"
        },
        {
          "id": "https://blog.google/technology/research/how-ai-creates-photorealistic-images-from-text/",
          "author": null,
          "description": "Have you ever seen a puppy in a nest emerging from a cracked egg? What about a photo that’s overlooking a steampunk city with airships? Or a picture of two robots having a romantic evening at the movies? These might sound far-fetched, but a novel type of machine learning technology called text-to-image generation makes them possible. These models can generate high-quality, photorealistic images from a simple text prompt.\nWithin Google Research, our scientists and engineers have been exploring text-to-image generation using a variety of AI techniques. After a lot of testing we recently announced two new text-to-image models — Imagen and Parti. Both have the ability to generate photorealistic images but use different approaches. We want to share a little more about how these models work and …",
          "link": "https://blog.google/technology/research/how-ai-creates-photorealistic-images-from-text/",
          "publishedOn": "2022-06-22T17:00:00.000Z",
          "wordCount": 1398,
          "title": "How AI creates photorealistic images from text"
        },
        {
          "id": "https://blog.google/products/chrome/building-a-more-helpful-browser-with-machine-learning/",
          "author": null,
          "description": "At Google we use technologies like machine learning (ML) to build more useful products — from filtering out email spam, to keeping maps up to date, to offering more relevant search results. Chrome is no exception: We use ML to make web images more accessible to people who are blind or have low vision, and we also generate real-time captions for online videos, in service of people in noisy environments, and those who are hard of hearing.\nThis work in Chrome continues, so we wanted to share some recent and future ML improvements that offer a safer, more accessible and more personalized browsing experience. Importantly: these updates are powered by on-device ML models, which means your data stays private, and never leaves your device.\nMore peace of mind, less annoying prompts\nSafe Browsing in…",
          "link": "https://blog.google/products/chrome/building-a-more-helpful-browser-with-machine-learning/",
          "publishedOn": "2022-06-09T16:00:00.000Z",
          "wordCount": 1338,
          "title": "Building a more helpful browser with machine learning"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=19351",
          "author": "Daniel Stenberg",
          "description": "On July 1st 2017, exactly five years ago today, the OSS-Fuzz project “adopted” curl into their program and started running fuzz tests against it. OSS-Fuzz is a project run by Google and they do fuzzing on a large amount of open source projects: OSS-Fuzz aims to make common open source software more secure and stable … Continue reading 5 years on OSS-Fuzz →",
          "link": "https://daniel.haxx.se/blog/2022/07/01/5-years-on-oss-fuzz/",
          "publishedOn": "2022-07-01T07:02:46.000Z",
          "wordCount": 956,
          "title": "5 years on OSS-Fuzz"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19426",
          "author": "Daniel Stenberg",
          "description": "Saturday June 18: I had some curl time in the afternoon and I was just about to go edit the four security advisories I had pending for the next release, to brush up the language and check that they read fine, when it dawned on me. These particular security advisories were still in draft versions … Continue reading Oops, I spilled the beans →",
          "link": "https://daniel.haxx.se/blog/2022/06/28/oops-i-spilled-the-beans/",
          "publishedOn": "2022-06-28T07:21:25.000Z",
          "wordCount": 1205,
          "title": "Oops, I spilled the beans"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19400",
          "author": "Daniel Stenberg",
          "description": "Welcome to take the next step with us in this never-ending stroll. Release presentation Numbers the 209th release8 changes47 days (total: 8,865)123 bug-fixes (total: 7,980)214 commits (total: 28,787)0 new public libcurl function (total: 88)2 new curl_easy_setopt() option (total: 297)1 new curl command line option (total: 248)51 contributors, 20 new (total: 2,652)35 authors, 13 new (total: … Continue reading curl 7.84.0 inside every box →",
          "link": "https://daniel.haxx.se/blog/2022/06/27/curl-7-84-0-inside-every-box/",
          "publishedOn": "2022-06-27T06:21:42.000Z",
          "wordCount": 1314,
          "title": "curl 7.84.0 inside every box"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19393",
          "author": "Daniel Stenberg",
          "description": "The REUSE project is an effort to make Open Source projects provide copyright and license information (for all files) in a machine readable way. When a project is fully REUSE compliant, you can easily figure out the copyright and license situation for every single file it holds. The easiest way to accomplish this is to … Continue reading curl is REUSE compliant →",
          "link": "https://daniel.haxx.se/blog/2022/06/17/curl-is-reuse-compliant/",
          "publishedOn": "2022-06-17T09:31:04.000Z",
          "wordCount": 1004,
          "title": "curl is REUSE compliant"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19373",
          "author": "Daniel Stenberg",
          "description": "Once again I’ve collected the numbers, generated graphs, scratched my head and tried to understand what users mean and how to best use this treasure trove of user feedback. The curl user survey 2022 ran for two full weeks in the end of May. Here is the document with all the numbers, graphs and analysis … Continue reading curl user survey 2022 analysis →",
          "link": "https://daniel.haxx.se/blog/2022/06/16/curl-user-survey-2022-analysis/",
          "publishedOn": "2022-06-16T16:24:14.000Z",
          "wordCount": 427,
          "title": "curl user survey 2022 analysis"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19296",
          "author": "Daniel Stenberg",
          "description": "Twenty-one years ago, in May 2001 we introduced the global initialization function to libcurl version 7.8 called curl_global_init(). The main reason we needed this separate function to get called before anything else was used in libcurl, was that several of libcurl’s dependencies at the time (including OpenSSL and GnuTLS) had themselves thread-unsafe initialization procedures. This … Continue reading Making libcurl init more thread-safe →",
          "link": "https://daniel.haxx.se/blog/2022/06/08/making-libcurl-init-more-thread-safe/",
          "publishedOn": "2022-06-08T06:42:32.000Z",
          "wordCount": 660,
          "title": "Making libcurl init more thread-safe"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-07-05T12:19:49.329Z",
          "wordCount": 1318,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-07-04T12:20:28.239Z",
          "wordCount": 1604,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-07-01T12:20:19.369Z",
          "wordCount": 2190,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-06-30T12:21:37.298Z",
          "wordCount": 1491,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "author": null,
          "description": "We’re investing in privacy-enhancing technologies (PET) to pioneer new methods of public accountability and access to data in a manner that respects and protects the privacy of people on Twitter.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/investing-in-privacy-enhancing-tech-to-advance-transparency-in-ML",
          "publishedOn": "2022-06-25T12:15:52.035Z",
          "wordCount": 809,
          "title": "Investing in privacy enhancing tech to advance transparency in ML"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "author": null,
          "description": "In this blog post, we share how we improved account recommendations with a model-based candidate generation framework.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/model-based-candidate-generation-for-account-recommendations",
          "publishedOn": "2022-06-25T12:15:52.021Z",
          "wordCount": 787,
          "title": "Model-based candidate generation for account recommendations"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-06-20T12:20:13.302Z",
          "wordCount": 1840,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-06-19T12:16:28.889Z",
          "wordCount": 1353,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-06-15T12:18:42.019Z",
          "wordCount": 2031,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-06-14T12:18:53.801Z",
          "wordCount": 1278,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-06-10T12:19:56.032Z",
          "wordCount": 828,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-06-09T12:21:18.778Z",
          "wordCount": 985,
          "title": "Introducing a new Swift package for Apache Thrift"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/06/2022-0-day-in-wild-exploitationso-far.html",
          "author": null,
          "description": "ul.lst-kix_68660h7uawx-0{list-style-type:none}ul.lst-kix_68660h7uawx-1{list-style-type:none}ul.lst-kix_68660h7uawx-2{list-style-type:none}ul.lst-kix_68660h7uawx-3{list-style-type:none}ul.lst-kix_68660h7uawx-4{list-style-type:none}ul.lst-kix_68660h7uawx-5{list-style-type:none}ul.lst-kix_68660h7uawx-6{list-style-type:none}.lst-kix_68660h7uawx-7>li:before{content:\"\\0025cb  \"}ul.lst-kix_68660h7uawx-7{list-style-type:none}ul.lst-kix_68660h7uawx-8{list-style-type:none}.lst-kix_68660h7uawx-0>li:before{content:\"\\0025cf  \"}.lst-kix_68660h7uawx-6>li:before{content:\"\\0025cf  \"}.lst-kix_68660h7uawx-8>li:before{content:\"\\0025a0  \"}li.li-bullet-0:before{margin-left:-18pt;white-space:nowrap;display:inline-block;min-width:18pt}.lst-kix_68660h7uawx-3>li:before{content:\"\\0025cf  \"}.lst-kix_68660h7uawx-2>li:…",
          "link": "https://googleprojectzero.blogspot.com/2022/06/2022-0-day-in-wild-exploitationso-far.html",
          "publishedOn": "2022-06-30T13:00:00.001Z",
          "wordCount": 1495,
          "title": "2022 0-day In-the-Wild Exploitation…so far"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/06/curious-case-carrier-app.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=cGvuclDC_Z1vE_cnVEU6Ae_NZQ7StBcqH_vXVqoPMX0');ol{margin:0;padding:0}table td,table th{padding:0}.HovzfPYjjR-c13{border-right-style:solid;padding:5pt 5pt 5pt 5pt;border-bottom-color:#e0e0e0;border-top-width:1pt;border-right-width:1pt;border-left-color:#e0e0e0;vertical-align:top;border-right-color:#e0e0e0;border-left-width:1pt;border-top-style:solid;background-color:#fafafa;border-left-style:solid;border-bottom-width:1pt;width:468pt;border-top-color:#e0e0e0;border-bottom-style:solid}.HovzfPYjjR-c34{padding-top:0pt;padding-bottom:3pt;line-height:1.5;page-break-after:avoid;text-align:left}.HovzfPYjjR-c15{padding-top:18pt;padding-bottom:6pt;line-height:1.5;page-break-after:avoid;text-align:left}.HovzfPYjjR-c17{text-decoration-skip-…",
          "link": "https://googleprojectzero.blogspot.com/2022/06/curious-case-carrier-app.html",
          "publishedOn": "2022-06-23T16:01:00.000Z",
          "wordCount": 4968,
          "title": "Untitled"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/06/an-autopsy-on-zombie-in-wild-0-day.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');.lst-kix_vnkr79j0brd5-6>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-8>li:before{content:\"\\0025a0  \"}ol.lst-kix_rpn0sahs9m0k-5.start{counter-reset:lst-ctn-kix_rpn0sahs9m0k-5 0}.lst-kix_rpn0sahs9m0k-1>li{counter-increment:lst-ctn-kix_rpn0sahs9m0k-1}.lst-kix_vnkr79j0brd5-5>li:before{content:\"\\0025a0  \"}.lst-kix_vnkr79j0brd5-2>li:before{content:\"\\0025a0  \"}.lst-kix_vnkr79j0brd5-4>li:before{content:\"\\0025cb  \"}ol.lst-kix_rpn0sahs9m0k-8.start{counter-reset:lst-ctn-kix_rpn0sahs9m0k-8 0}.lst-kix_vnkr79j0brd5-3>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-0>li:before{content:\"\\0025cf  \"}.lst-kix_vnkr79j0brd5-1>li:before{content:\"\\0025cb  \"}ol.lst-kix_omx22nj2js1z-1.start{counter-reset:lst-ctn-kix…",
          "link": "https://googleprojectzero.blogspot.com/2022/06/an-autopsy-on-zombie-in-wild-0-day.html",
          "publishedOn": "2022-06-14T16:00:00.000Z",
          "wordCount": 2809,
          "title": "An Autopsy on a Zombie In-the-Wild 0-day"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47890",
          "author": "Abhishek Aggarwal",
          "description": "Firefox Translations is a website translation add-on that provides an automated translation of web content. In this article, we will discuss the technical challenges around the development of the translation engine and how we solved them to build a usable Firefox Translations add-on.\nThe post Neural Machine Translation Engine for Firefox Translations add-on appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/neural-machine-translation-engine-for-firefox-translations-add-on/",
          "publishedOn": "2022-06-29T14:50:41.000Z",
          "wordCount": 2162,
          "title": "Neural Machine Translation Engine for Firefox Translations add-on"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47870",
          "author": "Yulia Startsev",
          "description": "As part of our work to ensure a free and open web, we've been working together with Ecma International, and many partners to write a License inspired by the W3C Document and Software License. Our goal was that JavaScript’s status would align with other specifications of the Web. In addition, with this new license available to all TCs at Ecma International, this will provide other organizations to approach standardization with the same perspective.\nThe post The JavaScript Specification has a New License appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/the-specification-for-javascript-has-a-new-license/",
          "publishedOn": "2022-06-27T15:05:35.000Z",
          "wordCount": 889,
          "title": "The JavaScript Specification has a New License"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47880",
          "author": "Aria Beingessner",
          "description": "For the last year, we've been working on the development of rust-minidump, a pure-Rust replacement for the minidump-processing half of google-breakpad. The final part in this series takes you through fuzzing rust-minidump.\nThe post Fuzzing rust-minidump for Embarrassment and Crashes – Part 2 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/fuzzing-rust-minidump-for-embarrassment-and-crashes/",
          "publishedOn": "2022-06-23T17:19:31.000Z",
          "wordCount": 3735,
          "title": "Fuzzing rust-minidump for Embarrassment and Crashes – Part 2"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47854",
          "author": "Xavier Harding",
          "description": "Samuel Aboagye is a genius. Aboagye is 17 years old. In those 17 years, he’s crafted more inventions than you have, probably. Among them: a solar-powered bike and a Bluetooth speaker, both using recycled materials. We caught up with Aboagye over video chat in hopes that he’d talk with us about his creations, and ultimately how he’s way cooler than any of us at 17.\nThe post Hacks Decoded: Bikes and Boomboxes with Samuel Aboagye appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/hacks-decoded-bikes-and-boomboxes-with-samuel-aboagye/",
          "publishedOn": "2022-06-16T15:00:15.000Z",
          "wordCount": 951,
          "title": "Hacks Decoded: Bikes and Boomboxes with Samuel Aboagye",
          "enclosure": {
            "url": "https://hacks.mozilla.org/files/2022/06/Untitled.mp4",
            "length": "11160104",
            "type": "video/mp4"
          }
        },
        {
          "id": "https://hacks.mozilla.org/?p=47842",
          "author": "Aria Beingessner",
          "description": "For the last year, we've been working on the development of rust-minidump, a pure-Rust replacement for the minidump-processing half of google-breakpad. The first in this two-part series explains what minidumps are, and how we made rust-minidump.\nThe post Everything Is Broken: Shipping rust-minidump at Mozilla – Part 1 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/everything-is-broken-shipping-rust-minidump-at-mozilla/",
          "publishedOn": "2022-06-14T15:05:06.000Z",
          "wordCount": 4580,
          "title": "Everything Is Broken: Shipping rust-minidump at Mozilla – Part 1"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47809",
          "author": "Evgeny Pavlov",
          "description": "The Bergamot project is a collaboration between Mozilla, University of Edinburgh, Charles University in Prague, the University of Sheffield, and University of Tartu with funding from the European Union’s Horizon 2020 research and innovation programme. It brings MT to the local environment, providing small, high-quality, CPU optimized NMT models. The Firefox Translations web extension utilizes proceedings of project Bergamot and brings local translations to Firefox. In this article, we will discuss the components used to train our efficient NMT models.\nThe post Training efficient neural network models for Firefox Translations appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/06/training-efficient-neural-network-models-for-firefox-translations/",
          "publishedOn": "2022-06-07T15:25:47.000Z",
          "wordCount": 2291,
          "title": "Training efficient neural network models for Firefox Translations"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=65607",
          "author": "Emilia Lazer-Walker",
          "description": "A Little Game Called Mario is an open source, collectively developed hell project. Anyone and everyone is welcome to contribute their unique talents to make both the player and developer experience more enjoyable. Find out how the collective leverages GitHub Actions to manage this wonderful little community.",
          "link": "https://github.blog/2022-07-06-managing-a-game-dev-community/",
          "publishedOn": "2022-07-06T08:00:15.000Z",
          "wordCount": 2932,
          "title": "Managing a game dev community with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=66076",
          "author": "Jose Palafox",
          "description": "New Actions from Anchore, NowSecure, SBT, and Trivy are now available to create a more comprehensive GitHub Dependency Graph.",
          "link": "https://github.blog/2022-07-01-extend-your-dependency-information-in-the-github-dependency-graph-with-new-github-actions/",
          "publishedOn": "2022-07-01T17:00:20.000Z",
          "wordCount": 949,
          "title": "Extend your dependency information in the GitHub Dependency Graph with new GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=66063",
          "author": "Ben Balter",
          "description": "Can projects and GitHub Actions be used by your non-developer teams? They absolutely can. Check out how our Security Team uses GitHub to run the department effortlessly.",
          "link": "https://github.blog/2022-07-01-how-the-github-security-team-uses-projects-and-github-actions-for-planning-tracking-and-more/",
          "publishedOn": "2022-07-01T15:22:53.000Z",
          "wordCount": 1376,
          "title": "How the GitHub Security Team uses projects and GitHub Actions for planning, tracking, and more"
        },
        {
          "id": "https://github.blog/?p=66035",
          "author": "Victoria Dye",
          "description": "High-quality Git commits are the key to a maintainable and collaborative open- or closed-source project. Learn strategies to improve and use commits to streamline your development process.",
          "link": "https://github.blog/2022-06-30-write-better-commits-build-better-projects/",
          "publishedOn": "2022-06-30T19:34:33.000Z",
          "wordCount": 4354,
          "title": "Write Better Commits, Build Better Projects"
        },
        {
          "id": "https://github.blog/?p=65939",
          "author": "Klint Finley",
          "description": "Maintainers answer your questions about how to manage an open source project that grows into a community.",
          "link": "https://github.blog/2022-06-30-what-to-do-when-your-open-source-project-becomes-a-community/",
          "publishedOn": "2022-06-30T15:11:39.000Z",
          "wordCount": 2183,
          "title": "What to do when your open source project becomes a community?"
        },
        {
          "id": "https://github.blog/?p=65991",
          "author": "Ashley Bass",
          "description": "Meet the 2022 MLH Fellowship cohort! This 12-week internship alternative is for aspiring software engineers, and powered by GitHub.",
          "link": "https://github.blog/2022-06-30-announcing-the-summer-2022-mlh-fellowship-github-contributors/",
          "publishedOn": "2022-06-30T15:00:47.000Z",
          "wordCount": 1204,
          "title": "Announcing the summer 2022 MLH Fellowship GitHub Contributors"
        },
        {
          "id": "https://github.blog/?p=65766",
          "author": "Man Yue Mo",
          "description": "In this post I'll exploit CVE-2022-1134, a type confusion in Chrome that I reported in March 2022, which allows remote code execution (RCE) in the renderer sandbox of Chrome by a single visit to a malicious site. I'll also look at some past vulnerabilities of this type and some implementation details of inline cache in V8, the JavaScript engine of Chrome.",
          "link": "https://github.blog/2022-06-29-the-chromium-super-inline-cache-type-confusion/",
          "publishedOn": "2022-06-29T18:39:46.000Z",
          "wordCount": 7537,
          "title": "The Chromium super (inline cache) type confusion"
        },
        {
          "id": "https://github.blog/?p=65874",
          "author": "Jeff Hostetler",
          "description": "Monorepo performance can suffer due to the sheer number of files in your working directory. Git’s new builtin file system monitor makes it easy to speed up monorepo performance.",
          "link": "https://github.blog/2022-06-29-improve-git-monorepo-performance-with-a-file-system-monitor/",
          "publishedOn": "2022-06-29T17:00:02.000Z",
          "wordCount": 5363,
          "title": "Improve Git monorepo performance with a file system monitor"
        },
        {
          "id": "https://github.blog/?p=65902",
          "author": "Brian Carlson",
          "description": "The recent changes to improve protocol security on GitHub.com are now coming to GitHub Enterprise Server, starting with version 3.6.",
          "link": "https://github.blog/2022-06-28-improving-git-protocol-security-on-github-enterprise-server/",
          "publishedOn": "2022-06-28T17:00:06.000Z",
          "wordCount": 1186,
          "title": "Improving Git protocol security on GitHub Enterprise Server"
        },
        {
          "id": "https://github.blog/?p=65943",
          "author": "Madison Oliver",
          "description": "We’re excited to announce that the GitHub Advisory Database now includes curated security advisories on Erlang, Elixir, and more.",
          "link": "https://github.blog/2022-06-27-github-advisory-database-now-supports-erlang-and-elixir-packages/",
          "publishedOn": "2022-06-27T20:24:52.000Z",
          "wordCount": 760,
          "title": "GitHub Advisory Database now supports Erlang and Elixir packages!"
        },
        {
          "id": "https://github.blog/?p=65850",
          "author": "Taylor Blau",
          "description": "The open source Git project just released Git 2.37. Take a look at some of our highlights from the latest release.",
          "link": "https://github.blog/2022-06-27-highlights-from-git-2-37/",
          "publishedOn": "2022-06-27T18:01:23.000Z",
          "wordCount": 2651,
          "title": "Highlights from Git 2.37"
        },
        {
          "id": "https://github.blog/?p=65852",
          "author": "Martin Woodward",
          "description": "To celebrate Maintainer Month, GitHub has invested an additional $500,000 to help sponsor the open source projects that it depends on.",
          "link": "https://github.blog/2022-06-24-thank-you-to-our-maintainers/",
          "publishedOn": "2022-06-24T15:32:25.000Z",
          "wordCount": 769,
          "title": "Thank you to our maintainers"
        },
        {
          "id": "https://github.blog/?p=65827",
          "author": "Tanmayee Kamath",
          "description": "We’re releasing exciting functionalities that will enable organizations to confidently manage and scale with Codespaces.",
          "link": "https://github.blog/2022-06-22-whats-new-in-codespaces-for-organizations/",
          "publishedOn": "2022-06-22T21:04:19.000Z",
          "wordCount": 1097,
          "title": "What’s new in Codespaces for Organizations"
        },
        {
          "id": "https://github.blog/?p=65761",
          "author": "Thomas Dohmke",
          "description": "We’re making GitHub Copilot, an AI pair programmer that suggests code in your editor, generally available to all developers for $10 USD/month or $100 USD/year. It will also be free to use for verified students and maintainers of popular open source projects.",
          "link": "https://github.blog/2022-06-21-github-copilot-is-generally-available-to-all-developers/",
          "publishedOn": "2022-06-21T16:04:44.000Z",
          "wordCount": 996,
          "title": "GitHub Copilot is generally available to all developers"
        },
        {
          "id": "https://github.blog/?p=65790",
          "author": "Brittany O'Shea",
          "description": "GitHub is excited to announce the release of CodeQL queries that implement the standards CERT C++ and AUTOSAR C++. These queries can aid developers looking to demonstrate ISO 26262 Part 6 process compliance.",
          "link": "https://github.blog/2022-06-20-adding-support-for-coding-standards-autosar-c-and-cert-c/",
          "publishedOn": "2022-06-20T17:00:12.000Z",
          "wordCount": 1090,
          "title": "GitHub enables the development of functional safety applications by adding support for coding standards AUTOSAR C++  and CERT C++"
        },
        {
          "id": "https://github.blog/?p=65748",
          "author": "Courtney Claessens",
          "description": "Expand the completeness of your dependency graph by using the dependency submission API, which will create more comprehensive alerts on supply chain vulnerabilities",
          "link": "https://github.blog/2022-06-17-creating-comprehensive-dependency-graph-build-time-detection/",
          "publishedOn": "2022-06-17T19:00:48.000Z",
          "wordCount": 1113,
          "title": "Creating a more comprehensive dependency graph with build time detection"
        },
        {
          "id": "https://github.blog/?p=65633",
          "author": "Michelle Mannering",
          "description": "Each month, we highlight open source projects that have shipped major updates. These projects can include everything from world-changing technology to developer tooling, and weekend hobbies. We cover what the project is and some of their breaking changes. Read about the project, and browse their repositories. Without further ado, here are our top staff picks […]",
          "link": "https://github.blog/2022-06-16-release-radar-may-2022/",
          "publishedOn": "2022-06-16T22:05:03.000Z",
          "wordCount": 1228,
          "title": "Release Radar · May 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=65495",
          "author": "Man Yue Mo",
          "description": "In this post I’ll exploit CVE-2022-22057, a use-after-free in the Qualcomm gpu kernel driver, to gain root and disable SELinux from the untrusted app sandbox on a Samsung Z flip 3. I’ll look at various mitigations that are implemented on modern Android devices and how they affect the exploit.",
          "link": "https://github.blog/2022-06-16-the-android-kernel-mitigations-obstacle-race/",
          "publishedOn": "2022-06-16T16:00:52.000Z",
          "wordCount": 10713,
          "title": "The Android kernel mitigations obstacle race"
        },
        {
          "id": "https://github.blog/?p=65724",
          "author": "Lee Reilly",
          "description": "Git Merge, the conference dedicated to bringing the Git community together returns on September 14-15 in Chicago, Illinois.",
          "link": "https://github.blog/2022-06-15-git-merge-2022/",
          "publishedOn": "2022-06-16T00:29:33.000Z",
          "wordCount": 530,
          "title": "Git Merge 2022"
        },
        {
          "id": "https://github.blog/?p=65687",
          "author": "Tanmayee Kamath",
          "description": "Teams and GHEC customers can now create blazing fast codespaces, even for your largest and most complex projects.",
          "link": "https://github.blog/2022-06-15-prebuilding-codespaces-is-generally-available/",
          "publishedOn": "2022-06-15T17:00:27.000Z",
          "wordCount": 1277,
          "title": "Prebuilding codespaces is generally available"
        },
        {
          "id": "https://github.blog/?p=65709",
          "author": "Brittany O'Shea",
          "description": "To combat the prevalence of malware in the open source ecosystem, GitHub now publishes malware occurrences in the GitHub Advisory Database. These advisories power Dependabot alerts and remain forever free and usable by the community.",
          "link": "https://github.blog/2022-06-15-github-now-publishes-malware-advisories-in-the-github-advisory-database/",
          "publishedOn": "2022-06-15T15:46:26.000Z",
          "wordCount": 674,
          "title": "GitHub now publishes malware advisories in the GitHub Advisory Database"
        },
        {
          "id": "https://github.blog/?p=65680",
          "author": "Cole Bemis",
          "description": "Learn why the GitHub Design Infrastructure team built a dedicated color tool and how they use it to create new color palettes for GitHub.",
          "link": "https://github.blog/2022-06-14-accelerating-github-theme-creation-with-color-tooling/",
          "publishedOn": "2022-06-14T19:04:41.000Z",
          "wordCount": 1275,
          "title": "Accelerating GitHub theme creation with color tooling"
        },
        {
          "id": "https://github.blog/?p=65673",
          "author": "Margaret Tucker",
          "description": "We share a recap of a recent roundtable event about what a federal open source software policy could look like in the United States.",
          "link": "https://github.blog/2022-06-14-how-can-the-united-states-build-its-open-source-software-policy/",
          "publishedOn": "2022-06-14T16:55:42.000Z",
          "wordCount": 888,
          "title": "How can the United States build its Open Source Software policy?"
        },
        {
          "id": "https://github.blog/?p=65652",
          "author": "Rizel Scarlett",
          "description": "June's Open Source Monthly features Modos–a community-focused company building software and hardware that designs digital devices with respect for users' time, attention, and well-being.",
          "link": "https://github.blog/2022-06-13-open-source-monthly-june-2022-edition/",
          "publishedOn": "2022-06-13T20:47:28.000Z",
          "wordCount": 1284,
          "title": "Open Source Monthly: June 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=65636",
          "author": "Rahul Zhade",
          "description": "How can you robustly assert and identify a user’s identity?",
          "link": "https://github.blog/2022-06-10-implementing-a-robust-digital-identity/",
          "publishedOn": "2022-06-10T19:12:59.000Z",
          "wordCount": 2215,
          "title": "Implementing a robust digital identity"
        },
        {
          "id": "https://github.blog/?p=65046",
          "author": "Keith Cirkel",
          "description": "Discover how GitHub thinks about browser support, look at usage patterns, and learn about the tools we use to make sure our customers are getting the best experience.",
          "link": "https://github.blog/2022-06-10-how-we-think-about-browsers/",
          "publishedOn": "2022-06-10T18:37:03.000Z",
          "wordCount": 5792,
          "title": "How we think about browsers"
        },
        {
          "id": "https://github.blog/?p=65600",
          "author": "Victoria Fawcett",
          "description": "Dependabot is generally available in GitHub Enterprise Server 3.5. Here is how to set up Dependabot on your instance.",
          "link": "https://github.blog/2022-06-09-dependabot-updates-hit-ga-in-ghes/",
          "publishedOn": "2022-06-09T20:47:19.000Z",
          "wordCount": 1440,
          "title": "Dependabot Updates hit GA in GHES"
        },
        {
          "id": "https://github.blog/?p=65571",
          "author": "Shawna Butterworth",
          "description": "We're excited to announce that we're open sourcing our Identity and Access Management solution: Entitlements.",
          "link": "https://github.blog/2022-06-09-introducing-entitlements-githubs-open-source-identity-and-access-management-solution/",
          "publishedOn": "2022-06-09T15:00:55.000Z",
          "wordCount": 1259,
          "title": "Introducing Entitlements: GitHub’s open source Identity and Access Management solution"
        },
        {
          "id": "https://github.blog/?p=65583",
          "author": "Bailey Brooks",
          "description": "Available in public beta today, we're announcing Achievements as a new way to commemorate milestones on GitHub.",
          "link": "https://github.blog/2022-06-09-introducing-achievements-recognizing-the-many-stages-of-a-developers-coding-journey/",
          "publishedOn": "2022-06-09T15:00:28.000Z",
          "wordCount": 792,
          "title": "Introducing Achievements: recognizing the many stages of a developer’s coding journey"
        },
        {
          "id": "https://github.blog/?p=65542",
          "author": "GitHub Staff",
          "description": "We are archiving Atom and all projects under the Atom organization for an official sunset on December 15, 2022.",
          "link": "https://github.blog/2022-06-08-sunsetting-atom/",
          "publishedOn": "2022-06-08T15:00:23.000Z",
          "wordCount": 625,
          "title": "Sunsetting Atom"
        },
        {
          "id": "https://github.blog/?p=65517",
          "author": "Matthew Dyson",
          "description": "Are you a student who is new to open source or just starting your maintainer journey? GitHub Global Campus’ Community Exchange can help you make that first contribution or grow your open source project.",
          "link": "https://github.blog/2022-06-08-start-your-open-source-journey-with-community-exchange/",
          "publishedOn": "2022-06-08T08:00:01.000Z",
          "wordCount": 808,
          "title": "Start your open source journey with Community Exchange"
        },
        {
          "id": "https://github.blog/?p=65520",
          "author": "Landon Grindheim",
          "description": "A personal story about building the feature you want and sharing it with the world.",
          "link": "https://github.blog/2022-06-07-one-developers-journey-bringing-dependabot-to-github-enterprise-server/",
          "publishedOn": "2022-06-07T19:55:45.000Z",
          "wordCount": 1429,
          "title": "One developer’s journey bringing Dependabot to GitHub Enterprise Server"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18487",
          "author": "Ezequiel Siddig - Editor and Content Creator at Nubank",
          "description": "VP of Engineering Lindsey Bleimes talks about Nubank’s Engineering Principles as a catalyst of everyday decisions and the job opportunities in Latam for engineers from all over the world.\nThe post “At Nubank, engineers understand the power of engineering” appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/engineering-principles-interview-with-nu-vp-of-engineering-lindsey-bleimes/",
          "publishedOn": "2022-06-24T17:43:44.000Z",
          "wordCount": 4129,
          "title": "“At Nubank, engineers understand the power of engineering”"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/application-security/security-highlights-new-cwe-rankings-software-supply-chains-and-side-channel",
          "author": "HackerOne",
          "description": "MITRE Releases 2022 CWE Top 25\n\nThe popular CWE Top 25 list, which ranks the most dangerous software vulnerabilities, has been updated for 2022. The",
          "link": "https://www.hackerone.com/application-security/security-highlights-new-cwe-rankings-software-supply-chains-and-side-channel",
          "publishedOn": "2022-07-05T17:00:00.000Z",
          "wordCount": 1518,
          "title": "Security Highlights: New CWE Rankings, Software Supply Chains, and Side-Channel Attacks"
        },
        {
          "id": "https://hackerone.com/penetration-testing/what-your-organization-gains-understanding-value-app-security-testing-averages",
          "author": "Sean Ryan",
          "description": "Daily and weekly agile software releases include bug fixes and security patches alongside new functionality. As a result, new vulnerabilities are intr",
          "link": "https://www.hackerone.com/penetration-testing/what-your-organization-gains-understanding-value-app-security-testing-averages",
          "publishedOn": "2022-06-30T16:00:00.000Z",
          "wordCount": 1733,
          "title": "What Your Organization Gains by Understanding the Value of App Security Testing Averages"
        },
        {
          "id": "https://hackerone.com/application-security/5-security-stages-devsecops-pipeline",
          "author": "HackerOne",
          "description": "DevSecOps builds on modern DevOps practices by incorporating security processes and automation into the development pipeline. This enables development teams to continue the rapid and continuous delivery trend while improving software assets' security. The DevSecOps pipeline follows the familiar DevOps “infinity loop” structure while incorporating some extra steps to ensure code security before, during, and after it’s pushed to production.",
          "link": "https://www.hackerone.com/application-security/5-security-stages-devsecops-pipeline",
          "publishedOn": "2022-06-28T18:59:00.000Z",
          "wordCount": 1620,
          "title": "5 Security Stages of the DevSecOps Pipeline"
        },
        {
          "id": "https://hackerone.com/community-blog/hackers-health-adverse-effects-doomscrolling",
          "author": "Pamela Greenberg",
          "description": "Question: \"I spend the majority of my time researching and keeping up with current affairs. I don’t feel like anything is wrong, but then I find mys",
          "link": "https://www.hackerone.com/community-blog/hackers-health-adverse-effects-doomscrolling",
          "publishedOn": "2022-06-27T15:45:00.000Z",
          "wordCount": 1463,
          "title": "Hacker's Health: Adverse Effects of Doomscrolling"
        },
        {
          "id": "https://hackerone.com/application-security/most-overlooked-server-permission-checks",
          "author": "Tyler Mann",
          "description": "",
          "link": "https://www.hackerone.com/application-security/most-overlooked-server-permission-checks",
          "publishedOn": "2022-06-23T16:00:00.000Z",
          "wordCount": null,
          "title": "The Most Overlooked Server Permission Checks"
        },
        {
          "id": "https://hackerone.com/hackerones-depth-approach-vulnerability-triage-and-validation",
          "author": "Naz Bozdemir",
          "description": "Like triaging in a hospital emergency room, security issues must be diagnosed and handled by an expert as soon as they arrive. But it doesn’t stop t",
          "link": "https://www.hackerone.com/hackerones-depth-approach-vulnerability-triage-and-validation",
          "publishedOn": "2022-06-23T16:00:00.000Z",
          "wordCount": 1270,
          "title": "HackerOne’s In-Depth Approach to Vulnerability Triage and Validation"
        },
        {
          "id": "https://hackerone.com/application-security/devsecops-vs-devops-what-difference",
          "author": "HackerOne",
          "description": "DevSecOps can dramatically reduce cyber risk for organizations—particularly those that rely on internal development for a competitive advantage.",
          "link": "https://www.hackerone.com/application-security/devsecops-vs-devops-what-difference",
          "publishedOn": "2022-06-23T16:00:00.000Z",
          "wordCount": 1650,
          "title": "DevSecOps vs DevOps: What is the Difference?"
        },
        {
          "id": "https://hackerone.com/ethical-hacker/how-bug-bounty-uncovered-5-year-old-vulnerability-hours",
          "author": "Tyler Mann",
          "description": "In this post, we will focus on a report Chris mentioned in his post—a high severity, blind Cross-Site Scripting (XSS) vulnerability that existed in",
          "link": "https://www.hackerone.com/ethical-hacker/how-bug-bounty-uncovered-5-year-old-vulnerability-hours",
          "publishedOn": "2022-06-16T11:00:00.000Z",
          "wordCount": 1681,
          "title": "How Bug Bounty Uncovered A 5-Year-Old Vulnerability In Hours"
        },
        {
          "id": "https://hackerone.com/community-blog/live-hacking-event-invitations-2022-guide",
          "author": "jessica@hackerone.com",
          "description": "Hello Hackers,\n\nLive Hacking Events are an experience like no other: hackers collaborate and connect with security teams, each other and HackerOne.�",
          "link": "https://www.hackerone.com/community-blog/live-hacking-event-invitations-2022-guide",
          "publishedOn": "2022-06-15T03:17:06.000Z",
          "wordCount": 1632,
          "title": "Live Hacking Event Invitations - 2022 Guide"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/cisos-do-you-know-security-risks-your-organizations-next-ma",
          "author": "Chris Evans",
          "description": "An ever-expanding attack surface is a global concern for most organizations and complicates an M&A, especially for CISOs. The M&A prospect may have a partially unprotected attack surface, thus increasing security risk coming in the form of a gap between the attack surface they can and do protect and the attack surface (and accompanying assets) they need to defend. This gap is what many M&A prospects bring to the table. And while an M&A may have undisputed business and strategic value, CISOs must still address the security risks involved in acquiring another organization's assets and its current attack surface, fully protected or not.",
          "link": "https://www.hackerone.com/vulnerability-management/cisos-do-you-know-security-risks-your-organizations-next-ma",
          "publishedOn": "2022-06-14T16:00:00.000Z",
          "wordCount": 1425,
          "title": "CISOs: Do You Know the Security Risks of Your Organization's Next M&A?"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-community-team-your-hacker-allies",
          "author": "jesse@hackerone.com",
          "description": "Jessica Sexton, Director of Community (Twitter/LinkedIn)\n\n\n\"I am excited to build a team and strategic programs that focus on human connectio",
          "link": "https://www.hackerone.com/community-blog/h1-community-team-your-hacker-allies",
          "publishedOn": "2022-06-13T17:41:00.000Z",
          "wordCount": 2284,
          "title": "H1 Community Team: Your Hacker Allies"
        },
        {
          "id": "https://hackerone.com/community-blog/community-hackerone-whats-come",
          "author": "jessica@hackerone.com",
          "description": "From Jessica Sexton - Director of Community,\n\nThree years ago, I found my home at HackerOne. My primary focus was to revamp our Live Hacking Events",
          "link": "https://www.hackerone.com/community-blog/community-hackerone-whats-come",
          "publishedOn": "2022-06-13T17:40:43.000Z",
          "wordCount": 2212,
          "title": "Community at HackerOne: What's to Come"
        },
        {
          "id": "https://hackerone.com/top-5-most-common-security-issues-i-discover-when-reviewing-code",
          "author": "William Barrett",
          "description": "NOTE: The following code examples have been contrived to provide detailed, illustrative representations of real security issues I’ve found while rev",
          "link": "https://www.hackerone.com/top-5-most-common-security-issues-i-discover-when-reviewing-code",
          "publishedOn": "2022-06-10T16:00:00.000Z",
          "wordCount": 1898,
          "title": "The Top 5 Most Common Security Issues I Discover When Reviewing Code"
        },
        {
          "id": "https://hackerone.com/vulnerability-management/how-catch-injection-security-vulnerabilities-code-review",
          "author": "William Barrett",
          "description": "Injection vulnerabilities result from insecure handling of user inputs. They are relatively simple to fix once the underlying issues that cause them are understood, and are frequently found by experienced reviewers who know what to look for. The prevalence of injection vulnerabilities today is one of the best arguments for continuing to perform code review in many organizations—this type of vulnerability is most frequently caught through human inspection of the offending code.",
          "link": "https://www.hackerone.com/vulnerability-management/how-catch-injection-security-vulnerabilities-code-review",
          "publishedOn": "2022-06-09T16:00:00.000Z",
          "wordCount": 1662,
          "title": "How to Catch Injection Security Vulnerabilities in Code Review"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/49348511c06c",
          "author": "Netflix Technology Blog",
          "description": "By Alex Hutter, Falguni Jhaveri, and Senthil Sayeebaba",
          "link": "https://netflixtechblog.com/how-netflix-content-engineering-makes-a-federated-graph-searchable-part-2-49348511c06c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-06-15T16:34:20.000Z",
          "wordCount": 1720,
          "title": "How Netflix Content Engineering makes a federated graph searchable (Part 2)"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/is-bear-market-over-probably-not",
          "author": "Market Radar",
          "description": "There has been a big drawdown but pain may not be over",
          "link": "https://marketradar.substack.com/p/is-bear-market-over-probably-not",
          "publishedOn": "2022-06-29T13:05:07.000Z",
          "wordCount": null,
          "title": "Is Bear Market over? Probably not",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F293675e5-9a33-4858-b8e8-5bd529538a53_679x427.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-june-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-review-june-2022",
          "publishedOn": "2022-06-23T13:00:54.000Z",
          "wordCount": null,
          "title": "Portfolio Review: June 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc601c1ae-716d-4742-b480-bdb4d4ebce78_895x761.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-5",
          "author": "Market Radar",
          "description": "A mix of charts on stocks, indices and crypto",
          "link": "https://marketradar.substack.com/p/charts-to-watch-5",
          "publishedOn": "2022-06-13T13:00:37.000Z",
          "wordCount": null,
          "title": "Charts to watch #5",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc77bcb2e-eb3a-4e44-9a0f-e9cc10e3fd56_933x746.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}