{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2023/08/Announcing-Googles-Open-Source-Software-Vulnerability-Rewards-Program .html",
          "author": null,
          "description": "Posted by Francis Perron, Open Source Security Technical Program Manager\n\n\n\nToday, we are launching Google’s Open Source Software Vulnerability Rewards Program (OSS VRP) to reward discoveries of vulnerabilities in Google’s open source projects. As the maintainer of major projects such as Golang, Angular, and Fuchsia, Google is among the largest contributors and users of open source in the world. With the addition of Google’s OSS VRP to our family of Vulnerability Reward Programs (VRPs), researchers can now be rewarded for finding bugs that could potentially impact the entire open source ecosystem.\n\nGoogle has been committed to supporting security researchers and bug hunters for over a decade. The original VRP program, established to compensate and thank those who help make Google’s code mo…",
          "link": "http://security.googleblog.com/2023/08/Announcing-Googles-Open-Source-Software-Vulnerability-Rewards-Program .html",
          "publishedOn": "2022-08-30T11:01:00.002Z",
          "wordCount": 2355,
          "title": "Announcing Google’s Open Source Software Vulnerability Rewards Program"
        },
        {
          "id": "http://security.googleblog.com/2022/08/announcing-open-sourcing-of-paranoids.html",
          "author": null,
          "description": "Posted by Pedro Barbosa, Security Engineer, and Daniel Bleichenbacher, Software Engineer\nParanoid is a project to detect well-known weaknesses in large amounts of crypto artifacts, like public keys and digital signatures. On August 3rd 2022 we open sourced the library containing the checks that we implemented so far (https://github.com/google/paranoid_crypto). The library is developed and maintained by members of the Google Security Team, but it is not an officially supported Google product.\nWhy the Project?\nCrypto artifacts may be generated by systems with implementations unknown to us; we refer to them as “black boxes.” An artifact may be generated by a black-box if, for example, it was not generated by one of our own tools (such as Tink), or by a library that we can inspect and test usi…",
          "link": "http://security.googleblog.com/2022/08/announcing-open-sourcing-of-paranoids.html",
          "publishedOn": "2022-08-24T17:14:00.009Z",
          "wordCount": 2650,
          "title": "Announcing the Open Sourcing of Paranoid's Library"
        },
        {
          "id": "http://security.googleblog.com/2022/08/making-linux-kernel-exploit-cooking.html",
          "author": null,
          "description": "Posted by Eduardo Vela, Exploit Critic\n\n\n\n\nCover of the medieval cookbook. Title in large letters kernel Exploits. Adorned. Featuring a small penguin. 15th century. Color. High quality picture. Private collection. Detailed.\n\n\n\n\n\n\n\n\nThe Linux kernel is a key component for the security of the Internet. Google uses Linux in almost everything, from the computers our employees use, to the products people around the world use daily like Chromebooks, Android on phones, cars, and TVs, and workloads on Google Cloud. Because of this, we have heavily invested in Linux’s security - and today, we’re announcing how we’re building on those investments and increasing our rewards.\n\nIn 2020, we launched an open-source Kubernetes-based Capture-the-Flag (CTF) project called, kCTF. The kCTF Vulnerability Rewar…",
          "link": "http://security.googleblog.com/2022/08/making-linux-kernel-exploit-cooking.html",
          "publishedOn": "2022-08-10T16:00:00.012Z",
          "wordCount": 1837,
          "title": "Making Linux Kernel Exploit Cooking Harder"
        },
        {
          "id": "http://security.googleblog.com/2022/08/how-hash-based-safe-browsing-works-in.html",
          "author": null,
          "description": "By Rohit Bhatia, Mollie Bates, Google Chrome Security\n There are various threats a user faces when browsing the web. Users may be tricked into sharing sensitive information like their passwords with a misleading or fake website, also called phishing. They may also be led into installing malicious software on their machines, called malware, which can collect personal data and also hold it for ransom. Google Chrome, henceforth called Chrome, enables its users to protect themselves from such threats on the internet. When Chrome users browse the web with Safe Browsing protections, Chrome uses the Safe Browsing service from Google to identify and ward off various threats. \nSafe Browsing works in different ways depending on the user's preferences. In the most common case, Chrome uses the privacy…",
          "link": "http://security.googleblog.com/2022/08/how-hash-based-safe-browsing-works-in.html",
          "publishedOn": "2022-08-08T15:55:00.003Z",
          "wordCount": 1971,
          "title": "How Hash-Based Safe Browsing Works in Google Chrome"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/14/1704",
          "author": null,
          "description": "Most of you already know what it’s like to work in a startup or a small company. A few of you have been asking us for conversations with engineers that work for big companies, the kind that run everything from big title games to banking, and even critical national infrastructure.\nIn today’s episode, we talk to Ganeshkumar, a Software Engineer in the Azure Kubernetes Service team, who works on Node Lifecycle and Kubernetes Versioning, and Brendan, Kubernetes project co-founder and engineering Corporate Vice President of Microsoft Azure OSS and Cloud-native Compute. We talk about what it’s like to work for Microsoft, how mentoring works in practice, and what Kubernetes, Omega, & Borg have to do with it all.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nBrendan Burns – Twitter, GitHub\nGaneshkumar Ashokavardhanan – Twitter, GitHub, LinkedIn\nGerhard Lazu – Twitter, GitHub, Website\nNotes and Links\n📄 Borg, Omega, and Kubernetes - March, 2016\n🎬 How to use GitOps with Microsoft Azure - Brendan Burns - July, 2021\n🎬 Kubernetes: The Documentary - Part 1 - January, 2022\nEvent Grid on Kubernetes with Azure Arc\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/shipit/68",
          "publishedOn": "2022-08-31T21:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 68: Behind the scenes at Microsoft Azure",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/68/ship-it-68.mp3",
            "length": "70672639",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ZoGe",
          "author": "Jerod Santo",
          "description": "Lane Wagner:\nThe ideas behind the DevOps movements undeniably changed the software development world for the better - but by now, the term “DevOps” has lost all meaning.\nAccording to Lane, some companies believe in DevOps ideas, but are unwilling to invest in changing their ways. Others aren’t convinced that some of the “scarier” ideas are all that helpful.\nDiscuss on Changelog News",
          "link": "https://wagslane.dev/posts/no-one-does-devops/",
          "publishedOn": "2022-08-31T20:07:00.000Z",
          "wordCount": null,
          "title": "DevOps: an idea so good, no one admits they don’t do it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1Gm",
          "author": "Jerod Santo",
          "description": "Julia Evans shares five things you can do to getting better at debugging, which is a critical skill for everyone in tech! They are:\nlearn the codebase\nlearn the system\nlearn your tools\nlearn strategies\nget experience\nEach thing comes with an explanation and she shares a great quote at the end (from a paper she extracted these things from):\nTheir findings did not show a significant difference in the strategies employed by the novices and experts. Experts simply formed more correct hypotheses and were more efficient at finding the fault. The authors suspect that this result is due to the difference in the programming experience between novices and experts.\nDiscuss on Changelog News",
          "link": "https://jvns.ca/blog/2022/08/30/a-way-to-categorize-debugging-skills/",
          "publishedOn": "2022-08-31T19:21:00.000Z",
          "wordCount": null,
          "title": "Some ways to get better at debugging",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rpd",
          "author": "Martin Heinz",
          "description": "The assignment operator - or walrus operator as we all know it - is a feature that’s been in Python for a while now (since 3.8), yet it’s still somewhat controversial and many people have unfounded hate for it.\nIn this article I will try to convince you that the walrus operator really is a good addition to the language and that if you use it properly, then it can help you make your code more concise and readable.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/79",
          "publishedOn": "2022-08-31T14:12:00.000Z",
          "wordCount": null,
          "title": "Here's why you should be using Python's walrus operator",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDd5",
          "author": "Jerod Santo",
          "description": "maps.earth is a planet-scale installation of Headway, but you can easily set up your own server on a smaller scale for your own personal use by running just a few commands.\nThis is the first I’ve heard of Headway, but I love their mission:\nThe Headway Project was born out of a frustration with the need to send current and future location data to a corporation in order to figure out how we’re getting from A to B. Offline-only maps apps can be frustrating to use, and sometimes suffer from performance problems, poor data coverage, or other technical limitations.\nHeadway aims to remedy these issues by bundling industry-standard software into a web app that’s easy to set up for yourself or your friends. No need to send your location data to anyone you don’t trust, not even maps.earth.\nDiscuss on Changelog News",
          "link": "https://about.maps.earth/",
          "publishedOn": "2022-08-31T13:24:00.000Z",
          "wordCount": null,
          "title": "Open source maps for everyone 🗺",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1815",
          "author": null,
          "description": "In this Fully-Connected episode, Daniel and Chris discuss concerns of privacy in the face of ever-improving AI / ML technologies.  Evaluating AI’s impact on privacy from various angles, they note that ethical AI practitioners and data scientists have an enormous burden, given that much of the general population may not understand the implications of the data privacy decisions of everyday life.\nThis intentionally thought-provoking conversation advocates consideration and action from each listener when it comes to evaluating how their own activities either protect or violate the privacy of those whom they impact.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nGoogle’s Responsible AI Practices - Privacy\nWhat is Data De-identification and Why is It Important?\nHugging Face - Stable Diffusion Demo\nfloret: lightweight, robust word vectors\nUsing oneAPI with Intel® FPGAs Workshop\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/191",
          "publishedOn": "2022-08-30T19:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 191: Privacy in the age of AI",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/191/practical-ai-191.mp3",
            "length": "41928467",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1GO",
          "author": "Jerod Santo",
          "description": "Tim Holman wants to take the web back to the wonderful days where knowing how to get your little mouse arrow to dance and sway was the most of your worries. That does sound nice, doesn’t it? “Emoji Rain” and the classic “Clock” are my favorites…\nDiscuss on Changelog News",
          "link": "https://tholman.com/cursor-effects/",
          "publishedOn": "2022-08-30T19:07:00.000Z",
          "wordCount": null,
          "title": "✨ 90's cursor effects ✨",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mb0W",
          "author": "Jerod Santo",
          "description": "Having a smaller website makes it load faster — that’s not surprising.\nWhat is surprising is that a 14kB page can load much faster than a 15kB page — maybe 612ms faster — while the difference between a 15kB and a 16kB page is trivial.\nThe reason for this is because of how TCP works, which is nicely explained in the post. But is 14kB even a feasible reality? The author thinks so:\nThat 14kB includes compression — so it could actually be more like ~50kB of uncompressed data — which is generous. Consider that the Apollo 11 guidance computers only had 72kB of memory.\nOnce you lose the autoplaying videos, the popups, the cookies, the cookie consent banners, the social network buttons, the tracking scripts, javascript and css frameworks, and all the other junk nobody likes — you’re probably there.\nDiscuss on Changelog News",
          "link": "https://endtimes.dev/why-your-website-should-be-under-14kb-in-size/",
          "publishedOn": "2022-08-30T14:42:00.000Z",
          "wordCount": null,
          "title": "Why your website should be under 14kB in size",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lPa",
          "author": "Jerod Santo",
          "description": "Heyang Zhou:\nWe decoupled SQLite’s storage layer onto FoundationDB to offer massive yet “bottomless” scalability, point-in-time reads, and the strictest level of consistency.\nSQLite’s web renaissance marches on.\nDiscuss on Changelog News",
          "link": "https://univalence.me/posts/mvsqlite",
          "publishedOn": "2022-08-30T13:46:00.000Z",
          "wordCount": null,
          "title": "Turning SQLite into a distributed database",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1816",
          "author": null,
          "description": "Qalculate has a command-line interface, Alexander Neumann adds compression to Restic, Emery Berger warns his fellow CS professors about Copilot, and Heroku GM Bob Wise details Heroku’s next chapter (which excludes free accounts).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nQalculate!\n‘qalc’ is awesome!\nRestic 0.14\nAlex Neumann on The Changelog #434\nCoping with Copilot\nHeroku’s Next Chapter\njoerick’s comment\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-29",
          "publishedOn": "2022-08-29T17:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Qalculate is awesome, Restic adds compression, CS teachers coping with Copilot & Heroku's next non-free chapter",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-29/the-changelog-news-2022-08-29.mp3",
            "length": "8745013",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/GWqM",
          "author": "Jerod Santo",
          "description": "From Steve Schoger’s announcement tweet:\n🤩 All new look! 260 icons redrawn from scratch\nAvailable as first-party React and Vue libraries and official Figma components.\nThe React and Vue libraries are cool, but the coolest part about SVG-based icons is how you can simply copy/paste the HTML directly into your code.\nDiscuss on Changelog News",
          "link": "https://heroicons.com/",
          "publishedOn": "2022-08-29T14:31:00.000Z",
          "wordCount": null,
          "title": "Heroicons 2.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEoO",
          "author": "Jerod Santo",
          "description": "A very cool case study of Segment’s long journey to creating a product that people would actually pay money to use.\nBy now they burnt $500K and were left with only $100K. They wanted to tryout something for one last time with the $100K. One of their Co-Founders suggested that they try to productise their open source library. Peter, the Co-Founder & CEO didn’t like that idea at all. This open-source library had only 580 lines of code, compared to the other 2 products which had 100x more lines of code and a very grand vision on how to define an industry.\nSide note: what is this bip.so thing that’s hosting the content?!\nDiscuss on Changelog News",
          "link": "https://bip.so/@TIL_/How-Segment-Found-PMF-bDaLg",
          "publishedOn": "2022-08-29T13:42:00.000Z",
          "wordCount": null,
          "title": "How Segment found product-market fit",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1804",
          "author": null,
          "description": "This week we’re talking with Alex MacCaw — he’s well known for his work as founder and CEO of Clearbit. In May of 2021, Alex shared a personal update with the world on his blog. After much reflection, he decided to step down as CEO of Clerabit to go back to his roots. In his words, “I love the early stages of company building. Hacking together code, setting up the Stripe account, getting the first customer. That’s my jam.”\nWe talk with Alex about this portion of his journey at Clearbit, the Catamaran he bought in South Africa and then sailed across the Atlantic Ocean, and the new thing he’s building called Reflect that let’s you keep track of your notes, books, and meetings.\nDiscuss on Changelog News\nChangelog++ members get a bonus 4 minutes at the end of this episode and zero ads. Join to…",
          "link": "https://changelog.com/podcast/503",
          "publishedOn": "2022-08-27T23:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 503: Building Reflect at sea",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/503/the-changelog-503.mp3",
            "length": "81440046",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/1Wgw",
          "author": "Adam Stacoviak",
          "description": "Well, the end of Moore’s law has forced YouTube to make its own video chip. General purpose processors we’re cutting for the specialized task of video transcoding, and after a 10 minute meeting with YouTube chief Susan Wojcicki, the company’s first video chip project was approved.\nThe obvious motive for building your own chip for a specific purpose is cost savings, but that’s not always the case. In many instances, big tech companies are simply looking to create a strategic advantage with custom chips. Consolidation in the chip industry also plays into the equation, as there are now only a couple of custom chipmakers to choose from in a given category making general-purpose processors that aren’t great at specialized tasks.\nGoogle said the Argos VCUs delivered a performance boost of anywhere between 20 to 33 times compared to traditional server hardware running well-tuned transcoding software.\nDiscuss on Changelog News",
          "link": "https://www.techspot.com/news/95774-end-moore-law-forced-youtube-make-own-video.html",
          "publishedOn": "2022-08-27T21:49:06.000Z",
          "wordCount": null,
          "title": "YouTube now controls its hardware roadmap",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1806",
          "author": null,
          "description": "Tejas Kumar joins Jerod & KBall for a wide-ranging convo about React Suspense, human skills, and the four pillars of impact for web engineers. We also discuss the news in “Story of the Week” and give a few quick shout outs to a must-read book and a great new publishing platform for lead devs.\nJoin Tejas at React Brussels on October 14, 2022! Get 30% off your ticket when you use code JSPARTYTIME at checkout and follow @JSPartyFM on Twitter for giveaway details.\nDiscuss on Changelog News\nChangelog++ members get a bonus 2 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square …",
          "link": "https://changelog.com/jsparty/240",
          "publishedOn": "2022-08-27T21:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 240: Bringing the vibe",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/240/js-party-240.mp3",
            "length": "58278157",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/D1y1",
          "author": "Adam Stacoviak",
          "description": "This is pure gold!\nAdd a single line to the /etc/pam.d/sudo file and BAM! You’re sudo’ing with TouchID or your Apple Watch. The only downside is this file is somewhat protected by macOS. When the OS updates, you might need to add the line back to the file. Other than that, it works perfectly!\n\nDiscuss on Changelog News",
          "link": "https://it.digitaino.com/use-touchid-to-authenticate-sudo-on-macos/",
          "publishedOn": "2022-08-27T20:47:25.000Z",
          "wordCount": null,
          "title": "Use TouchID to authenticate sudo on macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwp2",
          "author": "Adam Stacoviak",
          "description": "Most of our audience knows that we operate on the mantra “Slow and steady wins,” and yet there’s lessons to be learned by reading a post adjudicating the need to “Move fast or die.” Let me explain…\nThere’s a key phrase that sets this post and its lessons apart from us here at Changelog Media — it’s “Here’s how we did it at Facebook.” Clearly, we are not Facebook, so we should not operate on advice that’s focused on Facebook. However, we can learn something.\nOf the the five lessons shared, each can be appreciated, but one in particular stands out.\nWe embraced asking for forgiveness, never for permission.\nThis, to me, is synonymous with “Hire people smarter than you,” because it assumes everyone can bring something to the table that former wisdom might not. It gives permission to try something new and see if something beautiful comes as a result. That’s a good thing.\nDiscuss on Changelog News",
          "link": "https://blog.southparkcommons.com/move-fast-or-die/",
          "publishedOn": "2022-08-27T18:49:15.000Z",
          "wordCount": null,
          "title": "Move fast or die",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1799",
          "author": null,
          "description": "In this episode, we’ll be further exploring PRs. Check out The art of the PR: Part 1 if you haven’t yet. What is it that makes a PR a good PR? How do you consider PRs in an open source repo? How do you vet contributions from people who aren’t a part of the repository? How does giving feedback and encouragement fit in to the PR process? We’ll be debating the details, and trying to help our fellow gophers perfect the art of the PR. We are joined by the awesome Anderson Queiroz, hosted by Natalie Pistunovich & Angelica Hill.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFeaturing\nAnderson Queiroz – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nThe art of the PR: Part 1\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/244",
          "publishedOn": "2022-08-27T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 244: The art of the PR: Part 2",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/244/go-time-244.mp3",
            "length": "52759601",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pjgV",
          "author": "Adam Stacoviak",
          "description": "It is a very good thing for Salesforce to be more focused on Heroku’s future, but the glaring detail shared by Bob Wise today is the era of free on Heroku is over.\nHere’s what they announced:\nThey launched an interactive product roadmap on GitHub\nThey are focusing on mission critical and will discontinue free product plans and delete inactive accounts\nThey are starting a program to support students and nonprofits\nThey will continue to contribute to open source projects, notably Cloud Native Buildpacks and offering Heroku credits to select open source projects through Salesforce’s Open Source Program Office (OSPO)\nDiscuss on Changelog News",
          "link": "https://blog.heroku.com/next-chapter",
          "publishedOn": "2022-08-25T21:30:13.000Z",
          "wordCount": null,
          "title": "Heroku's \"next chapter\" doesn't include free plans",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqX0",
          "author": "Adam Stacoviak",
          "description": "DuckDuckGo is extending their push for greater digital privacy to email protection with DuckDuckGo Email Protection. Here’s what they shared today on the official DuckDuckGo blog at spreadprivacy.com.\nDuckDuckGo Email Protection is a free email forwarding service that removes multiple types of hidden email trackers and lets you create unlimited unique private email addresses on the fly. You can use Email Protection with your current email provider and app – no need to update your contacts or juggle multiple accounts. Email Protection works seamlessly in the background to deliver your more-private emails right to your inbox.\nEmail tracking and spam is at an all time insanity level. As someone who gets a ton of email daily, most of which is noise and not signal, the problem of email tracking could not hit closer to home\nDiscuss on Changelog News",
          "link": "https://spreadprivacy.com/protect-your-inbox-with-duckduckgo-email-protection/",
          "publishedOn": "2022-08-25T21:07:00.000Z",
          "wordCount": null,
          "title": "DuckDuckGo Email Protection is now open to everyone",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Eq43",
          "author": "Adam Stacoviak",
          "description": "Lőrik Levente shared a real world comparrison between Tauri and Electron using a real application he’s building called Authme. The comparrison focused on all the major things you’d care about — Bundle size, startup time, performance, app backend, rendering your app, security, auto update, and developer experience.\nAlso, see this tweet from swyx.\nTauri vs Electron results are consistently mindblowing\nApp: 97% smaller\nSo, is Electron is being replaced? Lőrik says yes, but…\n\nDiscuss on Changelog News",
          "link": "https://www.levminer.com/blog/tauri-vs-electron",
          "publishedOn": "2022-08-25T20:56:00.000Z",
          "wordCount": null,
          "title": "Tauri vs Electron with a real world app",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1698",
          "author": null,
          "description": "A few weeks ago, Jerod spoke with Liz Rice about the power of eBPF on The Changelog. Today, we have the pleasure of both Liz Rice, Chief Open Source Office at Isovalent & Thomas Graf, CTO & co-founder at Isovalent, the creators of Cilium.\nAround 2014, Facebook achieved a 10x performance improvement by replacing their traditional load balancers with eBPF. In 2017, every single packet that went to Facebook was processed by eBPF. Nowadays, every Android phone is using it. Truth be told, if it’s network-related and it matters, eBPF is most likely a part of it.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nDEX: Sort the Madness – Join our friends at Sentry for their upcoming developer experience conference …",
          "link": "https://changelog.com/shipit/67",
          "publishedOn": "2022-08-25T16:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 67: All your network are belong to eBPF",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/67/ship-it-67.mp3",
            "length": "71986265",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1814",
          "author": null,
          "description": "Differentiating between what is real versus what is fake on the internet can be challenging.  Historically, AI deepfakes have only added to the confusion and chaos, but when labeled and intended for good, deepfakes can be extremely helpful.  But with all of the misinformation surrounding deepfakes, it can be hard to see the benefits they bring.  Lior Hakim, CTO at Hour One, joins Chris and Daniel to shed some light on the practical uses of deepfakes.  He addresses the AI technology behind deepfakes, how to make positive use of deep fakes such as breaking down communications barriers, and shares how Hour One specializes in the development of virtual humans for use in professional video communications.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nLior Hakim – LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nHour One\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/190",
          "publishedOn": "2022-08-24T15:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 190: Practical positive uses for deep fakes",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/190/practical-ai-190.mp3",
            "length": "42329631",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1813",
          "author": null,
          "description": "Carlos Alexandro Becker shared some SSH tips, Sakun Acharige (a Comp Sci student + visual design enthusiast) created System.css, Felix Krause built a browser app that shows the JavaScript commands being executed by iOS app in-app browers, Yan Zhulanow decided to create Marta, and Lőrik Levente did a comparrison between Tauri & Electron using a real world application he’s building called Authme.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSubscribe to Changelog Weekly\nSubscribe to our YouTube Channel\nSSH Tips and Tricks\nSystem.css\niOS Privacy: Use InAppBrowser.com to see what JavaScript commands get injected through in-app browsers\nMar​ta - Native file manager for macOS\nTauri VS. Electron\nAuthme\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-22",
          "publishedOn": "2022-08-22T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: SSH tips and tricks, retro Apple UIs, iOS Privacy and TikTok, Marta & Tauri vs Electron",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-22/the-changelog-news-2022-08-22.mp3",
            "length": "9054804",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1803",
          "author": null,
          "description": "This week we’re re-broadcasting a very special episode of Founders Talk. Adam was invited by our friends at Square to host a fireside chat with Jack Dorsey as the featured finale of their annual developer conference called Square Unboxed. Jack is one of the most prolific CEOs out there. He’s a hacker turned CEO, often working at the very edge of what’s to come. He’s focused on what the future has to offer and an innovator at scale. He’s also a Bitcoin maximalist and has positioned himself and Block long on Bitcoin.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databa…",
          "link": "https://changelog.com/podcast/502",
          "publishedOn": "2022-08-19T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 502: Fireside chat with Jack Dorsey ♻️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/502/the-changelog-502.mp3",
            "length": "44340331",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbjW",
          "author": "Jerod Santo",
          "description": "I was adding this link to our show notes for next week’s JS Party with Tejas Kumar and thought I’d watch for a few minutes first. A half hour later I was hooked (pun intended) and decided it’s worth a proper Changelog News link-up as well. Once the episode drops you’ll get the BTS story of how this talk came be.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=f2mMOiCSj5c",
          "publishedOn": "2022-08-19T17:48:01.000Z",
          "wordCount": null,
          "title": "Deconstructing React (2020)",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1801",
          "author": null,
          "description": "Struggling through the tech job interview process? We feel you! On this episode, Amal, Nick & Amelia get together to discuss the various ways the interview process disappoints, share their own interview stories, and suggest ways we can improve the process for everyone.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nHasura – Create dynamic high-performance GraphQL & REST APIs from your database(s) in minutes with granular authorization and caching baked in. All without touching your underlying database. Go from data to API in minutes. Get started for free at hasura.io/jsparty\n\n    \nFeaturing\nAmal Hussein – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nAmelia Wattenberger – Twitter, GitHub, Website\nNotes and Links\n🎧 JS Party #238: Build faster websites with Astro 1.0\n🎧 The Changelog #479: Principles for hiring engineers\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/239",
          "publishedOn": "2022-08-19T16:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 239: Tech job interview support group",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/239/js-party-239.mp3",
            "length": "63856150",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/9lZa",
          "author": "Jerod Santo",
          "description": "whytheluckystiff.net is back online and now hosts links and mirrors to everything the man published on the internet during his illustrious career.\nIt works sort of like a museum that sells maps.\nIf you’ve never heard of why the lucky stiff, click through to get acquainted. If you were fortunate enough (like myself) to be around when he was actively creating things, click through for some top notch nostalgia.\nDiscuss on Changelog News",
          "link": "https://whytheluckystiff.net/",
          "publishedOn": "2022-08-19T14:18:00.000Z",
          "wordCount": null,
          "title": "_why's Estate",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQ9o",
          "author": "Jerod Santo",
          "description": "Felix Krause built an iOS browser app that lists the JavaScript commands executed by the iOS app rendering the page. Use it like this:\nOpen an app you want to analyze\nShare the URL somewhere inside the app (e.g. send a DM to a friend, or post to your feed)\nTap on the link inside the app to open it\nRead the report on the screen\nHis findings after using this for a bit are… concerning. Especially TikTok.\nDiscuss on Changelog News",
          "link": "https://krausefx.com/blog/announcing-inappbrowsercom-see-what-javascript-commands-get-executed-in-an-in-app-browser",
          "publishedOn": "2022-08-19T13:32:00.000Z",
          "wordCount": null,
          "title": "See what JS commands get injected through an in-app browser on iOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEXO",
          "author": "Jerod Santo",
          "description": "Mark Seemann explains why we need young people in the software industry:\nWe need young people in the software development industry. Because of their vigour and inexperience, they’ll push the envelope. Most will fail to do the impossible, but a few succeed.\nAnd why we also need old people in the software industry:\nWe need old people because they’re in a position to speak truth to the world… Old people have less on the line, so they can speak more freely. If someone you used to admire retires and all of a sudden starts saying or writing unpleasant and surprising things, there might be a good explanation, and it might be a good idea to pay attention.\nDiscuss on Changelog News",
          "link": "https://blog.ploeh.dk/2020/09/14/we-need-young-programmers-we-need-old-programmers/",
          "publishedOn": "2022-08-18T19:50:00.000Z",
          "wordCount": null,
          "title": "We need young programmers; we need old programmers",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1494",
          "author": null,
          "description": "In this episode, we will be exploring PRs. What makes a good PR? How do you give the best PR review? Is there such thing as too small, or big of a PR? We’ll be debating the details, and trying to help our fellow gophers perfect the art of the PR. We are joined by three wonderful guests Jeff Hernandez, Sarah Duncan, and Natasha Dykes. Hosted by Angelica Hill & Natalie Pistunovich.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome fea…",
          "link": "https://changelog.com/gotime/243",
          "publishedOn": "2022-08-18T16:05:00.000Z",
          "wordCount": null,
          "title": "Go Time 243: The art of the PR: Part 1",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/243/go-time-243.mp3",
            "length": "61426947",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/3L88",
          "author": "Jerod Santo",
          "description": "The screens in modern cars keep getting bigger. Design teams at most car manufacturers love to ditch physical buttons and switches, although they are far superior safety-wise.\nThat is the conclusion when Swedish car magazine Vi Bilägare performed a thorough test of the HMI system (Human-Machine Interface) in a total of twelve cars this summer.\nHopefully studies like this will convince car makers to install both a big, sexy touchscreen display and physical buttons for key functions that need to be performed quickly and often. Unfortunately, right now it seems most manufacturers are following Tesla’s lead to a buttonless future. And they pair that move with worse software, too. I’m looking at you, Ford. 👀\nDiscuss on Changelog News",
          "link": "https://www.vibilagare.se/nyheter/physical-buttons-outperform-touchscreens-new-cars-test-finds",
          "publishedOn": "2022-08-18T15:33:00.000Z",
          "wordCount": null,
          "title": "Physical buttons outperform touchscreens in new cars, test finds",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/7Yyp",
          "author": "Jerod Santo",
          "description": "Craig Kerstiens:\nToday I’m excited to introduce a new place for devs to polish their Postgres skills, a Postgres playground from Crunchy Data. What is the playground? Put simply it is:\nPostgres running in your local web browser\nWith canned datasets you can load\nGuided tutorials to follow along to learn about the power of Postgres\nSince it’s running in the browser you can only connect to it using the embedded psql interface provided. So, it’s not actually useful for real workloads, but it is useful for learning and experimenting.\nDiscuss on Changelog News",
          "link": "https://www.crunchydata.com/blog/learn-postgres-at-the-playground",
          "publishedOn": "2022-08-18T14:31:00.000Z",
          "wordCount": null,
          "title": "A Postgres playground in your browser (WebAssembly FTW)",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1656",
          "author": null,
          "description": "Why are the right values important for a company that changed the way the world builds software? How does pair programming help scale & maintain the company culture? What is it like to grow a company to 3000 employees over 30 years?\nToday we have the privilege of Rob Mee, former CEO of Pivotal, the real home of Cloud Foundry and Concourse CI. Rob is now the CEO of Geometer.io, an incubator where Elixir is behind many great ideas executed well, including the US COVID response programme.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems?…",
          "link": "https://changelog.com/shipit/66",
          "publishedOn": "2022-08-18T13:45:00.000Z",
          "wordCount": null,
          "title": "Ship It! 66: Do the right thing. Do what works. Be kind.",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/66/ship-it-66.mp3",
            "length": "66164454",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/D1N1",
          "author": "Jerod Santo",
          "description": "Alexander Wales:\nThis image was created by an AI, MidJourney. All I had to do was type in a prompt (“wildfire”) and aspect ratio. This AI is pretty good, but nowhere near the state of the art, and AI like it are, over the next few years, going to make art like this available within seconds at a cost of pennies. This applies not just to “art” like the above, which is going to accompany my prose and worldbuilding projects, but to almost every area of life where you see pictures of any kind. I think it’s hard to understate how big of a deal this will end up being, and this blog post is largely my attempt to collate a lot of the arguments under one roof, in part because some of the arguments aren’t actually arguments at all.\nDiscuss on Changelog News",
          "link": "https://alexanderwales.com/the-ai-art-apocalypse/",
          "publishedOn": "2022-08-17T14:18:00.000Z",
          "wordCount": null,
          "title": "The AI art apocalypse",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kw12",
          "author": "Jerod Santo",
          "description": "Josh Comeau takes times to answer the question that many of us have asked ourselves, but never sought out an answer to: exactly how does React’s re-rendering process work?\nThere are a lot of misconceptions out there about this topic, and it can lead to a lot of uncertainty. If we don’t understand React’s render cycle, how can we understand how to use React.memo, or when we should wrap our functions in useCallback?\nDiscuss on Changelog News",
          "link": "https://www.joshwcomeau.com/react/why-react-re-renders/",
          "publishedOn": "2022-08-17T13:32:01.000Z",
          "wordCount": null,
          "title": "Why React re-renders",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1807",
          "author": null,
          "description": "Daniel and Chris cover the AI news of the day in this wide-ranging discussion. They start with Truss from Baseten while addressing how to categorize AI infrastructure and tools. Then they move on to transformers (again!), and somehow arrive at an AI pilot model from CMU that can navigate crowded airspace (much to Chris’s delight).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nTruss on GitHub\nCMU: AI Pilot Can Navigate Crowded Airspace\nEmbarrassingly Parallel Training of Expert Language Models\nToucan: Learn español without even trying\n3D Vision with Transformers: A Survey\nSphere: Natural Language Processing with Transformers\nSkyJack on GitHub\nNVIDIA AI Demos\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/189",
          "publishedOn": "2022-08-16T21:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 189: CMU's AI pilot lands in the news 🗞",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/189/practical-ai-189.mp3",
            "length": "40314646",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlX1",
          "author": "Jerod Santo",
          "description": "As best I can tell, this provides simplified search across your infra, generates reports so you can easily audit resource usage, and lets you create/trigger jobs such as cleaning up unused resources and enforcing tag structures.\nThe search looks pretty powerful and you can pipe search results directly to jobs for quick processing:\nsearch is(resource) and tags.owner==null | tag update owner \"John Doe\"\n\nDiscuss on Changelog News",
          "link": "https://resoto.com/",
          "publishedOn": "2022-08-16T16:49:00.000Z",
          "wordCount": null,
          "title": "Resoto is a meta layer on top of your cloud infra",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/w9NO",
          "author": "Jerod Santo",
          "description": "Carlos Becker shares some SSH tips he’s learned over the years, including YubiKey integration. Did you know you can SSH straight into tmux?!\nDiscuss on Changelog News",
          "link": "https://carlosbecker.dev/posts/ssh-tips-and-tricks/",
          "publishedOn": "2022-08-16T15:58:00.000Z",
          "wordCount": null,
          "title": "SSH tips and tricks",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Eq13",
          "author": "Jamie Tanna",
          "description": "Every so often, engineers need to pick up a new language. After ~6 years of professional development using Java, with a bit of Ruby sprinkled in, coming to Deliveroo meant that I’d be starting to work on some Go codebases.\nSo when it came to accepting the offer, I ended up thinking about getting started with learning Go, so I could hit the ground running. In this post I share different ways to get practical experience of the language, as well as thoughts on what Go is like to a newbie\nDiscuss on Changelog News",
          "link": "https://www.jvt.me/posts/2022/08/12/learning-new-language-go/",
          "publishedOn": "2022-08-16T14:24:00.000Z",
          "wordCount": null,
          "title": "Learning a new language, or how I gained familiarity with Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqL2",
          "author": "Jerod Santo",
          "description": "Marta is a dual-pane file manager that’s super customizable and theme-able, too. It has an Actions Panel like Sublime Text and VS Code where you can work with files, interact with the operating system, or modify Marta itself. But for my money time, if it can remember the state of how I left things the last time… it’s far better than Finder already!\n\nDiscuss on Changelog News",
          "link": "https://marta.sh/",
          "publishedOn": "2022-08-15T18:53:00.000Z",
          "wordCount": null,
          "title": "A native, extensible & fast file manager for macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1805",
          "author": null,
          "description": "Lucas F. Costa on why your daily stand-ups don’t work and host to fix them, Mahdi Yusuf deeply explains Redis, the Deno team announces some big changes coming, DevDash is a highly configurable terminal dashboard for developers and creators & Brett Cannon determines what is a Minimum Viable Python (MVPy).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly\nSubscribe to our YouTube Channel\nWhy your daily stand-ups don’t work and host to fix them\nRedis Explained\nBig Changes Ahead for Deno\nDevDash\nMVPy: Minimum Viable Python\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-15",
          "publishedOn": "2022-08-15T17:40:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Stand-up advice, Redis explained, big changes for Deno, DevDash & Minimum Viable Python",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-15/the-changelog-news-2022-08-15.mp3",
            "length": "5921858",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/lOAY",
          "author": "Jerod Santo",
          "description": "System.css is a CSS library for building interfaces that resemble Apple’s System OS which ran from 1984-1991. Design-wise, not much really changed from System 1 to System 6; however this library is based on System 6 as it was the final monochrome version of MacOS.\n\nDiscuss on Changelog News",
          "link": "https://github.com/sakofchit/system.css",
          "publishedOn": "2022-08-15T13:58:00.000Z",
          "wordCount": null,
          "title": "A design system for building retro Apple interfaces",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1692",
          "author": null,
          "description": "eBPF is a revolutionary kernel technology that has lite the cloud native world on fire. If you’re going to have one person explain the excitement, that person would be Liz Rice. Liz is the COSO at Isovalent, creators of the open source Cilium project and pioneers of eBPF tech.\nOn this episode Liz tells Jerod all about the power of eBPF, where it came from, what kind of new applications its enabling, and who is building the next generation of networking, security, and observability tools with it.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nInfluxData – InfluxData’s Edge Data Replication feature allows developers to replicate data from local instances into InfluxDB Cloud, enables users to aggregate and…",
          "link": "https://changelog.com/podcast/501",
          "publishedOn": "2022-08-14T03:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 501: The power of eBPF",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/501/the-changelog-501.mp3",
            "length": "62514012",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1796",
          "author": null,
          "description": "Astro 1.0 just dropped so Amal got its creator, Fred K. Schott, on the pod for the full rundown. They go deep on how Astro is built to pull content from anywhere and serve it fast with their next-gen island architecture.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code PARTYTIME and get the team plan free for three months.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nHasura – Create dynamic high-performance GraphQL & REST APIs from your database(s) in minutes with granular authorization and caching baked in. All without touching your underlying database. Go from data to API in minutes. Get started for free at hasura.io/jsparty\n\n    \nFeaturing\nFred K. Schott – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNotes and Links\nAstro 1.0 announcement post\nAstro’s website\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/238",
          "publishedOn": "2022-08-12T21:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 238: Build faster websites with Astro 1.0",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/238/js-party-238.mp3",
            "length": "59366948",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/bJAl",
          "author": "Jerod Santo",
          "description": "This post reacting to other people’s reaction to GitLab’s recent free tier changes starts kinda rant-y:\nLots of users expect to get things for free, forever, from for-profit companies that don’t answer to them. Those users contribute almost nothing1 to the bottom line for the for-profit companies, and actively drive up costs for them. Yet, somehow, with no skin in the game, they feel entitled to complain and badmouth the companies because they’re not getting as much value for their monthly contribution of nothing at all.\nBut it ends with a pretty strong call to build things for ourselves:\nCreate a business case, get the funding, stand up the infrastructure, and pay people to work on it rather than expecting for-profit companies to prioritize (what you see as) the public good over profit. Whether that’s how things should be or not, it is how they are and that isn’t going to change as long as the only movement in the direction of change is people hectoring for-profit companies to do better.\nDiscuss on Changelog News",
          "link": "https://dissociatedpress.net/2022/08/10/give-nothing-expect-nothing-gitlabs-the-latest-punching-bag-for-entitled-users/",
          "publishedOn": "2022-08-12T16:51:00.000Z",
          "wordCount": null,
          "title": "GitLab’s the latest punching bag for entitled users",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/49Nq",
          "author": "Jerod Santo",
          "description": "When Rich Harris was last on JS Party, he wondered aloud:\n“Should I learn Rust? Should we rewrite the Svelte compiler in Rust?” Maybe it’s a terrible idea, I don’t know, but I think it’s at least worth investigating.\nWell, the effort we’re linking to here isn’t by Rich, but another member of the Svelte community. Their reasoning:\nMy main reason for doing this, is to compile Svelte without Node.js and possibly use Deno instead.\nAnd the state of the project:\nThis is still a big work in progress. I’m mainly working on this for fun and learning. I came up with the name rustle by combining rust and svelte (ruslte => rustle). The project is open to naming suggestions!\nDiscuss on Changelog News",
          "link": "https://github.com/pintariching/rustle",
          "publishedOn": "2022-08-12T15:14:00.000Z",
          "wordCount": null,
          "title": "The Svelte compiler rewritten in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM9j",
          "author": "Jerod Santo",
          "description": "A 12-week, 24-course curriculum covering:\nDifferent approaches to Artificial Intelligence, including the “good old” symbolic approach with Knowledge Representation and reasoning (GOFAI).\nNeural Networks and Deep Learning, which are at the core of modern AI. We will illustrate the concepts behind these important topics using code in two of the most popular frameworks - TensorFlow and PyTorch.\nNeural Architectures for working with images and text. We will cover recent models but may lack a little bit on the state-of-the-art.\nLess popular AI approaches, such as Genetic Algorithms and Multi-Agent Systems.\n\nDiscuss on Changelog News",
          "link": "https://github.com/microsoft/AI-For-Beginners",
          "publishedOn": "2022-08-12T14:25:00.000Z",
          "wordCount": null,
          "title": "Microsoft's new AI for Beginners course",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Zoge",
          "author": "Jerod Santo",
          "description": "You can think of this like fetch() or curl but entirely in SQL:\nselect request_url, response_status, response_headers \n  from http_get('http://httpbin.org/get');\n\nThe cool thing is you can save everything from the request: status code, headers, the body (of course), timestamps, and more. Great for archiving!\n-- initialize a table\ncreate table snapshots as\n  select * from http_get('https://changelog.com');\n\n-- To add more rows later on\ninsert into snapshots\n  select * from http_get('https://changelog.com');\n\nDiscuss on Changelog News",
          "link": "https://observablehq.com/@asg017/introducing-sqlite-http",
          "publishedOn": "2022-08-12T13:37:00.000Z",
          "wordCount": null,
          "title": "A SQLite extension for making HTTP requests",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8lN8",
          "author": "Ciprian Dorin Craciun",
          "description": "Not every hash algorithm is appropriate in all scenarios, and in fact, very few algorithms are usable in more than a couple of situations. Even worse, using the wrong algorithm will lead in the best case scenario to performance problems, but in the worst case scenario to security issues and even financial loss. Thus, knowing which algorithm to pick for which application is crucial.\nTherefore I’ll try to summarize how I approach the topic of hashing, including use-cases, recommended algorithms, and links to other articles.\nDiscuss on Changelog News",
          "link": "https://notes.volution.ro/v1/2022/07/notes/1290a79c/",
          "publishedOn": "2022-08-11T20:02:00.000Z",
          "wordCount": null,
          "title": "The many flavors of hashing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7ZR",
          "author": "Jerod Santo",
          "description": "Chip Huyen:\nAs machine learning moves towards real-time, streaming technology is becoming increasingly important for data scientists. Like many people coming from a machine learning background, I used to dread streaming. In our recent survey, almost half of the data scientists we asked said they would like to move from batch prediction to online prediction but can’t because streaming is hard, both technically and operationally…\nOver the last year, working with a co-founder who’s super deep into streaming, I’ve learned that streaming can be quite intuitive. This post is an attempt to rephrase what I’ve learned.\nDiscuss on Changelog News",
          "link": "https://huyenchip.com//2022/08/03/stream-processing-for-data-scientists.html",
          "publishedOn": "2022-08-11T19:13:00.000Z",
          "wordCount": null,
          "title": "Introduction to streaming for data scientists",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDq5",
          "author": "Jerod Santo",
          "description": "Mahdi Yusuf is back with another set of Architecture Notes, this time covering everyone’s favorite “data structure server”, Redis:\nRather than iterating over, sorting, and ordering rows, what if the data was in data structures you wanted from the ground up? Early on, it was used much like Memcached, but as Redis improved, it became viable for many other use cases, including publish-subscribe mechanisms, streaming, and queues.\n\nDiscuss on Changelog News",
          "link": "https://architecturenotes.co/redis/",
          "publishedOn": "2022-08-11T18:16:00.000Z",
          "wordCount": null,
          "title": "A deep technical dive into all things Redis",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1689",
          "author": null,
          "description": "Baruch Sadogursky (Chief Sticker Officer at JFrog) joins Natalie & Johnny to lament the current state of dependency management in Go and other languages. They discuss the problems dependency managers face, possible technical mitigations like SBOMs, people problems that will never be solved by tech, and take questions from listeners in the #gotimefm channel of Gophers Slack.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nShip It! – A podcast about getting your best ideas into the world and seeing what happens. Listen to an episode that interests you and subscribe today.\n\n    \nFeaturing\nBaruch Sadogursky – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nSam Boyer saying dependency managers being a human problem\nPyrsia.io untemperable ledger for modules\nPGP Keys\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/242",
          "publishedOn": "2022-08-11T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 242: The pain of dependency management",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/242/go-time-242.mp3",
            "length": "44426248",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/LWEn",
          "author": "Jerod Santo",
          "description": "We’re longtime users of Action Mailer and wanted something similar for our TypeScript/React apps. We didn’t find anything, so we decided to build Mailing.\nWe added some features that we would’ve liked in Action Mailer, like a mobile toggle (with hotkeys), and the ability to send a test email from the browser while developing. We went all in on MJML so that we (almost) never have to think about email clients or nested tables :)\nPlays well with the popular JS web frameworks, too. Demo video here.\nDiscuss on Changelog News",
          "link": "https://www.mailing.run/",
          "publishedOn": "2022-08-10T19:45:00.000Z",
          "wordCount": null,
          "title": "Build + test + send emails with React",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1697",
          "author": null,
          "description": "Tammer Saleh, founder of Super Orbital, a tiny team of exceptional Kubernetes engineers and teachers, is joining us today to talk about what is cool in the Cloud Native world. Yes, it’s the same Tammer that we had the pleasure of on shipit.show/31 - Is Kubernetes a platform?\nIn today’s episode, we also cover two great blog posts:\nZero to GitOps: Terraform and the AWS EKS Blueprints project by Sean Kane\nHunting Down an Intermittent Failure in Cilium by James McShane\nWe wrap up with ✨ The Cool Wall of Cloud Native ✨\nDiscuss on Changelog News\nChangelog++ members save 8 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, user…",
          "link": "https://changelog.com/shipit/65",
          "publishedOn": "2022-08-10T17:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 65: Two thumbs up for the Cool Wall",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/65/ship-it-65.mp3",
            "length": "77863071",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W1gO",
          "author": "Jerod Santo",
          "description": "This code is experimental (as you might imagine), but it’s full functional. It doesn’t implement all the Airplay protocols, but quite a few!\nDiscuss on Changelog News",
          "link": "https://github.com/openairplay/airplay2-receiver",
          "publishedOn": "2022-08-10T16:53:01.000Z",
          "wordCount": null,
          "title": "An Airplay 2 receiver in Python",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/49N7",
          "author": "Jerod Santo",
          "description": "Mike Melanson gives props to the language many of us (myself included) enjoy lampooning:\nWhile Java may have hit some hiccups earlier in its life, nowadays the language and its greater ecosystem have picked up the pace to meet the needs of the future in a variety of ways. In fact, it never really went anywhere: Companies like Amazon, Google, Netflix, Pinterest, Spotify, Square, and Zoom all employ Java across their vast codebases. Not to mention much of the high-scale data infrastructure over the past decade has been powered by Java, with the language serving as the backbone for the likes of Apache Hadoop, Kafka, and Spark.\nYou’ll have to read the article to see how he backs up statements like this one:\nAfter nearly 30 years of Java, you might expect the language to be showing some signs of wear and tear, but nothing could be further from the truth. Java in 2022 is not a language in decline, but rather a language preparing for the effervescent future of software development.\nDiscuss on Changelog News",
          "link": "https://github.com/readme/featured/java-programming-language",
          "publishedOn": "2022-08-10T14:15:00.000Z",
          "wordCount": null,
          "title": "Don’t call it a comeback: why Java is still champ",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1798",
          "author": null,
          "description": "AlphaFold is an AI system developed by DeepMind that predicts a protein’s 3D structure from its amino acid sequence. It regularly achieves accuracy competitive with experiment, and is accelerating research in nearly every field of biology.  Daniel and Chris delve into protein folding, and explore the implications of this revolutionary and hugely impactful application of AI.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAlphaFold\nAlphaFold reveals the structure of the protein universe\nAlphaFold: Timeline of a breakthrough\nAlphaFold Protein Structure Database\nGitHub:  deepmind / alphafold\nOxford Protein Informatics Group: AlphaFold 2 is here: what’s behind the structure prediction miracle\nNature: How AlphaFold can realize AI’s full potential in structural biology\nNature:  ‘The entire protein universe’: AI predicts shape of nearly every known protein\nNature: Highly accurate protein structure prediction with AlphaFold\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/188",
          "publishedOn": "2022-08-09T19:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 188: AlphaFold is revolutionizing biology",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/188/practical-ai-188.mp3",
            "length": "43968262",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/V1Xj",
          "author": "Jerod Santo",
          "description": "Ralf Jung has been thinking about semantics of Rust… a lot:\nThe purpose of MiniRust is to describe the semantics of an interesting fragment of Rust in a way that is both precise and understandable to as many people as possible… Specifically, MiniRust is specified by a reference interpreter that describes the step-by-step process of executing a MiniRust program, including checking at each step whether the program has Undefined Behavior.\nSource code here.\nDiscuss on Changelog News",
          "link": "https://www.ralfj.de/blog/2022/08/08/minirust.html",
          "publishedOn": "2022-08-09T14:36:00.000Z",
          "wordCount": null,
          "title": "Announcing: MiniRust",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/y7ZG",
          "author": "Jerod Santo",
          "description": "Daily stand-ups are a classic example of learned helplessness. We all know they’re useless, but we tell ourselves “that’s just how things are” and do nothing about it.\nLucas provides a set of five symptoms that indicate you’re doing stand-ups wrong and says if your team hits at least three of the five, your stand-ups are useless.\nBut, instead of just telling you to stop doing them (like I probably would), he provides a bunch of solid advice on how to make them useful again.\nDiscuss on Changelog News",
          "link": "https://lucasfcosta.com/2022/08/07/how-to-improve-daily-standups.html",
          "publishedOn": "2022-08-09T13:50:00.000Z",
          "wordCount": null,
          "title": "Why your daily stand-ups don't work and how to fix them",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1797",
          "author": null,
          "description": "We add episode chapters to the website, KubeSail sells a PiBox, Nima Badizadegan wants you to use one big server, Gergeloy Orosz details oncall compensation across the software industry, Greg Kogan isn’t impressed with how swamped you are at work, a dashboard template built on Bootstrap & Charm releases a CLI tool for shell scripts.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nPiBox\nUse One Big Server\nOncall Compensation for Software Engineers\n🎧 Gergeloy Orosz on The Changelog\nBeing Swamped is Normal and Not Impressive\n🎧 Woody Zuill on The Changelog\nTabler and Tabler React\nGum\n🎧 Toby Padilla on The Changelog\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-08",
          "publishedOn": "2022-08-08T17:50:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Chapters, PiBox, using one big server, oncall compensation, being swamped is normal, Tabler & Gum",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-08/the-changelog-news-2022-08-08.mp3",
            "length": "11860078",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/njEg",
          "author": "Jerod Santo",
          "description": "The story of Kells is an inspiring one, to say the least!\nI started this game back in 2020 as a fun little side-project to pass the time during the pandemic with lots of help from my son. Back then we didn’t even expect it to be playable, never mind it turning into a real game with 100+ levels and being released on Steam/PC. But even after that milestone, I never dreamed my son and I would be able to play it together around the TV on our favourite console!\n\nDiscuss on Changelog News",
          "link": "https://kellsgame.com/how-kells-came-to-be/",
          "publishedOn": "2022-08-08T15:00:00.000Z",
          "wordCount": null,
          "title": "A pandemic side project you can now play on Nintendo Switch",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1gg",
          "author": "Jerod Santo",
          "description": "Clojure is often lauded, but you don’t see too many teams actually using it to build production systems. “Why Clojure?” is what the Penpot team gets asked the most, so they lay their reasoning out in this article. The TLDR:\nThough it is not a mainstream language, Clojure was the right language for Penpot to choose because of its key features: stability, backwards compatibility, and syntactic abstraction.\nDiscuss on Changelog News",
          "link": "https://blog.kaleidos.net/penpot-chose-clojure-as-its-language-and-here-is-why/",
          "publishedOn": "2022-08-08T14:14:01.000Z",
          "wordCount": null,
          "title": "Why we chose the Clojure programming language",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6OEP",
          "author": "Jerod Santo",
          "description": "Pulls data from many sources. Built with Go. Demo video here.\n\nDiscuss on Changelog News",
          "link": "https://thedevdash.com/",
          "publishedOn": "2022-08-08T13:25:00.000Z",
          "wordCount": null,
          "title": "A highly configurable terminal dashboard for developers and creators",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1752",
          "author": null,
          "description": "Episode 500!!! And it has been a journey! Nearly 13 years ago we started this podcast and as of today (this episode) we’ve officially shipped our 500th episode. As a companion to this episode, Jerod and Adam shipped a special Backstage episode where they reflect on 500 episodes. And…not only has it been a journey for us, but it’s also been a journey for our good friend Chris Coyier and CSS-Tricks — which he grew from his personal blog to a massively popular contributor driven model, complete with an editor-in-chief, a wide array of influential contributors, and advertisers to help fund the way. The news, of course, is that CSS-Tricks was recently acquired by DigitalOcean in March of 2022. We get into all the details of this deal, his journey, and the legacy of CSS-Tricks.\nDiscuss on Change…",
          "link": "https://changelog.com/podcast/500",
          "publishedOn": "2022-08-05T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 500: The legacy of CSS-Tricks",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/500/the-changelog-500.mp3",
            "length": "91948628",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1714",
          "author": null,
          "description": "AngularJS creator Miško Hevery has a new web framework he wants to tell us about, but he’s not pitching just another framework, but with different DX. He says that Qwik is a fundamental rethinking of how a web application should work. And he’s here to convince Jerod & KBall that the implications of that are BIG.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike …",
          "link": "https://changelog.com/jsparty/237",
          "publishedOn": "2022-08-05T17:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 237: Qwik is a new kind of web framework",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/237/js-party-237.mp3",
            "length": "62347111",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/12/1794",
          "author": null,
          "description": "This is Adam and Jerod’s pre-show call before hooking up with Chris Coyier to record episode 500 of The Changelog. We’ve been doing these off and on for awhile now. We hang out for 30ish minutes before the show begins and ship that conversation as a bonus for our Changelog++ members.\nWe’re doing this one different. You don’t hit a round number like this very often. So, here it is. A standalone Backstage episode. Thanks for listening and here’s to the next 500! 🥂\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nJoin Changelog++!\nJerod’s first episode: #85\nSuper early days: #3\nThe one with Chris McCord: #147\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/24",
          "publishedOn": "2022-08-05T16:00:00.000Z",
          "wordCount": null,
          "title": "Backstage 24: Reflecting on 500 episodes",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/24/backstage-24.mp3",
            "length": "24406323",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwWe",
          "author": "Sébastien Lorber",
          "description": "Meta just released a stable version of their new documentation static-site-generator, after a 4 years alpha/beta period. It allows you to focus on content and just write Markdown files. Based on Node.js, React and MDX. Powering many docs sites including React-Native, Supabase, Redux, Tauri, Electron, Courier, Ionic, Figma, Prettier, Babel…\nDiscuss on Changelog News",
          "link": "https://docusaurus.io/blog/2022/08/01/announcing-docusaurus-2.0",
          "publishedOn": "2022-08-05T14:25:00.000Z",
          "wordCount": null,
          "title": "Announcing Docusaurus 2.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/PpXo",
          "author": "Jerod Santo",
          "description": "Michael Guarino lays out how the engineering team at Plural brought K8s to the browser for their users:\nOverall, we had a ton of fun building this feature. It allowed us to delve into an often unexplored area of the Kubernetes API, which I am honestly happy that we got to explore. This project also took an unexpected turn in its use of tmux and exposed us to a genuinely mind-blowing project in xtermjs (I’m shocked the community had the patience to write a full shell in javascript!).\n\nDiscuss on Changelog News",
          "link": "https://www.plural.sh/blog/how-we-created-an-in-browser-kubernetes-experience/",
          "publishedOn": "2022-08-05T13:36:00.000Z",
          "wordCount": null,
          "title": "How we created an in-browser Kubernetes experience",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1699",
          "author": null,
          "description": "Our today’s guest spent 4 days building a feature for his side project so that we could ship it together on Ship It!, while recording. The feature is called rave mode, and the context is Bass, an interpreted functional scripting language written in Go, riffing on the ideas of Kernel & Clojure. When the local build runs, you can now press r to synchronise the beats of your currently playing Spotify track with the build output. For a demo, see bass v0.9.0 release.\nPlease welcome Alex Suraci, a.k.a. vito, the creator of Concourse CI and Bass.\nThis episode is dedicated to the late John Shutt, the creator of Kernel.\nYour ideas continue in Bass.\nThank you for getting them out into the world.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads di…",
          "link": "https://changelog.com/shipit/64",
          "publishedOn": "2022-08-04T17:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 64: Bass: the beat drop after Concourse",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/64/ship-it-64.mp3",
            "length": "88344525",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1690",
          "author": null,
          "description": "Our award winning worthy survey game show is back, this time Mat Ryer hosts it live on stage at GopherCon Europe 2022!\nGo Time’s Natalie Pistunovich joins forces with Ronna Steinberg & Robert Burke to battle it out  with V Körbes, Tamir Bahar & Konrad Richie. Let’s see who can better guess what the GopherCon Europe gophers had to say!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nNatalie Pistunovich – Twitter, GitHub\nRonna Steinberg – Twitter, GitHub\nRobert Burke – Twitter, GitHub, Website\nV Körbes – Twitter, GitHub, Website\nTamir Bahar – Twitter, GitHub\nKonrad Reiche – Twitter, GitHub, Website\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nDonate to GoBridge\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/241",
          "publishedOn": "2022-08-04T16:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 241: Gophers Say! GopherCon EU Edition",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/241/go-time-241.mp3",
            "length": "39514622",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/RdEP",
          "author": "Jerod Santo",
          "description": "This is an attempt to build a locally hosted version of GitHub Copilot. It uses the SalesForce CodeGen models inside of NVIDIA’s Triton Inference Server with the FasterTransformer backend.\nOnce you get it all set up, you can point VS Code’s Copilot plugin at it!\nDiscuss on Changelog News",
          "link": "https://github.com/moyix/fauxpilot",
          "publishedOn": "2022-08-04T15:19:00.000Z",
          "wordCount": null,
          "title": "FauxPilot – an open source GitHub Copilot server",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1PO",
          "author": "Dylan Paulus",
          "description": "Don’t stress, we all break production. These are the tips I wished I had. Not which framework to learn, or how to ace that programming interview (all useful!), but what to expect when you land your first software job.\nDiscuss on Changelog News",
          "link": "https://www.dylanpaulus.com/tips-for-new-software-engineers/",
          "publishedOn": "2022-08-04T14:31:00.000Z",
          "wordCount": null,
          "title": "Advice for new software engineers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3LzN",
          "author": "Jerod Santo",
          "description": "Suraj Pillai, singing fzf’s praises:\nI’m a CLI junkie, addicted to Vim motions, and never miss an opportunity to bring those two in to any part of my workflow. Naturally, I love to geek out about command line utilities and am always on the lookout for the next tool that can improve my productivity or just make CLI more fun to use. I can confidently say that Fzf is one of the handful of tools I’ve discovered over the years that has done both and has,thus, significantly improved the quality of my command line life.\nDiscuss on Changelog News",
          "link": "https://medium.com/@Suraj_Pillai/fzf-the-tool-that-will-transform-your-cli-life-91148d54de6",
          "publishedOn": "2022-08-04T13:45:00.000Z",
          "wordCount": null,
          "title": "Fzf: a tool that will transform your CLI life",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WX6",
          "author": "Jerod Santo",
          "description": "I have to admit, I enjoy making fun of PHP. Mostly because the language itself is a fractal of bad design. But I (try to) do it with love, because language design is just one part of what makes a programming environment good. This post is a nice reminder of the many reasons why PHP and JavaScript are awesome.\nOver the last twenty years, I have used over a dozen languages professionally, from C to Common Lisp, from Java to Python, from C++ to Typescript.\nYet, I love janky programming languages. In particular, I really enjoy PHP and JavaScript.\nHere’s why.\nI particularly agree with the point at the end about legacy codebases, many of which are powered by PHP and JS:\nA legacy codebase means that the product is performing well. It means that I can often make immediate and impactful improvements.\nFor me, nothing comes close to the pleasure of improving a product with many users.\nDiscuss on Changelog News",
          "link": "https://the.scapegoat.dev/why-i-love-php-and-javascript/",
          "publishedOn": "2022-08-03T14:29:00.000Z",
          "wordCount": null,
          "title": "Why I still love PHP and JavaScript after 20+ years",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D1Yp",
          "author": "Jerod Santo",
          "description": "A lot of ink is spent on the “monoliths vs. microservices” debate, but the real issue behind this debate is about whether distributed system architecture is worth the developer time and cost overheads. By thinking about the real operational considerations of our systems, we can get some insight into whether we actually need distributed systems for most things.\nScaling up has always been easier than scaling out. It’s amazing what one beefy server can do these days…\nDiscuss on Changelog News",
          "link": "https://specbranch.com/posts/one-big-server/",
          "publishedOn": "2022-08-03T13:38:00.000Z",
          "wordCount": null,
          "title": "Use one big server",
          "itunes": {}
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0816release/",
          "author": null,
          "description": "Falcon Punch model and 200+ supported cars!",
          "link": "https://blog.comma.ai/0816release/",
          "publishedOn": "2022-08-26T00:00:00.000Z",
          "wordCount": 1205,
          "title": "openpilot 0.8.16"
        },
        {
          "id": "https://blog.comma.ai/ourfirstlawsuit/",
          "author": null,
          "description": "Notorious AV patent troll Axel Nix is at it again!",
          "link": "https://blog.comma.ai/ourfirstlawsuit/",
          "publishedOn": "2022-08-24T00:00:00.000Z",
          "wordCount": 667,
          "title": "Patent Trolls Inbound: Our First Lawsuit"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/join-us-in-the-ai-test-kitchen/",
          "author": null,
          "description": "As AI technologies continue to advance, they have the potential to unlock new experiences that support more natural human-computer interactions. We see a future where you can find the information you’re looking for in the same conversational way you speak to friends and family. While there’s still lots of work to be done before this type of human-computer interaction is possible, recent research breakthroughs in generative language models — inspired by the natural conversations of people — are accelerating our progress. One of our most promising models is called LaMDA (Language Model for Dialogue Applications), and as we move ahead with development, we feel a great responsibility to get this right.\n\n\nThat’s why we introduced an app called AI Test Kitchen at Google I/O earlier this year. It…",
          "link": "https://blog.google/technology/ai/join-us-in-the-ai-test-kitchen/",
          "publishedOn": "2022-08-25T16:00:00.000Z",
          "wordCount": 1407,
          "title": "Join us in the AI Test Kitchen"
        },
        {
          "id": "https://blog.google/technology/ai/helping-people-understand-ai/",
          "author": null,
          "description": "If you’re like me, you may have noticed that AI has become a part of daily life. I wake up each morning and ask my smart assistant about the weather. I recently applied for a new credit card and the credit limit was likely determined by a machine learning model. And while typing the previous sentence, I got a word choice suggestion that “probably” might flow better than “likely,” a suggestion powered by AI.\n\n\nAs a member of Google’s Responsible Innovation team, I think a lot about how AI works and how to develop it responsibly. Recently, I spoke with Patrick Gage Kelley, Head of Research Strategy on Google’s Trust & Safety team, to learn more about developing products that help people recognize and understand AI in their daily lives.\n\n\nHow do you help people navigate a world with so much A…",
          "link": "https://blog.google/technology/ai/helping-people-understand-ai/",
          "publishedOn": "2022-08-18T15:00:00.000Z",
          "wordCount": 1537,
          "title": "Helping people understand AI"
        },
        {
          "id": "https://blog.google/technology/ai/making-robots-more-helpful-with-language/",
          "author": null,
          "description": "Even the simplest human tasks are unbelievably complex. The way we perceive and interact with the world requires a lifetime of accumulated experience and context. For example, if a person tells you, “I am running out of time,” you don’t immediately worry they are jogging on a street where the space-time continuum ceases to exist. You understand that they’re probably coming up against a deadline. And if they hurriedly walk toward a closed door, you don’t brace for a collision, because you trust this person can open the door, whether by turning a knob or pulling a handle.\n\n\nA robot doesn’t innately have that understanding. And that’s the inherent challenge of programming helpful robots that can interact with humans. We know it as “Moravec's paradox” — the idea that in robotics, it’s the easi…",
          "link": "https://blog.google/technology/ai/making-robots-more-helpful-with-language/",
          "publishedOn": "2022-08-16T14:00:00.000Z",
          "wordCount": 1831,
          "title": "Making robots more helpful with language"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=20102",
          "author": "Daniel Stenberg",
          "description": "Welcome to a new curl release, the result of a slightly extend release cycle this time. Release presentation Numbers the 210th release3 changes65 days (total: 8,930)165 bug-fixes (total: 8,145)230 commits (total: 29,017)0 new public libcurl function (total: 88)2 new curl_easy_setopt() option (total: 299)0 new curl command line option (total: 248)79 contributors, 38 new (total: 2,690)44 … Continue reading curl 7.85.0 for you →",
          "link": "https://daniel.haxx.se/blog/2022/08/31/curl-7-85-0-for-you/",
          "publishedOn": "2022-08-31T06:34:35.000Z",
          "wordCount": 1282,
          "title": "curl 7.85.0 for you"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19985",
          "author": "Daniel Stenberg",
          "description": "A little over a year ago, we ditched Travis CI as a service to use for the curl project. Up until that day, it had been our preferred and favored CI service for many years. At most, we ran 34 CI jobs on it, for every pull-request and commit. It was the service that we … Continue reading The Travis separation a year later →",
          "link": "https://daniel.haxx.se/blog/2022/08/27/the-travis-separation-a-year-later/",
          "publishedOn": "2022-08-27T12:59:35.000Z",
          "wordCount": 984,
          "title": "The Travis separation a year later"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19949",
          "author": "Daniel Stenberg",
          "description": "In June of 2022 we intended to run the curl up 2022 curl conference in person, in California. Unfortunately, I had the bad taste of catching covid exactly when I was about to use my new US visa for the first time, so I had to remain at home and because of that we cancelled … Continue reading curl up 2022 take 2 →",
          "link": "https://daniel.haxx.se/blog/2022/08/26/curl-up-2022-take-2/",
          "publishedOn": "2022-08-26T07:39:08.000Z",
          "wordCount": 609,
          "title": "curl up 2022 take 2"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19725",
          "author": "Daniel Stenberg",
          "description": "I get this question fairly often. How would the projects I run manage if I took off? And really, the primary project people think of then is of course curl. How would the curl project manage if I took a forever vacation starting now? Of course I don’t know that. We can’t really know for … Continue reading What if I vanished? →",
          "link": "https://daniel.haxx.se/blog/2022/08/24/what-if-i-vanished/",
          "publishedOn": "2022-08-24T08:48:11.000Z",
          "wordCount": 1206,
          "title": "What if I vanished?"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19793",
          "author": "Daniel Stenberg",
          "description": "Recently I have received curious questions from users, customers and bystanders. Can you explain the seemingly increased CVE activity in curl over like the last year or so? (data and stats for this post comes mostly from the curl dashboard) Frequency In 2022 we have already had 14 CVEs reported so far, and we will … Continue reading Increased CVE activity in curl? →",
          "link": "https://daniel.haxx.se/blog/2022/08/22/increased-cve-activity-in-curl/",
          "publishedOn": "2022-08-22T06:22:50.000Z",
          "wordCount": 2395,
          "title": "Increased CVE activity in curl?"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19880",
          "author": "Daniel Stenberg",
          "description": "With just a month left until its seventh birthday, everything curl has now surpassed this amazing milestone. The book now contains more than 100,000 words. Distributed over 883 sections. All written in glorious markdown. Two years ago when we celebrated its 5th birthday, it was still this measly thin “pamphlet” of 72,000 words. It has … Continue reading 100,000 words →",
          "link": "https://daniel.haxx.se/blog/2022/08/19/100000-words/",
          "publishedOn": "2022-08-19T06:15:50.000Z",
          "wordCount": 579,
          "title": "100,000 words"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19882",
          "author": "Daniel Stenberg",
          "description": "Uncurled – everything I know and learned about running and maintaining Open Source projects for three decades. This is me, doing a live English-speaking presentation/webinar on these topics that I cover in my book: Uncurled. Date: Tuesday August 23, 2022 Time: 10: 00 UTC (12:00 CEST) Where: over zoom [Sign up] The plan is to … Continue reading Uncurled – the presentation →",
          "link": "https://daniel.haxx.se/blog/2022/08/18/uncurled-the-presentation/",
          "publishedOn": "2022-08-18T12:41:09.000Z",
          "wordCount": 441,
          "title": "Uncurled – the presentation"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19601",
          "author": "Daniel Stenberg",
          "description": "In the curl project we do timed releases and we try to do them planned and scheduled long in advance. The dates are planned. The content is not. I have been the release manager for every single curl release done. 209 releases at current count. Having this role means I make sure things are in … Continue reading The curl release cycle →",
          "link": "https://daniel.haxx.se/blog/2022/08/16/the-curl-release-cycle/",
          "publishedOn": "2022-08-16T09:43:10.000Z",
          "wordCount": 1200,
          "title": "The curl release cycle"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19646",
          "author": "Daniel Stenberg",
          "description": "Disclaimer: I work for wolfSSL but I don’t speak for wolfSSL. I state my own opinions and I try to be as honest and transparent as possible. As always. QUIC API Back in the summer of 2020 I blogged about QUIC support coming in wolfSSL. That work never actually took off, primarily I believe because … Continue reading QUIC and HTTP/3 with wolfSSL →",
          "link": "https://daniel.haxx.se/blog/2022/08/15/quic-and-http-3-with-wolfssl/",
          "publishedOn": "2022-08-15T07:13:05.000Z",
          "wordCount": 1185,
          "title": "QUIC and HTTP/3 with wolfSSL"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19590",
          "author": "Daniel Stenberg",
          "description": "curl, along with every other Internet tool with aspirations, supports proxies. A proxy is a (usually known) middle-man in a network operation; instead of going directly to the remote end server, the client goes via a proxy. curl has supported proxies since the day it was born. Which proxy? Applications that do Internet transfers often … Continue reading The dream of auto-detecting proxies →",
          "link": "https://daniel.haxx.se/blog/2022/08/12/the-dream-of-auto-detecting-proxies/",
          "publishedOn": "2022-08-12T11:27:31.000Z",
          "wordCount": 1220,
          "title": "The dream of auto-detecting proxies"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19629",
          "author": "Daniel Stenberg",
          "description": "The InterPlanetary File System (IPFS) is according to the Wikipedia description: “a protocol, hypermedia and file sharing peer-to-peer network for storing and sharing data in a distributed file system.”. It works a little like bittorrent and you typically access content on it using a very long hash in an ipfs:// URL. Like this: ipfs://bafybeigagd5nmnn2iys2f3doro7ydrevyr2mzarwidgadawmamiteydbzi HTTP … Continue reading IPFS and their gateways →",
          "link": "https://daniel.haxx.se/blog/2022/08/10/ipfs-and-their-gateways/",
          "publishedOn": "2022-08-10T11:46:19.000Z",
          "wordCount": 1274,
          "title": "IPFS and their gateways"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19596",
          "author": "Daniel Stenberg",
          "description": "The preferred method of providing changes to the curl project, be it source code, documentation or web site contents, is by submitting a pull-request. A “PR”. On the curl repository on GitHub. When a proposed curl change, bugfix or improvement is submitted as a PR on GitHub, it gets built, checked, tested and verified in … Continue reading How I merge PRs in curl →",
          "link": "https://daniel.haxx.se/blog/2022/08/08/how-i-merge-prs-in-curl/",
          "publishedOn": "2022-08-08T09:25:12.000Z",
          "wordCount": 943,
          "title": "How I merge PRs in curl"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-09-01T12:20:12.078Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-08-31T12:22:37.738Z",
          "wordCount": 1485,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-08-21T12:17:05.602Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-08-20T12:17:45.780Z",
          "wordCount": 1353,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-08-16T12:18:08.696Z",
          "wordCount": 2038,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-08-15T12:21:00.255Z",
          "wordCount": 1279,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-08-11T12:22:13.069Z",
          "wordCount": 832,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-08-10T12:18:51.786Z",
          "wordCount": 984,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-08-05T12:20:17.291Z",
          "wordCount": 1324,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-08-04T12:19:36.029Z",
          "wordCount": 1606,
          "title": "Data transfer in Manhattan using RocksDB"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/08/the-quantum-state-of-linux-kernel.html",
          "author": null,
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=wJuDEFlUsDZt7lpAAPdLm9CoNqneSjGN6FUREF5POP9krml-9Eg4KzR8naUO0aF3kuG_eoWNft1SfWZjF8JeEg');.lst-kix_wm3dnufq67dx-7>li:before{content:\"-  \"}.lst-kix_wm3dnufq67dx-8>li:before{content:\"-  \"}ol.lst-kix_iptxq54yrrnf-3.start{counter-reset:lst-ctn-kix_iptxq54yrrnf-3 0}.lst-kix_u3opzkdcnklc-1>li{counter-increment:lst-ctn-kix_u3opzkdcnklc-1}.lst-kix_wm3dnufq67dx-1>li:before{content:\"-  \"}.lst-kix_iptxq54yrrnf-4>li{counter-increment:lst-ctn-kix_iptxq54yrrnf-4}ol.lst-kix_mfudkcwv2w89-7.start{counter-reset:lst-ctn-kix_mfudkcwv2w89-7 0}.lst-kix_wm3dnufq67dx-0>li:before{content:\"-  \"}.lst-kix_hk8k8itxmlfp-4>li{counter-increment:lst-ctn-kix_hk8k8itxmlfp-4}.lst-kix_8chkxhfzc2ds-3>li:before{content:\"-  \"}.lst-kix_8chkxhfzc2ds-5>li:before{content…",
          "link": "https://googleprojectzero.blogspot.com/2022/08/the-quantum-state-of-linux-kernel.html",
          "publishedOn": "2022-08-10T23:00:00.003Z",
          "wordCount": 5171,
          "title": "The quantum state of Linux kernel garbage collection CVE-2021-0920 (Part I)"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47913",
          "author": "Schalk Neethling",
          "description": "How do you merge two Git repositories without losing history? This post will take you through the step-by-step process.\nThe post Merging two GitHub repositories without losing commit history appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/08/merging-two-github-repositories-without-losing-commit-history/",
          "publishedOn": "2022-08-29T07:54:58.000Z",
          "wordCount": 3521,
          "title": "Merging two GitHub repositories without losing commit history"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog",
      "articles": [
        {
          "id": "https://github.blog/?p=66724",
          "author": "Jeimy Ruiz",
          "description": "Register now to attend GitHub Universe virtually or in-person at the Yerba Buena Center for the Arts in San Francisco on November 9-10.",
          "link": "https://github.blog/2022-08-31-what-you-can-expect-at-github-universe-2022-cloud-security-community-and-ai/",
          "publishedOn": "2022-08-31T16:00:42.000Z",
          "wordCount": 1016,
          "title": "What you can expect at GitHub Universe 2022: cloud, security, community, and AI"
        },
        {
          "id": "https://github.blog/?p=66739",
          "author": "Derrick Stolee",
          "description": "Git’s file history queries use specialized algorithms that are tailored to common developer behavior. Level up your history spelunking skills by learning how different history modes behave and which ones to use when you need them.",
          "link": "https://github.blog/2022-08-31-gits-database-internals-iii-file-history-queries/",
          "publishedOn": "2022-08-31T14:00:42.000Z",
          "wordCount": 4841,
          "title": "Git’s database internals III: file history queries"
        },
        {
          "id": "https://github.blog/?p=66689",
          "author": "Derrick Stolee",
          "description": "This post explores Git commit history as a database where ‘git log’ is the query language. Learn about Git’s custom query index – the commit-graph file – and how to make sure it's enabled in your repositories.",
          "link": "https://github.blog/2022-08-30-gits-database-internals-ii-commit-history-queries/",
          "publishedOn": "2022-08-30T16:00:11.000Z",
          "wordCount": 5733,
          "title": "Git’s database internals II: commit history queries"
        },
        {
          "id": "https://github.blog/?p=66673",
          "author": "Derrick Stolee",
          "description": "This blog series will examine Git’s internals to help make your engineering system more efficient. Part I discusses how Git stores its data in packfiles using custom compression techniques.",
          "link": "https://github.blog/2022-08-29-gits-database-internals-i-packed-object-store/",
          "publishedOn": "2022-08-29T13:00:06.000Z",
          "wordCount": 4598,
          "title": "Git’s database internals I: packed object store"
        },
        {
          "id": "https://github.blog/?p=66657",
          "author": "Ashley Wolf",
          "description": "The future of software development does not exist without open source. However, to maintain today’s software and create the software of the future, the largest organizations and beneficiaries of open source need to expand their collaboration with the community and help it grow.",
          "link": "https://github.blog/2022-08-26-3-ways-every-company-can-get-started-with-an-open-source-software-strategy/",
          "publishedOn": "2022-08-26T16:00:50.000Z",
          "wordCount": 1046,
          "title": "3 ways every company can get started with an open-source software strategy"
        },
        {
          "id": "https://github.blog/?p=66604",
          "author": "Klint Finley",
          "description": "Whether you’re committing 30 minutes or 3 hours a day to learning, consistency is key. Klint Finley asks 3 tech professionals at different stages in their career for more advice.",
          "link": "https://github.blog/2022-08-25-keeping-your-skillset-fresh-as-a-developer/",
          "publishedOn": "2022-08-25T17:00:22.000Z",
          "wordCount": 2379,
          "title": "Keeping your skillset fresh as a developer"
        },
        {
          "id": "https://github.blog/?p=66578",
          "author": "Matthew Draper",
          "description": "We've open sourced Trilogy, the database adapter we use to connect Ruby on Rails to MySQL-compatible database servers.",
          "link": "https://github.blog/2022-08-25-introducing-trilogy-a-new-database-adapter-for-ruby-on-rails/",
          "publishedOn": "2022-08-25T14:16:34.000Z",
          "wordCount": 842,
          "title": "Introducing Trilogy: a new database adapter for Ruby on Rails"
        },
        {
          "id": "https://github.blog/?p=66595",
          "author": "Rizel Scarlett",
          "description": "This month's featured open source project, Open Sauced, connects contributors and maintainers through analytical insights.",
          "link": "https://github.blog/2022-08-25-open-source-monthly-august-2022-edition/",
          "publishedOn": "2022-08-25T13:00:25.000Z",
          "wordCount": 1424,
          "title": "Open Source Monthly: August 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66571",
          "author": "Lee Reilly",
          "description": "We are pleased to announce the full lineup of talks and workshops for this year’s Git Merge conference in Chicago. 17 talks, 3 workshops, 1 panel, and some great company!",
          "link": "https://github.blog/2022-08-23-the-full-lineup-for-git-merge-2022-revealed/",
          "publishedOn": "2022-08-23T13:00:23.000Z",
          "wordCount": 734,
          "title": "The full lineup for Git Merge 2022 revealed"
        },
        {
          "id": "https://github.blog/?p=66541",
          "author": "Evi Liu",
          "description": "As part of GitHub Enterprise Server 3.6, enterprise customers will now be able to use GitHub Discussions.",
          "link": "https://github.blog/2022-08-17-github-discussions-is-now-available-on-github-enterprise-server/",
          "publishedOn": "2022-08-17T16:00:28.000Z",
          "wordCount": 967,
          "title": "GitHub Discussions is now available on GitHub Enterprise Server"
        },
        {
          "id": "https://github.blog/?p=66529",
          "author": "Melody Mileski",
          "description": "GitHub Discussions and Audit Log Streaming, new automation features, and security enhancements are available now in GitHub Enterprise Server 3.6.",
          "link": "https://github.blog/2022-08-17-github-enterprise-server-3-6-is-now-generally-available/",
          "publishedOn": "2022-08-17T13:00:01.000Z",
          "wordCount": 1280,
          "title": "GitHub Enterprise Server 3.6 is now generally available"
        },
        {
          "id": "https://github.blog/?p=66458",
          "author": "Rose Coogan",
          "description": "We’re reporting on a six-month period rather than annually to increase our level of transparency. For this report, we’ve continued with the more granular reporting we began in our 2021 reports.",
          "link": "https://github.blog/2022-08-16-2022-transparency-report-january-to-june/",
          "publishedOn": "2022-08-16T21:00:21.000Z",
          "wordCount": 5184,
          "title": "2022 Transparency Report: January to June"
        },
        {
          "id": "https://github.blog/?p=66506",
          "author": "Bas van Schaik",
          "description": "Today, GitHub code scanning has all of LGTM.com’s key features—and more! The time has therefore come to announce the plan for the gradual deprecation of LGTM.com.",
          "link": "https://github.blog/2022-08-15-the-next-step-for-lgtm-com-github-code-scanning/",
          "publishedOn": "2022-08-15T15:00:07.000Z",
          "wordCount": 898,
          "title": "The next step for LGTM.com: GitHub code scanning!"
        },
        {
          "id": "https://github.blog/?p=66464",
          "author": "Chris Patterson",
          "description": "As GitHub Pages, home to 16 million websites, approaches its 15th anniversary, we’re excited to announce that all sites now build and deploy with GitHub Actions.",
          "link": "https://github.blog/2022-08-10-github-pages-now-uses-actions-by-default/",
          "publishedOn": "2022-08-10T16:00:29.000Z",
          "wordCount": 1291,
          "title": "GitHub Pages now uses Actions by default"
        },
        {
          "id": "https://github.blog/?p=66406",
          "author": "Brittany O'Shea",
          "description": "GitHub Actions gives teams access to powerful, native CI/CD capabilities right next to their code hosted in GitHub. Starting today, GitHub will send a Dependabot alert for vulnerable GitHub Actions, making it even easier to stay up to date and fix security vulnerabilities in your actions workflows.",
          "link": "https://github.blog/2022-08-09-dependabot-now-alerts-for-vulnerable-github-actions/",
          "publishedOn": "2022-08-09T15:00:27.000Z",
          "wordCount": 1140,
          "title": "Dependabot now alerts for vulnerable GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=66435",
          "author": "Justin Hutchings",
          "description": "Supply chain attacks exploit our implicit trust of open source to hurt developers and our customers. Read our proposal for how npm will significantly reduce supply chain attacks by signing packages with Sigstore.",
          "link": "https://github.blog/2022-08-08-new-request-for-comments-on-improving-npm-security-with-sigstore-is-now-open/",
          "publishedOn": "2022-08-08T16:22:23.000Z",
          "wordCount": 868,
          "title": "New request for comments on improving npm security with Sigstore is now open"
        },
        {
          "id": "https://github.blog/?p=66437",
          "author": "Brittany O'Shea",
          "description": "Today, we’re expanding access to the GitHub security overview! All GitHub Enterprise customers now have access to the security overview, not just those with GitHub Advanced Security. Additionally, all users within an enterprise can now access the security overview, not just admins and security managers.",
          "link": "https://github.blog/2022-08-08-all-github-enterprise-users-now-have-access-to-the-security-overview/",
          "publishedOn": "2022-08-08T15:00:11.000Z",
          "wordCount": 1132,
          "title": "All GitHub Enterprise users now have access to the security overview"
        },
        {
          "id": "https://github.blog/?p=66416",
          "author": "Michelle Mannering",
          "description": "While some of us have been wrapping up the financial year, and enjoying vacation time, others have been hard at work shipping open source projects and releases. These projects include everything from world-changing technology to developer tooling, and weekend hobbies. Here are some of the open source projects that released major version updates this July. […]",
          "link": "https://github.blog/2022-08-05-release-radar-jul-2022/",
          "publishedOn": "2022-08-05T17:00:38.000Z",
          "wordCount": 1473,
          "title": "Release Radar · July 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66373",
          "author": "Tina Heidinger",
          "description": "From hosting private packages in a private repository to tightening your security profile with GITHUB_TOKEN, here are five simple ways you can streamline your workflow with GitHub Packages.",
          "link": "https://github.blog/2022-08-04-5-simple-things-you-can-do-with-github-packages-to-level-up-your-workflows/",
          "publishedOn": "2022-08-04T16:00:08.000Z",
          "wordCount": 1727,
          "title": "5 simple things you can do with GitHub Packages to level up your workflows"
        },
        {
          "id": "https://github.blog/?p=66395",
          "author": "Jakub Oleksy",
          "description": "In July, we experienced one incident that resulted in degraded performance for Codespaces. This report also acknowledges two incidents that impacted multiple GitHub.com services in June.",
          "link": "https://github.blog/2022-08-03-github-availability-report-july-2022/",
          "publishedOn": "2022-08-03T16:00:30.000Z",
          "wordCount": 1041,
          "title": "GitHub Availability Report: July 2022"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=18840",
          "author": "Nubank Editorial",
          "description": "Going beyond maternity leave helps fight gender inequality, encourages family bonds, and creates a safer environment for professionals with children.\nThe post How does parental leave work at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/parental-leave-at-nubank/",
          "publishedOn": "2022-08-31T20:23:52.000Z",
          "wordCount": 3611,
          "title": "How does parental leave work at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18813",
          "author": "Nubank Editorial",
          "description": "Do you know what an Associate Product Manager does? Our Nubankers tell us what is their scope of work and expected skills.\nThe post What is it like to be an Associate Product Manager at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/associate-product-manager-at-nubank/",
          "publishedOn": "2022-08-26T18:13:40.000Z",
          "wordCount": 3521,
          "title": "What is it like to be an Associate Product Manager at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18765",
          "author": "Nubank Editorial",
          "description": "Nubank's Design team has over 200 professionals across many Business Units (BUs). Check out how the team is allocated in the company:\nThe post What is it like to have a career at Nubank’s Design team? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/career-at-nubanks-design-team/",
          "publishedOn": "2022-08-19T21:36:51.000Z",
          "wordCount": 3538,
          "title": "What is it like to have a career at Nubank’s Design team?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18742",
          "author": "Nubank Press",
          "description": "The full earnings release has been made available on the Company’s Investor Relations website.\nThe post Nu Holdings Ltd. Reports Second Quarter 2022 Financial Results appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-holdings-ltd-reports-second-quarter-2022-financial-results/",
          "publishedOn": "2022-08-15T21:12:56.000Z",
          "wordCount": 4323,
          "title": "Nu Holdings Ltd. Reports Second Quarter 2022 Financial Results"
        },
        {
          "id": "https://building.nubank.com.br/?p=18735",
          "author": "Nubank Press",
          "description": "Our full earnings report can be found on the Investor Relations website. See some of the key numbers and understand what they mean.\nThe post Nu Holdings results for Q2 2022: on our way towards becoming the largest digital platform in Latin America appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-results-q2-2022/",
          "publishedOn": "2022-08-15T21:10:56.000Z",
          "wordCount": 3611,
          "title": "Nu Holdings results for Q2 2022: on our way towards becoming the largest digital platform in Latin America"
        },
        {
          "id": "https://building.nubank.com.br/?p=18719",
          "author": "Nubank Editorial",
          "description": "My goal with this blogpost is to share the factors that persuaded me to join Nubank and relocate to Berlin.\nThe post <strong>What made my eyes shine towards joining Nubank in Berlin</strong> appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/what-made-my-eyes-shine-towards-joining-nubank-in-berlin/",
          "publishedOn": "2022-08-13T20:50:12.000Z",
          "wordCount": 3633,
          "title": "What made my eyes shine towards joining Nubank in Berlin"
        },
        {
          "id": "https://building.nubank.com.br/?p=18592",
          "author": "Nubank Editorial",
          "description": "Anitta will contribute even more with her marketing experience and help us move towards a brand that goes beyond financial services.\nThe post Anitta is now Nubank’s Global Brand Ambassador appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/anitta-is-now-nubanks-global-brand-ambassador/",
          "publishedOn": "2022-08-09T21:35:43.000Z",
          "wordCount": 3140,
          "title": "Anitta is now Nubank’s Global Brand Ambassador"
        },
        {
          "id": "https://building.nubank.com.br/?p=18611",
          "author": "Nubank Editorial",
          "description": "The new solution for buying and selling cryptocurrencies was launched for all Nubank clients less than a month ago.\nThe post Nubank Cripto: 1 million clients have already bought cryptocurrencies appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-cripto-1-million-clients-cryptocurrencies/",
          "publishedOn": "2022-08-09T20:57:10.000Z",
          "wordCount": 2921,
          "title": "Nubank Cripto: 1 million clients have already bought cryptocurrencies"
        },
        {
          "id": "https://building.nubank.com.br/?p=18513",
          "author": "Nubank Editorial",
          "description": "The Nu Way of Working is our hybrid work model that was created so people could collaborate more in person and still keep the flexibility of remote work. Check out how it will work.\nThe post Nu Way of Working: Nubank’s new hybrid work model appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-way-of-working-nubanks-new-hybrid-work-model/",
          "publishedOn": "2022-08-05T01:00:07.000Z",
          "wordCount": 3666,
          "title": "Nu Way of Working: Nubank’s new hybrid work model"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-3-switching-scopes",
          "author": "jesse@hackerone.com",
          "description": "It is a new day with new challenges. Scope has shifted for the next part of our LHE. Today, you can feel the focus. These hackers have been heads do",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-3-switching-scopes",
          "publishedOn": "2022-08-06T04:00:01.000Z",
          "wordCount": 777,
          "title": "H1-702 Las Vegas Day 3: Switching Up Scopes"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-4-switching-scopes",
          "author": "jesse@hackerone.com",
          "description": "It is a new day with new challenges. Scope has shifted for the next part of our LHE. Today, you can feel the focus. These hackers have been heads do",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-4-switching-scopes",
          "publishedOn": "2022-08-06T04:00:01.000Z",
          "wordCount": 777,
          "title": "H1-702 Las Vegas Day 4: Switching Up Scopes"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-2-hacking-zoom",
          "author": "jesse@hackerone.com",
          "description": "Welcome back to our first day of in-person hacking! We had some lovely people greeting you today for your check-in. Again, we want all of our hacker",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-2-hacking-zoom",
          "publishedOn": "2022-08-05T04:37:17.000Z",
          "wordCount": 854,
          "title": "H1-702 Las Vegas Day 2: Hacking with Zoom"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-3-hacking-zoom",
          "author": "jesse@hackerone.com",
          "description": "Welcome back to our first day of in-person hacking! We had some lovely people greeting you today for your check-in. Again, we want all of our hacker",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-3-hacking-zoom",
          "publishedOn": "2022-08-05T04:37:17.000Z",
          "wordCount": 854,
          "title": "H1-702 Las Vegas Day 3: Hacking with Zoom"
        },
        {
          "id": "https://hackerone.com/live-hacking-events/h1-702-las-vegas-day-2-hacking-zoom",
          "author": "jesse@hackerone.com",
          "description": "Welcome back to our first day of in-person hacking! We had some lovely people greeting you today for your check-in. Again, we want all of our hacker",
          "link": "https://www.hackerone.com/live-hacking-events/h1-702-las-vegas-day-2-hacking-zoom",
          "publishedOn": "2022-08-05T04:37:17.000Z",
          "wordCount": 839,
          "title": "H1-702 Las Vegas Day 2: Hacking with Zoom!"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-1-hcktivitycon",
          "author": "jesse@hackerone.com",
          "description": "After a day of prep, we were ready to launch into our first day of H1-702! What makes today special is the return of H@cktivitycon, previously",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-1-hcktivitycon",
          "publishedOn": "2022-08-04T02:24:10.000Z",
          "wordCount": 946,
          "title": "H1-702 Las Vegas Day 1: H@cktivitycon"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-2-hcktivity-con",
          "author": "jesse@hackerone.com",
          "description": "After a day of rest, we were ready to launch into our first day of H1-702! What makes today special is the return of H@cktivity Con, previousl",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-2-hcktivity-con",
          "publishedOn": "2022-08-04T02:24:10.000Z",
          "wordCount": 950,
          "title": "H1-702 Las Vegas Day 2: H@cktivity Con"
        },
        {
          "id": "https://hackerone.com/community-blog/h1-702-las-vegas-day-two-hcktivity-con",
          "author": "jesse@hackerone.com",
          "description": "After a day of rest, we were ready to launch into our first day of H1-702! What makes today special is the return of H@cktivity Con, previousl",
          "link": "https://www.hackerone.com/community-blog/h1-702-las-vegas-day-two-hcktivity-con",
          "publishedOn": "2022-08-04T02:24:10.000Z",
          "wordCount": 943,
          "title": "H1-702 Las Vegas Day Two: H@cktivity Con!"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/6cbc5263a32a",
          "author": "Netflix Technology Blog",
          "description": "by Ehtsham Elahi\nwith James McInerney, Nathan Kallus, Dario Garcia Garcia and Justin Basilico",
          "link": "https://netflixtechblog.com/reinforcement-learning-for-budget-constrained-recommendations-6cbc5263a32a?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-24T17:57:33.000Z",
          "wordCount": 2743,
          "title": "Reinforcement Learning for Budget Constrained Recommendations"
        },
        {
          "id": "https://medium.com/p/aab780b2f8c8",
          "author": "Netflix Technology Blog",
          "description": "The use of virtual production and real time technologies in film & tv has accelerated in recent years. Game engines, such as Unreal Engine, have been a major part driving the democratization of advanced in-camera visual effects (ICVFX). But with infinite configuration and setting combinations, how can a production get it right?",
          "link": "https://netflixtechblog.com/virtual-production-a-validation-framework-for-unreal-engine-aab780b2f8c8?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-10T14:03:05.000Z",
          "wordCount": 1978,
          "title": "Virtual Production — A Validation Framework For Unreal Engine"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-7",
          "author": "Market Radar",
          "description": "A mix of charts on stocks, indices and crypto",
          "link": "https://marketradar.substack.com/p/charts-to-watch-7",
          "publishedOn": "2022-08-23T18:27:14.000Z",
          "wordCount": null,
          "title": "Charts to Watch #7",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0616b815-b9f0-471a-a06b-b9fac4f0b26a_1786x744.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": [
        {
          "id": "https://betterexplained.com/?p=12748",
          "author": "kalid",
          "description": "Quick confession? I never fully learned the trig derivatives. Sure, I memorized $\\sin' = \\cos$ and $\\cos' = -\\sin $ like everyone else, but the derivative of tangent? Cosecant? Forget it, magic spells. After years of searching, there's a middle ground between tedious derivation and rote memorization. Aha moment: all trig functions change using the […]",
          "link": "https://betterexplained.com/articles/trig-derivatives/",
          "publishedOn": "2022-08-03T20:18:29.000Z",
          "wordCount": 1440,
          "title": "How to Learn Trig Derivatives",
          "enclosure": {
            "url": "https://betterexplained.com/wp-content/uploads/trig/derivatives/TrigDerivativeTable.mp4",
            "length": "10296927",
            "type": "video/mp4"
          }
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}