{
  "sources": [
    {
      "href": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "Posted by Charlie Reis​ and Alex Moshchuk, Chrome Security Team\nChrome's Site Isolation is an essential security defense that makes it harder for malicious web sites to steal data from other web sites. On Windows, Mac, Linux, and Chrome OS, Site Isolation protects all web sites from each other, and also ensures they do not share processes with extensions, which are more highly privileged than web sites. As of Chrome 92, we will start extending this capability so that extensions can no longer share processes…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/CBZqJOPDFeY/protecting-more-with-site-isolation.html",
          "publishedOn": "2021-07-20T17:00:00.007Z",
          "wordCount": 1006,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Protecting more with Site Isolation"
        },
        {
          "description": "Posted by Sarah Morales, Community Outreach Manager, Security&nbsp;\nIt’s no secret that lack of diversity in corporate America is a well-documented problem and improvements have been slow. To help improve female representation in the cybersecurity industry, Google teamed up with Women in Cybersecurity (WiCyS) and SANS Institute a year ago to establish the Security Training Scholarship Program. \nThe multi-stage security training program set participants on a path to launch and advance their careers in cybers…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/9UA3XccGiOc/advancing-inclusive-diverse-security.html",
          "publishedOn": "2021-07-20T16:20:00.007Z",
          "wordCount": 1043,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Advancing an inclusive, diverse security industry"
        },
        {
          "description": "Posted by Ryan Hurst, Production Security Team\n\nThe way we design and build software is continually evolving. Just as we now think of security as something we build into software from the start, we are also increasingly looking for new ways to minimize trust in that software. One of the ways we can do that is by designing software so that you can get cryptographic certainty of what the software has done.\nIn this post, we'll introduce the concept of verifiable data structures that help us get this cryptograp…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/TDPwDnh8ayA/verifiable-design-in-modern-systems.html",
          "publishedOn": "2021-07-15T17:18:00.005Z",
          "wordCount": 1222,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Verifiable design in modern systems"
        },
        {
          "description": "Posted by Kim Lewandowski, Azeem Shaikh, Laurent Simon, Google Open Source Security Team\n\n\nContributors to the Scorecards project, an automated security tool that produces a “risk score” for open source projects, have accomplished a lot since our launch last fall. Today, in collaboration  with the Open Source Security Foundation community, we are announcing Scorecards v2. We have added new security checks, scaled up the number of projects being scored, and made this data easily accessible for analysis.\n\nWit…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/aIycN3fXCO4/measuring-security-risks-in-open-source.html",
          "publishedOn": "2021-07-01T13:00:00.001Z",
          "wordCount": 2028,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Measuring Security Risks in Open Source Software: Scorecards Launches V2"
        },
        {
          "description": "Posted by Oliver Chang, Google Open Source Security team and Russ Cox, Go team&nbsp;\nIn recent months, Google has launched several efforts to strengthen open-source security on multiple fronts. One important focus is improving how we identify and respond to known security vulnerabilities without doing extensive manual work. It is essential to have a precise common data format to triage and remediate security vulnerabilities, particularly when communicating about risks to affected dependencies—it enables eas…",
          "link": "http://feedproxy.google.com/~r/GoogleOnlineSecurityBlog/~3/s8eHYMtsmLg/announcing-unified-vulnerability-schema.html",
          "publishedOn": "2021-06-24T13:00:00.002Z",
          "wordCount": 5190,
          "sourceHref": "https://googleonlinesecurity.blogspot.com/atom.xml",
          "sourceTitle": "Google Online Security Blog",
          "title": "Announcing a unified vulnerability schema for open source"
        }
      ]
    },
    {
      "href": "http://googletesting.blogspot.com/atom.xml",
      "articles": []
    },
    {
      "href": "https://changelog.com/feed",
      "articles": [
        {
          "description": "This keeps getting better! We talked with @lawik about the same topic a few weeks back on Ship It! #7. We even did a follow-up YouTube stream. I intend to continue this conversation if Maik is up for it 🎙\nDiscuss on Changelog News",
          "link": "https://ably.com/blog/no-we-dont-use-kubernetes",
          "publishedOn": "2021-07-21T17:00:00.000Z",
          "wordCount": 4671,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "No, we don’t use Kubernetes"
        },
        {
          "description": "Too often, web tiers are full of boilerplate that does nothing except convert a result set into JSON. A middle tier could be as simple as a function call that returns JSON. All we need is an easy way to convert result sets into JSON in the database.\nPostgreSQL has built-in JSON generators that can be used to create structured JSON output right in the database, upping performance and radically simplifying web tiers. Fortunately, PostgreSQL has such functions, that run right next to the data, for better perfo…",
          "link": "https://blog.crunchydata.com/blog/generating-json-directly-from-postgres",
          "publishedOn": "2021-07-21T15:12:00.000Z",
          "wordCount": 1051,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Generating JSON directly from Postgres"
        },
        {
          "description": "On this special edition of The Changelog, we tell Vim’s story from the mouths of its users. Julia Evans, Drew Neil, Suz Hinton, and Gary Bernhardt join Jerod Santo for a deep and wide-ranging discussion about “the best text editor that anyone ever wrote.”\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourcegraph is universal code search for every developer and team. Easily search across all the code that matters to…",
          "link": "https://changelog.com/podcast/450",
          "publishedOn": "2021-07-21T14:15:00.000Z",
          "wordCount": 9353,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 450: Why we 💚 Vim"
        },
        {
          "description": "This expands on topics that we have discussed in Ship It! #11 and covers community findings on the practices that make the biggest difference for:\nHigher productivity\nImprovement in code quality\nEnd-user satisfaction\nSoftware developer retention\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=W3UU2lsQDoo",
          "publishedOn": "2021-07-20T17:34:00.000Z",
          "wordCount": 27,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Mature teams ship better code faster and you can too"
        },
        {
          "description": "In 1984 John Gage of Sun Microsystems was credited as saying “The Network is the computer.” Almost four decades ago, John had a vision of distributed systems working together to be greater than the sum of their parts.\nFor this article, I surveyed the land of hosted IDEs and it turns out that we’ve progressed beyond running VS Code on an iPad whilst sipping a cocktail.\nYou can still do that, but there’s way more to it today and I’ll take you through some of use-cases and add my own thoughts. There’s also a p…",
          "link": "https://blog.alexellis.io/the-internet-is-my-computer/",
          "publishedOn": "2021-07-20T16:43:00.000Z",
          "wordCount": 2495,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Internet is my computer"
        },
        {
          "description": "Angle-grinder allows you to parse, aggregate, sum, average, min/max, percentile, and sort your data. You can see it, live-updating, in your terminal. Angle grinder is designed for when, for whatever reason, you don’t have your data in graphite/honeycomb/kibana/sumologic/splunk/etc. but still want to be able to do sophisticated analytics.\nAngle grinder can process well above 1M rows per second (simple pipelines as high as 5M), so it’s usable for fairly meaty aggregation. The results will live update in your …",
          "link": "https://github.com/rcoh/angle-grinder",
          "publishedOn": "2021-07-20T15:55:00.000Z",
          "wordCount": 4074,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Slice and dice logs on the command line with Angle Grinder"
        },
        {
          "description": "9 out of 10 AI projects don’t end up creating value in production. Why? At least partly because these projects utilize unstable models and drifting data. In this episode, Roey from BeyondMinds gives us some insights on how to filter garbage input, detect risky output, and generally develop more robust AI systems.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nPSSC Labs – Solutions from PSSC Labs provide a cost effective, highly s…",
          "link": "https://changelog.com/practicalai/141",
          "publishedOn": "2021-07-20T15:00:00.000Z",
          "wordCount": 397,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 141: Towards stability and robustness"
        },
        {
          "description": "This week we’re talking to Rasmus Andersson about his journey as a software creator. We talk about the work he’s doing right now on Playbit, a computing environment which encourages playful learning, building, and sharing of software. We also talk about his work on the Inter typeface, as well as the reasons why this font family needed to be free and open source.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nSourcegraph – Sourceg…",
          "link": "https://changelog.com/podcast/449",
          "publishedOn": "2021-07-19T20:30:00.000Z",
          "wordCount": 493,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 449: The story behind Inter"
        },
        {
          "description": "k6 describes itself as “like unit testing, for performance.” It’s an open source tool that can be run locally or on their cloud. The company behind the tool was recently acquired by Grafana, so the project is now a Grafana Labs thing. You write your scripts in JavaScript and they run on a Go backend engine.\n\nDiscuss on Changelog News",
          "link": "https://k6.io/",
          "publishedOn": "2021-07-19T16:13:00.000Z",
          "wordCount": 1226,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A modern load testing tool, using Go and JavaScript"
        },
        {
          "description": "There are server colocation providers that allow hosting a 1U server for as low as $30/month, but there’s a catch: There are restrictions on power usage (1A @ 120v max, for example) because they’re expecting small and power-efficient network equipment like firewalls.\nThis repo is about designing a server that fits within the 1U space and 1A @ 120v power constraint while maximizing computing power, storage, and value.\n\nDiscuss on Changelog News",
          "link": "https://github.com/pawl/raspberry-pi-1u-server",
          "publishedOn": "2021-07-19T15:27:00.000Z",
          "wordCount": 3302,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A low power 1U Raspberry Pi cluster server"
        },
        {
          "description": "The panel discusses all the things that have to happen before you write a lick of code. Then, for Story of the Week: Dan Abramov thinks npm audit is broken by design. We also have thoughts. Lots of ’em.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nMicro – Micro is reimagining the cloud for the next generation of developers. It’s a developer friendly platform to explore, search, and use simpler APIs for everyday consumption all …",
          "link": "https://changelog.com/jsparty/184",
          "publishedOn": "2021-07-16T16:00:00.000Z",
          "wordCount": 405,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 184: Much ado before coding"
        },
        {
          "description": "I don’t think I’ve ever had more distrust and as a consequence distate for software than in recent years. I don’t think its just me as a tech-nerd with artisanal tech-carpentry aspirations. I want people to build well, treat their users right and generally exercise some actual restraint. I see it very clearly and I react more viscerally than anyone non-technical in my surroundings. However, I see the frustrations and the consequences everywhere…\nDiscuss on Changelog News",
          "link": "https://underjord.io/trust-in-software-an-all-time-low.html",
          "publishedOn": "2021-07-16T14:49:00.000Z",
          "wordCount": 2066,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "My trust in software, an all time low"
        },
        {
          "description": "Kishore Nallan:\nWhen I first started working on Typesense six years ago, I set myself a simple rule:\nI shall write some code everyday before or after work.\nThat’s it. No deadlines, no quarterly goals, no milestones.\nLooking back, I cannot believe how much I’ve been able to ship over the past 6 years by just following this one rule.\nThis rule has served me well in my career as well. Showing up consistently and putting in the work pays dividends over the long-term that you just can’t see over the short-term. …",
          "link": "https://typesense.org/blog/the-unreasonable-effectiveness-of-just-showing-up-everyday/",
          "publishedOn": "2021-07-16T14:02:00.000Z",
          "wordCount": 732,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The unreasonable effectiveness of just showing up everyday"
        },
        {
          "description": "Doing ops properly is hard. Most of us are failing &amp; learning every day. Some of us manage to have fun too.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=rK_7ozvm53o",
          "publishedOn": "2021-07-15T16:20:00.000Z",
          "wordCount": 18,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "That Sinking Feeling (The #HugOps Song)"
        },
        {
          "description": "Go modules brought about quite a few changes to the Go ecosystem. One of those changes is semantic import versioning (SIV), which has a fairly pronounced effect on how libraries are identified. In this episode we are joined by Tim Heckman and Peter Bourgon to discuss some of the downsides to these changes and how it has lead to what a subset of the Go community refers to as the “v2+ problem.”\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!…",
          "link": "https://changelog.com/gotime/188",
          "publishedOn": "2021-07-15T15:30:00.000Z",
          "wordCount": 474,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 188: SIV and the V2+ issue"
        },
        {
          "description": "This sounds too good to be true, because it kind of is. There is no escaping the cloud (because of email trust) or the requirement of sysadmin’ing this setup (sending/receiving email is critical). If you slack on the details or upkeep, it’s your email.\nI have been on an ongoing quest to free myself from cloud services for years now. During this time, I have hosted my personal email (@bloomqu.ist) on a Google Apps G Suite Google Workspace account, which, while convenient, also means that my personal emails a…",
          "link": "https://zach.bloomqu.ist/blog/2021/07/reliable-self-hosted-email.html",
          "publishedOn": "2021-07-15T15:12:06.000Z",
          "wordCount": 1471,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Reliable, deliverable, self-hosted email"
        },
        {
          "description": "This series of interactive lessons and exercises is a great place to start if you want to learn SQL. And trust me: if you don’t know SQL, you want to learn SQL. Of all the technologies and tools I’ve picked up over the course of my career, SQL has had one of the highest ROIs. It’s portable across languages/runtimes and has incredible staying power in terms of skill relevancy.\nDiscuss on Changelog News",
          "link": "https://sqlbolt.com/",
          "publishedOn": "2021-07-15T14:25:00.000Z",
          "wordCount": 672,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "SQLBolt – quickly learn SQL right in your browser"
        },
        {
          "description": "Kaizen means “change for the better”, continuous improvement in this context. Failure is essential to learning, but how do we learn as a team? The simplest thing is to regularly dedicate time for taking a step back, talking about what works &amp; what doesn’t, maybe writing some of it down, and eventually deciding what should improve next. I intend to make every 10th Ship It! episode a Kaizen one.\nThis is the first one when we talk with Adam and Jerod about the things that we want to improve in our setup ov…",
          "link": "https://changelog.com/shipit/10",
          "publishedOn": "2021-07-15T14:00:00.000Z",
          "wordCount": 587,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 10: Kaizen! The day half the internet went down"
        },
        {
          "description": "In any software project, over time new features and APIs are added and from time-to-time some of them also become deprecated and eventually get removed. Even huge project such as Kubernetes is no exception to this, yet core parts of its API don’t really come to mind when thinking about deprecating and eventual removal. So, the question is - could a core object or API in Kubernetes, such as Pod, Deployment or Service be removed and if so, how would that go?\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/53",
          "publishedOn": "2021-07-15T13:38:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Could Kubernetes pods ever become deprecated?"
        },
        {
          "description": "Ellen Spertus on Stack Overflow’s blog:\nWhile there are many resources to help programmers write better code—such as books and static analyzers—there are few for writing better comments. While it’s easy to measure the quantity of comments in a program, it’s hard to measure the quality, and the two are not necessarily correlated. A bad comment is worse than no comment at all. Here are some rules to help you achieve a happy medium.\nI like rule #6 (provide links to the original source of copied code) and rule …",
          "link": "https://stackoverflow.blog/2021/07/05/best-practices-for-writing-code-comments/",
          "publishedOn": "2021-07-14T20:17:00.000Z",
          "wordCount": 4490,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Best practices for writing code comments"
        },
        {
          "description": "HOW HAVE I NOT HEARD OF GIT WORK TREES??? WHAT THE EFF.  They are so incredible.  You have to check them out!!! In this video I go over them briefly, assuming you are smart enough to understand them, and also show you my workflow with vim!  Its fantastic!\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=2uEqYw-N8uE",
          "publishedOn": "2021-07-14T15:11:00.000Z",
          "wordCount": 18,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Git's best and most unknown feature"
        },
        {
          "description": "This is such a cool idea (inspired by Limelight), written in Lua, and using TreeSitter for better dimming. Will plugins like this start pulling normal Vim users over to Neovim?\n\nDiscuss on Changelog News",
          "link": "https://github.com/folke/twilight.nvim",
          "publishedOn": "2021-07-14T14:22:00.000Z",
          "wordCount": 806,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Twilight is a plugin for Neovim that dims inactive portions of code"
        },
        {
          "description": "This is my third eBook on Go, and it’s one of the ways I’m supporting my time to make open source contributions and lead the OpenFaaS community. The book covers samples, examples and techniques that I’ve learned over the past 5-6 years.\nThe point is not to be an 800-page tomb with tenuous links between content, but code from real open source applications that are run in production at scale.\nThere’s been over 300 copies sold already and I’m offering a money back guarantee if anyone should feel it didn’t meet…",
          "link": "https://blog.alexellis.io/i-wrote-a-book-about-golang/",
          "publishedOn": "2021-07-14T13:35:00.000Z",
          "wordCount": 1052,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "I wrote a book about Everyday Go"
        },
        {
          "description": "This is a follow-up blog post to Ship It! #6 Money flows rule everything\nTo achieve anything significant you need funding\nTo get funding you need to persuade the people with the money to part with it\nTo persuade the people with the money, you need to understand what they value\nTo understand what they value, you need to understand how their cash flows work\nTo understand how their cash flow works, you need to understand\n\nyour customers/clients and how and why they part with their money\nthe legal and regulator…",
          "link": "https://zwischenzugs.com/2021/07/12/if-you-want-to-transform-it-start-with-finance/",
          "publishedOn": "2021-07-13T18:51:00.000Z",
          "wordCount": 5245,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "If you want to transform IT, start with finance"
        },
        {
          "description": "How did we get from symbolic AI to deep learning models that help your write code (i.e., GitHub and OpenAI’s new Copilot)? That’s what Chris and Daniel discuss in this episode about the history and future of deep learning (with some help from an article recently published in ACM and written by the luminaries of deep learning).\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nPSSC Labs – Solutions from PSSC Labs provide a cost effec…",
          "link": "https://changelog.com/practicalai/140",
          "publishedOn": "2021-07-13T15:00:00.000Z",
          "wordCount": 387,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Practical AI 140: From symbols to AI pair programmers 💻"
        },
        {
          "description": "Texthero is a python package to work with text data efficiently. It empowers NLP developers with a tool to quickly understand any text-based dataset and it provides a solid pipeline to clean and represent text data, from zero to hero.\nDiscuss on Changelog News",
          "link": "https://texthero.org/",
          "publishedOn": "2021-07-13T14:53:00.000Z",
          "wordCount": 199,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Take your text pre-processing, representation, and visualization from zero to hero"
        },
        {
          "description": "Emma Catlin writing for Pinterest Engineering:\n… at some point in my first year, I realized something critical: I needed to help the entire team, not just myself, in order to grow to the next engineering level. To start, one of my teammates recommended I review code.\nThe advice was simple enough — use code reviews as a way to learn more about a piece of code and expand my knowledge of our overall system. It turned out code reviews were the perfect way for me to continue my learning journey.\nShe got better a…",
          "link": "https://medium.com/pinterest-engineering/how-to-review-code-as-a-junior-developer-10ffb7846958",
          "publishedOn": "2021-07-13T13:41:00.000Z",
          "wordCount": 1821,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How to review code as a junior developer"
        },
        {
          "description": "This week on Founders Talk, Adam is joined by Mitch Wainer, previously CMO at DigitalOcean and a member of the founding team. They talk about his journey as an entrepreneur and marketer, the early days at DigitalOcean, and everything that went into disrupting the cloud with blazing fast SSDs. Back in March (2021), DigitalOcean started trading on the New York Stock Exchange (NYSE) — this obviously earned Mitch and many others a very large payday. They also talk about the work Mitch is doing now with Welcome …",
          "link": "https://changelog.com/founderstalk/76",
          "publishedOn": "2021-07-12T20:30:00.000Z",
          "wordCount": 510,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Founders Talk 76: From disrupting the cloud to IPO"
        },
        {
          "description": "Monocle is my universal, personal search engine. It can query across tens of thousands of documents from my blog posts, journal entries, notes, Tweets, contacts, and more to act as my extended memory spanning my entire life. Monocle is designed with a focus on speed, privacy, and hackability. It’s built to be very specific to the particulars of my personal workflow around data, so probably won’t work for anyone else.\nI’m logging this for your inspiration, not because you should download it and give it a try…",
          "link": "https://monocle.surge.sh/",
          "publishedOn": "2021-07-12T14:25:00.000Z",
          "wordCount": 3,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Monocle is a universal, personal search engine"
        },
        {
          "description": "Earthly is language agnostic, “steals” good ideas from Makefiles and Dockerfiles and combines them into one spec, and makes your builds self-contained, repeatable, portable and parallel.\nHere’s a ~5 minute video demoing how to  buil a simple Go app with Earthly\nDiscuss on Changelog News",
          "link": "https://earthly.dev/",
          "publishedOn": "2021-07-12T13:20:00.000Z",
          "wordCount": 815,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Earthly is a build automation tool for the container era"
        },
        {
          "description": "This week we talk with Jean-Sébastien Pedron, RabbitMQ and FreeBSD contributor, about the importance of good release engineering for core infrastructure. Both Jean-Sébastien and I have been part of the Core RabbitMQ team for many years now. We have built some of the biggest CI/CD pipelines (check the show notes for one example), wrote and shipped some great code together, while breaking and fixing many things in the process.\nWe have been wrestling with today’s topic since 2016. Jean-Sébastien has some great…",
          "link": "https://changelog.com/shipit/9",
          "publishedOn": "2021-07-10T23:00:00.000Z",
          "wordCount": 548,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 9: What is good release engineering?"
        },
        {
          "description": "This week we’re sharing a recent episode from Founders Talk that we continuously hear about from listeners. Listen and subscribe to Founders Talk at founderstalk.fm and anywhere you listen to podcasts.\nOn Founders Talk #75 — Adam talks with Spencer Kimball, CEO and Co-founder of Cockroach Labs — makers of CockroachDB an open source cloud-native distributed SQL database. Cockroach Labs recently raised $160 million dollars on a $2 billion dollar valuation. In this episode, Spencer shares his journey in open s…",
          "link": "https://changelog.com/podcast/448",
          "publishedOn": "2021-07-09T19:00:00.000Z",
          "wordCount": 533,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 448: Massive scale and ultra-resilience"
        },
        {
          "description": "KBall and Nick Nisi sit down with Nick Fitzgerald to learn about running JavaScript on WebAssembly. They talk about almost instantaneous startup, running interpreted languages at the edge, and take a deep dive into the weeds of how Wasm based modules will change the future of application development.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platform built specifically for developers that makes …",
          "link": "https://changelog.com/jsparty/183",
          "publishedOn": "2021-07-09T15:30:00.000Z",
          "wordCount": 420,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 183: JS on Wasm"
        },
        {
          "description": "Difftastic is an experimental structured diff tool that compares files based on their syntax. It is very much unfinished. It works reasonably on very parenthesised data (lisps, JSON), it works sometimes on other languages with sufficient parentheses (Rust, JS), and falls back to a line-oriented diff otherwise.\n\nDiscuss on Changelog News",
          "link": "https://github.com/Wilfred/difftastic",
          "publishedOn": "2021-07-09T15:01:00.000Z",
          "wordCount": 835,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A syntax-aware diffing tool"
        },
        {
          "description": "This post does a great job of laying out all of the cumbersome/verbose ways you can solve a problem with regular expressions and then showing the tricky way of doing the same thing without all the hassle. With this trick up your sleeve, you’ll be able to answer all of these questions:\nHow do I match a word unless it’s surrounded by quotes?\nHow do I match xyz except in contexts a, b or c?\nHow do I match every word except those on a blacklist (or other contexts)?\nHow do I ignore all content that is bolded (… …",
          "link": "http://rexegg.com/regex-best-trick.html",
          "publishedOn": "2021-07-09T14:12:00.000Z",
          "wordCount": 10433,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The best regex trick"
        },
        {
          "description": "Fuzzing is coming to the standard library. We speak to Katie Hockman and Jay Conrod who were part of the team responsible for designing and implementing it. We dig into the details, hear some best practices, where fuzzing can help your code, and learn more about how it works.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database…",
          "link": "https://changelog.com/gotime/187",
          "publishedOn": "2021-07-08T16:15:00.000Z",
          "wordCount": 461,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 187: Fuzzing in the standard library"
        },
        {
          "description": "Dan Abramov cuts right to the chase:\nHave you heard the story about the boy who cried wolf? Spoiler alert: the wolf eats the sheep. If we don’t want our sheep to be eaten, we need better tools.\nAs of today, npm audit is a stain on the entire npm ecosystem. The best time to fix it was before rolling it out as a default. The next best time to fix it is now.\nHe goes on to lay out how it works, why it’s broken, and what changes he’s hoping to see.\nDiscuss on Changelog News",
          "link": "https://overreacted.io/npm-audit-broken-by-design/",
          "publishedOn": "2021-07-08T16:09:00.000Z",
          "wordCount": 2813,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "npm audit: broken by design"
        },
        {
          "description": "Tenacity is an easy-to-use, cross-platform multi-track audio editor/recorder for Windows, MacOS, GNU/Linux and other operating systems and is developed by a group of volunteers as open source software.\nSound familiar? Maybe because it’s a fork of the historically awesome Audacity project that promises:\nno telemetry, crash reports and other shenanigans like that!\nNot ringing any bells? Check out Audacity’s privacy policy changes, new CLA, and data collection attempts.\nDiscuss on Changelog News",
          "link": "https://tenacityaudio.org",
          "publishedOn": "2021-07-08T15:02:00.000Z",
          "wordCount": 246,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Tenacity – a FLOSS fork of Audacity"
        },
        {
          "description": "Austin Gil explains some of the benefits of using SVG for your site’s favicon:\nCrisp image quality with a single file\nSupport for emojis\nInline icon (no need for a linked resource)\nDark mode detection (sweet!)\nDisclaimer: browser support is not amazing.\nDiscuss on Changelog News",
          "link": "https://austingil.com/svg-favicons/",
          "publishedOn": "2021-07-07T16:13:00.000Z",
          "wordCount": 1328,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "SVG favicons have some cool benefits"
        },
        {
          "description": "In this post, I explain what typeclasses are (an alternative to subtyping polymorphism) and how to use them. I give examples in 4 very different languages to show that this concept is universal. I also show that this idea is very pythonic by comparing our classes implementation with functools.singledispatch.\nCheck how easy it is to define a typeclass with classes:\nfrom classes import AssociatedType, Supports, typeclass\n\nclass Greet(AssociatedType):\n    &quot;&quot;&quot;Special type to represent that some i…",
          "link": "https://sobolevn.me/2021/06/typeclasses-in-python",
          "publishedOn": "2021-07-07T15:22:00.000Z",
          "wordCount": 2869,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Typeclasses in Python"
        },
        {
          "description": "One of our awesome Changelog++ members scratched their own itch:\nWhen you upgrade to Changelog++ you’re given access to ad-free versions of episodes however they’re only available in one giant bucket feed instead of through individual show feeds. Though only around 5 new podcast episodes are published weekly, if you’re coming in as a new listener you’ll have a long backlog list with over one thousand shows. It’s easier to sift through older episodes when they’re organized by show, so that’s what this projec…",
          "link": "https://github.com/plus-or-minus/changelog-plus-plus-feed-sifter",
          "publishedOn": "2021-07-07T14:26:00.000Z",
          "wordCount": 844,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A GitHub Action to create single-show feeds from your Changelog++ feed"
        },
        {
          "description": "Jacob Kaplan-Moss begins where I often do when discussing estimation:\nOne study by HBR found that one in six IT projects had cost overruns of over 200% and were late by almost 70%. Another study by McKinsey found that IT projects are on average 45% over budget and 7% over schedule. They found large software projects were particularly bad: software projects with budgets over $15M went over budget by an overage of 66% and had schedule overruns averaging 33%.\nNonetheless, there are good reasons to estimate any…",
          "link": "https://jacobian.org/2021/may/20/estimation/",
          "publishedOn": "2021-07-06T19:52:00.000Z",
          "wordCount": 768,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Software estimation is hard. Do it anyway."
        },
        {
          "description": "Devon Zuegel on startup cities:\nWhile the startup cities industry is still small, it is already quite heterogeneous. Each project has its own distinct set of goals, motivations, and scope. However, this diversity isn’t fully captured by the vocabulary we use right now.\nTo help myself create a mental map of the industry, I’ve grouped these motivations into 5 categories. I’ve also included examples of places that personify each motivation.\nShe goes on to discuss each of the 5 categories: economic opportunity,…",
          "link": "https://devonzuegel.com/post/what-are-startup-cities-for",
          "publishedOn": "2021-07-06T18:50:00.000Z",
          "wordCount": 1182,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What are startup cities for?"
        },
        {
          "description": "This project is a formalized list of checks that can be run against an open source codebase and a Go-based tool to run those checks and provide a report on the project’s health. Here are a few of the checks it runs, to get an idea of what it’s all about:\nDoes the project use fuzzing tools, e.g. OSS-Fuzz?\nDoes the project cryptographically sign releases?\nDoes the project contain a security policy?\nDiscuss on Changelog News",
          "link": "https://github.com/ossf/scorecard",
          "publishedOn": "2021-07-06T13:58:00.000Z",
          "wordCount": 2211,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Security health metrics for open source projects"
        },
        {
          "description": "Commit groups sounds interesting to me. Anyone reading this familiar with Git innards? Is this doable?\nYou know the “group” facility of vector graphics programs? You draw a couple of shapes, you group them together, and then you can apply transformations to the entire group at once, operating on it as if it were an atomic thing. But when need arises, you can “ungroup” it and look deeper.\nI’d love to see that same idea applied to Git commits. In Git, a commit group might just be a named and annotated range o…",
          "link": "http://blog.danieljanus.pl/2021/07/01/commit-groups/",
          "publishedOn": "2021-07-05T20:14:34.000Z",
          "wordCount": 1900,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Things I wish Git had: Commit groups"
        },
        {
          "description": "This week we’re sharing one of the most popular episodes from our new podcast Ship It. Ship It launched in May and now has 8 episodes in the feed to enjoy…it’s hosted by Gerhard Lazu, our SRE here at Changelog.\nIn this episode Gerhard talks with Dave Farley, co-author of Continuous Delivery and the inventor of the Deployment Pipeline. Today, most of us ship code the way we do because 25 years ago, Dave cared enough to drive the change that we now call CI/CD. He is one of the great software engineers: opinio…",
          "link": "https://changelog.com/podcast/447",
          "publishedOn": "2021-07-02T23:00:00.000Z",
          "wordCount": 558,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Changelog 447: The foundations of Continuous Delivery"
        },
        {
          "description": "Cakebrew is a Mac App (GUI) that lets you do most of the useful tasks you need in Homebrew. Including updating and finding problems with brew doctor!\nInstalls via Homebrew too - brew install --cask cakebrew\n\nDiscuss on Changelog News",
          "link": "https://www.cakebrew.com/",
          "publishedOn": "2021-07-02T16:18:52.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Cakebrew - macOS app for Homebrew"
        },
        {
          "description": "Nick Reese joins the party to tell us all about Elder.js, his opinionated static site generator and web framework built with SEO in mind. Elder.js was purpose-built with large, content-heavy websites in mind and already serves in many production capacities. We discuss imposter syndrome, the startup/product mindset, Svelte’s virtues, and much more.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRetool – Retool is a low-code platfo…",
          "link": "https://changelog.com/jsparty/182",
          "publishedOn": "2021-07-02T16:00:00.000Z",
          "wordCount": 426,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 182: The Elder.js Guide to the Galaxy"
        },
        {
          "description": "Every line of code written comes at a price: maintenance. To avoid paying for a lot of code, we build reusable software. The problem with code re-use is that it gets in the way of changing your mind later on.\nDeleting code is fun! Let’s all write code that’s easy to delete. But how?\nTo write code that’s easy to delete: repeat yourself to avoid creating dependencies, but don’t repeat yourself to manage them. Layer your code too: build simple-to-use APIs out of simpler-to-implement but clumsy-to-use parts. Sp…",
          "link": "https://programmingisterrible.com/post/139222674273/how-to-write-disposable-code-in-large-systems",
          "publishedOn": "2021-07-02T14:34:00.000Z",
          "wordCount": 3537,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Write code that is easy to delete, not easy to extend"
        },
        {
          "description": "Solid… does not use a Virtual DOM. Instead it opts to compile its templates down to real DOM nodes and wrap updates in fine grained reactions. This way when your state updates only the code that depends on it runs.\nSolid takes a lot of cues from React, but sets itself apart in that it doesn’t use a Virtual DOM. Here’s what Michel Weststrate had to say about it on Twitter:\nNot a revolution, but really solid (pun) evolution; clean component model, really efficient run-time model, deeply embedded reactivity. D…",
          "link": "https://github.com/solidjs/solid",
          "publishedOn": "2021-07-02T13:46:00.000Z",
          "wordCount": 1310,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Solid – a declarative JavaScript library for creating user interfaces"
        },
        {
          "description": "This repository is a collection of various materials and tools that I use every day in my work. It contains a lot of useful information gathered in one piece. It is an invaluable source of knowledge for me that I often look back on.\nThis repo is meant to only contain the good stuff, but holy cow there’s a LOT of stuff in here.\nDiscuss on Changelog News",
          "link": "https://github.com/trimstray/the-book-of-secret-knowledge",
          "publishedOn": "2021-07-01T18:04:00.000Z",
          "wordCount": 22115,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The Book of Secret Knowledge 📘"
        },
        {
          "description": "Learning Go with code pop quizzes is a fun way to zoom in on different language features. People are looking forward to pop quizzes on Twitter and in conferences, and they also learn from that. Let’s chat about pop quizzes!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database on the planet. Build and scale fast with CockroachCl…",
          "link": "https://changelog.com/gotime/186",
          "publishedOn": "2021-07-01T16:10:00.000Z",
          "wordCount": 448,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 186: Pop quiz time! 😱"
        },
        {
          "description": "Responsive design is evolving. Una Kravets:\nToday, when using the term: “responsive design”, you are most likely thinking about using media queries to change layout when resizing a design from mobile size, to tablet size, through to desktop size.\nBut soon, this perception of responsive design may be considered as outdated as using tables for page layout.\n“Responsive” used to mean a web design would respond based on the size of the device accessing it. In the not-so-distant future, it will mean a web design …",
          "link": "https://web.dev/new-responsive/",
          "publishedOn": "2021-07-01T14:57:00.000Z",
          "wordCount": 2304,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Web design in a component-driven world"
        },
        {
          "description": "Take a tour of Python’s functools module and learn how to use its higher-order functions to implement caching, overloading, creating decorators and in general how to make your code a bit more functional.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/52",
          "publishedOn": "2021-07-01T14:09:00.000Z",
          "wordCount": 17,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "The power of higher-order functions in Python"
        },
        {
          "description": "Why Cloud Native? What are the guiding principles that you should keep in mind as you are choosing a project from the Cloud Native Landscape? How do you build &amp; ship an app in a Cloud Native way? Katie Gamanji, Ecosystem Advocate @ CNCF and former cloud engineer for American Express, Condé Nast and Microsoft, joins Gerhard to cover these topics in the context of the Cloud Native Fundamentals course that she developed. 15,000 students have already enrolled, and the initial feedback has been great. Tune i…",
          "link": "https://changelog.com/shipit/8",
          "publishedOn": "2021-07-01T11:00:00.000Z",
          "wordCount": 516,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 8: Cloud Native fundamentals"
        },
        {
          "description": "Erik Kennedy with a checklist of his most important UX tips for creating usable signup and login forms. He covers everything from field autofocus to letting people optionally see the password they’re typing. ✅\nDiscuss on Changelog News",
          "link": "https://learnui.design/blog/tips-signup-login-ux.html",
          "publishedOn": "2021-06-30T15:04:00.000Z",
          "wordCount": 1571,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Tips for better UX on your signup/login forms"
        },
        {
          "description": "A while ago I did a blog post about using fzf in Vim, so this is a nice complementary post on how to use fzf in the terminal. It should be super useful to folks who dwell inside the command-line on a day-to-day basis.\nDiscuss on Changelog News",
          "link": "https://pragmaticpineapple.com/four-useful-fzf-tricks-for-your-terminal/",
          "publishedOn": "2021-06-30T14:15:00.000Z",
          "wordCount": 1258,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Useful fzf tricks for your terminal"
        },
        {
          "description": "GAN Theft Auto is a Generative Adversarial Network that recreates the Grand Theft Auto 5 environment. It is created using a GameGAN fork based on NVIDIA’s GameGAN research.\nSource code here.\n\nDiscuss on Changelog News",
          "link": "https://www.youtube.com/watch?v=udPY5rQVoW0",
          "publishedOn": "2021-06-29T14:11:00.000Z",
          "wordCount": 23,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Playing a neural network's version of GTA V"
        },
        {
          "description": "Sad but true: Git is simply too hard. One thing driving said truth is that undoing things often requires jumping through obscure hoops. Here’s what Waleed Khan has to say on the matter:\nWell, it’s not that it’s too easy to lose your data — but rather, that it’s too difficult to recover it. For each operation you want to recover from, there’s a different “magic” incantation to undo it. All the data is still there in principle, but it’s not accessible to many in practice.\nHere’s my theory: novice and intermed…",
          "link": "https://blog.waleedkhan.name/git-undo/",
          "publishedOn": "2021-06-29T13:24:00.000Z",
          "wordCount": 487,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Git undo: we can do better"
        },
        {
          "description": "Dr. Axel Rauschmayer gives us a feel for one of the most exciting new APIs in JavaScript-land.\nThe Temporal date time API is accessible via the global variable Temporal. It is a pleasure to use:\nAll objects are immutable. Changing them produces new values, similarly to how strings work in JS.\nThere is support for time zones and non-Gregorian calendars.\nThere are several specialized classes for Temporal values (date time values with time zones, date time values without time zones, date values without time zo…",
          "link": "https://2ality.com/2021/06/temporal-api.html",
          "publishedOn": "2021-06-28T19:05:00.000Z",
          "wordCount": 3474,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Temporal: getting started with JavaScript’s new date time API"
        },
        {
          "description": "A perspective on incidents that makes a lot of sense actually, and captures the “Why?” perfectly. My highlights: Incidents involve more people than we think. Tooling just makes it really hard for them to help. We have more incidents than we realise. We just don’t hear about them. Your whole team, on the same team. Practice makes perfect.\nDiscuss on Changelog News",
          "link": "https://incident.io/blog/incidents-are-for-everyone",
          "publishedOn": "2021-06-28T17:08:00.000Z",
          "wordCount": 1530,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Incidents are for everyone"
        },
        {
          "description": "Brave Search has some similarities to DDG (which has been my default for a couple years now), but it’s different in that it builds its own index vs relying on Bing and Yandex. Brave’s principles:\nPrivacy: no tracking or profiling of users.\nUser-first: the user comes first, not the advertising and data industries.\nIndependence: Brave has its own search index for answering common queries privately without reliance on other providers.\nChoice: soon, options for ad-free paid search and ad-supported search.\nTrans…",
          "link": "https://brave.com/brave-search-beta/",
          "publishedOn": "2021-06-28T16:18:00.000Z",
          "wordCount": 1462,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Brave adds a privacy-focused search engine (beta)"
        },
        {
          "description": "Contributing to open-source projects can be intimidating – and PostgreSQL is no exception. As a long-time PostgreSQL contributor, Aleks shares his hard-earned tips to help you make your first contribution, or start contributing more.\nDiscuss on Changelog News",
          "link": "https://blog.timescale.com/blog/how-and-why-to-become-a-postgresql-contributor/",
          "publishedOn": "2021-06-28T15:24:00.000Z",
          "wordCount": 3238,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "How (and why) to become a PostgreSQL contributor"
        },
        {
          "description": "This week we chat with Angie Jones about all things testing. We’ll cover unit testing, visual testing, end-to-end testing, and more!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nRaygun – With Raygun Error and Performance Monitoring you have all the information you need at your fingertips to quickly find and fix errors and performance issues across your tech stack down to the line of code. Get started with a free 14-day trial, h…",
          "link": "https://changelog.com/jsparty/181",
          "publishedOn": "2021-06-25T15:45:00.000Z",
          "wordCount": 435,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "JS Party 181: Testing testing 1 2 3"
        },
        {
          "description": "Sometimes you start a thing and lose interest. Or maybe it brings in some cash, but not what you’d hoped. Rather than let it languish and eventually die, sell your thing on Tiny Acquisitions.\nSometimes you want to start a thing, but don’t have a good idea. Or maybe you’ve tried a few times, but nothing that generated income. Rather than start from scratch with an unproven idea, buy a thing on Tiny Acquisitions.\nDiscuss on Changelog News",
          "link": "https://tinyacquisitions.com/home",
          "publishedOn": "2021-06-25T15:12:00.000Z",
          "wordCount": 6,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A place to buy and sell tiny projects worth less than $5k"
        },
        {
          "description": "Andrej Karpathy, Sr. Director of AI at Tesla:\nWe are going to create, digitally sign, and broadcast a Bitcoin transaction in pure Python, from scratch, and with zero dependencies. In the process we’re going to learn quite a bit about how Bitcoin represents value. Let’s get it.\nThis post is a technical deep-dive. At the end he posted a reader exercise which was to steal some bitcoins his wallet. The challenge, of course, was completed within 45 minutes of publishing. 😁\nDiscuss on Changelog News",
          "link": "https://karpathy.github.io/2021/06/21/blockchain/",
          "publishedOn": "2021-06-25T14:23:00.000Z",
          "wordCount": 12598,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A from-scratch tour of bitcoin in Python"
        },
        {
          "description": "Kathy Korevec has been putting a lot of thought into documentation as part of her work at GitHub:\nWouldn’t it be great if the docs knew that you were writing a Python app on a Windows machine and that you preferred watching videos instead of reading through text? I want you to find the answer to your questions in the docs, easily and efficiently. When you’re stuck on a problem and you turn to the docs, there’s a moment of magic as you find the solution, try it out and it works. In that moment you become unb…",
          "link": "https://kathykorevec.medium.com/building-a-better-place-for-docs-197f92765409",
          "publishedOn": "2021-06-25T13:36:00.000Z",
          "wordCount": 2714,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Maybe it’s time we re-think docs"
        },
        {
          "description": "We discuss how Test Driven Development (TDD) can help you write better code, and build better software. Packed with tips and tricks, gotchas and best practices, the panel explore the subject and share their real-world experiences.\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to the metal, and make the ads disappear!\nSponsors\nCockroach Labs – Scale fast, survive anything, thrive everywhere! CockroachDB is most highly evolved database on the planet. Build and scale fast with Cock…",
          "link": "https://changelog.com/gotime/185",
          "publishedOn": "2021-06-24T16:15:00.000Z",
          "wordCount": 400,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Go Time 185: Giving TDD a Go"
        },
        {
          "description": "Karsten Silz for InfoQ:\nEight years in the making with 28,000 commits, 7400 pull requests, and 4100 closed issues, Scala 3.0 has been released, delivering a “complete overhaul of the Scala language” with new features, updates to the syntax and type systems, and new tools for meta-programming.\nHoly wow that must’ve been quite the undertaking. Our Scala coverage is embarrassingly scant. Maybe it’s time for an episode of The Changelog on the subject? Who would be the ideal guest(s) for such a conversation?\nDis…",
          "link": "https://www.infoq.com/news/2021/06/scala-3-overhaul/",
          "publishedOn": "2021-06-24T14:56:00.000Z",
          "wordCount": 3586,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Scala 3 overhauls language for better developer experience"
        },
        {
          "description": "Chip Huyen has been on both sides of  ML-related interviews and has a lot of expertise on the process:\nIf you’ve picked up this book because you’re interested in working with one of the key emerging technologies of the 2020s but not sure where to start, you’re in the right place. Whether you want to become an ML engineer, a platform engineer, a research scientist, or you want to do ML but don’t yet know the differences among those titles, I hope that this book will give you some useful pointers.\nDiscuss on …",
          "link": "https://huyenchip.com/ml-interviews-book/",
          "publishedOn": "2021-06-24T13:54:00.000Z",
          "wordCount": 1065,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "A free book on how to survive the machine learning interview process"
        },
        {
          "description": "The New Stack has a solid summary of what’s new in Grafana 8. Shiny! ✨\n\nDiscuss on Changelog News",
          "link": "https://thenewstack.io/grafana-8-0-rethinks-alerts-and-visualizations/",
          "publishedOn": "2021-06-23T18:39:00.000Z",
          "wordCount": 1433,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Grafana 8.0 rethinks alerts and visualizations"
        },
        {
          "description": "This week on Ship It! Gerhard talks with Lars Wikman (independent Elixir/BEAM software consultant) why sometimes a monolith running on a single host with continuous backups and a built-in self-restore capability is everything that a small team of developers needs. That’s right, no Kubernetes or microservices. After 2 years of running changelog.com, a Phoenix monolith, on Kubernetes, what do I think? Join our discuss and find out!\nDiscuss on Changelog News\nJoin Changelog++ to support our work, get closer to …",
          "link": "https://changelog.com/shipit/7",
          "publishedOn": "2021-06-23T16:00:00.000Z",
          "wordCount": 465,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Ship It! 7: Why Kubernetes?"
        },
        {
          "description": "Benny Powers is NOT pleased with what he believes is missing from the latest React release:\nFor five years now, there’s been a concerted, multilateral push to bring React into line with every other major framework on custom elements, enshrined in the HTML and DOM specs for years now. Much effort was spent both in public and behind the scenes to encourage the React core team to implement real support for the standards.\nBut then the PRs were closed, or ignored without public comment. And the issues languished…",
          "link": "https://dev.to/bennypowers/what-s-not-new-in-react-18-45c7",
          "publishedOn": "2021-06-23T15:10:00.000Z",
          "wordCount": 2571,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "What's NOT new in React 18"
        },
        {
          "description": "In this article, I’d like to explore a couple of implementations of sorting algorithms. However, I’d like to do so driven by unit tests. The examples are written in Go, but don’t worry if you never worked with Go before. The emphasis here is on the journey and the joy of building solutions guided by tests!\nDiscuss on Changelog News",
          "link": "https://alabeduarte.com/test-driven-algorithms/sorting/",
          "publishedOn": "2021-06-23T14:24:00.000Z",
          "wordCount": 3167,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Let's test-drive some sorting algorithms"
        },
        {
          "description": "A deep-dive on what conditional HTTP requests are, reviewing the main pieces of the RFC, explaining the semantics of validators and preconditions, then showing examples how you can implement conditional HTTP GETs in your web app.\nDiscuss on Changelog News",
          "link": "https://ieftimov.com/post/conditional-http-get-fastest-requests-need-no-response-body/",
          "publishedOn": "2021-06-23T13:38:00.000Z",
          "wordCount": 3789,
          "sourceHref": "https://changelog.com/feed",
          "sourceTitle": "Changelog",
          "title": "Conditional HTTP GET: The fastest requests need no response body"
        }
      ]
    },
    {
      "href": "https://blog.comma.ai/feed.xml",
      "articles": []
    },
    {
      "href": "https://blog.google/technology/ai/rss",
      "articles": [
        {
          "description": "As people searched for the latest information on COVID-19 last year, including school reopenings and travel restrictions, the BBC recognized they needed to find new ways of bringing their journalism to their audiences. They released a new online tool, the BBC Corona Bot, which uses artificial intelligence to draw on BBC News’ explanatory journalism. It responds with an answer to a reader’s specific question where possible, or points to health authorities’ websites when appropriate. AI technology allowed BBC…",
          "link": "https://blog.google/outreach-initiatives/google-news-initiative/launching-ai-academy-small-newsrooms/",
          "publishedOn": "2021-07-08T08:00:00.000Z",
          "wordCount": 1256,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Launching the AI Academy for small newsrooms"
        },
        {
          "description": "When I was growing up in Brisbane, Aussie Rules football wasn’t offered as a school sport – and there weren’t any professional female role models to look up to and learn from. Despite these limitations, we got resourceful. We organized football games in our lunch breaks with friends, using soccer or rugby goal posts and adding sticks or cones to serve as point posts. We practised accuracy using rubbish bins as targets.\nA decade later, women have truly made their mark in the AFL. There are, however,  many ba…",
          "link": "https://blog.google/around-the-globe/google-asia/australia/footy-skills-lab/",
          "publishedOn": "2021-07-08T06:00:00.000Z",
          "wordCount": 1095,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Kick like a pro with Footy Skills Lab"
        },
        {
          "description": "Back in the day, there was a surefire way to tell humans and computers apart: You’d present a picture of a four-legged friend and ask if it was a cat or dog. A computer couldn’t identify felines from canines, but we humans could answer with doggone confidence. \nThat all changed about a decade ago thanks to leaps in computer vision and machine learning – specifically,  major advancements in neural networks, which can train computers to learn in a way similar to humans. Today, if you give a computer enough im…",
          "link": "https://blog.google/technology/ai/ask-a-techspert-whats-a-neural-network/",
          "publishedOn": "2021-07-07T16:00:00.000Z",
          "wordCount": 1527,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Ask a Techspert: What’s a neural network?"
        },
        {
          "description": "Over the past year, responsibly developed AI has transformed health screenings, supportedfact-checking to battle misinformation and save lives, predicted Covid-19 cases to support public health, and protected wildlife after bushfires. Developing AI in a way that gets it right for everyone requires openness, transparency, and a clear focus on understanding the societal implications. That is why we were among the first companies to develop and publish AI Principles and why, each year, we share updates on our …",
          "link": "https://blog.google/technology/ai/update-our-progress-responsible-ai-innovation/",
          "publishedOn": "2021-06-30T17:00:00.000Z",
          "wordCount": 2323,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "An update on our progress in responsible AI innovation"
        },
        {
          "description": "Have you ever noticed that the word art is embedded in the phrase artificial intelligence? Neither did we, but when the opportunity presented itself to explore how artificial intelligence (AI) inspires artistic expression — with the help of internationally renowned Canadian artist Douglas Coupland — the Google Research team jumped on it. This collaboration, with the support of Google Arts &amp; Culture, culminated in a project called Slogans for the Class of 2030, which spotlights the experiences of the fir…",
          "link": "https://blog.google/outreach-initiatives/arts-culture/douglas-coupland-slogans-class-2030/",
          "publishedOn": "2021-06-29T10:00:00.000Z",
          "wordCount": 1308,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "Douglas Coupland fuses AI and art to inspire students"
        },
        {
          "description": "Over recent years, we have seen remarkable progress in AI’s ability to confront new problems and help solve old ones. Advancing these efforts was one reason we set up the Google Research India lab in 2019, with a particular emphasis on AI research that could make a positive social impact. It’s also why we've supported nonprofit organizations through the Google AI Impact Challenge.\n\nWorking in partnership with Google.org and Google’s University Relations program, our goal is to help academics and nonprofits …",
          "link": "https://blog.google/technology/ai/30-new-ai-for-social-good-projects/",
          "publishedOn": "2021-06-29T03:00:00.000Z",
          "wordCount": 1241,
          "sourceHref": "https://blog.google/technology/ai/rss",
          "sourceTitle": "AI",
          "title": "How we’re supporting 30 new AI for Social Good projects"
        }
      ]
    },
    {
      "href": "https://daniel.haxx.se/blog/feed/",
      "articles": [
        {
          "description": "Welcome to another release! We did more bug-fixes than in any previous release (176). We paid more in bug-bounties than during any previous release cycle (4,200 USD) and we thank more contributors in the RELEASE-NOTES than ever before (83). Release presentation Numbers the 201st release6 changes56 days (total: 8,524)176 bug-fixes (total: 7,142)263 commits (total: 27,465)0 &#8230; Continue reading curl 7.78.0 five in one &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/21/curl-7-78-0-five-in-one/",
          "publishedOn": "2021-07-21T07:32:03.000Z",
          "wordCount": 1364,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl 7.78.0 five in one"
        },
        {
          "description": "I&#8217;m proud and happy to mention that curl just passed the magic limit of 100,000 USD in raised sponsorship money. Or call it donations if you want. Since April 2018. That&#8217;s about 40 months. Donate? Do it here! Donations over time A grand total of 440 awesome organizations and individuals have donated money to the &#8230; Continue reading curl reaches 100K raised &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/06/curl-reaches-100k-raised/",
          "publishedOn": "2021-07-06T06:52:19.000Z",
          "wordCount": 989,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl reaches 100K raised"
        },
        {
          "description": "It is time to once again tell you that people responded very similarly to how they did last year&#8230; curl user survey 2021 analysys Not a lot changed this year compared to last year. Perhaps the biggest three changes this year were that 1. HTTP/3, Unix domain sockets and DNS-over-HTTPS increased significantly among &#8220;used features&#8221; &#8230; Continue reading curl user survey 2021 &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/07/05/curl-user-survey-2021/",
          "publishedOn": "2021-07-05T08:40:21.000Z",
          "wordCount": 747,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "curl user survey 2021"
        },
        {
          "description": "This part 2. See Giving a away an insane amount of curl stickers for part 1. As suspected already from the start, I ran out of stickers really fast. I ordered more from my trusted sticker guy on the corner, and he could even deliver stickers put into pre-printed envelopes. Envelopes that even got a &#8230; Continue reading Sending those stickers &#8594;",
          "link": "https://daniel.haxx.se/blog/2021/06/24/sending-those-stickers/",
          "publishedOn": "2021-06-24T12:04:01.000Z",
          "wordCount": 1065,
          "sourceHref": "https://daniel.haxx.se/blog/feed/",
          "sourceTitle": "daniel.haxx.se",
          "title": "Sending those stickers"
        }
      ]
    },
    {
      "href": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "articles": [
        {
          "description": "Learn how Shardlib, a new sharding library at Twitter simplifies the management of sharded ads services and enables dynamic resharding of these services without redeploying their clients.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/sharding-simplification-and-twitters-ads-serving-platform",
          "publishedOn": "2021-07-13T12:19:17.711Z",
          "wordCount": 4874,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharding, simplification, and Twitter’s ads serving platform"
        },
        {
          "description": "In this post, we describe a graph neural network architecture (SIGN) that is of simple implementation and that works on very large graphs.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/simple-scalable-graph-neural-networks",
          "publishedOn": "2021-07-13T12:19:17.678Z",
          "wordCount": 3596,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Simple scalable graph neural networks"
        },
        {
          "description": "This blog post is based on Michael Bronstein’s keynote talk at ICLR 2021 and the paper M. M. Bronstein et al., Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges (2021)",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/iclr-invited-talk-on-geometric-deep-learning",
          "publishedOn": "2021-07-13T12:19:17.665Z",
          "wordCount": 3228,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "ICLR Invited Talk on Geometric Deep Learning"
        },
        {
          "description": "Twitter engineers found and fixed a Linux kernel bug in memory shrinker which caused OOM for us.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2021/dropping-cache-didnt-drop-cache",
          "publishedOn": "2021-07-13T12:19:17.635Z",
          "wordCount": 2282,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Dropping cache didn’t drop cache"
        },
        {
          "description": "Twitter built a data product to help with coronavirus research by opening our APIs to academic researchers, to access the public conversation around COVID-19.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/how-we-built-a-data-stream-to-assist-with-covid-19-research",
          "publishedOn": "2021-07-13T12:19:16.955Z",
          "wordCount": 1480,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Building a data stream to assist with COVID-19 research"
        },
        {
          "description": "Introducing the dict-minimize package",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/harnessing-second-order-optimizers-from-deep-learning-frameworks",
          "publishedOn": "2021-07-13T12:19:16.944Z",
          "wordCount": 1631,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Harnessing second order optimizers from deep learning frameworks"
        },
        {
          "description": "Learn about Twitter’s adoption of RocksDB within Manhattan, its internal distributed key-value store.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2021/adopting-rocksdb-within-manhattan",
          "publishedOn": "2021-07-13T12:19:16.929Z",
          "wordCount": 2259,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Adopting RocksDB within Manhattan"
        },
        {
          "description": "Twitter annotated its data to a defined taxonomy by leveraging machine learning in its data platform by fusing Elasticsearch with neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/fusing-elasticsearch-with-neural-networks-to-identify-data",
          "publishedOn": "2021-07-13T12:19:16.903Z",
          "wordCount": 1788,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Fusing Elasticsearch with neural networks to identify data"
        },
        {
          "description": "Twitter shares a technical analysis of its assessment for potential bias in its image cropping algorithm as part of its efforts to be more transparent around how it uses machine learning to improve pe",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/sharing-learnings-about-our-image-cropping-algorithm",
          "publishedOn": "2021-07-13T12:19:16.668Z",
          "wordCount": 1464,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Sharing learnings about our image cropping algorithm"
        },
        {
          "description": "Twitter describes how to design local and computationally efficient provably powerful graph neural networks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2021/provably-expressive-graph-neural-networks",
          "publishedOn": "2021-07-13T12:19:16.651Z",
          "wordCount": 2202,
          "sourceHref": "https://blog.twitter.com/engineering/en_us/blog.rss",
          "sourceTitle": "English (US)",
          "title": "Provably expressive graph neural networks"
        }
      ]
    },
    {
      "href": "https://googleprojectzero.blogspot.com/atom.xml",
      "articles": [
        {
          "description": "@import url('https://themes.googleusercontent.com/fonts/css?kit=cGvuclDC_Z1vE_cnVEU6AfLhOPS0h0oMHpEhTRSdXHM5KEqTDahEV1ECVSsZOMl9_kmCvy597kDopqFAXvpeaA');.lst-kix_xko68zpk7do4-7>li{counter-increment:lst-ctn-kix_xko68zpk7do4-7}ol.lst-kix_69oxjbhu0l4-6.start{counter-reset:lst-ctn-kix_69oxjbhu0l4-6 0}ol.lst-kix_xko68zpk7do4-0.start{counter-reset:lst-ctn-kix_xko68zpk7do4-0 0}ol.lst-kix_44h6gatzfsnw-2{list-style-type:none}ol.lst-kix_xko68zpk7do4-6.start{counter-reset:lst-ctn-kix_xko68zpk7do4-6 0}ol.lst-kix_44h6ga…",
          "link": "https://googleprojectzero.blogspot.com/2021/06/an-epyc-escape-case-study-of-kvm.html",
          "publishedOn": "2021-06-29T15:58:00.002Z",
          "wordCount": 6734,
          "sourceHref": "https://googleprojectzero.blogspot.com/atom.xml",
          "sourceTitle": "Project Zero",
          "title": "An EPYC escape: Case-study of a KVM breakout"
        }
      ]
    },
    {
      "href": "https://www.hackerone.com/blog.rss",
      "articles": [
        {
          "description": "Organizations rely on security testing to identify vulnerabilities, but how do they know when a vulnerability is critical and needs immediate attention? HackerOne and PagerDuty partnered to create a workflow automation integration that identifies when critical vulnerabilities need action minimizing cyber risk and remediation time.",
          "link": "https://www.hackerone.com/blog/hackerone-and-pagerduty-partner-identify-when-vulnerabilities-need-action",
          "publishedOn": "2021-07-19T14:00:00.000Z",
          "wordCount": 853,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How to Use HackerOne and PagerDuty to Identify When Vulnerabilities Need Action"
        },
        {
          "description": "Looking for bug bounty examples? We’ll explain what bug bounties are, and show you how they work step-by-step using examples of actual bug bounties.",
          "link": "https://www.hackerone.com/blog/what-are-bug-bounties-how-do-they-work-examples",
          "publishedOn": "2021-07-17T05:30:00.000Z",
          "wordCount": 1249,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "What Are Bug Bounties? How Do They Work? [With Examples]"
        },
        {
          "description": "Today, HackerOne is launching the industry’s first hacker API. This release is now out of beta and is available to the hacker community. It includes a collection of API endpoints that help automate common workflow tasks. In the past, hackers had to use the UI to complete repetitive tasks on the platform, with no supported mechanism to script or automate their workflows. With the new API, hackers can increase productivity and allocate more time towards creative bug hunting.",
          "link": "https://www.hackerone.com/blog/how-industrys-first-hacker-powered-api-helps-hackers-automate-workflows",
          "publishedOn": "2021-07-15T15:00:00.000Z",
          "wordCount": 976,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How the Industry’s First Hacker-Powered API Helps Hackers Automate Workflows"
        },
        {
          "description": "Dr. Jasyn Voshell, Director for Product and Solution Security at Zebra Technologies, is a power user of HackerOne, with a Vulnerability Disclosure Program (VDP), bug bounty program, and his team regularly running pentests with hackers.",
          "link": "https://www.hackerone.com/blog/how-hackerone-positively-influences-zebras-software-development-life-cycle",
          "publishedOn": "2021-07-13T16:00:00.000Z",
          "wordCount": 1269,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "How HackerOne Positively Influences Zebra’s Software Development Life Cycle"
        },
        {
          "description": "Cyberattacks are the terrorism of today, hitting societies, commercial companies, and even individual citizens with data theft, money theft, ransomware, disruption of operations, public shaming, and loss of trust. The list of potential damage is long, and perpetrators are hiding in the dark web in jurisdictions outside of our control. The question is not whether you will be breached, but when or if it already happened without your knowledge. When a company’s digital assets are compromised, what would have c…",
          "link": "https://www.hackerone.com/blog/top-top-cybersecurity-principles-every-board-member-must-know",
          "publishedOn": "2021-07-12T20:15:00.000Z",
          "wordCount": 1236,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "The Top Cybersecurity Principles Every Board Member Must Know"
        },
        {
          "description": "Trying to understand the difference between a bug bounty vs. CTF? We explain the differences, the similarities, and the benefits of each.",
          "link": "https://www.hackerone.com/blog/bug-bounty-vs-ctf-understanding-differences-benefits",
          "publishedOn": "2021-07-09T23:30:00.000Z",
          "wordCount": 1627,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Bug Bounty vs. CTF [Understanding Differences & Benefits]"
        },
        {
          "description": "Companies offer ongoing bug bounties to freelance ethical hackers to discover security vulnerabilities. Alternatively, penetration testing is a scheduled test of a system’s security to identify weaknesses and vulnerabilities.",
          "link": "https://www.hackerone.com/blog/bug-bounty-vs-penetration-testing-differences-explained",
          "publishedOn": "2021-06-25T20:00:00.000Z",
          "wordCount": 1550,
          "sourceHref": "https://www.hackerone.com/blog.rss",
          "sourceTitle": "HackerOne",
          "title": "Bug Bounty vs. Penetration Testing: \tDifferences Explained"
        }
      ]
    },
    {
      "href": "https://hacks.mozilla.org/feed/",
      "articles": [
        {
          "description": "As we’re all aware by now, we made some big platform changes at the end of 2020. Whilst the big move has happened, it’s given us a great opportunity to clear out the cupboards and closets. \nThe post Spring Cleaning MDN: Part 1 appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2021/07/spring-cleaning-mdn-part-1/",
          "publishedOn": "2021-07-20T16:00:48.000Z",
          "wordCount": 418,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Spring Cleaning MDN: Part 1"
        },
        {
          "description": "As the summer rolls around for those of us in the northern hemisphere, temperatures are high and unwinding with a cool ice tea is high on the agenda. Isn't it lucky then that Background Update is here for Windows, which means Firefox can update even if it's not running. We can just sit back and relax!\nAlso this release we see a few nice JavaScript additions, including private fields and methods for classes, and the at() method for Array, String and TypedArray global objects.\nThis blog post just provides a s…",
          "link": "https://hacks.mozilla.org/2021/07/getting-lively-with-firefox-90/",
          "publishedOn": "2021-07-13T15:02:10.000Z",
          "wordCount": 876,
          "sourceHref": "https://hacks.mozilla.org/feed/",
          "sourceTitle": "Mozilla Hacks – the Web developer blog",
          "title": "Getting lively with Firefox 90"
        }
      ]
    },
    {
      "href": "https://github.blog/feed/",
      "articles": [
        {
          "description": "The GitHub Education Stream Team is adding new shows. Job-hunting graduate? New to coding? No matter where you are, there's a show for you.",
          "link": "https://github.blog/2021-07-15-student-leaders-github-campus-tv-next-level/",
          "publishedOn": "2021-07-15T16:00:29.000Z",
          "wordCount": 1142,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Student leaders are taking GitHub Campus TV to the next level"
        },
        {
          "description": "This month, we have some exciting updates to share. A lot of you have welcomed the improvements to your ability to sync a forked repo with upstream from the web UI, add video on issues",
          "link": "https://github.blog/2021-07-13-whats-new-github-changelog-june-2021/",
          "publishedOn": "2021-07-13T16:01:14.000Z",
          "wordCount": 1435,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "What’s new from GitHub Changelog? June 2021 Recap"
        },
        {
          "description": "At GitHub, we recently added a new feature to Rails that will be available in 7.0: support for handling associations across database clusters.",
          "link": "https://github.blog/2021-07-12-adding-support-cross-cluster-associations-rails-7/",
          "publishedOn": "2021-07-12T16:00:12.000Z",
          "wordCount": 1449,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Adding support for cross-cluster associations to Rails 7"
        },
        {
          "description": "In June, we experienced no incidents resulting in service downtime to our core services.",
          "link": "https://github.blog/2021-07-07-github-availability-report-june-2021/",
          "publishedOn": "2021-07-07T16:00:30.000Z",
          "wordCount": 262,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "GitHub Availability Report: June 2021"
        },
        {
          "description": "Today, we're launching a technical preview of GitHub Copilot, a new AI pair programmer that helps you write better code.",
          "link": "https://github.blog/2021-06-29-introducing-github-copilot-ai-pair-programmer/",
          "publishedOn": "2021-06-29T14:28:51.000Z",
          "wordCount": 416,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing GitHub Copilot: your AI pair programmer"
        },
        {
          "description": "GitHub’s bug bounty program is now a mature component of how we improve product security. We're excited to highlight some achievements (and interesting vulnerabilities)!",
          "link": "https://github.blog/2021-06-25-seven-years-github-security-bug-bounty-program/",
          "publishedOn": "2021-06-25T16:01:03.000Z",
          "wordCount": 2085,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Seven years of the GitHub Security Bug Bounty program"
        },
        {
          "description": "We're excited to announce the newest addition to the Student Developer Pack, the GitHub Virtual Event Kit! Access the best virtual event tools in one place at no cost.",
          "link": "https://github.blog/2021-06-24-run-online-campus-events-github-virtual-event-kit/",
          "publishedOn": "2021-06-24T16:00:08.000Z",
          "wordCount": 883,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Run online campus events with your favorite tools at no cost with the new GitHub Virtual Event Kit"
        },
        {
          "description": "Announcing new beta features for GitHub Issues for better planning and tracking of your projects in GitHub, including project tables, task lists, and issue forms.",
          "link": "https://github.blog/2021-06-23-introducing-new-github-issues/",
          "publishedOn": "2021-06-23T16:04:51.000Z",
          "wordCount": 354,
          "sourceHref": "https://github.blog/feed/",
          "sourceTitle": "The GitHub Blog",
          "title": "Introducing the new GitHub Issues"
        }
      ]
    },
    {
      "href": "https://building.nubank.com.br/feed/",
      "articles": [
        {
          "description": "Analytical work can greatly benefit from software engineering standards in terms of quality and efficiency, here's how.\nThe post Scaling data analytics with software engineering best practices appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/scaling-data-analytics-with-software-engineering-best-practices/",
          "publishedOn": "2021-07-15T15:31:27.000Z",
          "wordCount": 4830,
          "sourceHref": "https://building.nubank.com.br/feed/",
          "sourceTitle": "Building Nubank",
          "title": "Scaling data analytics with software engineering best practices"
        }
      ]
    }
  ],
  "cliVersion": "1.4.0"
}