{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/11/our-principles-for-iot-security-labeling.html",
          "author": null,
          "description": "Posted by Dave Kleidermacher, Eugene Liderman, and Android and Made by Google security teams \nWe believe that security and transparency are paramount pillars for electronic products connected to the Internet.  Over the past year, we’ve been excited to see more focused activity across policymakers, industry partners, developers, and public interest advocates around raising the security and transparency bar for IoT products.  \nThat said, the details of IoT product labeling - the definition of labeling, what labeling needs to convey in terms of security and privacy, where the label should reside, and how to achieve consumer acceptance, are still open for debate.  Google has also been considering these core questions for a long time.  As an operating system, IoT product provider, and the maint…",
          "link": "http://security.googleblog.com/2022/11/our-principles-for-iot-security-labeling.html",
          "publishedOn": "2022-11-02T17:00:00.002Z",
          "wordCount": 3144,
          "title": "Our Principles for IoT Security Labeling"
        },
        {
          "id": "http://security.googleblog.com/2022/10/announcing-guac-great-pairing-with-slsa.html",
          "author": null,
          "description": "Posted by Brandon Lum, Mihai Maruseac, Isaac Hepworth, Google Open Source Security Team \nSupply chain security is at the fore of the industry’s collective consciousness. We’ve recently seen a significant rise in software supply chain attacks, a Log4j vulnerability of catastrophic severity and breadth, and even an Executive Order on Cybersecurity.  \nIt is against this background that Google is seeking contributors to a new open source project called GUAC (pronounced like the dip). GUAC, or Graph for Understanding Artifact Composition, is in the early stages yet is poised to change how the industry understands software supply chains. GUAC addresses a need created by the burgeoning efforts across the ecosystem to generate software build, security, and dependency metadata. True to Google’s mis…",
          "link": "http://security.googleblog.com/2022/10/announcing-guac-great-pairing-with-slsa.html",
          "publishedOn": "2022-10-20T17:01:00.000Z",
          "wordCount": 1577,
          "title": "Announcing GUAC, a great pairing with SLSA (and SBOM)!"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/news/y7AE",
          "author": "Jerod Santo",
          "description": "Might a “modular monolith” be the happy middle ground in the endless monolith or microservices decision? You may have to answer that question for yourself, but this post shares some good thoughts around designing a modular monolith:\nWhen designing a modular monolith, it is all about breaking up the system into modules, and then combining those modules into a monolith for deployment.\nIt might be worth noting that finding what modules you will need, might not be as easy as you would think. They have to be as independent as possible. High-cohesion and low coupling is very important here, as all communication between the modules might end up being a cross network call, if you decide to break it into services in the future.\nThis means that all communication between modules need to well abstracted, and be either asynchronous, so that they can handle the call going across the network in the future, or use some form of messaging.\nDiscuss on Changelog News",
          "link": "https://www.fearofoblivion.com/build-a-modular-monolith-first",
          "publishedOn": "2022-11-15T21:09:00.000Z",
          "wordCount": null,
          "title": "Build the modular monolith first",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Jgkr",
          "author": "Jerod Santo",
          "description": "Fathy Boundjadj new html2svg project is pretty cool. We’ve seen a lot of efforts to convert HTML to raster images like PNG and JPG, but SVG is a different (pixel-independent) story.\nThis end product took some engineering, and the linked post goes deep into all the steps Fathy had to take along the way. From taking the picture to rendering to SVG to supporting shadows and more.\nDiscuss on Changelog News",
          "link": "https://fathy.fr/html2svg",
          "publishedOn": "2022-11-15T20:19:00.000Z",
          "wordCount": null,
          "title": "Forking Chrome to turn HTML into SVG",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8lkE",
          "author": "Adam Stacoviak",
          "description": "Let’s see if this ages well, but I do agree that Armin shares some good points. Scale comes with mainstream, and mainstream Mastodon isn’t quite possible if we can’t all agree (and we can’t). This is probably Mastodon’s most obvious achilles heel — agreement in a decentralized, federated, you can “do what you want” world.\n…before we even hit the issue of the technology, we hit the issue of there being absolutely no agreement of what the thing should look like or what the issue actually is and that’s I think much more interesting.\nSome people claim the solution to the technical scalability issue is huge instances, some other people have the belief that the actual intended design and solution were micro-instances of in extreme cases a user each.\nThen there’s moderation, which if you’ve ever run any community forums, Slacks, etc you’ll know that you’re going to have to moderate and deal with people problems.\nOn the topic of moderation the very same issue is even more absurd. Some instances want uncontrolled free speech where some instances effectively are pure shit-posting instances which are completely de-federated from the most of the fediverse as a result. Other instances really like to control their content, where some popular ones such as fosstodon ban all languages than English as a result to allow moderation. There also is no real agreement on if larger or smaller instance are going to make the problem of moderation better or worse.\nDiscuss on Changelog News",
          "link": "https://lucumr.pocoo.org/2022/11/14/scaling-mastodon/",
          "publishedOn": "2022-11-15T14:00:00.000Z",
          "wordCount": null,
          "title": "Scaling Mastodon is impossible",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/N1Qa",
          "author": "Adam Stacoviak",
          "description": "I didn’t want to click through to this. I was like, “No. A Kindle?” But, the opening image got me. That’s why all I’m sharing is this note and that image.\n\nDiscuss on Changelog News",
          "link": "https://matthealy.com/kindle",
          "publishedOn": "2022-11-14T23:04:21.000Z",
          "wordCount": null,
          "title": "Your next smart home device is a $30 used Kindle",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1936",
          "author": null,
          "description": "Roger Lee has been tracking all tech layoffs since COVID-19, Amanda Hoover says tech worker demand is still high, ntfy helps you send push notifications for free, devenv lets you share development environments without containers, Markdoc scales from personal blogs to massive documentation sites & we talk with Mike Bifulco at All Things Open 2022.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMike Bifulco – Twitter, GitHub, Website\nJerod Santo – Twitter, GitHub\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nlayoffs.fyi\nDespite Big Layoffs, Tech Workers Are Still in Demand\n\nMeta LinkedIn Group\nGoogle sheet of opportunities\nntfy.sh\ndevenv.sh\nMarkdoc\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-11-14",
          "publishedOn": "2022-11-14T17:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Tracking layoffs, tech worker demand still high, ntfy, devenv, Markdoc & Mike Bifulco",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-11-14/the-changelog-news-2022-11-14.mp3",
            "length": "16935599",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ojmN",
          "author": "Jerod Santo",
          "description": "Use it as a CLI, a server, a library, or inside a container 👌\n\nDiscuss on Changelog News",
          "link": "https://github.com/danielgatis/rembg",
          "publishedOn": "2022-11-14T15:20:00.000Z",
          "wordCount": null,
          "title": "A Python tool that removes the background from images",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/MbWA",
          "author": "Adam Stacoviak",
          "description": "If you loathe Markdown, read this. If you love Markdown, read this.\nI truly loathe Markdown. Truly. But given the widespread use of Markdown, it might seem strange that I have such aversion to it. If you somehow really like it, or are so used to it by now, you might be tempted to think I’m the oddball. But I’m definitely not alone in my dislike of the format…\nIt’s popular and got a lot wrong, but also a lot right. 🤔\nDiscuss on Changelog News",
          "link": "https://www.russellbeattie.com/notes/posts/why-is-markdown-popular.html",
          "publishedOn": "2022-11-12T20:21:50.000Z",
          "wordCount": null,
          "title": "Why is Markdown popular?",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1886",
          "author": null,
          "description": "This week we’re back for part 2 with Adam Wiggins — going beyond Heroku and the story of Muse (listen to part 1). After a six-year adrenaline high on Heroku, Adam needed time to recover and refill the creative well. So, he moved to Berlin, did some gig work with companies…dabbled in investing and advising. But he wasn’t satisfied. Adam likes to build things.\nUltimately, he was just waiting for the right time to reconnect with James Lindenbaum and Orion Henry — the same fellas he created Heroku with. Eventually they founded Ink & Switch, an independent research lab which led to innovations that made Muse possible. Muse is a tool for deep work and thinking on iPad and Mac. Today’s show is all about that journey and the details in-between.\nDiscuss on Changelog News\nChangelog++ members get a b…",
          "link": "https://changelog.com/podcast/514",
          "publishedOn": "2022-11-11T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 514: Beyond Heroku to Muse",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/514/the-changelog-514.mp3",
            "length": "106507355",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1926",
          "author": null,
          "description": "Estelle Weyl has been building the web since 1999 and documenting it since 2007. Today she joins Amal for a loooong and deeeep conversation about new and !important features of CSS & HTML. Sit down, strap in, and prepare to be schooled!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nEstelle Weyl – Twitter, GitHub\nAmal Hussein – Twitter, GitHub\nNotes and Links\nweb platform tests\ntest262 report\nEstelle’s CSS slides\nGoogle’s web.dev site\nOpen Web Docs\nMDN: Cascade\nMDN: Cascade Layers\nMDN: Specificity\nMDN: important\nMerry-Go-Round\nSpecificity with Fish\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/251",
          "publishedOn": "2022-11-11T21:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 251: A very !important lesson",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/251/js-party-251.mp3",
            "length": "88170729",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/PpyE",
          "author": "Jerod Santo",
          "description": "It stores your shell history in context (what directory you ran the command in, whether it succeeded or failed, how long it took, etc). This is all stored locally and end-to-end encrypted for syncing to to all your other computers. All of this is easily queryable via the hishtory CLI. This means from your laptop, you can easily find that complex bash pipeline you wrote on your server, and see the context in which you ran it.\nDiscuss on Changelog News",
          "link": "https://github.com/ddworken/hishtory",
          "publishedOn": "2022-11-11T16:32:00.000Z",
          "wordCount": null,
          "title": "`hishtory` is a better shell history",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AXke",
          "author": "Jerod Santo",
          "description": "Russ Cox, for the Go team:\nToday we celebrate the thirteenth birthday of the Go open source release. The Gopher is a teenager!\nIt’s been an eventful year for Go. The most significant event was the release of Go 1.18 in March, which brought many improvements but most notably Go workspaces, fuzzing, and generics.\nHe goes on to describe many of the other notable features and events of the past year and closes with a glance into Go’s future:\nIn Go’s 14th year, we’ll keep working to make Go the best environment for software engineering at scale. We plan to focus particularly on supply chain security, improved compatibility, and structured logging, all of which have been linked already in this post. And there will be plenty of other improvements as well, including profile-guided optimization.\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/13years",
          "publishedOn": "2022-11-11T15:46:00.000Z",
          "wordCount": null,
          "title": "Thirteen years of Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GW3o",
          "author": "Jerod Santo",
          "description": "Podman Desktop installs, configures and keeps Podman up to date on your local environment. It provides a system tray, to check status and interact with your container engine without losing focus from other tasks. The desktop application provides a dashboard to interact with containers, images, pods and volumes but also configures your environment with your OCI registries and network settings. Podman Desktop also provides capabilities to connect and deploy pods to Kubernetes environments.\n\nDiscuss on Changelog News",
          "link": "https://github.com/containers/podman-desktop",
          "publishedOn": "2022-11-11T14:56:00.000Z",
          "wordCount": null,
          "title": "A graphical tool for developing on containers and Kubernetes",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1691",
          "author": null,
          "description": "Natalie & Ian welcome Liran Haimovitch & Tiago Queiroz to the show for a discussion focused on debugging Go programs. They cover good & bad debugging practices, the difficulty of debugging in the cloud, the value of errors logs & metrics, the practice of debugging in production (or not) & much more!\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nLiran Haimovitch – Twitter, GitHub\nTiago Queiroz – Twitter, GitHub, LinkedIn, Website\nNatalie Pistunovich – Twitter, GitHub\nIan Lopshire – Twitter, GitHub\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/255",
          "publishedOn": "2022-11-10T17:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 255: Debugging Go",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/255/go-time-255.mp3",
            "length": "51471907",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/RdZm",
          "author": "Jerod Santo",
          "description": "Google search quality has been deteriorating for awhile. In this manifesto (of sorts), Kagi CEO Vladimir Prelovac describes what he thinks needs to replace it:\nIn the future, instead of everyone sharing the same search engine, you’ll have your completely individual, personalized Mike or Julia or Jarvis - the AI. Instead of being scared to share information with it, you will volunteer your data, knowing its incentives align with yours. The more you tell your assistant, the better it can help you, so when you ask it to recommend a good restaurant nearby, it’ll provide options based on what you like to eat and how far you want to drive. Ask it for a good coffee maker, and it’ll recommend choices within your budget from your favorite brands with only your best interests in mind. The search will be personal and contextual and excitingly so!\nDiscuss on Changelog News",
          "link": "https://blog.kagi.com/age-pagerank-over",
          "publishedOn": "2022-11-10T15:30:00.000Z",
          "wordCount": null,
          "title": "The age of PageRank is over",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/3L7D",
          "author": "Jerod Santo",
          "description": "For web automation/testing, Selenium has been the de facto “standard” since forever. It’s simple to get started with and supports almost every programming language.\nI know a lot of people who use Selenium, but I don’t know a lot of people who enjoy using Selenium. (That’s no knock on the Selenium team. They solved a hard problem for lots of devs over the course of many years. Huge impact!) Playwright on the other hand…\nDiscuss on Changelog News",
          "link": "https://new.pythonforengineers.com/blog/web-automation-dont-use-selenium-use-playwright/",
          "publishedOn": "2022-11-10T14:39:00.000Z",
          "wordCount": null,
          "title": "Web automation: don't use Selenium, use Playwright",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1817",
          "author": null,
          "description": "In today’s episode we have the pleasure of Audun Fauchald Strand, Principal Software Engineer at NAV.no, Norway’s Labour & Welfare Administration. We will be talking about NAIS.io, the application platform that runs on-prem, as well as on the public cloud.\nImagine hundreds of developers shipping on an average day 300 changes into a system which processes $100,000,000 worth of transactions on a quiet week. If you think this is hard, consider the context: a government institution which must comply with all laws & regulations.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently l…",
          "link": "https://changelog.com/shipit/78",
          "publishedOn": "2022-11-09T22:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 78: The system that runs Norway's welfare payments 🇳🇴",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/78/ship-it-78.mp3",
            "length": "59693824",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/2l7M",
          "author": "Jerod Santo",
          "description": "Adam Gordon Bell:\nThere are many ways to understand how containers work, but most useful explanations are actually simplifications….\nBut for me, containers are just chrooted processes. Sure, they are more than that: Containers have a nice developer experience, an open-source foundation, and a whole ecosystem of cloud-native companies pushing them forward. But, let me show you why I think chroot is the key.\nI like this framing. It makes a lot of sense to me. More than ‘lightweight VM’, which is how I’ve thought about them previously. The rest of this article is Adam stepping through the process of building a container runtime using only the chroot system call.\nDiscuss on Changelog News",
          "link": "https://earthly.dev/blog/chroot/",
          "publishedOn": "2022-11-09T17:59:00.000Z",
          "wordCount": null,
          "title": "Containers are chroot with a marketing budget",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/1WG4",
          "author": "Jerod Santo",
          "description": "Compared to other programming languages such as Python and Go, Rust’s standard library is very small, including only core data structures in the standard library with all other functionality farmed out to 3rd party ecosystem crates, and a common complaint from new Rust developers is that they don’t know where to start: which crates they ought to use and which crates they ought to trust. This list attempts to answer those questions.\nDiscuss on Changelog News",
          "link": "https://blessed.rs/crates",
          "publishedOn": "2022-11-09T16:30:00.000Z",
          "wordCount": null,
          "title": "An unofficial guide to the Rust ecosystem",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/D125",
          "author": "Jerod Santo",
          "description": "Rachel Stephens, trying to reconcile the claims that the tech industry is vastly overstaffed with other claims of vast resource scarcity:\nBoth things can be true: it’s not a clear over- or under-staffing problem. It’s a problem of proportionality. There can definitely be organizational bloat… At the same time, there are also areas in tech that remain chronically understaffed and under-resourced: OSS project maintainers, people working on-call support, and people writing documentation to name a few.\nAn interesting analysis with a much-needed call for kindness to our fellow nerds as they face these tumultuous times.\nAnd (I can’t believe I’m writing this, but the jokes about Twitter layoffs in particular keep coming at a surprising rate) be kind to people facing layoffs. Losing your job is awful in the best of circumstances; going through it in such a public and charged situation must be emotionally grueling. Be kind.\nDiscuss on Changelog News",
          "link": "https://redmonk.com/rstephens/2022/11/01/kindness-and-staffing/",
          "publishedOn": "2022-11-09T15:43:00.000Z",
          "wordCount": null,
          "title": "Kindness, tech staffing and resource allocation",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1930",
          "author": null,
          "description": "It’s been a while since we’ve touched on quantum computing. It’s time for an update! This week we talk with Yonatan from Quantum Machines about real progress being made in the practical construction of hybrid computing centers with a mix of classical processors, GPUs, and quantum processors. Quantum Machines is building both hardware and software to help control, program, and integrate quantum processors within a hybrid computing environment.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nYonatan Cohen – Twitter, GitHub, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nQuantum Machines\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/200",
          "publishedOn": "2022-11-08T21:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 200: Hybrid computing with quantum processors",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/200/practical-ai-200.mp3",
            "length": "42109814",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X1E2",
          "author": "Jerod Santo",
          "description": "Katana can run in standard mode, which is like curl/wget, or it can run in headless mode, which is like a real web browser with JavaScript parsing and all that jazz. And since it’s written in Go, you get that silky universal binary experience. Just drop it in your $PATH and you’re off to the races!\nDiscuss on Changelog News",
          "link": "https://github.com/projectdiscovery/katana",
          "publishedOn": "2022-11-08T19:43:00.000Z",
          "wordCount": null,
          "title": "A next-gen crawling and spidering framework",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mlGl",
          "author": "Jerod Santo",
          "description": "According to this, 757 companies have laid off 104,791 employees thus far in 2022. Absolutely brutal.\nDiscuss on Changelog News",
          "link": "https://layoffs.fyi/",
          "publishedOn": "2022-11-08T16:55:00.000Z",
          "wordCount": null,
          "title": "Tech layoffs tracker",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1931",
          "author": null,
          "description": "Colin Bartlett’s 50 useful Vim commands, Jeremey Utley on why your first ideas aren’t always the best, Emanuele Rocca’s pets configuration management project, our Kaizen shirts are now on sale & Arun Venkatesen makes a microsite for infinite canvas tools.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\n📥 Subscribe to Changelog Weekly\n50 Useful Vim Commands\npets configuration management system\nKeep ’Em Coming: Why Your First Ideas Aren’t Always the Best\n\nIdeaflow\n👕 Kaizen - Continuous Improvement\nInfinite Canvas\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-11-07",
          "publishedOn": "2022-11-07T21:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Useful Vim commands, bad first ideas, PETS config manager, Kaizen shirts for sale & infinite canvas tools",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/news-2022-11-07/the-changelog-news-2022-11-07.mp3",
            "length": "6843898",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/dqok",
          "author": "Jerod Santo",
          "description": "Apropos of nothing 😉\nMastodon, a decentralized microblogging site named after an extinct type of mammoth, recorded 120,000 new users in the four days following billionaire Elon Musk’s acquisition of Twitter, its German-born founder Eugen Rochko tells TIME. Many of them were Twitter users seeking a new place to call their online home.\nThose users, whether they knew it or not, were following in the footsteps of Rochko, 29, who began coding Mastodon in 2016 after becoming disillusioned with Twitter. “I was thinking that being able to express myself online to my friends through short messages was very important to me, important also to the world, and that maybe it should not be in the hands of a single corporation,” Rochko says. “It was generally related to a feeling of distrust of the top down control that Twitter exercised.”\nAdam and I first spoke with Eugen in 2018 (before it was cool) and even signed up on his instance, but haven’t started posting there… yet. I’m a bit skeptical of its ability to scale beyond technologist circles. But maybe that’s okay?\nDiscuss on Changelog News",
          "link": "https://time.com/6229230/mastodon-eugen-rochko-interview/",
          "publishedOn": "2022-11-07T15:48:00.000Z",
          "wordCount": null,
          "title": "A timely TIME interview with Mastodon founder Eugen Rochko",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXyn",
          "author": "Jerod Santo",
          "description": "Olo provides online ordering & delivery services to restaurants, a big part of which is notifying their customers when important events take place in their ordering platform. For this need, they built a webhook service, which was working great… until it wasn’t.\nIn this article, they share how they evaluated, chose, and eventually migrated to Apache Kafka for this service. It looks like a lot of work that paid off in the end, woo hoo!\nDiscuss on Changelog News",
          "link": "https://ololabs.github.io/olo.engineering/posts/migrating-webhooks-to-kafka/",
          "publishedOn": "2022-11-07T14:58:00.000Z",
          "wordCount": null,
          "title": "How we migrated our webhook service to Kafka",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1873",
          "author": null,
          "description": "This week on The Changelog we’re joined by Adam Wiggins, co-founder and former CTO of Heroku, for an exclusive trip down Heroku memory lane. Adam and Jerod are both tremendous fans of Heroku and believe (to this day) they represent the apex in developer experience for delivering code to production.\nWe talk through the beginnings of Heroku, the v1 most people have forgotten about, the era of web hosting back in 2008-2010, the serendipity of Silicon Vally in those days, pitching to Y Combinator, the makings of git push heroku, the Heroku style and name, the sale of Heroku to Salesforce, potential regrets — and we tee up part 2 coming next week with Adam going beyond Heroku and the story of Muse.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made th…",
          "link": "https://changelog.com/podcast/513",
          "publishedOn": "2022-11-04T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 513: The story of Heroku",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/513/the-changelog-513.mp3",
            "length": "146328480",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/5jPO",
          "author": "Adam Stacoviak",
          "description": "This is so cool! Shout out to Zach Latta (Founder of Hack Club) for giving me a call today to tell me about Sprig — this awesome new Hack Club project is built by teenagers for teenagers.\nSprig is a game console where every user is a creator. It can only be obtained by building a tile-based game in the web-based game editor and shipping it in the community gallery. It’s made by Hack Club.\n… Fall of 2022, we are giving a Sprig (valued at over $100 in components alone) to every teenage hacker that successfully shares a game they create in our community gallery.\n\nDiscuss on Changelog News",
          "link": "https://github.com/hackclub/sprig",
          "publishedOn": "2022-11-04T20:57:32.000Z",
          "wordCount": null,
          "title": "Open source game console/engine built by teenagers",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1923",
          "author": null,
          "description": "Maggie Johnson-Pint from Stanza sits down with Amal & Divya for a deep-dive in to the production side of the development world. If you’re at all curious (and/or intimidated) by terms like Site Reliability Engineering (SRE), Service Level Objective (SLO), OpenTelemetry, distributed tracing, and the like… this episode’s for you!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nMaggie Johnson-Pint – Twitter, GitHub, LinkedIn, Website\nAmal Hussein – Twitter, GitHub\nDivya – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nStanza\nOpenTelemetry\n📘 Site Reliability Engineering\n📘 The Site Reliability Workbook\nweb components has egg on its face because the zeitgeist\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/250",
          "publishedOn": "2022-11-04T19:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 250: Making sense of production",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/250/js-party-250.mp3",
            "length": "61889748",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pjZP",
          "author": "Jerod Santo",
          "description": "Now that we’re out of the ‘dark times’ where CSS was so limited that we spent countless hours developing hacks, tricks, and workarounds… Sacha Greif wonders if the pendulum has swung the other way:\nwe are now faced with an embarrassment of CSS riches, and it can be hard to catch up. CSS Grid started being supported in major browsers almost five years ago, yet I still check a reference every time I use it. And as cool as subgrid seems, I’ve yet to even try it out.\nPerhaps CSS is even starting to reach over into areas best handled by HTML or JavaScript?\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/is-there-too-much-css-now/",
          "publishedOn": "2022-11-04T15:46:00.000Z",
          "wordCount": null,
          "title": "Is there too much CSS now?",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1847",
          "author": null,
          "description": "Today we’re talking about uses for Go in the medical industry. Tim Stiles develops and maintains a Go package for synthetic biology and molecular biology called Poly. It has broad applications for biotech R&D, but also has very direct applications to medicine.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nFeaturing\nTim Stiles – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nIan Lopshire – Twitter, GitHub\nNotes and Links\nPoly on GitHub\nThe algorithm of the professor used by 23and me and others\nCentral Dogma of DNA of biology\nThe Three-Body Problem\nAlphaFold\nGitpod\nFoldit\nGo library for Huggingface\nSurrealDB\nBooth’s Least Rotation Go Implementation and wiki\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/254",
          "publishedOn": "2022-11-04T14:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 254: Go in medicine & biology",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/254/go-time-254.mp3",
            "length": "64905443",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqzR",
          "author": "Jerod Santo",
          "description": "A couple weeks back, Adam logged some news that linked to githubcopilotinvestigation.com. Well, There’s a new website now: githubcopilotlitigation.com\nMatthew Butterick:\nBy train­ing their AI sys­tems on pub­lic GitHub repos­i­to­ries (though based on their pub­lic state­ments, pos­si­bly much more) we con­tend that the defen­dants have vio­lated the legal rights of a vast num­ber of cre­ators who posted code or other work under cer­tain open-source licenses on GitHub. Which licenses? A set of 11 pop­u­lar open-source licenses that all require attri­bu­tion of the author’s name and copy­right, includ­ing the MIT license, the GPL, and the Apache license.\nDiscuss on Changelog News",
          "link": "https://githubcopilotlitigation.com/",
          "publishedOn": "2022-11-04T13:12:00.000Z",
          "wordCount": null,
          "title": "We've filed a lawsuit challenging GitHub Copilot",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW43",
          "author": "Jerod Santo",
          "description": "Most internet speed testing tools focus on bandwidth, but latency and packet loss are major factors in the experience as well.\nBandwidth means, once things get going, how fast you can download. But “once things get going” can take a really long time. In fact, it can take longer than the whole download! This is especially true for simple web pages, or web pages made up of a bunch of tiny pieces, which is very common on today’s web… That’s where latency comes in.\nTry blip for yourself: gfblip.appspot.com\nDiscuss on Changelog News",
          "link": "https://github.com/apenwarr/blip",
          "publishedOn": "2022-11-03T14:27:00.000Z",
          "wordCount": null,
          "title": "blip –a tool for seeing your internet latency",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1707",
          "author": null,
          "description": "15 years ago, Gerhard discovered magic in the form of Ruby on Rails. It was intuitive and it just worked. That is the context in which Gerhard fell in love with infrastructure and operations.\nToday, for special episode 77, we start at Seven Shipping Principles, and, in the true spirit of Ship It, we’ll see what happens next.\nOur guest is David Heinemeier Hansson, creator of Ruby on Rails, co-founder of Basecamp & HEY, and a lot more - check out dhh.dk.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and …",
          "link": "https://changelog.com/shipit/77",
          "publishedOn": "2022-11-03T13:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 77: Seven Shipping Principles",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/77/ship-it-77.mp3",
            "length": "56747496",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/49Jj",
          "author": "Jerod Santo",
          "description": "History is proof that removing a dangerous feature can greatly improve the quality of code. Today, we have a slew of dangerous practices that compromise the robustness and maintainability of software. Nearly all modern programming languages have some form of null references, shared global state, and functions with side effects—things that are far worse than the GOTO ever was.\nHow can those flaws be eliminated? It turns out that the answer has been around for decades: purely functional programming languages.\nDiscuss on Changelog News",
          "link": "https://spectrum.ieee.org/functional-programming",
          "publishedOn": "2022-11-02T13:47:00.000Z",
          "wordCount": null,
          "title": "Why functional programming should be the future of software development",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qMqd",
          "author": "Jerod Santo",
          "description": "This is for people who need to administer a handful of machines, all fairly different from each other and all Very Important. Those systems are not Cattle! They’re actually a bit more than Pets. They’re almost Family. For example: a laptop, workstation, and that personal tiny server in Sweden. They are all named after something dear.\nLiz Rice and I spoke about pets & cattle recently on The Changelog. I asked her, “from your perspective, are the people still doing it the old-school pets way?”\nThis tool is a great example of Pets-style administration being alive and well.\nDiscuss on Changelog News",
          "link": "https://github.com/ema/pets",
          "publishedOn": "2022-11-02T12:32:00.000Z",
          "wordCount": null,
          "title": "A configuration management system for Pets, not Cattle",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoJN",
          "author": "Jerod Santo",
          "description": "Vercel dropped Next.js 13 last week and there’s a lot of new stuff (router, server components, streaming & more) in this release. If you learn best by example (and subsequent tinkering with existing things), this (WIP) repo might be a good starting place for you.\nDiscuss on Changelog News",
          "link": "https://github.com/shadcn/taxonomy",
          "publishedOn": "2022-11-01T23:30:00.000Z",
          "wordCount": null,
          "title": "An open source app built using everything new in Next.js 13",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1925",
          "author": null,
          "description": "Recently Chris and Daniel briefly discussed the Open RAIL-M licensing and model releases on Hugging Face. In this episode, Daniel follows up on this topic based on some recent practical experience. Also included is a discussion about graph neural networks, message passing, and tweaking synthesized voices!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nDaniel’s team license from recent work\nGraph Neural Network courses from Zak Jost\nCoqui voice studio\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/199",
          "publishedOn": "2022-11-01T22:35:00.000Z",
          "wordCount": null,
          "title": "Practical AI 199: The practicalities of releasing models",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/199/practical-ai-199.mp3",
            "length": "36050375",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ojzd",
          "author": "Jerod Santo",
          "description": "In CSS, we’ve been encoding colors with rgb() or hex (mostly for historical reasons). However, the new CSS Color 4 specification adds many better ways of declaring colors in CSS. Of these, oklch() is the most interesting one—this article explains why.\nDiscuss on Changelog News",
          "link": "https://evilmartians.com/chronicles/oklch-in-css-why-quit-rgb-hsl",
          "publishedOn": "2022-11-01T13:50:00.000Z",
          "wordCount": null,
          "title": "OKLCH in CSS: why we moved from RGB and HSL",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQbm",
          "author": "Adam Stacoviak",
          "description": "From VimTricks:\nHere are 50 useful Vim commands that work in normal mode. Many of these can be combined and modified to produce dozens more. Use these as inspiration for your own repeatable workflows.\nDiscuss on Changelog News",
          "link": "https://vimtricks.com/p/50-useful-vim-commands/",
          "publishedOn": "2022-11-01T13:00:00.000Z",
          "wordCount": null,
          "title": "50 useful Vim commands",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/PpEE",
          "author": "Adam Stacoviak",
          "description": "Simon Willison describes the Perfect Commit as a single commit that contains all of the following:\nThe implementation: a single, focused change\nTests that demonstrate the implementation works\nUpdated documentation reflecting the change\nA link to an issue thread providing further context\nHere’s four paragraphs on how he got to here:\nI went through a several year phase of writing essays in my commit messages, trying to capture as much of the background context and thinking as possible.\nMy commit messages grew a lot shorter when I started bundling the updated documentation in the commit—since often much of the material I’d previously included in the commit message was now in that documentation instead.\nAs I extended my practice of writing issue threads, I found that they were a better place for most of this context than the commit messages themselves. They supported embedded media, were more discoverable and I could continue to extend them even after the commit had landed.\nToday many of my commit messages are a single line summary and a link to an issue!\nDiscuss on Changelog News",
          "link": "https://simonwillison.net/2022/Oct/29/the-perfect-commit/",
          "publishedOn": "2022-10-31T14:00:00.000Z",
          "wordCount": null,
          "title": "The Perfect Commit",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Y1QW",
          "author": "Jerod Santo",
          "description": "I, for one, welcome our new Rust overlords.\nDiscuss on Changelog News",
          "link": "https://github.com/dudykr/stc",
          "publishedOn": "2022-10-31T13:53:00.000Z",
          "wordCount": null,
          "title": "A TypeScript type checker written in Rust",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/AXle",
          "author": "Adam Stacoviak",
          "description": "If you’re feeling the FOMO of JavaScript or you’re writing “spaghetti code” just to do something a NextJS component would do out of the box, then read this post from Bill Prin on why he moved from Django to NextJS.\nThe summary is that using a language like Python or Ruby for a significant web project has increasingly gotten less reasonable over time to the point where now, in 2022, it’s getting hard to justify. By not keeping your web stack in pure Javascript, you are making your life unnecessarily difficult (as usual, we’ll include languages like TypeScript as part of the JavaScript ecosystem). You will almost certainly invest a bunch of time-solving problems that would be automatically solved for you if you just stuck with JavaScript.\nI will provide specific examples of solving problems using Django that would have been trivially solved in NextJS.\nHe goes on to share two reasons why you should use Python or Ruby for web projects in 2022.\nYou’re working on an existing project that hasn’t been migrated yet or is not worth migrating.\nDiscuss on Changelog News",
          "link": "https://billprin.com/2022/10/30/ditched-django-nextjs.html",
          "publishedOn": "2022-10-31T13:00:00.000Z",
          "wordCount": null,
          "title": "Why I ditched Django for NextJS",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1885",
          "author": null,
          "description": "This week we’re doing some Linux mythbusting and talking retro gaming with Jay LaCroix from Learn Linux TV. This is a preview of what’s to come from our trip to All Things Open next week. By the way, make sure you come and check us out at booth 60. We’ll be recording podcasts, shaking hands, giving out t-shirts and stickers…and speaking of gaming, you can go head-to-head with us on Mario Kart or Rocket League on the Nintendo Switch. We’re giving that Switch away to a lucky winner at the conference, but you have to play to win. If you’re there, make sure you come see us because we want to see you.\nDiscuss on Changelog News\nChangelog++ members get a bonus 10 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why t…",
          "link": "https://changelog.com/podcast/512",
          "publishedOn": "2022-10-28T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 512: Linux mythbusting & retro gaming",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/podcast/512/the-changelog-512.mp3",
            "length": "95596538",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1845",
          "author": null,
          "description": "Nick & Amelia welcome the co-authors of Tiny CSS Projects to discuss their awesome new (and still in-progress) Manning book all about CSS!\nUse code podjsparty20 when checking out to save 40% (good for all products in all formats!) and join the JS Party community chat for a chance to win a free ebook copy!\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nFeaturing\nMartine Dowden – Twitter, GitHub, Website\nMichael Gearon – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nAmelia Wattenberger – Twitter, GitHub, Website\nNotes and Links\nTiny CSS Projects (use code podjsparty20 to save 40%!)\nJoin the JS Party community to win a free ebook!\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/249",
          "publishedOn": "2022-10-28T20:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 249: Tiny CSS Projects",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/jsparty/249/js-party-249.mp3",
            "length": "51103769",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7YZ0",
          "author": "Jerod Santo",
          "description": "An open-source knowledge based community software. You can use it to quickly build your Q&A community for product technical support, customer support, user communication, and more.\nInstall with Docker, a Go binary, or from source.\n\nDiscuss on Changelog News",
          "link": "https://github.com/answerdev/answer",
          "publishedOn": "2022-10-28T15:00:00.000Z",
          "wordCount": null,
          "title": "Answer - Build Q&A community",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qp4q",
          "author": "James Sinclair",
          "description": "Suppose you learn some functional JavaScript, and it’s wonderful. But, for some reason, your team doesn’t get it? What do you do? To understand what’s going on, we need to step back and get a little perspective…\nDiscuss on Changelog News",
          "link": "https://jrsinclair.com/articles/2022/what-if-the-team-hates-my-functional-code/",
          "publishedOn": "2022-10-28T14:13:00.000Z",
          "wordCount": null,
          "title": "What if the team hates my functional code?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/2lzM",
          "author": "Jerod Santo",
          "description": "An opinionated set of thumb rules that Shrikant Sharat Kandula follows after a decade of writing shell scripts. His starter template looks nice as well:\n#!/usr/bin/env bash\n\nset -o errexit\nset -o nounset\nset -o pipefail\nif [[ \"${TRACE-0}\" == \"1\" ]]; then\n    set -o xtrace\nfi\n\nif [[ \"${1-}\" =~ ^-*h(elp)?$ ]]; then\n    echo 'Usage: ./script.sh arg-one arg-two\n\nThis is an awesome bash script to make your life better.\n\n'\n    exit\nfi\n\ncd \"$(dirname \"$0\")\"\n\nmain() {\n    echo do awesome stuff\n}\n\nmain \"$@\"\n\nDiscuss on Changelog News",
          "link": "https://sharats.me/posts/shell-script-best-practices/",
          "publishedOn": "2022-10-28T13:27:00.000Z",
          "wordCount": null,
          "title": "Shell script best practices",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZolL",
          "author": "Adam Stacoviak",
          "description": "This tldr from Guilherme Rambo is enough, but read the full post for all the details.\nTL;DR: Any app with access to Bluetooth could record your conversations with Siri and audio from the iOS keyboard dictation feature when using AirPods or Beats headsets. This would happen without the app requesting microphone access permission and without the app leaving any trace that it was listening to the microphone.\nThis bug has since been handled by Apple. Also, after reaching back out to Apple (on Oct 25), Guilherme was told he’d be receiving a $7,000 (USD) bug bounty payment for reporting the issue.\nDiscuss on Changelog News",
          "link": "https://rambo.codes/posts/2022-10-25-sirispy-ios-bug-allowed-apps-to-eavesdrop",
          "publishedOn": "2022-10-27T20:35:00.000Z",
          "wordCount": null,
          "title": "iOS bug \"SiriSpy\" allowed apps to eavesdrop on your conversations with Siri",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1876",
          "author": null,
          "description": "Mat Ryer gathers a gang of ghouls and ghosts to tell spooky developer stories! Join us to hear tales of Mat’s $1k nightmare, Dee’s infinite loop of horror, Natalie’s haunted time as a junior dev & many, many more.\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nFeaturing\nDee Kitchen – Twitter\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nKris Brandow – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nJohnny Boursiquot – Twitter, GitHub, Website\nNotes and Links\nbluemonday\n“All About Regular Expressions” by Jade Allen\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/253",
          "publishedOn": "2022-10-27T17:45:00.000Z",
          "wordCount": null,
          "title": "Go Time 253: Spooky stories to scare devs 👻",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/gotime/253/go-time-253.mp3",
            "length": "58167946",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/14/1855",
          "author": null,
          "description": "In today’s episode, we talk about distroless, ko, apko, melange, musl and glibc. The context is Wolfi OS, a community Linux OS designed for the container and cloud-native era. If you are looking for the lightest possible container base image with 0 CVEs and both glibc and musl support, Wolfi OS & the related chainguard-images are worth checking out.\nAriadne Conill is an Alpine Linux TSC member & Software Engineer at Chainguard.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about …",
          "link": "https://changelog.com/shipit/76",
          "publishedOn": "2022-10-27T14:30:00.000Z",
          "wordCount": null,
          "title": "Ship It! 76: Container base images with glibc & musl",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/shipit/76/ship-it-76.mp3",
            "length": "60880366",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Jg8Z",
          "author": "Jerod Santo",
          "description": "Lars Wikman on what it takes to learn software development and how he responds when people ask him how they should go about it:\nAt the time I was learning, I didn’t have access to any kind of bigger picture. I had limited resources. Limited documentation. I had so many limitations. I ran into them constantly and eventually found the next thing I could use to do cool stuff. If you try to teach someone to use an HTML form today, you will need to decide if you are talking about the basic idea or reality. Do we need to cover CSRF, captchas and how to do it in React? How about the backend? Starting out, I didn’t hear about half of the things I didn’t know; I think that made things easier.\nWhen it comes to the software industry, this is the best of times. There are amazing learning resources available, a vast repository of free code that you don’t have to write, and lucrative job offers on the other end of the chasm.\nWhen it comes to the software industry, this is the worst of times. There are too many learning resources to choose from, a crippling repository of free code that might stumble you, and overwhelming imposter syndrome on the other end of the chasm.\nLars sums it up nicely:\nHand someone a fish and they’ll never know that the ocean is vast. Teach them how to fish and they’ll be forever lost at sea.\nDiscuss on Changelog News",
          "link": "https://underjord.io/complex-systems-all-the-way-down.html",
          "publishedOn": "2022-10-27T13:39:00.000Z",
          "wordCount": null,
          "title": "Complex systems all the way down",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/8l7r",
          "author": "Jerod Santo",
          "description": "Sacha Greif gets out his crystal ball and tries to anticipate the future CSS trends (as well as some far-fetched and futuristic CSS features that might one day make their way to the browser) based on his learnings from running the State of CSS survey (go take it!)\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/10/futuristic-css/",
          "publishedOn": "2022-10-26T17:02:00.000Z",
          "wordCount": null,
          "title": "Futuristic CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/nj8Q",
          "author": "Jerod Santo",
          "description": "I’m here for any story that begins with an errant rm -r -f *, especially when the stakes are super-high, like you could lose an entire movie of Toy Story 2’s magnitude…\nWoody’s hat disappeared. And then his boots disappeared. And then as we kept checking, he disappeared entirely. Woody’s gone.\nCan you guess what happens next?\nWe realized that the backups we had were actually bad.\nRemember: nobody wants backups, everyone wants restore. Like Pixar’s movies, this tale ends happily, but I won’t spoil for you how the day was saved.\nDiscuss on Changelog News",
          "link": "https://kottke.org/12/05/how-pixar-almost-deleted-toy-story-2",
          "publishedOn": "2022-10-26T14:32:00.000Z",
          "wordCount": null,
          "title": "How Pixar almost deleted Toy Story 2",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1883",
          "author": null,
          "description": "This panel discussion was recorded at a recent event hosted by a company, Aryballe, that we previously featured on the podcast (#120). We got a chance to discuss the AI-driven technology transforming the order/fragrance industries, and we went down the rabbit hole discussing how this technology is being adopted at large, well-established companies.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nMary Fischer-Mullins – LinkedIn\nYanis Caritu – LinkedIn\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAryballe\nCox Automotive\nPrevious episode with Aryballe\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/198",
          "publishedOn": "2022-10-26T14:30:00.000Z",
          "wordCount": null,
          "title": "Practical AI 198: AI adoption in large, well-established companies",
          "itunes": {},
          "enclosure": {
            "url": "https://op3.dev/e/https://cdn.changelog.com/uploads/practicalai/198/practical-ai-198.mp3",
            "length": "32154839",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/MbJ0",
          "author": "Jerod Santo",
          "description": "Webpack creator Tobias Koppers announcing its (Vercel-funded) successor:\nTurbopack is built on a new incremental architecture for the fastest possible development experience. On large applications, it shows updates 10x faster than Vite and 700x faster than Webpack. On even larger applications, the difference is greater—often 20x faster than Vite.\nTurbopack is open source and still in alpha. Here’s what the future may hold:\nTo start, Turbopack will be used for the Next.js 13 development server. It will power lightning-fast HMR, and it will support React Server Components natively, as well as TypeScript, JSX, CSS, and more.\nTurbopack will eventually also power Next.js production builds, both locally and in the cloud. We’ll be able to share Turbo’s cache across your entire team, using Vercel Remote Caching.\nWebpack users can also expect an incremental migration path into the Rust-based future with Turbopack.\nDiscuss on Changelog News",
          "link": "https://vercel.com/blog/turbopack",
          "publishedOn": "2022-10-25T19:14:00.000Z",
          "wordCount": null,
          "title": "Introducing Turbopack: Rust-based successor to Webpack",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lYp",
          "author": "Jerod Santo",
          "description": "The speed record for data transmission using a single light source and optical chip has been shattered once again. Engineers have transmitted data at a blistering rate of 1.84 petabits per second (Pbit/s), almost twice the global internet traffic per second.\nFor context, if you’re fortunate enough to be living the “gig-life” (as my local carrier markets it) with a 1-gigabit connection at your house… a petabit is a million times faster than that. And that record-setting 1.84 petabit speed is just the start:\nBut the new chip is far from finished breaking records, according to the team behind it. Using a computational model to scale the data transmission potential of the system, the researchers claim that it could eventually reach eye-watering speeds of up to 100 Pbit/s.\nShut up and take my money?!\nDiscuss on Changelog News",
          "link": "https://newatlas.com/telecommunications/optical-chip-fastest-data-transmission-record-entire-internet-traffic/",
          "publishedOn": "2022-10-25T15:13:00.000Z",
          "wordCount": null,
          "title": "Record-breaking chip can transmit entire internet's traffic per second",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/aQVA",
          "author": "Jerod Santo",
          "description": "Long past are the days when I’d upgrade my production OS on day/week one, but I do try to read at least one or two reviews of the latest macOS to see how much of my FOMO is well-placed. And if you’re going to read just one review, it might as well be Ars Technica’s…\nI haven’t waded into the depth of this review yet, but the opener has me underwhelmed:\nThe throughline for all these features is about making the Mac more welcoming and comfortable for people who come to it through one of Apple’s mobile platforms…\nBut when was the last time that the Finder, the Dock, or the Menu Bar was given a substantial, non-cosmetic rethink? When did Apple last make major improvements to the way that windows coexist on a given screen? The Mac does get new under-the-hood features that are specific to it, but the headline features are mostly iOS and iPadOS imports, especially this year.\nI would absolutely love for Apple to rethink Finder! Having said that, the fact that this reviewer is down with Stage Manager on macOS despite how terrible I’ve heard it is on iOS is intriguing…\nStage Manager differs from standard macOS multitasking by offering a column of recently used apps on the side of your screen (it’s the left-hand side by default, but it will switch if you’ve got your Dock set to use the left-hand side of your screen instead). But unlike minimizing or maximizing an app from the Dock, each “stage” can contain multiple app windows from multiple apps; switch from one stage to another, and every window on that stage will pop back up on your screen in exactly the arrangement you were using before.\nIt’s off by default, thank goodness, but I would like to give this a try and see how it maps to my way of window/app management. Have you tried Stage Manager on macOS? What do you think? How does it compare to iOS?\nDiscuss on Changelog News",
          "link": "https://arstechnica.com/gadgets/2022/10/macos-13-ventura-the-ars-technica-review/",
          "publishedOn": "2022-10-25T14:27:00.000Z",
          "wordCount": null,
          "title": "The Ars Technica review of macOS 13 Ventura",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/PpZd",
          "author": "Jerod Santo",
          "description": "This looks a lot like the early days of Postman. Built with Vue.js.\n\nDiscuss on Changelog News",
          "link": "https://github.com/flawiddsouza/Restfox",
          "publishedOn": "2022-10-24T20:04:00.000Z",
          "wordCount": null,
          "title": "Restfox –an  offline-first web HTTP client",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1881",
          "author": null,
          "description": "Valerian Saliou’s Sonic search backend, Brandon Willett on how to build software like an SRE, DHH on why they’re leaving the cloud, Amos’ HTTP crash course nobody asked for & Sam Magura tells why he and the Spot team are breaking up with CSS-in-JS.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nThe Sonic search backend\nHow to build software like an SRE\nWhy we’re leaving the cloud\nThe HTTP crash course nobody asked for\nWhy We’re Breaking Up with CSS-in-JS\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-10-24",
          "publishedOn": "2022-10-24T17:55:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Sonic search, building software like an SRE, leaving the cloud, an HTTP crash course & breaking up with CSS-in-JS",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-10-24/the-changelog-news-2022-10-24.mp3",
            "length": "8086686",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/mlzy",
          "author": "Tw93",
          "description": "🏂 Fantastic – local use, security, syntax highlighting, dark mode, source file saving, international, presentation mode, PPT Mode, single edit mode, export file, internal jump, document auto typesetting, picture upload, LaTeX, Mermaid, PlantUML, Markmap.\n🎊 Beauty – minimalist design style, folder + file list + editor 3 column mode.\n🚄‍ Fast – using Swift5 native development, the performance experience is much better compared to the Web.\n🥛 Simple – very light, pure editor input experience, many shortcut keys to help you fast.\nDiscuss on Changelog News",
          "link": "https://miaoyan.app/",
          "publishedOn": "2022-10-24T15:09:00.000Z",
          "wordCount": null,
          "title": "MiaoYan - A markdown Mac note-taking app for engineers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Eq6D",
          "author": "Bruno Calza",
          "description": "This is a journey of how I, a developer unfamiliar with C, went down the rabbit hole of navigating the SQLite source and changed it to offer a capability that wasn’t available.\nDiscuss on Changelog News",
          "link": "https://brunocalza.me/making-a-change-to-sqlite-source-code/",
          "publishedOn": "2022-10-24T14:19:00.000Z",
          "wordCount": null,
          "title": "Making a change to SQLite source code",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/GWwW",
          "author": "Jerod Santo",
          "description": "Dendron founder, Kevin Lin:\nPMF is not just your only job but it is the job that only you, the startup founder, can do. Your investors can help introduce you to relevant people, successful founders can tell you how they found PMF, but ultimately, you are the only person that can determine PMF for your company.\nAnd don’t forget to talk your users along the way!\nDiscuss on Changelog News",
          "link": "https://www.kevinslin.com/notes/htchyy536bb169mzu47ksb6/",
          "publishedOn": "2022-10-24T13:33:00.000Z",
          "wordCount": null,
          "title": "Startup founders: your only real job is finding product market fit",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1854",
          "author": null,
          "description": "This week we’re talking with Will McGugan about using the terminal to not just build software, but also to deliver software. Will is a few months into his journey of building Textualize, a company he started around his open source projects Textual and Rich. When combined Textual and Rich give you a Python framework to build beautiful full-featured TUIs for the Terminal. We talk with Will about his big idea of the terminal as a platform, how he got here from first principles, what it takes to build Textual apps and whether or not they can replace not so good web admins, building, launching, and distributing Textual apps, why Python was his choiice of language, the big picture and business model behind Textualize, and why he’s building this as open source and in public.\nDiscuss on Changelog …",
          "link": "https://changelog.com/podcast/511",
          "publishedOn": "2022-10-21T22:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 511: The terminal as a platform",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/511/the-changelog-511.mp3",
            "length": "70432318",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1875",
          "author": null,
          "description": "What do Story of the Week, HeadLIES & Pro Tip Time have in common? They’re all games we play on this seriously ridiculous episode of JS Party!\nDiscuss on Changelog News\nChangelog++ members get a bonus 8 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSentry – Working code means happy customers. That’s exactly why teams choose Sentry. From error tracking to performance monitoring, Sentry helps teams see what actually matters, resolve problems quicker, and learn continuously about their applications - from the frontend to the backend. Use the code CHANGELOG and get the team plan free for three months.\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nFeaturing\nJerod Santo – Twitter, GitHub\nAmelia Wattenberger – Twitter, GitHub, Website\nAmal Hussein – Twitter, GitHub\nNick Nisi – Twitter, GitHub, Website\nNotes and Links\nStory of the Week\nThe Future of the Web is on the Edge\nBrave blocking annoying and privacy-harming cookie consent banners\nLinear’s website temporarily replaced with a Figma file\nHeadLIES\nApple’s Mixed Reality Headset to Offer Iris Scanning for Payments, Logging In\nThe US department of Veteran Affairs postpones rollout of electronic health record systems, developed by Oracle under a $50B contact, until 2030\nHeroku reverses course, plans to reintroduce free plans after facing community backlash\nDecentraland’s reported to have only has 38 Daily Active Users in their $1.3B Ecosystem\nMeta Avatar Legs Demo ‘Created By Motion Capture’, Not Live VR\nPro Tip Time\nNick: How I use git worktrees\nJerod: Get a Pi-hole!\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/248",
          "publishedOn": "2022-10-21T17:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 248: Fake legs till you make legs",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/248/js-party-248.mp3",
            "length": "59986826",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/2lRD",
          "author": "Jerod Santo",
          "description": "TLDR: AWS is super-expensive at scale.\nOf course it’s expensive to rent your computers from someone else. But it’s never presented in those terms. The cloud is sold as computing on demand, which sounds futuristic and cool, and very much not like something as mundane as “renting computers”, even though that’s mostly what it is.\nBut also:\nIt’s also about what kind of internet we want to operate in the future. It strikes me as downright tragic that this decentralized wonder of the world is now largely operating on computers owned by a handful of mega corporations. If one of the primary AWS regions go down, seemingly half the internet is offline along with it.\nMethinks this will become even more of a trend in the coming months and years.\nDiscuss on Changelog News",
          "link": "https://world.hey.com/dhh/why-we-re-leaving-the-cloud-654b47e0",
          "publishedOn": "2022-10-21T15:31:00.000Z",
          "wordCount": null,
          "title": "Why 37signals is leaving the cloud",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/O5Z7",
          "author": "Jerod Santo",
          "description": "This is one of those pieces of advice that is easy to say, but hard to do. Cedric Chin:\nThe only problem with this advice is that it’s trite — it sounds obvious; people don’t take it seriously; it’s a cliché. But it really isn’t any of those things, not if you’re actually trying to put it to practice. One of the more interesting things about focus is that you can see it in good operators, if you know how to look. But it happens to also be really difficult to do.\nInstead of articulating a fully-fleshed out theory of focus, I want to do something different here. I’m going to tell you a handful of stories. This should do more to illustrate the nature of focus in business than anything else that I can say. Let’s get started.\nSome good stories follow. I’ll just add that good ideas is just one category of things that focus means saying “no” to. Another major category is good opportunities.\nWhen you’re first getting started in your career, you are short on opportunities and long on time. But success breeds success. At a certain point, that relationship flips and you have more opportunities (actual, good ones) than you have time. Saying “no” to the wrong ones and “yes” to the right ones is another lesson in and of itself, but the same thing is in danger: your focus.\nDiscuss on Changelog News",
          "link": "https://commoncog.com/focus-saying-no-to-good-ideas/",
          "publishedOn": "2022-10-21T14:45:00.000Z",
          "wordCount": null,
          "title": "Focus is saying no to good ideas",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1809",
          "author": null,
          "description": "In this episode, we’re joined by tech Lawyer Luis Villa to explore the question, who owns code? The company, the engineer, the team? What about when you’re using AI, Machine learning, GitHub Copilot… is that still your code?\nDiscuss on Changelog News\nChangelog++ members save 4 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nLuis Villa – Twitter, LinkedIn, Website\nAngelica Hill – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nKris Brandow – Twitter, GitHub\nNotes and Links\nTidelift\nLuis’s new newsletter!\nNYTimes review of Dennis Duncan’s “Index, A History of the”\nThe Berne Convention for the Protection of Literary and Artistic Works\nGoogle LLC v. Oracle America, Inc.\nWhy Andy Warhol’s ‘Prince Series,’ the Subject of a Long-Term Copyright Dispute, Should Be Considered Fair Use After All\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/252",
          "publishedOn": "2022-10-20T16:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 252: Who owns our code?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/252/go-time-252.mp3",
            "length": "63953737",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/gwj6",
          "author": "Jerod Santo",
          "description": "Tomasz Cichociński:\nIt’s completely fine to deepen one technology or one programming language knowledge. It’s totally fine to just have a 9-5 job that pays the bills. But if you aim to level up, I’m highly recommending trying something new to broaden your perspective.\nIf you’re writing JavaScript, try some functional language like Elixir or ReScript. If you’re already familiar with high level, garbage collected languages, try something low level like Rust or even C/C++. Play with different concurrency model like coroutines or actor model.\nYou don’t need to change your job, you don’t need to ship products with it. Try to create something fun. You’ll thank yourself later.\nDiscuss on Changelog News",
          "link": "https://cichocinski.dev/blog/trying-new-programming-languages-helped-grow-software-engineer",
          "publishedOn": "2022-10-20T13:29:00.000Z",
          "wordCount": null,
          "title": "How trying new programming languages helped me grow as a software engineer",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6raZ",
          "author": "Adam Stacoviak",
          "description": "Is GitHub Copilot an AI parasite trained in the realms of fair use on pub­lic code any­where on the inter­net? Or, is it a much needed automation layer to all the reasons we open source in the first place?\nWhen I first wrote about Copi­lot, I said “I’m not wor­ried about its effects on open source.” In the short term, I’m still not wor­ried. But as I reflected on my own jour­ney through open source—nearly 25 years—I real­ized that I was miss­ing the big­ger pic­ture. After all, open source isn’t a fixed group of peo­ple. It’s an ever-grow­ing, ever-chang­ing col­lec­tive intel­li­gence, con­tin­u­ally being renewed by fresh minds. We set new stan­dards and chal­lenges for each other, and thereby raise our expec­ta­tions for what we can accom­plish.\nAmidst this grand alchemy, Copi­lot inter­lopes. Its goal is to arro­gate the energy of open-source to itself. We needn’t delve into Microsoft’s very check­ered his­tory with open source to see Copi­lot for what it is: a par­a­site.\nThe legal­ity of Copi­lot must be tested before the dam­age to open source becomes irrepara­ble. That’s why I’m suit­ing up.\nWhat are your thoughts on this investigation and “poten­tial law­suit” against GitHub Copi­lot?\nDiscuss on Changelog News",
          "link": "https://githubcopilotinvestigation.com/",
          "publishedOn": "2022-10-19T18:25:42.000Z",
          "wordCount": null,
          "title": "GitHub Copilot Investigation",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1703",
          "author": null,
          "description": "Few genuinely need a multi-cloud setup. There is plenty of advice out there which mostly boils down to don’t do it, you will be worse off. Vex.dev is a startup that provides APIs for video and audio streaming. The hard part is real-time combined with massive scale - think hundreds of thousands of concurrent connections. They achieve this by using a combination of Fly.io, AWS and GCP. Jason Carter, founder of Vex Communications, is joining us today to talk about the multi-cloud setup that vex.dev runs.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service ca…",
          "link": "https://changelog.com/shipit/75",
          "publishedOn": "2022-10-19T18:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 75: How vex.dev runs on AWS, Fly.io & GCP",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/75/ship-it-75.mp3",
            "length": "68754286",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/posts/2550",
          "author": "Jerod Santo",
          "description": "After reading Lucas da Costa’s Why deadlines are pointless and what to do instead, I agree with almost every point he makes, especially this one:\nIt’s about time we start calling deadlines by their real name: pressure\nLucas goes on to describe how deadlines can cause harm, can’t actually make people code faster, and so on. I agree with that too. But does that make them pointless? Not necessarily!\nSometimes a little pressure is just what the doctor ordered. Here’s what I mean by that.\nNote: Lucas’s article is written to software teams that are dedicated to a single product. This post is to a slightly different audience: those of us with many disparate things we could be working on at any given time. For that reason, I don’t believe his take on Parkinson’s Law  applies in this context. If yo…",
          "link": "https://changelog.com/posts/arbitrary-deadlines-are-actually-awesome",
          "publishedOn": "2022-10-19T18:05:30.000Z",
          "wordCount": null,
          "title": "Arbitrary deadlines are actually awesome",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDG3",
          "author": "Shekhar Gulati",
          "description": "It is just not about redundancy. In this post I cover how having more AZs mean you need fewer nodes to achieve higher availability.\nDiscuss on Changelog News",
          "link": "https://shekhargulati.com/2022/10/06/why-an-architecture-with-three-availability-zones-is-better-than-the-one-with-two-availability-zones/",
          "publishedOn": "2022-10-19T16:29:00.000Z",
          "wordCount": null,
          "title": "Why three Availability Zones are better than two",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5j98",
          "author": "Jerod Santo",
          "description": "This is an excellent deep-dive on error message best practices by Jenni Nadler from Wix:\nError messages are part of our daily lives online. Every time a server is down or we don’t have internet, or we forget to add some info in a form, we get an error message. “Something went wrong” is the classic. But what went wrong? What happened? And, most importantly, how can I fix it?\n\nDiscuss on Changelog News",
          "link": "https://scribe.rip/when-life-gives-you-lemons-write-better-error-messages-46c5223e1a2f",
          "publishedOn": "2022-10-19T15:29:00.000Z",
          "wordCount": null,
          "title": "When life gives you lemons, write better error messages",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LWJa",
          "author": "Adam Stacoviak",
          "description": "Rust is quite popular, but why? Emil Ernerfeldt, CTO of rerun.io, shares his thoughts in the subject.\nI believe Rust is the most important development in system programming languages since C. What is novel is not any individual feature (“Rust is not a particularly original language”), but the fact that so many amazing features have come together in one mainstream language.\nRust is not a perfect language (scroll down for my complaints!), but it’s so much nicer than anything else I’ve used.\nI’m not alone in loving Rust - Rust has been the most loved language in the Stack Overflow Developer Survey for seven years straight. So what are the features that make me love Rust so much?\nDiscuss on Changelog News",
          "link": "https://www.rerun.io/blog/why-rust",
          "publishedOn": "2022-10-18T21:17:52.000Z",
          "wordCount": null,
          "title": "Why Rust?",
          "itunes": {}
        },
        {
          "id": "changelog.com/12/1880",
          "author": null,
          "description": "The Open Podcast Prefix Project is a free and open source podcast prefix analytics service committed to open data and listener privacy. This hits close to home for us in a couple ways, so we invited the project’s creator, John Spurlock, Backstage to learn more about it.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJohn Spurlock – Twitter, GitHub, Website\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nJerod Santo – Twitter, GitHub\nNotes and Links\nop3.dev\nLivewire.io\nThe Podcast Index\npodcastindex.social\nThe new podcast namespace\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/backstage/25",
          "publishedOn": "2022-10-18T17:10:00.000Z",
          "wordCount": null,
          "title": "Backstage 25: Should we get down with OP3?",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/backstage/25/backstage-25.mp3",
            "length": "78326955",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/7Ya2",
          "author": "Jerod Santo",
          "description": "Zach Musgrave from Dolt reviews several case studies of performance problems they ran into while benchmarking Dolt DB to get row access to be as fast as MySQL.\nOh, and he also shares how to fix each problem, which is nice. 😉\nDiscuss on Changelog News",
          "link": "https://www.dolthub.com/blog/2022-10-14-golang-performance-case-studies/",
          "publishedOn": "2022-10-18T15:44:00.000Z",
          "wordCount": null,
          "title": "Go performance case studies",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mby0",
          "author": "Martin Heinz",
          "description": "Out-of-the-box, the Python standard library ships with many great libraries, some of which provide CLIs, allowing us to do many cool things directly from terminal without needing to even open a .py file.\nThis includes things like starting a webserver, opening a browser, parsing JSON files, benchmarking programs and many more, all of which we will explore in this article.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/83",
          "publishedOn": "2022-10-18T14:51:00.000Z",
          "wordCount": null,
          "title": "Python CLI tricks that don't require any code whatsoever",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1878",
          "author": null,
          "description": "People are starting to wake up to the fact that they have control and ownership over their data, and governments are moving quickly to legislate these rights. John K. Thomson has written a new book on the topic that is a must read! We talk about the new book in this episode along with how practitioners should be thinking about data exchanges, privacy, trust, and synthetic data.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJohn K. Thompson – Twitter, LinkedIn\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nUse the code podpracticalAI19 for 40% off of Data for All, along with all Manning products in all formats!!!\nData for All\nJohn’s other books:\n\nAnalytics Teams: Harnessing analytics and artificial intelligence for business improvement\nAnalytics: How to win with Intelligence\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/197",
          "publishedOn": "2022-10-18T14:05:00.000Z",
          "wordCount": null,
          "title": "Practical AI 197: Data for All",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/197/practical-ai-197.mp3",
            "length": "47705072",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": []
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/technology/ai/a-conversation-with-thomas-friedman-about-ai/",
          "author": null,
          "description": "Technology has an unmistakable impact on society — the way we work, learn and play have all changed significantly over the past decade. As SVP of Technology and Society, part of my work at Google is connecting people and ideas to help shape the future of our most ambitious technology and its impact on society, and to do it responsibly.\n\n\nAn important part of that is talking to and learning from experts in a variety of fields and disciplines. Recently I sat down with a brilliant friend, New York Times columnist and author Thomas L. Friedman, to compare notes and discuss some big questions on our minds.\n\n\n\n\nThomas Friedman and James Manyika in conversation at Google’s Bay View campus.\n\n\n\nWe had a lot to cover, as it had been a couple of years since our last such in-person conversation due to the pandemic. Much of our discussion focused on AI and how it affects society, but we also discussed what Tom has been observing, how we as a society shape technology, and why we think this moment in time is an inflection point akin to the printing press or the industrial revolution.\n\n\nTo close our conversation, I asked Tom what keeps him optimistic about the future. His answer reinforces my belief that getting technology right is a collective responsibility involving the whole of society — from open, honest conversations like this to better understand the opportunities and challenges, to defining policy, and responsibly creating new and societally-beneficial applications.\n\n\nI always learn something new when I have these conversations with Tom, and I’m excited to share more insights and dialogues on YouTube soon.\n\n\nVisit YouTubeto see more of James’ conversation with Thomas Friedman.",
          "link": "https://blog.google/technology/ai/a-conversation-with-thomas-friedman-about-ai/",
          "publishedOn": "2022-11-15T17:00:00.000Z",
          "wordCount": 961,
          "title": "A conversation with Thomas Friedman about AI"
        },
        {
          "id": "https://blog.google/inside-google/googlers/hear-what-googles-first-responsible-innovation-intern-learned/",
          "author": null,
          "description": "In 2018, we launched Google’s AI Principles to ensure we’re building AI that not only solves important problems and helps people in their daily lives, but also AI that is ethical, fair and safe. At the same time, we launched a central Responsible Innovation team to ensure the rest of Google is held accountable to these AI Principles. As the team grows, we continue to incorporate the perspectives and ideas of people from around the world — and this spring we welcomed our first intern, Lieke Dom. Lieke is based in Amsterdam, recently got her Master’s in Digital Business & Innovation, and is completing her Master’s in Applied Ethics.\n\n\nI sat down with Lieke to learn more about her experience so far, including how her educational career led her here and what she’s learned from the internship.\n…",
          "link": "https://blog.google/inside-google/googlers/hear-what-googles-first-responsible-innovation-intern-learned/",
          "publishedOn": "2022-11-14T16:00:00.000Z",
          "wordCount": 1512,
          "title": "Hear what Google’s first Responsible Innovation intern learned"
        },
        {
          "id": "https://blog.google/outreach-initiatives/sustainability/cop27-adaptation-efforts/",
          "author": null,
          "description": "Communities around the world are facing the effects of climate change — from devastating floods and wildfires to challenges around food security. As global leaders meet in Egypt for COP27, a key area of focus will be on how we can work together to address the climate change crisis and implement sustainable solutions. At Google, we’re investing in technologies that can help communities prepare for and respond to climate-related disasters and threats.\nTools to alert people and governments about immediate risks\nNatural disasters are increasing in frequency and intensity due to climate change. As part of our Crisis Response efforts, we're working to bring trusted information to people in critical moments to keep them safe and informed. To do so, we rely on the research and development of our A…",
          "link": "https://blog.google/outreach-initiatives/sustainability/cop27-adaptation-efforts/",
          "publishedOn": "2022-11-02T14:05:00.000Z",
          "wordCount": 1731,
          "title": "How we're using AI to help address the climate crisis"
        },
        {
          "id": "https://blog.google/technology/ai/ways-ai-is-scaling-helpful/",
          "author": null,
          "description": "I was first introduced to neural networks as an undergraduate in 1990. Back then, many people in the AI community were excited about the potential of neural networks, which were impressive, but couldn’t yet accomplish important, real-world tasks. I was excited, too! I did my senior thesis on using parallel computation to train neural networks, thinking we only needed 32X more compute power to get there. I was way off. At that time, we needed 1 million times as much computational power.\n\n\nA short 21 years later, with exponentially more computational power, it was time to take another crack at neural networks. In 2011, I and a few others at Google started training very large neural networks using millions of randomly selected frames from videos online. The results were remarkable. Without ex…",
          "link": "https://blog.google/technology/ai/ways-ai-is-scaling-helpful/",
          "publishedOn": "2022-11-02T14:00:00.000Z",
          "wordCount": 2299,
          "title": "3 ways AI is scaling helpful technologies worldwide"
        },
        {
          "id": "https://blog.google/technology/health/a-new-genome-sequencing-tool-powered-with-our-technology/",
          "author": null,
          "description": "Genome sequencing provides a more complete description of cells and organisms, allowing scientists to uncover serious genetic conditions such as the elevated risk for breast cancer or pulmonary arterial hypertension. While researching genomics has the potential to save lives and preserve people’s quality of life, it's incredibly challenging work.\nBack in January, we announced a partnership with PacBio, a developer of genome sequencing instruments, to further advance genomic technologies. Today, PacBio is introducing the Revio sequencing system, an instrument that runs on our deep learning technology, DeepConsensus. With DeepConsensus built right into Revio, researchers can quickly and accurately identify genetic variants that cause diseases.\nHow Google Health’s technology works\nGenome sequ…",
          "link": "https://blog.google/technology/health/a-new-genome-sequencing-tool-powered-with-our-technology/",
          "publishedOn": "2022-10-26T17:00:00.000Z",
          "wordCount": 964,
          "title": "A new genome sequencing tool powered with our technology"
        },
        {
          "id": "https://blog.google/technology/health/how-ai-can-help-in-the-fight-against-breast-cancer/",
          "author": null,
          "description": "In 2020, there were 2.3 million people diagnosed with breast cancer and 685,000 deaths globally. Early cancer detection is key to better health outcomes. But screenings are work intensive, and patients often find getting mammograms and waiting for results stressful.\nIn response to these challenges, Google Health and Northwestern Medicine partnered in 2021 on a clinical research study to explore whether artificial intelligence (AI) models can reduce the time to diagnosis during the screening process, narrowing the assessment gap and improving the patient experience. This work is among the first prospective randomized controlled studies for AI in breast cancer screening, and the results will be published in early 2023.\nBehind this work, are scientists and researchers united in the fight agai…",
          "link": "https://blog.google/technology/health/how-ai-can-help-in-the-fight-against-breast-cancer/",
          "publishedOn": "2022-10-21T17:00:00.000Z",
          "wordCount": 1465,
          "title": "How AI can help in the fight against breast cancer"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=20624",
          "author": "Daniel Stenberg",
          "description": "In the curl project, one of the holiest and most sacred rules is: we do not break the API or ABI Everything else is a matter of discussion. More features all the time We keep adding features and we do improvements at a rather high pace. So much that we actually rarely do a release … Continue reading connection filters in curl →",
          "link": "https://daniel.haxx.se/blog/2022/11/15/connection-filters-in-curl/",
          "publishedOn": "2022-11-15T22:35:06.000Z",
          "wordCount": 838,
          "title": "connection filters in curl"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20655",
          "author": "Daniel Stenberg",
          "description": "When setting up a TLS or QUIC connection, a client like curl needs a CA store in order to verify the certificate(s) the server provides in the TLS handshake. CA store A CA store is a fancy name for a number of certificates. Certificates for the Certificate Authorities (CAs) that a TLS client trusts. On … Continue reading curl’s new CA store cache →",
          "link": "https://daniel.haxx.se/blog/2022/11/11/curls-new-ca-store-cache/",
          "publishedOn": "2022-11-11T12:20:52.000Z",
          "wordCount": 826,
          "title": "curl’s new CA store cache"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20533",
          "author": "Daniel Stenberg",
          "description": "A new curl option was born: --url-query. How it started curl offered the -d / --data option already in its first release back in 1998. curl 4.0. A trusted old friend. curl also has some companion versions of this option that work slightly differently, but they all have the common feature that they append data … Continue reading Append data to the URL query →",
          "link": "https://daniel.haxx.se/blog/2022/11/10/append-data-to-the-url-query/",
          "publishedOn": "2022-11-10T09:13:15.000Z",
          "wordCount": 1014,
          "title": "Append data to the URL query"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20565",
          "author": "Daniel Stenberg",
          "description": "The last day of this edition of the HTTP workshop. Thursday November 3, 2022. A half day only. Many participants at the Workshop are going to continue their UK adventure and attend the IETF 115 in London next week. We started off the day with a deep dive into connection details. How to make connections … Continue reading thehttpworkshop2022-day3.txt →",
          "link": "https://daniel.haxx.se/blog/2022/11/03/thehttpworkshop2022-day3-txt/",
          "publishedOn": "2022-11-03T17:36:14.000Z",
          "wordCount": 653,
          "title": "thehttpworkshop2022-day3.txt"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20495",
          "author": "Daniel Stenberg",
          "description": "Day one was awesome. Now we take the next step. The missing people During the discussions today it was again noticeable that apart from some specific individuals we also lack people in the room from prominent “players” in this area such as Chrome developers or humans with closer knowledge of how larger content deliverer work … Continue reading Workshop season 5 episode 2 →",
          "link": "https://daniel.haxx.se/blog/2022/11/03/workshop-season-5-episode-2/",
          "publishedOn": "2022-11-02T23:14:15.000Z",
          "wordCount": 900,
          "title": "Workshop season 5 episode 2"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20538",
          "author": "Daniel Stenberg",
          "description": "The HTTP Workshop is an occasional gathering of HTTP experts and other interested parties to discuss the Web’s foundational protocol. The fifth HTTP Workshop is a three day event that takes place in Oxford, UK. I’m happy to say that I am attending this one as well, as I have all the previous occasions. This … Continue reading HTTP Workshop 2022 – day 1 →",
          "link": "https://daniel.haxx.se/blog/2022/11/02/http-workshop-2022-day-1/",
          "publishedOn": "2022-11-01T23:33:57.000Z",
          "wordCount": 853,
          "title": "HTTP Workshop 2022 – day 1"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20443",
          "author": "Daniel Stenberg",
          "description": "Welcome to another curl release. You know the drill… Numbers the 211th release2 changes56 days (total: 8,986)192 bug-fixes (total: 8,337)314 commits (total: 29,331)3 new public libcurl function (total: 91)1 new curl_easy_setopt() option (total: 300)0 new curl command line option (total: 248)74 contributors, 43 new (total: 2,733)42 authors, 17 new (total: 1,082)4 security fixes (total: 130)Bug … Continue reading 7.86.0 with WebSocket →",
          "link": "https://daniel.haxx.se/blog/2022/10/26/7-86-0-with-websocket/",
          "publishedOn": "2022-10-26T06:21:57.000Z",
          "wordCount": 1657,
          "title": "7.86.0 with WebSocket"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20153",
          "author": "Daniel Stenberg",
          "description": "I am happy to announce that curl receives funding from The Sovereign Tech Fund. This funding is directed towards three specific projects that we have identified as interesting and worthwhile to push forward as ways to improve curl and the life of curl users. This “investment” will fund two developers to work on curl over … Continue reading Funded curl improvements →",
          "link": "https://daniel.haxx.se/blog/2022/10/19/funded-curl-improvements/",
          "publishedOn": "2022-10-19T06:59:35.000Z",
          "wordCount": 1333,
          "title": "Funded curl improvements"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20422",
          "author": "Daniel Stenberg",
          "description": "tldr: we do not particular keep track nor document curl’s exact spec compliance. I cannot fathom how we could. Today, in October 2022, curl and libcurl combined consist of nearly 150,000 lines of source code (not counting blank lines). 19% of those are comments. This source code pile was carefully crafted with the sole purpose … Continue reading Deviating from specs →",
          "link": "https://daniel.haxx.se/blog/2022/10/18/deviating-from-specs/",
          "publishedOn": "2022-10-18T12:19:33.000Z",
          "wordCount": 1401,
          "title": "Deviating from specs"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-11-16T12:19:32.984Z",
          "wordCount": 1272,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-11-16T12:19:32.084Z",
          "wordCount": 887,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "author": null,
          "description": "In this blog, we discuss how we power real-time search for Tweets, Users, Direct Messages and more using Elasticsearch.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/stability-and-scalability-for-search",
          "publishedOn": "2022-11-15T12:19:55.911Z",
          "wordCount": 1710,
          "title": "Stability and scalability for search"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-11-12T12:18:20.065Z",
          "wordCount": 832,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-11-06T12:19:25.111Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-11-03T12:21:33.407Z",
          "wordCount": 2177,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-11-01T12:26:26.900Z",
          "wordCount": 1488,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "author": null,
          "description": "In this blog, we share how we adopted the CausalImpact package from Google on a Twitter edge network experiment to measure the impact of improving Twitter's latency on customer engagement and revenue.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/measuring-the-impact-of-twitter-network-latency-with-causalimpac",
          "publishedOn": "2022-10-22T12:22:27.968Z",
          "wordCount": 2253,
          "title": "Measuring the impact of Twitter network latency with CausalImpact"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-10-22T12:22:27.840Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "author": null,
          "description": "In this blog, we discuss how we approached migrating an exabyte of data to Google Cloud to make it easier for our Tweeps to analyze and visualize data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/scaling-data-access-by-moving-an-exabyte-of-data-to-google-cloud",
          "publishedOn": "2022-10-21T12:26:58.375Z",
          "wordCount": 1353,
          "title": "Scaling data access by moving an exabyte of data to Google Cloud"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": [
        {
          "id": "https://googleprojectzero.blogspot.com/2022/11/a-very-powerful-clipboard-samsung-in-the-wild-exploit-chain.html",
          "author": null,
          "description": "Maddie Stone, Project Zero\n\nNote: The three vulnerabilities discussed in this blog were all fixed in Samsung’s March 2021 release. They were fixed as CVE-2021-25337, CVE-2021-25369, CVE-2021-25370. To ensure your Samsung device is up-to-date under settings you can check that your device is running SMR Mar-2021 or later.\n\nAs defenders, in-the-wild exploit samples give us important insight into what attackers are really doing. We get the “ground truth” data about the vulnerabilities and exploit techniques they’re using, which then informs our further research and guidance to security teams on what could have the biggest impact or return on investment. To do this, we need to know that the vulnerabilities and exploit samples were found in-the-wild. Over the past few years there’s been tremendo…",
          "link": "https://googleprojectzero.blogspot.com/2022/11/a-very-powerful-clipboard-samsung-in-the-wild-exploit-chain.html",
          "publishedOn": "2022-11-04T15:50:00.000Z",
          "wordCount": 7556,
          "title": "A Very Powerful Clipboard: Analysis of a Samsung in-the-wild exploit chain"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/11/gregor-samsa-exploiting-java-xml.html",
          "author": null,
          "description": "By Felix Wilhelm, Project Zero\n\nEarlier this year, I discovered a surprising attack surface hidden deep inside Java’s standard library: A custom JIT compiler processing untrusted XSLT programs, exposed to remote attackers during XML signature verification. This post discusses CVE-2022-34169, an integer truncation bug in this JIT compiler resulting in arbitrary code execution in many Java-based web applications and identity providers that support the SAML single-sign-on standard. \nOpenJDK fixed the discussed issue in July 2022. The Apache BCEL project used by Xalan-J, the origin of the vulnerable code, released a patch in September 2022. \n\nWhile the vulnerability discussed in this post has been patched , vendors and users should expect further vulnerabilities in SAML.\n\nFrom a security resea…",
          "link": "https://googleprojectzero.blogspot.com/2022/11/gregor-samsa-exploiting-java-xml.html",
          "publishedOn": "2022-11-02T11:41:00.008Z",
          "wordCount": 4851,
          "title": "Gregor Samsa: Exploiting Java's XML Signature Verification"
        },
        {
          "id": "https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html",
          "author": null,
          "description": "By James Forshaw, Project Zero\n\nI've been spending a lot of time researching Windows authentication implementations, specifically Kerberos. In June 2022 I found an interesting issue number 2310 with the handling of RC4 encryption that allowed you to authenticate as another user if you could either interpose on the Kerberos network traffic to and from the KDC or directly if the user was configured to disable typical pre-authentication requirements.\n\nThis blog post goes into more detail on how this vulnerability works and how I was able to exploit it with only a bare minimum of brute forcing required. Note, I'm not going to spend time fully explaining how Kerberos authentication works, there's plenty of resources online. For example this blog post by Steve Syfuhs who works at Microsoft is a …",
          "link": "https://googleprojectzero.blogspot.com/2022/10/rc4-is-still-considered-harmful.html",
          "publishedOn": "2022-10-27T19:48:00.000Z",
          "wordCount": 4291,
          "title": "RC4 Is Still Considered Harmful"
        }
      ]
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47930",
          "author": "Dipika Bhattacharya",
          "description": "The MDN Web Docs team recently undertook a project to revamp and reorganize the “Contribution Docs”. These are all the pages on MDN that describe what’s what – the templates and page structures, how to perform a task on MDN, how to contribute to MDN, and the community guidelines to follow while contributing to this […]\nThe post Revamp of MDN Web Docs Contribution Docs appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/10/revamp-of-mdn-web-docs-contribution-docs/",
          "publishedOn": "2022-10-31T17:47:12.000Z",
          "wordCount": 939,
          "title": "Revamp of MDN Web Docs Contribution Docs"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=68721",
          "author": "Candy Ho",
          "description": "GitHub Mobile helps keep work going while you're going. Untether yourself from your office.",
          "link": "https://github.blog/2022-11-15-the-power-of-github-in-the-palm-of-your-hand/",
          "publishedOn": "2022-11-15T20:51:23.000Z",
          "wordCount": 868,
          "title": "The power of GitHub in the palm of your hand"
        },
        {
          "id": "https://github.blog/?p=68712",
          "author": "Ryan J. Salva",
          "description": "Reading code is a hugely important task for developers. That’s why we built GitHub’s new code search—to help developers search, navigate, and understand code written by them, their team, and the world.",
          "link": "https://github.blog/2022-11-15-a-better-way-to-search-navigate-and-understand-code-on-github/",
          "publishedOn": "2022-11-15T19:51:04.000Z",
          "wordCount": 829,
          "title": "A better way to search, navigate, and understand code on GitHub"
        },
        {
          "id": "https://github.blog/?p=68732",
          "author": "Mario Rodriguez",
          "description": "In July, we launched the general availability of GitHub Projects, and now we are excited to bring you even more features designed to make it easier to plan and track in the same place you build!",
          "link": "https://github.blog/2022-11-15-the-journey-of-your-work-has-never-been-clearer/",
          "publishedOn": "2022-11-15T18:50:57.000Z",
          "wordCount": 928,
          "title": "The journey of your work has never been clearer"
        },
        {
          "id": "https://github.blog/?p=68590",
          "author": "Ethan Dennis",
          "description": "GitHub Actions Importer helps you forecast, plan, and facilitate migrations from your current CI/CD tool to GitHub Actions.",
          "link": "https://github.blog/2022-11-10-introducing-github-actions-importer/",
          "publishedOn": "2022-11-10T17:00:19.000Z",
          "wordCount": 2486,
          "title": "Introducing GitHub Actions Importer"
        },
        {
          "id": "https://github.blog/?p=68650",
          "author": "Nik Molnar",
          "description": "We’re giving GitHub users 60 free hours each month on Codespaces. Learn what else we shipped for Codespaces at Universe this year.",
          "link": "https://github.blog/2022-11-10-whats-new-with-codespaces-from-github-universe-2022/",
          "publishedOn": "2022-11-10T16:00:16.000Z",
          "wordCount": 1604,
          "title": "What’s new with Codespaces from GitHub Universe 2022"
        },
        {
          "id": "https://github.blog/?p=68641",
          "author": "Thomas Dohmke",
          "description": "Veja o que estamos construindo para aprimorar a plataforma de desenvolvimento mais integrada e que permite que pessoas desenvolvedoras e empresas impulsionem a inovação com mais facilidade. Quinze anos atrás, estava sendo escrita a primeira linha de código para a construção do GitHub. Desde então, o objetivo tem sido equipar as pessoas desenvolvedoras com tudo […]",
          "link": "https://github.blog/2022-11-09-todas-as-novidades-do-github-universe-2022/",
          "publishedOn": "2022-11-09T17:49:49.000Z",
          "wordCount": 4436,
          "title": "Todas as novidades do GitHub Universe 2022"
        },
        {
          "id": "https://github.blog/?p=68631",
          "author": "Naytri Sramek",
          "description": "Investing in our open source future by supporting the maintainers of today.",
          "link": "https://github.blog/2022-11-09-an-open-source-economy-built-by-developers-for-developers/",
          "publishedOn": "2022-11-09T17:35:39.000Z",
          "wordCount": 1017,
          "title": "An open source economy–built by developers, for developers"
        },
        {
          "id": "https://github.blog/?p=68289",
          "author": "Thomas Dohmke",
          "description": "See what we're building to enhance the most integrated developer platform that allows developers and enterprises to drive innovation with ease.",
          "link": "https://github.blog/2022-11-09-everything-new-from-github-universe-2022/",
          "publishedOn": "2022-11-09T17:35:22.000Z",
          "wordCount": 4069,
          "title": "Everything new from GitHub Universe 2022"
        },
        {
          "id": "https://github.blog/?p=68464",
          "author": "Mala Kumar",
          "description": "Here's how nonprofits and the social sector are using open source to drive social good.",
          "link": "https://github.blog/2022-11-09-the-social-impact-of-open-source/",
          "publishedOn": "2022-11-09T16:29:48.000Z",
          "wordCount": 860,
          "title": "Understanding the social impact of open source technologies"
        },
        {
          "id": "https://github.blog/?p=68458",
          "author": "Mike Linksvayer",
          "description": "In 2022, governments and the policy community spent a lot of time thinking about open source. Here's what that means and why it matters.",
          "link": "https://github.blog/2022-11-09-open-source-government-policies/",
          "publishedOn": "2022-11-09T16:29:45.000Z",
          "wordCount": 888,
          "title": "The changing nature of governmental policies around open source"
        },
        {
          "id": "https://github.blog/?p=68442",
          "author": "Ashley Wolf",
          "description": "By our estimation at GitHub, over 30% of Fortune 100 companies have now implemented OSPOs. Here's what that means for open source.",
          "link": "https://github.blog/2022-11-09-why-companies-are-starting-ospos/",
          "publishedOn": "2022-11-09T16:29:27.000Z",
          "wordCount": 861,
          "title": "Why more companies are investing in open source program offices"
        },
        {
          "id": "https://github.blog/?p=68469",
          "author": "Justin Hutchings",
          "description": "We think a lot about a high-profile supply chain attack that might cause developers, teams, and organizations to lose trust in open source. That’s why we’re investing in new ways to protect the open source ecosystem.",
          "link": "https://github.blog/2022-11-09-improving-open-source-supply-chain-security/",
          "publishedOn": "2022-11-09T16:29:25.000Z",
          "wordCount": 973,
          "title": "The importance of improving supply chain security in open source"
        },
        {
          "id": "https://github.blog/?p=68474",
          "author": "Jessica Lord",
          "description": "We know that companies benefit from open source. That's why we’re making it easier for companies to financially support projects.",
          "link": "https://github.blog/2022-11-09-financial-sustainability-in-open-source/",
          "publishedOn": "2022-11-09T16:29:06.000Z",
          "wordCount": 1057,
          "title": "Bringing greater financial sustainability to open source communities"
        },
        {
          "id": "https://github.blog/?p=68534",
          "author": "Melody Mileski",
          "description": "GitHub Enterprise Server 3.7 is available now, including a single view of code risk, new forking and repository policies, and security enhancements to the management console.",
          "link": "https://github.blog/2022-11-08-github-enterprise-server-3-7-is-now-generally-available/",
          "publishedOn": "2022-11-08T17:37:58.000Z",
          "wordCount": 1561,
          "title": "GitHub Enterprise Server 3.7 is now generally available"
        },
        {
          "id": "https://github.blog/?p=68491",
          "author": "Mark Paulsen",
          "description": "Explore how GitHub Advanced Security can help address several of the OWASP Top 10 vulnerabilities",
          "link": "https://github.blog/2022-11-04-how-to-mitigate-owasp-vulnerabilities-while-staying-in-the-flow/",
          "publishedOn": "2022-11-04T15:30:16.000Z",
          "wordCount": 1248,
          "title": "How to mitigate OWASP vulnerabilities while staying in the flow"
        },
        {
          "id": "https://github.blog/?p=67968",
          "author": "Margaret Tucker",
          "description": "How GitHub advocated for developer interests at the US Copyright Office technical measures consultations",
          "link": "https://github.blog/2022-11-03-advocating-for-developers-to-the-us-copyright-office/",
          "publishedOn": "2022-11-03T16:00:28.000Z",
          "wordCount": 1235,
          "title": "Advocating for developers to the US Copyright Office"
        },
        {
          "id": "https://github.blog/?p=68413",
          "author": "Kylie Stradley",
          "description": "This post is the second part in a series about ActiveRecord::Encryption that shows how GitHub upgrades previously encrypted and unencrypted columns to ActiveRecord::Encryption.",
          "link": "https://github.blog/2022-11-03-how-github-converts-previously-encrypted-and-unencrypted-columns-to-activerecord-encrypted-columns/",
          "publishedOn": "2022-11-03T12:53:42.000Z",
          "wordCount": 2011,
          "title": "How GitHub converts previously encrypted and unencrypted columns to ActiveRecord encrypted columns"
        },
        {
          "id": "https://github.blog/?p=68350",
          "author": "Laura Paine",
          "description": "Developers creating Internet of Things software use a complex stack of software that needs to be custom built into their CI/CD platform. Arm is leveraging the simplicity and scalability of GitHub Actions with a native integration that will revolutionize IoT software development.",
          "link": "https://github.blog/2022-11-02-github-partners-with-arm-to-revolutionize-internet-of-things-software-development-with-github-actions/",
          "publishedOn": "2022-11-02T18:39:04.000Z",
          "wordCount": 2042,
          "title": "GitHub partners with Arm to revolutionize Internet of Things software development with GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=68396",
          "author": "Jakub Oleksy",
          "description": "In October, we experienced four incidents that resulted in degraded performance across GitHub services. This report also sheds light into an incident that impacted Codespaces in September.",
          "link": "https://github.blog/2022-11-02-github-availability-report-october-2022/",
          "publishedOn": "2022-11-02T16:00:33.000Z",
          "wordCount": 1836,
          "title": "GitHub Availability Report: October 2022"
        },
        {
          "id": "https://github.blog/?p=68363",
          "author": "Lee Reilly",
          "description": "It’s the moment you’ve all been waiting for. Are you ready?",
          "link": "https://github.blog/2022-11-01-game-off-2022-theme-announcement/",
          "publishedOn": "2022-11-01T20:37:41.000Z",
          "wordCount": 1126,
          "title": "Game Off 2022 theme announcement"
        },
        {
          "id": "https://github.blog/?p=68373",
          "author": "Ryan J. Salva",
          "description": "We will begin to introduce several new capabilities to GitHub Copilot in 2023 to continue delivering responsible innovation and true happiness at the keyboard.",
          "link": "https://github.blog/2022-11-01-preview-referencing-public-code-in-github-copilot/",
          "publishedOn": "2022-11-01T19:00:20.000Z",
          "wordCount": 721,
          "title": "Preview: referencing public code in GitHub Copilot"
        },
        {
          "id": "https://github.blog/?p=68358",
          "author": "Demetris Cheatham",
          "description": "We are pleased to announce the expansion of All In for Students! All In for Students introduces college students to open source and provides them with the education, technical training and career development to prepare them for a summer internship in tech.",
          "link": "https://github.blog/2022-11-01-all-in-for-students-expanding-the-next-generation-of-open-source-leaders/",
          "publishedOn": "2022-11-01T15:15:11.000Z",
          "wordCount": 923,
          "title": "All In for Students: expanding the next generation of open source leaders"
        },
        {
          "id": "https://github.blog/?p=68344",
          "author": "Hauwa Otori",
          "description": "A glimpse into the backgrounds and day-to-day work of several GitHub employees in cybersecurity roles.",
          "link": "https://github.blog/2022-10-31-creating-a-more-inclusive-security-research-field/",
          "publishedOn": "2022-10-31T17:09:47.000Z",
          "wordCount": 1613,
          "title": "Creating a more inclusive security research field"
        },
        {
          "id": "https://github.blog/?p=67492",
          "author": "Lee Reilly",
          "description": "Some seriously spooktacular open source games for the web, Windows, macOS, and Linux with all sorts of fun hacks for infinite lives, invulnerability, and playing with time.",
          "link": "https://github.blog/2022-10-29-thirteen-tiny-terrific-and-terrifying-games-to-hack-slay-and-play-this-halloween/",
          "publishedOn": "2022-10-29T07:01:32.000Z",
          "wordCount": 2110,
          "title": "13 tiny, terrific, and terrifying games to hack, slay, and play this Halloween 🧛🏻‍♀️"
        },
        {
          "id": "https://github.blog/?p=68269",
          "author": "Logan MacLaren",
          "description": "As we wrap up Cybersecurity Awareness Month, the GitHub bug bounty team is excited to spotlight one of the security researchers who participates in the GitHub Security Bug Bounty Program.",
          "link": "https://github.blog/2022-10-28-cybersecurity-spotlight-on-bug-bounty-researcher-ahacker1/",
          "publishedOn": "2022-10-28T18:34:58.000Z",
          "wordCount": 1100,
          "title": "Cybersecurity spotlight on bug bounty researcher @ahacker1"
        },
        {
          "id": "https://github.blog/?p=68231",
          "author": "Michelle Mannering",
          "description": "Hackatoberfest, hackathons, and open source contributions. It’s been a hectic month with so many community pull requests to all kinds of projects. So many in fact that we had to spend hours going through all the submissions for this blog post. We almost didn’t get it out before the end of October. Nevertheless, we are […]",
          "link": "https://github.blog/2022-10-28-release-radar-sept-2022/",
          "publishedOn": "2022-10-28T18:00:17.000Z",
          "wordCount": 1540,
          "title": "Release Radar · September 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=68178",
          "author": "Laura Lindeman",
          "description": "You can now build your agenda on GitHubUniverse.com! Whether you’re just getting started or you’re a seasoned industry professional, there’s a session for you.",
          "link": "https://github.blog/2022-10-27-choose-your-own-github-universe-2022-adventure/",
          "publishedOn": "2022-10-27T18:54:54.000Z",
          "wordCount": 2257,
          "title": "Choose your own GitHub Universe 2022 adventure"
        },
        {
          "id": "https://github.blog/?p=68189",
          "author": "Joseph Katsioloudes",
          "description": "The GitHub Security Lab provided office hours for open source projects looking to improve their security posture and reduce the risk of breach. Here’s what we learned and how you can also participate.",
          "link": "https://github.blog/2022-10-27-what-we-learned-from-the-security-labs-community-office-hours/",
          "publishedOn": "2022-10-27T15:00:42.000Z",
          "wordCount": 1539,
          "title": "What we learned from the Security Lab’s Community Office Hours"
        },
        {
          "id": "https://github.blog/?p=68183",
          "author": "Dawn Beatty",
          "description": "As GitHub continues to grow, our vision of being the home for all developers continues to materialize, expanding our progress, perspectives, and responsibility to the world.",
          "link": "https://github.blog/2022-10-27-diversity-inclusion-and-belonging-at-github-in-2022/",
          "publishedOn": "2022-10-27T13:13:22.000Z",
          "wordCount": 1114,
          "title": "Diversity, inclusion, and belonging at GitHub in 2022"
        },
        {
          "id": "https://github.blog/?p=68152",
          "author": "Chris Reddington",
          "description": "Explore how GitHub Enterprise can help you transform your software engineering organization and practices.",
          "link": "https://github.blog/2022-10-26-3-strategies-for-consolidating-your-toolkit-and-boosting-productivity/",
          "publishedOn": "2022-10-26T16:00:04.000Z",
          "wordCount": 2397,
          "title": "3 strategies for consolidating your toolkit and boosting productivity"
        },
        {
          "id": "https://github.blog/?p=68159",
          "author": "Kylie Stradley",
          "description": "You may know that GitHub encrypts your source code at rest, but you may not have known that we encrypt sensitive database columns as well. Read about our column encryption strategy and our decision to adopt the Rails column encryption standard.",
          "link": "https://github.blog/2022-10-26-why-and-how-github-encrypts-sensitive-database-columns-using-activerecordencryption/",
          "publishedOn": "2022-10-26T14:00:25.000Z",
          "wordCount": 1459,
          "title": "Why and how GitHub encrypts sensitive database columns using ActiveRecord::Encryption"
        },
        {
          "id": "https://github.blog/?p=68140",
          "author": "Zachary Steindler",
          "description": "The Sigstore GA means you can protect your software supply chain today with GitHub Actions, and will power new npm security capabilities in the near future.",
          "link": "https://github.blog/2022-10-25-why-were-excited-about-the-sigstore-general-availability/",
          "publishedOn": "2022-10-25T13:02:35.000Z",
          "wordCount": 1244,
          "title": "Why we’re excited about the Sigstore general availability"
        },
        {
          "id": "https://github.blog/?p=67825",
          "author": "Lee Reilly",
          "description": "Git Merge 2022 just wrapped up bringing the community together for 16 talks, three workshops, one Git Contributor Summit, and lots of great conversations over two days. Read on for more info, photos from the event, and all of the session recordings.",
          "link": "https://github.blog/2022-10-21-git-merge-2022-mission-report/",
          "publishedOn": "2022-10-21T16:00:11.000Z",
          "wordCount": 552,
          "title": "Git Merge 2022 – that’s a wrap! 🎬"
        },
        {
          "id": "https://github.blog/?p=67943",
          "author": "Lee Reilly",
          "description": "Save the date! Game Off returns on November 1 for it’s 10th year! 🎉",
          "link": "https://github.blog/2022-10-21-build-a-game-this-november-with-game-off-2022/",
          "publishedOn": "2022-10-21T07:30:25.000Z",
          "wordCount": 653,
          "title": "Build a game this November with Game Off 2022"
        },
        {
          "id": "https://github.blog/?p=67990",
          "author": "allthedoll",
          "description": "We’re always trying to improve the GitHub developer experience in meaningful ways, and we love learning from our customers. In the last several months we released several new fork capabilities, and we’re publishing revised fork documentation that gives more details with clearer explanations to make fork concepts easier to understand.",
          "link": "https://github.blog/2022-10-20-unboxing-fork-improvements-and-unwrapping-fork-docs/",
          "publishedOn": "2022-10-20T18:00:58.000Z",
          "wordCount": 1452,
          "title": "Unboxing fork improvements and unwrapping fork docs"
        },
        {
          "id": "https://github.blog/?p=67971",
          "author": "Amarilis Dias",
          "description": "GitHub Actions changed how developers automate workflows with GitHub. Today, we’re introducing a new navigation to manage your GitHub Actions experience, improving discoverability and accessibility as well as opening up future feature opportunities.",
          "link": "https://github.blog/2022-10-20-improving-navigation-for-github-actions/",
          "publishedOn": "2022-10-20T16:00:00.000Z",
          "wordCount": 1022,
          "title": "Improving navigation for GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=67904",
          "author": "Taylor Blau",
          "description": "Upgrade your local installation of Git, especially when cloning with --recurse-submodules from untrusted repositories, or if you use git shell interactive mode.",
          "link": "https://github.blog/2022-10-18-git-security-vulnerabilities-announced/",
          "publishedOn": "2022-10-18T17:11:45.000Z",
          "wordCount": 960,
          "title": "Git security vulnerabilities announced"
        },
        {
          "id": "https://github.blog/?p=67900",
          "author": "Hirsch Singhal",
          "description": "Fine-grained personal access tokens offer enhanced security to developers and organization owners, to reduce the risk to your data of compromised tokens.",
          "link": "https://github.blog/2022-10-18-introducing-fine-grained-personal-access-tokens-for-github/",
          "publishedOn": "2022-10-18T15:35:02.000Z",
          "wordCount": 1610,
          "title": "Introducing fine-grained personal access tokens for GitHub"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19875",
          "author": "Nubank Press",
          "description": "Nu Holdings reported a $7.8 million net profit in the quarter. Our full earnings report can be found on the Investor Relations website, but here we explain some of the key numbers.\nThe post Nu Holdings results for Q3 2022: growing strong and profitable appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nu-holdings-results-for-q3-2022-growing-strong-and-profitable/",
          "publishedOn": "2022-11-14T21:16:00.000Z",
          "wordCount": 3168,
          "title": "Nu Holdings results for Q3 2022: growing strong and profitable"
        },
        {
          "id": "https://building.nubank.com.br/?p=19855",
          "author": "Nubank Editorial",
          "description": "Ellen Kiss, the Director of our Center of Excellence in Design, hosted a prolific discussion about important topics in the design market.\nThe post Women Leaders Who Design appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/women-leaders-who-design/",
          "publishedOn": "2022-11-10T20:35:51.000Z",
          "wordCount": 4042,
          "title": "Women Leaders Who Design"
        },
        {
          "id": "https://building.nubank.com.br/?p=19717",
          "author": "Céu Balzano - Security Awareness Engineer Leader at Nubank",
          "description": "A look into the career of an Information Security Awareness Engineer at Nubank, the scope and importance of this role for any organization.\nThe post What is it like being an Information Security Awareness Engineer at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/information-security-awareness-engineer-at-nubank/",
          "publishedOn": "2022-11-07T12:48:24.000Z",
          "wordCount": 3489,
          "title": "What is it like being an Information Security Awareness Engineer at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19685",
          "author": "Nubank Editorial",
          "description": "The new building is now Nu’s largest space! The place is located at Vila Leopoldina neighborhood and can be used for events and trainings with large teams.\nThe post Nubank opens another office in Brazil, the third one in São Paulo appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/nubank-office-vila-leopoldina/",
          "publishedOn": "2022-11-04T20:59:14.000Z",
          "wordCount": 3012,
          "title": "Nubank opens another office in Brazil, the third one in São Paulo"
        },
        {
          "id": "https://building.nubank.com.br/?p=19661",
          "author": "BU Team",
          "description": "Behind the scenes of how we revolutionized the way people save money\nThe post How Nubank launched ‘Caixinhas’ appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/how-nubank-launched-caixinhas/",
          "publishedOn": "2022-11-03T22:01:42.000Z",
          "wordCount": 4226,
          "title": "How Nubank launched ‘Caixinhas’"
        },
        {
          "id": "https://building.nubank.com.br/?p=19626",
          "author": "Isabela Piccinini - Senior Data Scientist at Nubank",
          "description": "A mini guide on what are, why to use and how to perform reliable A/B testing experiments\nThe post A gentle and practical introduction to A/B tests appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/introduction-to-a-b-tests/",
          "publishedOn": "2022-10-28T17:48:44.000Z",
          "wordCount": 4684,
          "title": "A gentle and practical introduction to A/B tests"
        },
        {
          "id": "https://building.nubank.com.br/?p=19606",
          "author": "Nubank Editorial",
          "description": "The recognition of the employer branding in the Universum ranking comes with two other awards: Diversity in Practice (from Blend Edu) and the Respect Award (from Grupo Padrão).\nThe post Nubank is chosen as one of the most attractive companies for Brazilian students to work at in 2022 appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/one-of-the-most-attractive-companies-2022/",
          "publishedOn": "2022-10-26T16:41:53.000Z",
          "wordCount": 3114,
          "title": "Nubank is chosen as one of the most attractive companies for Brazilian students to work at in 2022"
        },
        {
          "id": "https://building.nubank.com.br/?p=19592",
          "author": "Jaqueline Duque - Senior Software Engineer at Nubank",
          "description": "One of the steps in Nubank's software engineering recruiting process are the algorithm exercises. Check out how they work and get a few tips on how to do well on these tests.\nThe post 8 tips to solve software engineering technical exercise for Nubank’s hiring process appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/tips-software-engineering-technical-exercise/",
          "publishedOn": "2022-10-21T20:11:57.000Z",
          "wordCount": 3525,
          "title": "8 tips to solve software engineering technical exercise for Nubank’s hiring process"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/customer-stories/how-oneweb-safeguarding-its-assets-hacker-community",
          "author": "Elizabeth Raffa",
          "description": "HackerOne sat down with Wendy Ng, Principal Cloud Security Architect at OneWeb, to talk about their experience with their private HackerOne bug bounty program.",
          "link": "https://www.hackerone.com/customer-stories/how-oneweb-safeguarding-its-assets-hacker-community",
          "publishedOn": "2022-11-15T16:00:00.000Z",
          "wordCount": 2007,
          "title": "How OneWeb is Safeguarding its Assets with the Hacker Community"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hacker-appreciation-month-badge-awards",
          "author": "HackerOne",
          "description": "Celebrating the accomplishments of hackers is something we want to do year-round. However, we decided we wanted to root Cyber Security Awareness mon",
          "link": "https://www.hackerone.com/hackerone-community-blog/hacker-appreciation-month-badge-awards",
          "publishedOn": "2022-11-04T15:30:21.000Z",
          "wordCount": 1579,
          "title": "Hacker Appreciation Month: Badge Awards"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hacker-afk-thearchangel",
          "author": "HackerOne",
          "description": "Today's hacker the_arch_angel \nJXoaT: What was your first experience with hacking growing up? \nthe_arch_angel: I actually didn't do any",
          "link": "https://www.hackerone.com/hackerone-community-blog/hacker-afk-thearchangel",
          "publishedOn": "2022-11-02T15:03:34.000Z",
          "wordCount": 1262,
          "title": "Hacker AFK: the_arch_angel"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/hacker-success-managers",
          "author": "jesse@hackerone.com",
          "description": "Intro to Hacker Success Managers \nEarlier this year, we released a blog that shared foundational changes on our Community Team. One of our goals",
          "link": "https://www.hackerone.com/hackerone-community-blog/hacker-success-managers",
          "publishedOn": "2022-10-27T16:30:54.000Z",
          "wordCount": 1377,
          "title": "Hacker Success Managers"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/making-things-right",
          "author": "HackerOne",
          "description": "Did you know HackerOne has had a Make It Right fund for years?\nOften, programs and hackers come to agreeable solutions on reports according to in",
          "link": "https://www.hackerone.com/hackerone-community-blog/making-things-right",
          "publishedOn": "2022-10-21T13:00:40.000Z",
          "wordCount": 900,
          "title": "Making Things Right"
        },
        {
          "id": "https://hackerone.com/hackerone-community-blog/meeting-mediation-team-h1-702",
          "author": "HackerOne",
          "description": "Hello world, we are the Mediation Team.\nFor those who don’t know what we do - we are here to help the ethical hacking community and custome",
          "link": "https://www.hackerone.com/hackerone-community-blog/meeting-mediation-team-h1-702",
          "publishedOn": "2022-10-18T15:28:58.000Z",
          "wordCount": 1031,
          "title": "Meeting the Mediation Team at H1-702"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/d308ee43c079",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/helping-vfx-studios-pave-a-path-to-the-cloud-d308ee43c079?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-15T17:03:55.000Z",
          "wordCount": null,
          "title": "Helping VFX studios pave a path to the cloud"
        },
        {
          "id": "https://medium.com/p/5067ac110bcd",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/new-series-creating-media-with-machine-learning-5067ac110bcd?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-11T17:26:39.000Z",
          "wordCount": null,
          "title": "New Series: Creating Media with Machine Learning"
        },
        {
          "id": "https://medium.com/p/b0b4ef3be3f6",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/machine-learning-for-fraud-detection-in-streaming-services-b0b4ef3be3f6?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-11T17:26:15.000Z",
          "wordCount": null,
          "title": "Machine Learning for Fraud Detection in Streaming Services"
        },
        {
          "id": "https://medium.com/p/2721924a2822",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/seeing-through-hardware-counters-a-journey-to-threefold-performance-increase-2721924a2822?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-09T23:47:03.000Z",
          "wordCount": null,
          "title": "Seeing through hardware counters: a journey to threefold performance increase"
        },
        {
          "id": "https://medium.com/p/6cb89b9ce296",
          "author": "Netflix Technology Blog",
          "description": "",
          "link": "https://netflixtechblog.com/consistent-caching-mechanism-in-titus-gateway-6cb89b9ce296?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-11-03T19:19:31.000Z",
          "wordCount": null,
          "title": "Consistent caching mechanism in Titus Gateway"
        },
        {
          "id": "https://medium.com/p/aaa2b41b800c",
          "author": "Netflix Technology Blog",
          "description": "by Jun He, Akash Dwivedi, Natallia Dzenisenka, Snehal Chennuru, Praneeth Yenugutala, Pawan Dixit",
          "link": "https://netflixtechblog.com/orchestrating-data-ml-workflows-at-scale-with-netflix-maestro-aaa2b41b800c?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-10-18T20:43:36.000Z",
          "wordCount": 2953,
          "title": "Orchestrating Data/ML Workflows at Scale With Netflix Maestro"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-october-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-review-october-2022",
          "publishedOn": "2022-10-26T17:27:47.000Z",
          "wordCount": null,
          "title": "Portfolio Review: October 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6824e355-3c12-4bc4-b165-f77d91860414_800x617.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}