{
  "sources": [
    {
      "title": "Google Online Security Blog",
      "feedUrl": "https://googleonlinesecurity.blogspot.com/atom.xml",
      "siteUrl": "http://security.googleblog.com/",
      "articles": [
        {
          "id": "http://security.googleblog.com/2022/09/use-after-freedom-miracleptr.html",
          "author": null,
          "description": "Posted by Adrian Taylor, Bartek Nowierski and Kentaro Hara on behalf of the MiraclePtr team \nMemory safety bugs are the most numerous category of Chrome security issues and we’re continuing to investigate many solutions – both in C++ and in new programming languages. The most common type of memory safety bug is the “use-after-free”. We recently posted about an exciting series of technologies designed to prevent these. Those technologies (collectively, *Scan, pronounced “star scan”) are very powerful but likely require hardware support for sufficient performance. \nToday we’re going to talk about a different approach to solving the same type of bugs. \nIt’s hard, if not impossible, to avoid use-after-frees in a non-trivial codebase. It’s rarely a mistake by a single programmer. Instead, one p…",
          "link": "http://security.googleblog.com/2022/09/use-after-freedom-miracleptr.html",
          "publishedOn": "2022-09-13T16:59:00.000Z",
          "wordCount": 1968,
          "title": "Use-after-freedom: MiraclePtr"
        },
        {
          "id": "http://security.googleblog.com/2022/09/fuzzing-beyond-memory-corruption.html",
          "author": null,
          "description": "Posted by Jonathan Metzman, Dongge Liu and Oliver Chang, Google Open Source Security Team \nRecently, OSS-Fuzz—our community fuzzing service that regularly checks 700 critical open source projects for bugs—detected a serious vulnerability (CVE-2022-3008): a bug in the TinyGLTF project that could have allowed attackers to execute malicious code in projects using TinyGLTF as a dependency.   \nThe bug was soon patched, but the wider significance remains: OSS-Fuzz caught a trivially exploitable command injection vulnerability. This discovery shows that fuzzing, a type of testing once primarily known for detecting memory corruption vulnerabilities in C/C++ code, has considerable untapped potential to find broader classes of vulnerabilities. Though the TinyGLTF library is written in C++, this vuln…",
          "link": "http://security.googleblog.com/2022/09/fuzzing-beyond-memory-corruption.html",
          "publishedOn": "2022-09-08T16:00:00.000Z",
          "wordCount": 1231,
          "title": "Fuzzing beyond memory corruption: Finding broader classes of vulnerabilities automatically"
        },
        {
          "id": "http://security.googleblog.com/2023/08/Announcing-Googles-Open-Source-Software-Vulnerability-Rewards-Program .html",
          "author": null,
          "description": "Posted by Francis Perron, Open Source Security Technical Program Manager\n\n\n\nToday, we are launching Google’s Open Source Software Vulnerability Rewards Program (OSS VRP) to reward discoveries of vulnerabilities in Google’s open source projects. As the maintainer of major projects such as Golang, Angular, and Fuchsia, Google is among the largest contributors and users of open source in the world. With the addition of Google’s OSS VRP to our family of Vulnerability Reward Programs (VRPs), researchers can now be rewarded for finding bugs that could potentially impact the entire open source ecosystem.\n\nGoogle has been committed to supporting security researchers and bug hunters for over a decade. The original VRP program, established to compensate and thank those who help make Google’s code mo…",
          "link": "http://security.googleblog.com/2023/08/Announcing-Googles-Open-Source-Software-Vulnerability-Rewards-Program .html",
          "publishedOn": "2022-08-30T11:01:00.002Z",
          "wordCount": 2355,
          "title": "Announcing Google’s Open Source Software Vulnerability Rewards Program"
        },
        {
          "id": "http://security.googleblog.com/2022/08/announcing-open-sourcing-of-paranoids.html",
          "author": null,
          "description": "Posted by Pedro Barbosa, Security Engineer, and Daniel Bleichenbacher, Software Engineer\nParanoid is a project to detect well-known weaknesses in large amounts of crypto artifacts, like public keys and digital signatures. On August 3rd 2022 we open sourced the library containing the checks that we implemented so far (https://github.com/google/paranoid_crypto). The library is developed and maintained by members of the Google Security Team, but it is not an officially supported Google product.\nWhy the Project?\nCrypto artifacts may be generated by systems with implementations unknown to us; we refer to them as “black boxes.” An artifact may be generated by a black-box if, for example, it was not generated by one of our own tools (such as Tink), or by a library that we can inspect and test usi…",
          "link": "http://security.googleblog.com/2022/08/announcing-open-sourcing-of-paranoids.html",
          "publishedOn": "2022-08-24T17:14:00.009Z",
          "wordCount": 2650,
          "title": "Announcing the Open Sourcing of Paranoid's Library"
        }
      ]
    },
    {
      "title": "Google Testing Blog",
      "feedUrl": "http://googletesting.blogspot.com/atom.xml",
      "siteUrl": "http://testing.googleblog.com/",
      "articles": []
    },
    {
      "title": "Changelog",
      "feedUrl": "https://changelog.com/feed",
      "siteUrl": "https://changelog.com/",
      "articles": [
        {
          "id": "changelog.com/1/1843",
          "author": null,
          "description": "This week on The Changelog we’re talking about Stable Diffusion, DALL-E, and the impact of AI generated art. We invited our good friend Simon Willison on the show today because he wrote a very thorough blog post titled, “Stable Diffusion is a really big deal.”\nYou may know Simon from his extensive contributions to open source software. Simon is a co-creator of the Django Web framework (which we don’t talk about at all on this show), he’s the creator of Datasette, a multi-tool for exploring and publishing data (which we do talk about on this show)…most of all Simon is a very insightful thinker, which he puts on display here on this episode. We talk from all the angles of this topic, the technical, the innovation, the future and possibilities, the ethical and the moral – we get into it all. …",
          "link": "https://changelog.com/podcast/506",
          "publishedOn": "2022-09-16T20:45:00.000Z",
          "wordCount": null,
          "title": "The Changelog 506: Stable Diffusion breaks the internet",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/506/the-changelog-506.mp3",
            "length": "74282049",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1839",
          "author": null,
          "description": "Austin Gil joins the show and KBall continues an old email correspondence about the JS community and growth. Then, the gang plays a round of TIL where Austin shares his learnings about the HTML capture attribute. Finally, Austin shares what it’s like to have a blog post blow up.\nDiscuss on Changelog News\nChangelog++ members save 9 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nDEX: Sort the Madness – Join our friends at Sentry for their upcoming developer experience conference called DEX: Sort the Madness. This event will be in-person in San Francisco AND virtual on September 28. This is a free conference by developers for developers where you’ll sort through the madness and look at ways to improve workflow productivity. Learn more and register\n\n    \nVercel – Vercel combines the best developer experience with an obsessive focus on end-user performance.  Our platform enables frontend teams to do their best work. Unlock a better frontend workflow today.\n\n    \nFly.io – Deploy your apps and databases close to your users. In minutes you can run your Ruby, Go, Node, Deno, Python, or Elixir app (and databases!) all over the world. No ops required. Learn more at fly.io/changelog and check out the speedrun in their docs.\n\n    \nHasura – Create dynamic high-performance GraphQL & REST APIs from your database(s) in minutes with granular authorization and caching baked in. All without touching your underlying database. Go from data to API in minutes. Get started for free at hasura.io/jsparty\n\n    \nFeaturing\nAustin Gil – Twitter, GitHub, LinkedIn, Website\nNick Nisi – Twitter, GitHub, Website\nKevin Ball – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nTIL: You can access a user’s camera with just HTML\nHN Link\nVideo Explainer\nObsidian\nObsidian Sample Plugin\nOODA Loop\nFunction Call podcast\nSubmit to Changelog News\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/jsparty/243",
          "publishedOn": "2022-09-16T17:30:00.000Z",
          "wordCount": null,
          "title": "JS Party 243: Smile! HTML can access your camera",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/243/js-party-243.mp3",
            "length": "64395571",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/kwby",
          "author": "Jerod Santo",
          "description": "So you got tired of AI just suggesting code edits, and now you want it to help you run code, too. Silly human, you have come to the right place. This will take five steps.\nThis gets an A+ for creativity. Fire up your shell, then launch Neovim. Then shell out with :VimShell to get back to where you started, but with Copilot suggestions.\nMy guess is the ergonomics of this are… bad. But a cool hack, regardless!\nDiscuss on Changelog News",
          "link": "https://github.com/maxwell-bland/copilot-in-the-terminal",
          "publishedOn": "2022-09-16T15:26:00.000Z",
          "wordCount": null,
          "title": "Hacking  GitHub Copilot in to the terminal",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/gwZG",
          "author": "Jerod Santo",
          "description": "This tool calls itself the “best RSS search experience you can find” but really, are there other RSS search experiences out there? The results are a little underwhelming at the moment, but I’m sharing it because RSS and I’m sure it’ll get better with more eyes/feeds on it. 👀\nDiscuss on Changelog News",
          "link": "https://github.com/dato-ai/dato.rss",
          "publishedOn": "2022-09-16T14:38:00.000Z",
          "wordCount": null,
          "title": "A search engine based on RSS feeds",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/X1Nk",
          "author": "Jerod Santo",
          "description": "Devon Zuegel draws a comparison that I would’ve never thought of:\nPirate crews developed a surprisingly similar approach to compensation in the 17th century. Just like many startups, they also balanced equity incentives with other mechanisms that would be familiar to a startup employee today, such as bonuses.\nThese surprising similarities offer an interesting frame through which we can reflect on why startup equity and bonuses are structured the way they are. We can learn a lot about the theory of compensation in modern companies by looking at how pirates designed incentives to organize and motivate their work.\nMaybe it’s time to stop hiring “frontend wizards” and start looking for “frontend pirates” instead, matey.\nDiscuss on Changelog News",
          "link": "https://devonzuegel.com/post/uncharted-waters-what-startups-can-learn-from-pirates-about-compensation",
          "publishedOn": "2022-09-16T13:48:00.000Z",
          "wordCount": null,
          "title": "What startups can learn from pirates about compensation",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1701",
          "author": null,
          "description": "Inbal Cohen, Product expert and Agile evangelist, joins Natalie & Angelica for a conversation about all things Agile. Inbal lays out some agile tips for Go devs, discusses if and how remote work changes things, describes some downsides of the methodology, and more.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square to dive into the docs, APIs, SDKs and to create your Square Developer account — tell them Changelog sent you.\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nInbal Cohen – Twitter, LinkedIn\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/247",
          "publishedOn": "2022-09-15T16:15:00.000Z",
          "wordCount": null,
          "title": "Go Time 247: Stay agile out there",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/247/go-time-247.mp3",
            "length": "59906758",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/5jrY",
          "author": "Jerod Santo",
          "description": "Dan Hollick nerds out on the history and anatomy of a QR code. This bit at the end is super cool:\nPerhaps the coolest thing about QR codes is that Denso Wave, the company that invented them, never exercised their patent and released the technology for free!\n\nDiscuss on Changelog News",
          "link": "https://typefully.com/DanHollick/qr-codes-T7tLlNi",
          "publishedOn": "2022-09-15T14:48:00.000Z",
          "wordCount": null,
          "title": "Ever wondered how a QR code works?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDoR",
          "author": "Alex Ellis",
          "description": "The title of this post is “Why I Love Go”, I saw it shared by Rob Pike (one of the founding team for Go). In the post David Yach talks about how productive interns can be with Go, writing substantial prototypes in a short period of time. That’s one of the reasons I like to use it for OSS container/networking projects and developer tools too.\nDiscuss on Changelog News",
          "link": "https://cloud.google.com/blog/products/application-modernization/why-david-yach-loves-go",
          "publishedOn": "2022-09-15T14:02:00.000Z",
          "wordCount": null,
          "title": "Why David Yach loves Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOLW",
          "author": "Jerod Santo",
          "description": "Jaun Diego covers some little known yet extremely useful APIs, such as the Page Visibility, Web Sharing, Broadcast ChanneI and Internationalization.\nDiscuss on Changelog News",
          "link": "https://www.smashingmagazine.com/2022/09/javascript-api-guide/",
          "publishedOn": "2022-09-15T13:13:00.000Z",
          "wordCount": null,
          "title": "JavaScript APIs you (probably) don’t know about",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1695",
          "author": null,
          "description": "In today’s Kaizen episode, we talk about shipping Adam’s Christmas present: chapter support for all Changelog episodes that we now publish. This feature was hard because there are many subtle differences in how the ID3 spec is implemented. Of course, once the PR shipped, there were other issues to solve, including an upgrade the world kind of scenario. Since Lars Wikman did all the heavy ID3 lifting, he is here with us too.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of …",
          "link": "https://changelog.com/shipit/70",
          "publishedOn": "2022-09-14T18:20:00.000Z",
          "wordCount": null,
          "title": "Ship It! 70: Kaizen! Four PRs, one big feature",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/70/ship-it-70.mp3",
            "length": "64690999",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/EqLQ",
          "author": "Jerod Santo",
          "description": "This nifty little web app lets you tour the history of a file on GitHub. The coolest part about it is that you don’t have to download or install anything! Just change the github.com part of the URL with github.githistory.xyz and you’re in action!\n\nDiscuss on Changelog News",
          "link": "https://githistory.xyz/",
          "publishedOn": "2022-09-14T13:23:01.000Z",
          "wordCount": null,
          "title": "Quickly browse the history of files in any git repo",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1841",
          "author": null,
          "description": "The new stable diffusion model is everywhere! Of course you can use this model to quickly and easily create amazing, dream-like images to post on twitter, reddit, discord, etc., but this technology is also poised to be used in very pragmatic ways across industry. In this episode, Chris and Daniel take a deep dive into all things stable diffusion. They discuss the motivations for the work, the model architecture, and the differences between this model and other related releases (e.g., DALL·E 2).\n\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAnnouncement blog post\nStable diffusion paper\nBlog post about the model from Marc Päpper\nStable Diffusion on Hugging Face\nHugging Face Diffusers library\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/193",
          "publishedOn": "2022-09-13T22:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 193: Stable Diffusion",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/193/practical-ai-193.mp3",
            "length": "42687303",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/49Y3",
          "author": "Jerod Santo",
          "description": "This is cool because portability. But also because you can embed it as a library in your Go projects. It’s not identical to jq in practice, though. Here’s a long list of differences between the two.\nDiscuss on Changelog News",
          "link": "https://github.com/itchyny/gojq",
          "publishedOn": "2022-09-13T21:01:00.000Z",
          "wordCount": null,
          "title": "A pure Go implementation of jq",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/qM7L",
          "author": "Jerod Santo",
          "description": "This is a nice round-up of some new(ish) HTML and JavaScript features related to forms. Now that Safari 16 is out, good stuff like requestSubmit and showPicker are looking pretty green!\nDiscuss on Changelog News",
          "link": "https://css-tricks.com/whats-new-with-forms-in-2022/",
          "publishedOn": "2022-09-13T20:12:00.000Z",
          "wordCount": null,
          "title": "What’s new with forms in 2022?",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/ZoAj",
          "author": "Jerod Santo",
          "description": "Hillel Wayne:\nI practice “weak TDD”, which just means “writing tests before code, in short feedback cycles”. This is sometimes derogatively referred to as “test-first”. Strong TDD follows a much stricter “red-green-refactor” cycle…\nTurns out I also practice “weak TDD” most of the time, but I didn’t know there was a (derogatory) term for it. In this post, Hillel lays out why he does weak TDD and why he doesn’t do strong TDD. Oh, and stick around to the end to learn why he thinks TDD hasn’t conquered the world…\nDiscuss on Changelog News",
          "link": "https://buttondown.email/hillelwayne/archive/i-have-complicated-feelings-about-tdd-8403/",
          "publishedOn": "2022-09-13T18:45:00.000Z",
          "wordCount": null,
          "title": "I have complicated feelings about TDD",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1A4",
          "author": "Jerod Santo",
          "description": "A lot of ink has been spilt over the years trying to elucidate the divide between junior and senior. Miłosz Piechocki makes the distinction this way:\nJunior Engineers care about writing Software. They value code quality, employ best practices, try to adopt cutting-edge technologies. They invest a lot of time into learning new technologies. To them, the ultimate goal is to create elegant, performant, maintainable software.\nSenior Engineers care about building Systems. To them, creating software is just one of the steps. First of all, they question whether the software needs to be built in the first place. They ask what problems would it solve and why it’s important to solve them. They inquire who will be using the software and on what scale. They think about where the software would run and how they’re going to monitor whether it’s working properly. They also decide how to measure whether the software is actually solving the problems it was supposed to solve.\nHe goes on to describe how hard it is to build Systems and lists activities that are part of that process.\nDiscuss on Changelog News",
          "link": "https://codewithstyle.info/software-vs-systems/",
          "publishedOn": "2022-09-13T15:03:00.000Z",
          "wordCount": null,
          "title": "What makes a senior engineer? Writing software vs building systems",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1840",
          "author": null,
          "description": "Jacob Kaplan-Moss writes up a hot take on software quality, Wilfred Hughes creates the diff tool he’s always wanted, Josh Collinsworth thinks React is only great at being popular, Jetpack’s Devbox project looks pretty cool & James Williams sets out to find the shortest URLs on the internet. Oh, and chapters are here!\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\n📥 Subscribe to Changelog Weekly\nAll Things Open 2022\nQuality is Systemic\n\n🎧 Jacobian on The Changelog #479\nDifftastic, the Fantastic Diff\n\nDifftastic\nDo things, tell people\nThe self-fulfilling prophecy of React\nDevbox\n\nJoin our community!\n🎧 Subscribe to Ship It!\nShortest URLs on the Internet\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-12",
          "publishedOn": "2022-09-12T18:30:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Quality is systemic, React is a self-fulfilling prophecy, Difftastic, Devbox & the shortest URLs on the web",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-12/the-changelog-news-2022-09-12.mp3",
            "length": "9777366",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1AJ",
          "author": "Jerod Santo",
          "description": "11ty creator Zach Leatherman recently released a standalone HTML serializer for generating markup for Web Components. Here’s what Zach had to say about it on Twitter:\nThis is an early preview and I welcome feedback! I think it’s a great way to build standards-based HTML-first components without JavaScript framework overhead 🙌🏻\nDiscuss on Changelog News",
          "link": "https://github.com/11ty/webc",
          "publishedOn": "2022-09-12T13:32:01.000Z",
          "wordCount": null,
          "title": "WebC is for single file Web Components",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEOD",
          "author": "Jerod Santo",
          "description": "Jacob Kaplan-Moss with a hot take on software quality:\nSoftware quality is more the result of a system designed to produce quality, and not so much the result of individual performance. That is: a group of mediocre programmers working with a structure designed to produce quality will produce better software than a group of fantastic programmers working in a system designed with other goals.\nWhat does he mean by “a system designed for quality”? Read on to see for yourself..\nDiscuss on Changelog News",
          "link": "https://jacobian.org/2022/sep/9/quality-is-systemic/",
          "publishedOn": "2022-09-09T21:30:00.000Z",
          "wordCount": null,
          "title": "Quality is systemic",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1837",
          "author": null,
          "description": "This week we’re joined by Jason Bosco, co-founder and CEO of Typesense — the open source Algolia alternative and the easier to use ElasticSearch alternative. For years we’ve used Algolia as our search engine, so we come to this conversation with skin in the game and the scars to prove it. Jason shared how he and his co-founder got started on Typesense, why and how they are “all in” on open source, the options and the paths developers can take to add search to their project, how Typesense compares to ElasticSearch and Algolia, he walks us through getting started, the story of Typesense Cloud, and why they have resisted Venture Capital.\nDiscuss on Changelog News\nChangelog++ members get a bonus 5 minutes at the end of this episode and zero ads. Join today!\nSponsors\nFly.io – Deploy your apps a…",
          "link": "https://changelog.com/podcast/505",
          "publishedOn": "2022-09-09T21:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 505: Typesense is truly open source search",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/505/the-changelog-505.mp3",
            "length": "77232672",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Eq5Q",
          "author": "Ciprian Dorin Craciun",
          "description": "When it comes to static sites, there are a myriad of solutions for authoring and compiling, but talk about hosting these static sites, and we are still in the early 2000s. I discuss the challenges one faces when hosting, and even make a proposal to solve some of these.\nDiscuss on Changelog News",
          "link": "https://notes.volution.ro/v1/2022/09/notes/b08118d8/",
          "publishedOn": "2022-09-09T20:41:00.000Z",
          "wordCount": null,
          "title": "Static site hosting hurdles",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/RdAG",
          "author": "Jerod Santo",
          "description": "Based on the excellent Gradio library that we’ve featured on Practical AI.\n\nDiscuss on Changelog News",
          "link": "https://github.com/AUTOMATIC1111/stable-diffusion-webui",
          "publishedOn": "2022-09-09T19:50:00.000Z",
          "wordCount": null,
          "title": "A web UI for Stable Diffusion",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1823",
          "author": null,
          "description": "Jerod, KBall & Nick “Holla!” at React India, share what we’re excited about these days, and then take up a KBall topic that goes off the rails but manages to climb back on them, power through, and end up in a good place.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRetool – The low-code platform for developers to build internal tools — Some of the best teams out there trust Retool…Brex, Coinbase, Plaid, Doordash, LegalGenius, Amazon, Allbirds, Peloton, and so many more – the developers at these teams trust Retool as the platform to build their internal tools. Try it free at retool.com/changelog\n\n    \nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash …",
          "link": "https://changelog.com/jsparty/242",
          "publishedOn": "2022-09-09T19:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 242: Seth Godin is the new Mark Twain",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/242/js-party-242.mp3",
            "length": "55725077",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/2/1802",
          "author": null,
          "description": "Egon Elbre and Roger Peppe join Mat for a conversation all about bloat (and how to avoid it). Expect talk of code bloat, binary bloat, feature bloat, and an even-more-bloated-than-usual unpopular opinion segment.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nFeaturing\nEgon Elbre – Twitter, GitHub, LinkedIn\nRoger Peppe – Twitter, GitHub\nMat Ryer – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nCUE lang\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/246",
          "publishedOn": "2022-09-08T17:30:00.000Z",
          "wordCount": null,
          "title": "Go Time 246: Avoiding bloat",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/246/go-time-246.mp3",
            "length": "61502972",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/X19k",
          "author": "Adam Stacoviak",
          "description": "The ideas behind WikiHouse remind me of the conversation we had with Marcin Jakubowski from Open Source Ecology early last year (changelog.fm/428).\nSustainable should be the new normal. Think global, manufacture local. It’s all open source.\nEverything is on GitHub (from what I can tell).\nDiscuss on Changelog News",
          "link": "https://www.wikihouse.cc/",
          "publishedOn": "2022-09-08T15:51:02.000Z",
          "wordCount": null,
          "title": "Open source, modular, wood based, zero carbon housing",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/mldE",
          "author": "Adam Stacoviak",
          "description": "Josh Collinsworth (an unapologetic React non-fan) writes on his blog about the ubiquity of React:\nI don’t know what the future of front-end looks like. Nobody really does. But it’s a very safe bet that React will continue to be the thing for a very long time.\nIf you’re learning front-end development in the hopes of getting a job, or trying to level up your career, and React is a knowledge gap for you, it seems like the safest bet you could make. React isn’t going anywhere anytime soon. That said, however…\nBut why does React remain on top?\nBecause we don’t always value the strongest choice as much as we value consensus. (In fact, you could make an argument that consensus is the strongest choice, in many ways.)\nReact keeps getting picked…because React keeps getting picked.\nBut there’s a ton more to unpack. Josh got into the details on the best choice for the job, covering: Performance, learning curve, bundle size, scalability, community and support, financial backing, hireability, and developer experience.\nShould I spoil it for you? Nah. Read Josh’s words for the full story.\nDiscuss on Changelog News",
          "link": "https://joshcollinsworth.com/blog/self-fulfilling-prophecy-of-react",
          "publishedOn": "2022-09-08T15:13:39.000Z",
          "wordCount": null,
          "title": "\"React isn't great at anything except being popular\"",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/dqGl",
          "author": "Jerod Santo",
          "description": "This was my favorite moment from our episode with Chris Coyier. I asked him what’s interesting in the frontend world these days and Chris went off for almost five minutes. His enthusiasm is contagious!\n\nDiscuss on Changelog News",
          "link": "https://youtu.be/YHC8jEgpVfk",
          "publishedOn": "2022-09-08T14:47:00.000Z",
          "wordCount": null,
          "title": "These new features will change how we write CSS",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1678",
          "author": null,
          "description": "Maybe it’s the Californian sun. Or perhaps it’s the time spent at Disney Studios, the home of the best stories. One thing is for sure: Taylor Dolezal is one of the happiest cloud native people that Gerhard knows.\nAs a former Lead SRE for Disney Studios, Taylor has significant hands-on experience running cloud native technologies in a large company. After a few years as a HashiCorp Developer Advocate, Taylor is now Head of End User Ecosystem at CNCF. In his current role, he is helping enable cloud native success for end-users like Boeing, Mercedes Benz & many others.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual da…",
          "link": "https://changelog.com/shipit/69",
          "publishedOn": "2022-09-08T14:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 69: The cloud native ecosystem",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/69/ship-it-69.mp3",
            "length": "73479460",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Qp8M",
          "author": "Jerod Santo",
          "description": "Here’s Natasha Lekh from Apify describing the project:\nThis project really is a culmination of 4 years of work trying to make the best library for web scraping in production. Web scraping is a very dynamic environment and what works today might not work tomorrow, so we at Apify had to go through a lot of trial and error to figure out the most reliable and convenient ways of crawling the web and scraping data. We hope that we finally cracked it and that now many developers will enjoy working with our new library and it will make their scrapers more reliable and time to production faster.\nI like how it starts with simple HTTP-based scraping, but can switch to browser-based automation when a site has JavaScript rendering. I don’t love the built-in proxy rotation features. Not because they’re bad, per se, but because they make spammers lives easier…\nDiscuss on Changelog News",
          "link": "https://crawlee.dev",
          "publishedOn": "2022-09-08T13:22:00.000Z",
          "wordCount": null,
          "title": "Crawlee is a web scraping & browser automation library for Node.js",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/5jMY",
          "author": "Jerod Santo",
          "description": "I don’t know how practical this font is, but I do know how cool this font is…\n\nDiscuss on Changelog News",
          "link": "https://github.com/IdreesInc/Monocraft",
          "publishedOn": "2022-09-07T15:40:00.000Z",
          "wordCount": null,
          "title": "A programming font based on the typeface used in Minecraft",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/lOdW",
          "author": "Jerod Santo",
          "description": "The Preact team dropped a new state management solution on us:\nSignals are a way of expressing state that ensure apps stay fast regardless of how complex they get. Signals are based on reactive principles and provide excellent developer ergonomics, with a unique implementation optimized for Virtual DOM.\nAdding Signals to your Preact app only adds 1.6kB to your bundle size. So what’s the big idea?\nThe main idea behind signals is that instead of passing a value directly through the component tree, we pass a signal object containing the value (similar to a ref). When a signal’s value changes, the signal itself stays the same. As a result, signals can be updated without re-rendering the components they’ve been passed through, since components see the signal and not its value. This lets us skip all of the expensive work of rendering components and jump immediately to the specific components in the tree that actually access the signal’s value.\nDiscuss on Changelog News",
          "link": "https://preactjs.com/blog/introducing-signals/",
          "publishedOn": "2022-09-07T14:47:00.000Z",
          "wordCount": null,
          "title": "The Preact team introduces Signals",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/pjdM",
          "author": "Jerod Santo",
          "description": "Julie Qiu, announcing Go’s new support for vulnerability management:\nGo provides tooling to analyze your codebase and surface known vulnerabilities. This tooling is backed by the Go vulnerability database, which is curated by the Go security team. Go’s tooling reduces noise in your results by only surfacing vulnerabilities in functions that your code is actually calling.\nThere’s a new govulncheck command you can/should install and run against your project. It surfaces only the vulnerabilities that actually affect you, which is awesome.\nGovulncheck is a standalone tool to allow frequent updates and rapid iteration while we gather feedback from users. In the long term, we plan to integrate the govulncheck tool into the main Go distribution.\nDiscuss on Changelog News",
          "link": "https://go.dev/blog/vuln",
          "publishedOn": "2022-09-07T13:49:00.000Z",
          "wordCount": null,
          "title": "Vulnerability management for Go",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1834",
          "author": null,
          "description": "AI is increasingly being applied in creative and artistic ways, especially with recent tools integrating models like Stable Diffusion. This is making some artists mad. How should we be thinking about these trends more generally, and how can we as practitioners release and license models anticipating human impacts? We explore this along with other topics (like AI models detecting swimming pools 😊) in this fully connected episode.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nAutomation and creativity\nGoodbye, humans: Call centers ‘could save $80b’ switching to AI\nDALL-E can now use AI to extend images as a human artist might\nAn AI-Generated Artwork Won First Place at a State Fair Fine Arts Competition, and Artists Are Pissed\nNation states and AI\nUndeclared pools in France uncovered by AI technology\nFrance reveals hidden swimming pools with AI, taxes them\nNvidia says U.S. government allows A.I. chip development in China\nForeign Affairs:  Spirals of Delusion - How AI Distorts Decision-Making and Makes Dictators More Dangerous\nResources\nOpen RAIL Licenses\nNormConf\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/192",
          "publishedOn": "2022-09-06T21:45:00.000Z",
          "wordCount": null,
          "title": "Practical AI 192: Licensing & automating creativity",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/192/practical-ai-192.mp3",
            "length": "43227790",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1835",
          "author": null,
          "description": "Martin Heinz thinks you should be using Python’s walrus operator, you probably believe some falsehoods about email, Carlos Fenollosa threw in the towel after self-hosting his email for 23 years & Leon is an open source personal assistant that can live on your server.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nSubscribe to Changelog Weekly!\nPython’s Walrus Operator\nEmail falsehoods\n\nThere’s only ONE way to validate\nNo more self-hosting\nLeon.ai\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-09-05",
          "publishedOn": "2022-09-06T21:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Python's :=, email falsehoods, no more self-hosting & Leon",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-09-05/the-changelog-news-2022-09-05.mp3",
            "length": "5348246",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/AXNj",
          "author": "Gerhard Lazu",
          "description": "If Nix seems too daunting, this might just be a great way to reap one of its benefits without getting lost in its complexity.\nDevbox is a command-line tool that lets you easily create isolated shells and containers. You start by defining the list of packages required by your development environment, and devbox uses that definition to create an isolated environment just for your application.\nDiscuss on Changelog News",
          "link": "https://github.com/jetpack-io/devbox",
          "publishedOn": "2022-09-06T16:00:00.000Z",
          "wordCount": null,
          "title": "Instant, easy, predictable shells and containers",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/LW05",
          "author": "Austin Gil",
          "description": "It’s cool to see the how far HTML has come. Every once in a while I find something that seems super powerful, wrapped up in a simple implementation. This time it was the HTML capture attribute.\nDiscuss on Changelog News",
          "link": "https://austingil.com/html-capture-attribute/",
          "publishedOn": "2022-09-06T15:13:00.000Z",
          "wordCount": null,
          "title": "TIL: You can access a user’s camera with just HTML",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/W1Ao",
          "author": "Adam Stacoviak",
          "description": "In the world of messaging (today), you have behemoths like WhatsApp and iMessage, and they are “backed by some of the richest companies in the world.” And then there’s Signal. It’s run by a nonprofit and pretty much operates as the exact opposite — they are committed to end-to-end encryption, does not collect or store sensitive information, or backups of user data.\nThis post from Nitasha Tiku on The Washington Post gives a detailed backstory on Meredith Whittaker, former Google manager, and her arrival to Signal as President (and board member since 2020), as well as why Signal “hopes to support itself with small donations from millions of users.”\nThe only way to escape technology that makes money off your data is by paying for products that don’t, Whittaker says. An alternative to data collection only exists if the community of people who rely on it “kick in a little bit,” she said.\nSignal is one of the few successful tech products, like the Firefox browser, led by vociferous critics of Big Tech. The app offers end-to-end encryption on group text, voice and video chat, does not collect or store sensitive information and does not store backups of your data on its servers — a viable alternative to relentless data gathering at the center of tech industry critiques.\nDiscuss on Changelog News",
          "link": "https://www.washingtonpost.com/technology/2022/09/06/signal-meredith-whittaker/",
          "publishedOn": "2022-09-06T14:26:29.000Z",
          "wordCount": null,
          "title": "Signal hired one of Big Tech’s sharpest critics and wants your donations",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1826",
          "author": null,
          "description": "This week we’re sharing the most popular episode of Go Time from last year — Go Time #196. We believe this episode was the most popular because it’s all about building actually maintainable software and what goes into that. Kris Brandow is joined by Johnny Boursiquot, Ian Lopshire, and Sam Boyer. There’s lots of hot takes, disagreements, and unpopular opinions.\nThis is part two of a three part mini-series led by Kris on maintenance. Make sure you check out Go Time #195 and Go Time #202 to continue the series.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nInfluxData – All of the open source software InfluxData creates is either MIT-licensed or Apache2-licensed. These are very permissive licenses. But wh…",
          "link": "https://changelog.com/podcast/504",
          "publishedOn": "2022-09-02T20:30:00.000Z",
          "wordCount": null,
          "title": "The Changelog 504: Building actually maintainable software ♻️",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/504/the-changelog-504.mp3",
            "length": "71870887",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/6/1811",
          "author": null,
          "description": "Dr. Gleb Bahmutov returns to the party for a wide-ranging discussion on open source, end-to-end testing, Cypress, and more. Amal, Divya & Chris host.\nDiscuss on Changelog News\nChangelog++ members save 7 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nRaygun – Never miss another mission-critical issue again — Raygun Alerting is now available for Crash Reporting and Real User Monitoring, to make sure you are quickly notified of the errors, crashes, and front-end performance issues that matter most to you and your business. Set thresholds for your alert based on an increase in error count, a spike in load time, or new issues introduced in the latest deployment. Start your free 14-day trial at Raygun.com\n\n    \nSquare – Develop on the platform that sellers trus…",
          "link": "https://changelog.com/jsparty/241",
          "publishedOn": "2022-09-02T16:45:00.000Z",
          "wordCount": null,
          "title": "JS Party 241: The doctor is in (again)",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/241/js-party-241.mp3",
            "length": "69056401",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Jgb2",
          "author": "Adam Stacoviak",
          "description": "Like many software engineers, Matt Bilyeu receives multiple emails from recruiters weekly. And, because he’s polite (and for other reasons) he tries to respond (politely) to all of them. But…\nIt would be ideal if I could automate sending these responses. Assuming I get four such emails per week and that it takes two minutes to read and respond to each one, automating this would save me about seven hours of administrative work per year.\nEnter the GPT-3 API and some code that gets run by a future cron job (now that he’s tested this on a handful of emails) and Matt auto-responds to al the emails, continues to be polite, while also saving (his) time. It’s AI Matt responding the way real Matt would.\nDiscuss on Changelog News",
          "link": "https://matthewbilyeu.com/blog/2022-09-01/responding-to-recruiter-emails-with-gpt-3",
          "publishedOn": "2022-09-02T16:36:08.000Z",
          "wordCount": null,
          "title": "Responding to recruiter emails with GPT-3",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Qp0E",
          "author": "Jerod Santo",
          "description": "This course from the folks at web.dev targets beginners and advanced developers alike.\nYou’ll learn PWA fundamentals like the Web App Manifest, service workers, how to design with an app in mind, what’s different from a classic web app, how to use other tools to test and debug your PWA. After these fundamentals, you’ll learn about integration with the platform and operating system, how to enhance your PWA’s installation and usage experience, and how to offer an offline experience.\nDiscuss on Changelog News",
          "link": "https://web.dev/learn/pwa/",
          "publishedOn": "2022-09-02T15:34:00.000Z",
          "wordCount": null,
          "title": "A course that breaks down every aspect of modern PWA development",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDdR",
          "author": "Jerod Santo",
          "description": "It’s easy to fool ourselves into believing the world is normal, sensible, and without rare-but-undeniably-valid edge and corner cases. Maybe you’ve done this to yourself with email. I’m guilty.\nOne example, we do email-based authentication (no passwords!) because I believe(d) this particular falsehood:\nEmails will be received soon after they’re sent\nI wish it were always true! Thankfully, there’s a lot of things on the linked list that I don’t believe. Do you?\nDiscuss on Changelog News",
          "link": "https://beesbuzz.biz/code/439-Falsehoods-programmers-believe-about-email",
          "publishedOn": "2022-09-02T14:40:00.000Z",
          "wordCount": null,
          "title": "Falsehoods programmers believe about email",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1671",
          "author": null,
          "description": "Ever wondered how GopherCon came to be, and how it’s put together every year. In this show we will be chatted with Erik St. Martin, who has been there from the start about how GopherCon came to be, how this year’s conference came together, as well as why events like GopherCon as so great!\nWe are joined by Erik St. Martin, GopherCon Organizer and Co-Author Go in Action.\nDiscuss on Changelog News\nChangelog++ members save 8 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at abo…",
          "link": "https://changelog.com/gotime/245",
          "publishedOn": "2022-09-01T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 245: Inside GopherCon",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/245/go-time-245.mp3",
            "length": "65013042",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/W19z",
          "author": "Jerod Santo",
          "description": "Simon Willison explains what it is:\nStable Diffusion is a new “text-to-image diffusion model” that was released to the public by Stability.ai six days ago, on August 22nd.\nIt’s similar to models like Open AI’s DALL-E, but with one crucial difference: they released the whole thing.\nAnd why it’s a really big deal:\nIn just a few days, there has been an explosion of innovation around it. The things people are building are absolutely astonishing.\nHe then details some of the innovation and it is staggering, to say the least. Open FTW!\nDiscuss on Changelog News",
          "link": "https://simonwillison.net/2022/Aug/29/stable-diffusion/",
          "publishedOn": "2022-09-01T14:58:00.000Z",
          "wordCount": null,
          "title": "Stable Diffusion is a really big deal",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/JgEA",
          "author": "Michael Guarino",
          "description": "Why do we think StatefulSets are broken? Well, if you run through the operational needs of a stateful workload in your head, there’s one key component that you might notice is missing:\nWhat do you do when you need to resize the underlying disk?\nThe dataset is a common database store that typically grows at a pretty constant positive rate. Unless you support horizontal scaling and partitioning, you’ll need to add headroom in the disk as that dataset grows.\nThis is where Kubernetes falls flat on its face.\nDiscuss on Changelog News",
          "link": "https://www.plural.sh/blog/kubernetes-statefulsets-are-broken-heres-why/",
          "publishedOn": "2022-09-01T14:07:00.000Z",
          "wordCount": null,
          "title": "Kubernetes StatefulSets are broken. Here's why",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/rXGy",
          "author": "Jerod Santo",
          "description": "This article isn’t arguing against writing user stories, it’s arguing against keeping user stories:\nIf you put the story in your icebox/backlog/cooler/hat, it’s time for it to go. It’s now duplicate documentation. That story was only there because you were yet to break it down into tasks. Now you have, so you delete it.\nI don’t mean tick it off as complete, I mean right-click on it and hit the ‘delete’ button.\nDiscuss on Changelog News",
          "link": "https://www.browserlondon.com/blog/2022/08/30/why-user-stories-belong-in-the-garbage/",
          "publishedOn": "2022-09-01T13:20:00.000Z",
          "wordCount": null,
          "title": "Why user stories belong in the garbage",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1704",
          "author": null,
          "description": "Most of you already know what it’s like to work in a startup or a small company. A few of you have been asking us for conversations with engineers that work for big companies, the kind that run everything from big title games to banking, and even critical national infrastructure.\nIn today’s episode, we talk to Ganeshkumar, a Software Engineer in the Azure Kubernetes Service team, who works on Node Lifecycle and Kubernetes Versioning, and Brendan, Kubernetes project co-founder and engineering Corporate Vice President of Microsoft Azure OSS and Cloud-native Compute. We talk about what it’s like to work for Microsoft, how mentoring works in practice, and what Kubernetes, Omega, & Borg have to do with it all.\nDiscuss on Changelog News\nChangelog++ members save 5 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nHoneycomb – Guess less, know more. When production is running slow, it’s hard to know where problems originate: is it your application code, users, or the underlying systems? With Honeycomb you get a fast, unified, and clear understanding of the one thing driving your business: production. Join the swarm and try Honeycomb free today at honeycomb.io/changelog\n\n    \nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFeaturing\nBrendan Burns – Twitter, GitHub\nGaneshkumar Ashokavardhanan – Twitter, GitHub, LinkedIn\nGerhard Lazu – Twitter, GitHub, Website\nNotes and Links\n📄 Borg, Omega, and Kubernetes - March, 2016\n🎬 How to use GitOps with Microsoft Azure - Brendan Burns - July, 2021\n🎬 Kubernetes: The Documentary - Part 1 - January, 2022\nEvent Grid on Kubernetes with Azure Arc\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/shipit/68",
          "publishedOn": "2022-08-31T21:15:00.000Z",
          "wordCount": null,
          "title": "Ship It! 68: Behind the scenes at Microsoft Azure",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/68/ship-it-68.mp3",
            "length": "70672639",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/ZoGe",
          "author": "Jerod Santo",
          "description": "Lane Wagner:\nThe ideas behind the DevOps movements undeniably changed the software development world for the better - but by now, the term “DevOps” has lost all meaning.\nAccording to Lane, some companies believe in DevOps ideas, but are unwilling to invest in changing their ways. Others aren’t convinced that some of the “scarier” ideas are all that helpful.\nDiscuss on Changelog News",
          "link": "https://wagslane.dev/posts/no-one-does-devops/",
          "publishedOn": "2022-08-31T20:07:00.000Z",
          "wordCount": null,
          "title": "DevOps: an idea so good, no one admits they don’t do it",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/V1Gm",
          "author": "Jerod Santo",
          "description": "Julia Evans shares five things you can do to getting better at debugging, which is a critical skill for everyone in tech! They are:\nlearn the codebase\nlearn the system\nlearn your tools\nlearn strategies\nget experience\nEach thing comes with an explanation and she shares a great quote at the end (from a paper she extracted these things from):\nTheir findings did not show a significant difference in the strategies employed by the novices and experts. Experts simply formed more correct hypotheses and were more efficient at finding the fault. The authors suspect that this result is due to the difference in the programming experience between novices and experts.\nDiscuss on Changelog News",
          "link": "https://jvns.ca/blog/2022/08/30/a-way-to-categorize-debugging-skills/",
          "publishedOn": "2022-08-31T19:21:00.000Z",
          "wordCount": null,
          "title": "Some ways to get better at debugging",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/6rpd",
          "author": "Martin Heinz",
          "description": "The assignment operator - or walrus operator as we all know it - is a feature that’s been in Python for a while now (since 3.8), yet it’s still somewhat controversial and many people have unfounded hate for it.\nIn this article I will try to convince you that the walrus operator really is a good addition to the language and that if you use it properly, then it can help you make your code more concise and readable.\nDiscuss on Changelog News",
          "link": "https://martinheinz.dev/blog/79",
          "publishedOn": "2022-08-31T14:12:00.000Z",
          "wordCount": null,
          "title": "Here's why you should be using Python's walrus operator",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/zDd5",
          "author": "Jerod Santo",
          "description": "maps.earth is a planet-scale installation of Headway, but you can easily set up your own server on a smaller scale for your own personal use by running just a few commands.\nThis is the first I’ve heard of Headway, but I love their mission:\nThe Headway Project was born out of a frustration with the need to send current and future location data to a corporation in order to figure out how we’re getting from A to B. Offline-only maps apps can be frustrating to use, and sometimes suffer from performance problems, poor data coverage, or other technical limitations.\nHeadway aims to remedy these issues by bundling industry-standard software into a web app that’s easy to set up for yourself or your friends. No need to send your location data to anyone you don’t trust, not even maps.earth.\nDiscuss on Changelog News",
          "link": "https://about.maps.earth/",
          "publishedOn": "2022-08-31T13:24:00.000Z",
          "wordCount": null,
          "title": "Open source maps for everyone 🗺",
          "itunes": {}
        },
        {
          "id": "changelog.com/7/1815",
          "author": null,
          "description": "In this Fully-Connected episode, Daniel and Chris discuss concerns of privacy in the face of ever-improving AI / ML technologies.  Evaluating AI’s impact on privacy from various angles, they note that ethical AI practitioners and data scientists have an enormous burden, given that much of the general population may not understand the implications of the data privacy decisions of everyday life.\nThis intentionally thought-provoking conversation advocates consideration and action from each listener when it comes to evaluating how their own activities either protect or violate the privacy of those whom they impact.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nGoogle’s Responsible AI Practices - Privacy\nWhat is Data De-identification and Why is It Important?\nHugging Face - Stable Diffusion Demo\nfloret: lightweight, robust word vectors\nUsing oneAPI with Intel® FPGAs Workshop\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/191",
          "publishedOn": "2022-08-30T19:20:00.000Z",
          "wordCount": null,
          "title": "Practical AI 191: Privacy in the age of AI",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/191/practical-ai-191.mp3",
            "length": "41928467",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/Y1GO",
          "author": "Jerod Santo",
          "description": "Tim Holman wants to take the web back to the wonderful days where knowing how to get your little mouse arrow to dance and sway was the most of your worries. That does sound nice, doesn’t it? “Emoji Rain” and the classic “Clock” are my favorites…\nDiscuss on Changelog News",
          "link": "https://tholman.com/cursor-effects/",
          "publishedOn": "2022-08-30T19:07:00.000Z",
          "wordCount": null,
          "title": "✨ 90's cursor effects ✨",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Mb0W",
          "author": "Jerod Santo",
          "description": "Having a smaller website makes it load faster — that’s not surprising.\nWhat is surprising is that a 14kB page can load much faster than a 15kB page — maybe 612ms faster — while the difference between a 15kB and a 16kB page is trivial.\nThe reason for this is because of how TCP works, which is nicely explained in the post. But is 14kB even a feasible reality? The author thinks so:\nThat 14kB includes compression — so it could actually be more like ~50kB of uncompressed data — which is generous. Consider that the Apollo 11 guidance computers only had 72kB of memory.\nOnce you lose the autoplaying videos, the popups, the cookies, the cookie consent banners, the social network buttons, the tracking scripts, javascript and css frameworks, and all the other junk nobody likes — you’re probably there.\nDiscuss on Changelog News",
          "link": "https://endtimes.dev/why-your-website-should-be-under-14kb-in-size/",
          "publishedOn": "2022-08-30T14:42:00.000Z",
          "wordCount": null,
          "title": "Why your website should be under 14kB in size",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/9lPa",
          "author": "Jerod Santo",
          "description": "Heyang Zhou:\nWe decoupled SQLite’s storage layer onto FoundationDB to offer massive yet “bottomless” scalability, point-in-time reads, and the strictest level of consistency.\nSQLite’s web renaissance marches on.\nDiscuss on Changelog News",
          "link": "https://univalence.me/posts/mvsqlite",
          "publishedOn": "2022-08-30T13:46:00.000Z",
          "wordCount": null,
          "title": "Turning SQLite into a distributed database",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1816",
          "author": null,
          "description": "Qalculate has a command-line interface, Alexander Neumann adds compression to Restic, Emery Berger warns his fellow CS professors about Copilot, and Heroku GM Bob Wise details Heroku’s next chapter (which excludes free accounts).\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nJerod Santo – Twitter, GitHub\nNotes and Links\nQalculate!\n‘qalc’ is awesome!\nRestic 0.14\nAlex Neumann on The Changelog #434\nCoping with Copilot\nHeroku’s Next Chapter\njoerick’s comment\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-29",
          "publishedOn": "2022-08-29T17:45:00.000Z",
          "wordCount": null,
          "title": "Changelog News: Qalculate is awesome, Restic adds compression, CS teachers coping with Copilot & Heroku's next non-free chapter",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-29/the-changelog-news-2022-08-29.mp3",
            "length": "8745013",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/GWqM",
          "author": "Jerod Santo",
          "description": "From Steve Schoger’s announcement tweet:\n🤩 All new look! 260 icons redrawn from scratch\nAvailable as first-party React and Vue libraries and official Figma components.\nThe React and Vue libraries are cool, but the coolest part about SVG-based icons is how you can simply copy/paste the HTML directly into your code.\nDiscuss on Changelog News",
          "link": "https://heroicons.com/",
          "publishedOn": "2022-08-29T14:31:00.000Z",
          "wordCount": null,
          "title": "Heroicons 2.0",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/eEoO",
          "author": "Jerod Santo",
          "description": "A very cool case study of Segment’s long journey to creating a product that people would actually pay money to use.\nBy now they burnt $500K and were left with only $100K. They wanted to tryout something for one last time with the $100K. One of their Co-Founders suggested that they try to productise their open source library. Peter, the Co-Founder & CEO didn’t like that idea at all. This open-source library had only 580 lines of code, compared to the other 2 products which had 100x more lines of code and a very grand vision on how to define an industry.\nSide note: what is this bip.so thing that’s hosting the content?!\nDiscuss on Changelog News",
          "link": "https://bip.so/@TIL_/How-Segment-Found-PMF-bDaLg",
          "publishedOn": "2022-08-29T13:42:00.000Z",
          "wordCount": null,
          "title": "How Segment found product-market fit",
          "itunes": {}
        },
        {
          "id": "changelog.com/1/1804",
          "author": null,
          "description": "This week we’re talking with Alex MacCaw — he’s well known for his work as founder and CEO of Clearbit. In May of 2021, Alex shared a personal update with the world on his blog. After much reflection, he decided to step down as CEO of Clerabit to go back to his roots. In his words, “I love the early stages of company building. Hacking together code, setting up the Stripe account, getting the first customer. That’s my jam.”\nWe talk with Alex about this portion of his journey at Clearbit, the Catamaran he bought in South Africa and then sailed across the Atlantic Ocean, and the new thing he’s building called Reflect that let’s you keep track of your notes, books, and meetings.\nDiscuss on Changelog News\nChangelog++ members get a bonus 4 minutes at the end of this episode and zero ads. Join to…",
          "link": "https://changelog.com/podcast/503",
          "publishedOn": "2022-08-27T23:00:00.000Z",
          "wordCount": null,
          "title": "The Changelog 503: Building Reflect at sea",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/503/the-changelog-503.mp3",
            "length": "81440046",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/1Wgw",
          "author": "Adam Stacoviak",
          "description": "Well, the end of Moore’s law has forced YouTube to make its own video chip. General purpose processors we’re cutting for the specialized task of video transcoding, and after a 10 minute meeting with YouTube chief Susan Wojcicki, the company’s first video chip project was approved.\nThe obvious motive for building your own chip for a specific purpose is cost savings, but that’s not always the case. In many instances, big tech companies are simply looking to create a strategic advantage with custom chips. Consolidation in the chip industry also plays into the equation, as there are now only a couple of custom chipmakers to choose from in a given category making general-purpose processors that aren’t great at specialized tasks.\nGoogle said the Argos VCUs delivered a performance boost of anywhere between 20 to 33 times compared to traditional server hardware running well-tuned transcoding software.\nDiscuss on Changelog News",
          "link": "https://www.techspot.com/news/95774-end-moore-law-forced-youtube-make-own-video.html",
          "publishedOn": "2022-08-27T21:49:06.000Z",
          "wordCount": null,
          "title": "YouTube now controls its hardware roadmap",
          "itunes": {}
        },
        {
          "id": "changelog.com/6/1806",
          "author": null,
          "description": "Tejas Kumar joins Jerod & KBall for a wide-ranging convo about React Suspense, human skills, and the four pillars of impact for web engineers. We also discuss the news in “Story of the Week” and give a few quick shout outs to a must-read book and a great new publishing platform for lead devs.\nJoin Tejas at React Brussels on October 14, 2022! Get 30% off your ticket when you use code JSPARTYTIME at checkout and follow @JSPartyFM on Twitter for giveaway details.\nDiscuss on Changelog News\nChangelog++ members get a bonus 2 minutes at the end of this episode and zero ads. Join today!\nSponsors\nSquare – Develop on the platform that sellers trust. There is a massive opportunity for developers to support Square sellers by building apps for today’s business needs. Learn more at changelog.com/square …",
          "link": "https://changelog.com/jsparty/240",
          "publishedOn": "2022-08-27T21:00:00.000Z",
          "wordCount": null,
          "title": "JS Party 240: Bringing the vibe",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/jsparty/240/js-party-240.mp3",
            "length": "58278157",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/D1y1",
          "author": "Adam Stacoviak",
          "description": "This is pure gold!\nAdd a single line to the /etc/pam.d/sudo file and BAM! You’re sudo’ing with TouchID or your Apple Watch. The only downside is this file is somewhat protected by macOS. When the OS updates, you might need to add the line back to the file. Other than that, it works perfectly!\n\nDiscuss on Changelog News",
          "link": "https://it.digitaino.com/use-touchid-to-authenticate-sudo-on-macos/",
          "publishedOn": "2022-08-27T20:47:25.000Z",
          "wordCount": null,
          "title": "Use TouchID to authenticate sudo on macOS",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/kwp2",
          "author": "Adam Stacoviak",
          "description": "Most of our audience knows that we operate on the mantra “Slow and steady wins,” and yet there’s lessons to be learned by reading a post adjudicating the need to “Move fast or die.” Let me explain…\nThere’s a key phrase that sets this post and its lessons apart from us here at Changelog Media — it’s “Here’s how we did it at Facebook.” Clearly, we are not Facebook, so we should not operate on advice that’s focused on Facebook. However, we can learn something.\nOf the the five lessons shared, each can be appreciated, but one in particular stands out.\nWe embraced asking for forgiveness, never for permission.\nThis, to me, is synonymous with “Hire people smarter than you,” because it assumes everyone can bring something to the table that former wisdom might not. It gives permission to try something new and see if something beautiful comes as a result. That’s a good thing.\nDiscuss on Changelog News",
          "link": "https://blog.southparkcommons.com/move-fast-or-die/",
          "publishedOn": "2022-08-27T18:49:15.000Z",
          "wordCount": null,
          "title": "Move fast or die",
          "itunes": {}
        },
        {
          "id": "changelog.com/2/1799",
          "author": null,
          "description": "In this episode, we’ll be further exploring PRs. Check out The art of the PR: Part 1 if you haven’t yet. What is it that makes a PR a good PR? How do you consider PRs in an open source repo? How do you vet contributions from people who aren’t a part of the repository? How does giving feedback and encouragement fit in to the PR process? We’ll be debating the details, and trying to help our fellow gophers perfect the art of the PR. We are joined by the awesome Anderson Queiroz, hosted by Natalie Pistunovich & Angelica Hill.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nSourcegraph – Transform your code into a queryable database to create customizable visual dashboards in seconds. Sourcegraph recently launched Code Insights — now you can track what really matters to you and your team in your codebase. See how other teams are using this awesome feature at about.sourcegraph.com/code-insights\n\n    \nFireHydrant – The reliability platform for every developer. Incidents impact everyone, not just SREs. FireHydrant gives teams the tools to maintain service catalogs, respond to incidents, communicate through status pages, and learn with retrospectives. Small teams up to 10 people can get started for free with all FireHydrant features included. No credit card required to sign up. Learn more at firehydrant.com/\n\n    \nChronosphere – Chronosphere is the observability platform for cloud-native teams operating at scale. When it comes to observability, teams need a reliable, scalable, and efficient solution so they can know about issues well before their customers do. Teams choose Chronosphere to help them move faster than the competition. Learn more and get a demo at chronosphere.io.\n\n    \nFeaturing\nAnderson Queiroz – Twitter, GitHub\nNatalie Pistunovich – Twitter, GitHub\nAngelica Hill – Twitter, GitHub\nNotes and Links\nThe art of the PR: Part 1\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/gotime/244",
          "publishedOn": "2022-08-27T16:00:00.000Z",
          "wordCount": null,
          "title": "Go Time 244: The art of the PR: Part 2",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/gotime/244/go-time-244.mp3",
            "length": "52759601",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/news/pjgV",
          "author": "Adam Stacoviak",
          "description": "It is a very good thing for Salesforce to be more focused on Heroku’s future, but the glaring detail shared by Bob Wise today is the era of free on Heroku is over.\nHere’s what they announced:\nThey launched an interactive product roadmap on GitHub\nThey are focusing on mission critical and will discontinue free product plans and delete inactive accounts\nThey are starting a program to support students and nonprofits\nThey will continue to contribute to open source projects, notably Cloud Native Buildpacks and offering Heroku credits to select open source projects through Salesforce’s Open Source Program Office (OSPO)\nDiscuss on Changelog News",
          "link": "https://blog.heroku.com/next-chapter",
          "publishedOn": "2022-08-25T21:30:13.000Z",
          "wordCount": null,
          "title": "Heroku's \"next chapter\" doesn't include free plans",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/jqX0",
          "author": "Adam Stacoviak",
          "description": "DuckDuckGo is extending their push for greater digital privacy to email protection with DuckDuckGo Email Protection. Here’s what they shared today on the official DuckDuckGo blog at spreadprivacy.com.\nDuckDuckGo Email Protection is a free email forwarding service that removes multiple types of hidden email trackers and lets you create unlimited unique private email addresses on the fly. You can use Email Protection with your current email provider and app – no need to update your contacts or juggle multiple accounts. Email Protection works seamlessly in the background to deliver your more-private emails right to your inbox.\nEmail tracking and spam is at an all time insanity level. As someone who gets a ton of email daily, most of which is noise and not signal, the problem of email tracking could not hit closer to home\nDiscuss on Changelog News",
          "link": "https://spreadprivacy.com/protect-your-inbox-with-duckduckgo-email-protection/",
          "publishedOn": "2022-08-25T21:07:00.000Z",
          "wordCount": null,
          "title": "DuckDuckGo Email Protection is now open to everyone",
          "itunes": {}
        },
        {
          "id": "changelog.com/news/Eq43",
          "author": "Adam Stacoviak",
          "description": "Lőrik Levente shared a real world comparrison between Tauri and Electron using a real application he’s building called Authme. The comparrison focused on all the major things you’d care about — Bundle size, startup time, performance, app backend, rendering your app, security, auto update, and developer experience.\nAlso, see this tweet from swyx.\nTauri vs Electron results are consistently mindblowing\nApp: 97% smaller\nSo, is Electron is being replaced? Lőrik says yes, but…\n\nDiscuss on Changelog News",
          "link": "https://www.levminer.com/blog/tauri-vs-electron",
          "publishedOn": "2022-08-25T20:56:00.000Z",
          "wordCount": null,
          "title": "Tauri vs Electron with a real world app",
          "itunes": {}
        },
        {
          "id": "changelog.com/14/1698",
          "author": null,
          "description": "A few weeks ago, Jerod spoke with Liz Rice about the power of eBPF on The Changelog. Today, we have the pleasure of both Liz Rice, Chief Open Source Office at Isovalent & Thomas Graf, CTO & co-founder at Isovalent, the creators of Cilium.\nAround 2014, Facebook achieved a 10x performance improvement by replacing their traditional load balancers with eBPF. In 2017, every single packet that went to Facebook was processed by eBPF. Nowadays, every Android phone is using it. Truth be told, if it’s network-related and it matters, eBPF is most likely a part of it.\nDiscuss on Changelog News\nChangelog++ members save 6 minutes on this episode because they made the ads disappear. Join today!\nSponsors\nDEX: Sort the Madness – Join our friends at Sentry for their upcoming developer experience conference …",
          "link": "https://changelog.com/shipit/67",
          "publishedOn": "2022-08-25T16:00:00.000Z",
          "wordCount": null,
          "title": "Ship It! 67: All your network are belong to eBPF",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/shipit/67/ship-it-67.mp3",
            "length": "71986265",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/7/1814",
          "author": null,
          "description": "Differentiating between what is real versus what is fake on the internet can be challenging.  Historically, AI deepfakes have only added to the confusion and chaos, but when labeled and intended for good, deepfakes can be extremely helpful.  But with all of the misinformation surrounding deepfakes, it can be hard to see the benefits they bring.  Lior Hakim, CTO at Hour One, joins Chris and Daniel to shed some light on the practical uses of deepfakes.  He addresses the AI technology behind deepfakes, how to make positive use of deep fakes such as breaking down communications barriers, and shares how Hour One specializes in the development of virtual humans for use in professional video communications.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nLior Hakim – LinkedIn, Website\nChris Benson – Twitter, GitHub, LinkedIn, Website\nDaniel Whitenack – Twitter, GitHub, Website\nNotes and Links\nHour One\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/practicalai/190",
          "publishedOn": "2022-08-24T15:00:00.000Z",
          "wordCount": null,
          "title": "Practical AI 190: Practical positive uses for deep fakes",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/practicalai/190/practical-ai-190.mp3",
            "length": "42329631",
            "type": "audio/mpeg"
          }
        },
        {
          "id": "changelog.com/1/1813",
          "author": null,
          "description": "Carlos Alexandro Becker shared some SSH tips, Sakun Acharige (a Comp Sci student + visual design enthusiast) created System.css, Felix Krause built a browser app that shows the JavaScript commands being executed by iOS app in-app browers, Yan Zhulanow decided to create Marta, and Lőrik Levente did a comparrison between Tauri & Electron using a real world application he’s building called Authme.\nDiscuss on Changelog News\nChangelog++ members support our work, get closer to the metal, and make the ads disappear. Join today!\nFeaturing\nAdam Stacoviak – Twitter, GitHub, LinkedIn, Website\nNotes and Links\nSubscribe to Changelog Weekly\nSubscribe to our YouTube Channel\nSSH Tips and Tricks\nSystem.css\niOS Privacy: Use InAppBrowser.com to see what JavaScript commands get injected through in-app browsers\nMar​ta - Native file manager for macOS\nTauri VS. Electron\nAuthme\nSomething missing or broken? PRs welcome!",
          "link": "https://changelog.com/podcast/news-2022-08-22",
          "publishedOn": "2022-08-22T20:00:00.000Z",
          "wordCount": null,
          "title": "Changelog News: SSH tips and tricks, retro Apple UIs, iOS Privacy and TikTok, Marta & Tauri vs Electron",
          "itunes": {},
          "enclosure": {
            "url": "https://cdn.changelog.com/uploads/podcast/news-2022-08-22/the-changelog-news-2022-08-22.mp3",
            "length": "9054804",
            "type": "audio/mpeg"
          }
        }
      ]
    },
    {
      "title": "comma.ai blog",
      "feedUrl": "https://blog.comma.ai/feed.xml",
      "siteUrl": "https://blog.comma.ai/",
      "articles": [
        {
          "id": "https://blog.comma.ai/0816release/",
          "author": null,
          "description": "Falcon Punch model and 200+ supported cars!",
          "link": "https://blog.comma.ai/0816release/",
          "publishedOn": "2022-08-26T00:00:00.000Z",
          "wordCount": 1205,
          "title": "openpilot 0.8.16"
        },
        {
          "id": "https://blog.comma.ai/ourfirstlawsuit/",
          "author": null,
          "description": "Notorious AV patent troll Axel Nix is at it again!",
          "link": "https://blog.comma.ai/ourfirstlawsuit/",
          "publishedOn": "2022-08-24T00:00:00.000Z",
          "wordCount": 667,
          "title": "Patent Trolls Inbound: Our First Lawsuit"
        }
      ]
    },
    {
      "title": "AI",
      "feedUrl": "https://blog.google/technology/ai/rss",
      "siteUrl": "https://blog.google/technology/ai/",
      "articles": [
        {
          "id": "https://blog.google/outreach-initiatives/google-org/our-commitment-on-using-ai-to-accelerate-progress-on-global-development-goals/",
          "author": null,
          "description": "I joined Google earlier this year to lead a new function: Technology & Society. Our aim is to help connect research, people and ideas across Google to shape the future of our technology innovations and their impact on society for the better. A key area of focus is AI, a field I have studied and immersed myself in over the years. I recently met with a team at the Google AI Center in Ghana that is using advanced technology to address an ancient problem: detecting locust outbreaks which threaten food security and livelihoods for millions of people. And in India and Bangladesh, our Crisis Response teams are using our machine-learning-based forecasting to provide over 360 million people with alerts about upcoming floods.\n\n\nEfforts like these make me optimistic about how AI can contribute to sol…",
          "link": "https://blog.google/outreach-initiatives/google-org/our-commitment-on-using-ai-to-accelerate-progress-on-global-development-goals/",
          "publishedOn": "2022-09-15T15:45:00.000Z",
          "wordCount": 1378,
          "title": "Our commitment on using AI to accelerate progress on global development goals"
        },
        {
          "id": "https://blog.google/technology/ai/join-us-in-the-ai-test-kitchen/",
          "author": null,
          "description": "As AI technologies continue to advance, they have the potential to unlock new experiences that support more natural human-computer interactions. We see a future where you can find the information you’re looking for in the same conversational way you speak to friends and family. While there’s still lots of work to be done before this type of human-computer interaction is possible, recent research breakthroughs in generative language models — inspired by the natural conversations of people — are accelerating our progress. One of our most promising models is called LaMDA (Language Model for Dialogue Applications), and as we move ahead with development, we feel a great responsibility to get this right.\n\n\nThat’s why we introduced an app called AI Test Kitchen at Google I/O earlier this year. It…",
          "link": "https://blog.google/technology/ai/join-us-in-the-ai-test-kitchen/",
          "publishedOn": "2022-08-25T16:00:00.000Z",
          "wordCount": 1407,
          "title": "Join us in the AI Test Kitchen"
        }
      ]
    },
    {
      "title": "daniel.haxx.se",
      "feedUrl": "https://daniel.haxx.se/blog/feed/",
      "siteUrl": "https://daniel.haxx.se/blog",
      "articles": [
        {
          "id": "https://daniel.haxx.se/blog/?p=20050",
          "author": "Daniel Stenberg",
          "description": "The dash-dash-libcurl is the sometimes missed curl gem that you might want to know about and occasionally maybe even use. How do I convert There is a very common pattern in curl land: a user who is writing an application using language L first does something successfully with the curl command line tool and then … Continue reading convert a curl cmdline to libcurl source code →",
          "link": "https://daniel.haxx.se/blog/2022/09/12/convert-a-curl-cmdline-to-libcurl-source-code/",
          "publishedOn": "2022-09-12T06:42:48.000Z",
          "wordCount": 828,
          "title": "convert a curl cmdline to libcurl source code"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20184",
          "author": "Daniel Stenberg",
          "description": "The other day I sent out this tweet As it took off, got an amazing attention and I received many different comments and replies, I felt a need to elaborate a little. To add some meat to this. Is this string really a legitimate URL? What is a URL? How is it parsed? http://http://http://@http://http://?http://#http:// curl … Continue reading http://http://http://@http://http://?http://#http:// →",
          "link": "https://daniel.haxx.se/blog/2022/09/08/http-http-http-http-http-http-http/",
          "publishedOn": "2022-09-08T11:43:08.000Z",
          "wordCount": 1121,
          "title": "http://http://http://@http://http://?http://#http://"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20145",
          "author": "Daniel Stenberg",
          "description": "This is a tale of cookies, Internet code and a CVE. It goes back a long time so please take a seat, lean back and follow along. The scene is of course curl, the internet transfer tool and library I work on. 1998 In October 1998 we shipped curl 4.9. In 1998. Few people had … Continue reading A bug that was 23 years old or not →",
          "link": "https://daniel.haxx.se/blog/2022/09/05/a-bug-that-was-23-years-old-or-not/",
          "publishedOn": "2022-09-05T06:31:03.000Z",
          "wordCount": 2012,
          "title": "A bug that was 23 years old or not"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20025",
          "author": "Daniel Stenberg",
          "description": "Every human has a unique fingerprint. With only an impression of a person’s fingertip, it is possible to follow the lead back to the single specific individual wearing that unique pattern. TLS fingerprints The phrase TLS fingerprint is of course in this spirit. A pattern in a TLS handshake that allows an involved party to … Continue reading curl’s TLS fingerprint →",
          "link": "https://daniel.haxx.se/blog/2022/09/02/curls-tls-fingerprint/",
          "publishedOn": "2022-09-02T11:46:17.000Z",
          "wordCount": 1490,
          "title": "curl’s TLS fingerprint"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=20102",
          "author": "Daniel Stenberg",
          "description": "Welcome to a new curl release, the result of a slightly extend release cycle this time. Release presentation Numbers the 210th release3 changes65 days (total: 8,930)165 bug-fixes (total: 8,145)230 commits (total: 29,017)0 new public libcurl function (total: 88)2 new curl_easy_setopt() option (total: 299)0 new curl command line option (total: 248)79 contributors, 38 new (total: 2,690)44 … Continue reading curl 7.85.0 for you →",
          "link": "https://daniel.haxx.se/blog/2022/08/31/curl-7-85-0-for-you/",
          "publishedOn": "2022-08-31T06:34:35.000Z",
          "wordCount": 1282,
          "title": "curl 7.85.0 for you"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19985",
          "author": "Daniel Stenberg",
          "description": "A little over a year ago, we ditched Travis CI as a service to use for the curl project. Up until that day, it had been our preferred and favored CI service for many years. At most, we ran 34 CI jobs on it, for every pull-request and commit. It was the service that we … Continue reading The Travis separation a year later →",
          "link": "https://daniel.haxx.se/blog/2022/08/27/the-travis-separation-a-year-later/",
          "publishedOn": "2022-08-27T12:59:35.000Z",
          "wordCount": 984,
          "title": "The Travis separation a year later"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19949",
          "author": "Daniel Stenberg",
          "description": "In June of 2022 we intended to run the curl up 2022 curl conference in person, in California. Unfortunately, I had the bad taste of catching covid exactly when I was about to use my new US visa for the first time, so I had to remain at home and because of that we cancelled … Continue reading curl up 2022 take 2 →",
          "link": "https://daniel.haxx.se/blog/2022/08/26/curl-up-2022-take-2/",
          "publishedOn": "2022-08-26T07:39:08.000Z",
          "wordCount": 609,
          "title": "curl up 2022 take 2"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19725",
          "author": "Daniel Stenberg",
          "description": "I get this question fairly often. How would the projects I run manage if I took off? And really, the primary project people think of then is of course curl. How would the curl project manage if I took a forever vacation starting now? Of course I don’t know that. We can’t really know for … Continue reading What if I vanished? →",
          "link": "https://daniel.haxx.se/blog/2022/08/24/what-if-i-vanished/",
          "publishedOn": "2022-08-24T08:48:11.000Z",
          "wordCount": 1206,
          "title": "What if I vanished?"
        },
        {
          "id": "https://daniel.haxx.se/blog/?p=19793",
          "author": "Daniel Stenberg",
          "description": "Recently I have received curious questions from users, customers and bystanders. Can you explain the seemingly increased CVE activity in curl over like the last year or so? (data and stats for this post comes mostly from the curl dashboard) Frequency In 2022 we have already had 14 CVEs reported so far, and we will … Continue reading Increased CVE activity in curl? →",
          "link": "https://daniel.haxx.se/blog/2022/08/22/increased-cve-activity-in-curl/",
          "publishedOn": "2022-08-22T06:22:50.000Z",
          "wordCount": 2395,
          "title": "Increased CVE activity in curl?"
        }
      ]
    },
    {
      "title": "English (US)",
      "feedUrl": "https://blog.twitter.com/engineering/en_us/blog.rss",
      "siteUrl": "https://blog.twitter.com/engineering/en_us",
      "articles": [
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "author": null,
          "description": "In this blog, we share details about how we built an in-house product called Qurious, which allows our internal customers to get answers to their analytical queries through natural language questions.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/next-generation-data-insights-using-natural-language-queries",
          "publishedOn": "2022-09-16T12:21:13.565Z",
          "wordCount": 2037,
          "title": "Next generation data insights using natural language queries"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "author": null,
          "description": "In this blog, we share an overview of Twitter’s Druid ecosystem and discuss our work towards a unified ingestion experience.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/powering-real-time-data-analytics-with-druid-at-twitter",
          "publishedOn": "2022-09-15T12:25:53.281Z",
          "wordCount": 1274,
          "title": "Powering real-time data analytics with Druid at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "author": null,
          "description": "In this post, we share how Twitter implemented a Data Quality Platform that gave customers the ability to have automated data quality checks.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-quality-automation-at-twitter",
          "publishedOn": "2022-09-15T12:25:53.255Z",
          "wordCount": 884,
          "title": "Data Quality Automation at Twitter"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "author": null,
          "description": "In this blog, we share findings from a follow-up analysis in which we seek to understand how prompts cause people to reconsider potentially harmful or offensive content before they hit send.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/reconsidering-tweets",
          "publishedOn": "2022-09-11T12:19:47.586Z",
          "wordCount": 818,
          "title": "Reconsidering Tweets"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "author": null,
          "description": "Twitter’s new Thrift library is an open-source, standalone, lightweight, data encoding library. In this blog, we share our library so iOS developers outside Twitter can start using Thrift data.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/open-source/2022/introducing-twitter-apache-thrift",
          "publishedOn": "2022-09-10T12:19:12.238Z",
          "wordCount": 982,
          "title": "Introducing a new Swift package for Apache Thrift"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "author": null,
          "description": "On the Data Science team, a piece of our job is understanding how conversations are happening on Twitter. In this blog, we use Wordle as a case study to showcase how we think about similar analyses.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/understanding-twitter-conversations--a-wordle-case-study",
          "publishedOn": "2022-09-05T12:21:05.314Z",
          "wordCount": 1327,
          "title": "Understanding Twitter conversations: A Wordle case study"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "author": null,
          "description": "In this blog post, we talk about a performance and stability problem we encountered while migrating Manhattan's storage engine to RocksDB and how we solved it.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/data-transfer-in-manhattan-using-rocksdb",
          "publishedOn": "2022-09-04T12:19:42.494Z",
          "wordCount": 1603,
          "title": "Data transfer in Manhattan using RocksDB"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "author": null,
          "description": "Over-squashing is a common plight of Graph Neural Networks. In this post, we discuss how this phenomenon can be understood and remedied through the concept of Ricci curvature.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/over-squashing--bottlenecks--and-graph-ricci-curvature",
          "publishedOn": "2022-09-01T12:20:12.078Z",
          "wordCount": 2189,
          "title": "Over-squashing, Bottlenecks, and Graph Ricci curvature"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "author": null,
          "description": "In this blog post, we discuss the scale at which Twitter operates through Project Sparrow, an initiative that shifted the architecture of our data pipelines from a batch event approach to streaming.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2022/twitter-sparrow-tackles-data-storage-challenges-of-scale",
          "publishedOn": "2022-08-31T12:22:37.738Z",
          "wordCount": 1485,
          "title": "Twitter Sparrow tackles data storage challenges of scale"
        },
        {
          "id": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "author": null,
          "description": "This blog post discusses how feature propagation can be an efficient and scalable approach for handling missing features in graph machine learning applications.",
          "link": "https://blog.twitter.com/engineering/en_us/topics/insights/2022/graph-machine-learning-with-missing-node-features",
          "publishedOn": "2022-08-21T12:17:05.602Z",
          "wordCount": 1838,
          "title": "Graph machine learning with missing node features"
        }
      ]
    },
    {
      "title": "Project Zero",
      "feedUrl": "https://googleprojectzero.blogspot.com/atom.xml",
      "siteUrl": "https://googleprojectzero.blogspot.com/",
      "articles": []
    },
    {
      "title": "Mozilla Hacks – the Web developer blog",
      "feedUrl": "https://hacks.mozilla.org/feed/",
      "siteUrl": "https://hacks.mozilla.org/",
      "articles": [
        {
          "id": "https://hacks.mozilla.org/?p=47919",
          "author": "Schalk Neethling",
          "description": "In June 2021, we decided to start converting the source code for MDN web docs from HTML into a format that would be easier for us to work with. The goal was to get 100% of our manually-written documentation converted to Markdown, and we really had a mountain of source code to climb for this particular expedition.\nIn this post, we’ll describe why we decided to migrate to Markdown, and the steps you can take that will help us on our mission.\nThe post The 100% Markdown Expedition appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/09/the-100-percent-markdown-expedition/",
          "publishedOn": "2022-09-08T09:14:51.000Z",
          "wordCount": 2997,
          "title": "The 100% Markdown Expedition"
        },
        {
          "id": "https://hacks.mozilla.org/?p=47913",
          "author": "Schalk Neethling",
          "description": "How do you merge two Git repositories without losing history? This post will take you through the step-by-step process.\nThe post Merging two GitHub repositories without losing commit history appeared first on Mozilla Hacks - the Web developer blog.",
          "link": "https://hacks.mozilla.org/2022/08/merging-two-github-repositories-without-losing-commit-history/",
          "publishedOn": "2022-08-29T07:54:58.000Z",
          "wordCount": 3521,
          "title": "Merging two GitHub repositories without losing commit history"
        }
      ]
    },
    {
      "title": "The GitHub Blog",
      "feedUrl": "https://github.blog/feed/",
      "siteUrl": "https://github.blog/",
      "articles": [
        {
          "id": "https://github.blog/?p=67084",
          "author": "Aiqiao Yan",
          "description": "The GitHub Actions team has done lots of work to improve the performance and resource consumption of Actions on GHES in the past year.",
          "link": "https://github.blog/2022-09-16-how-we-tripled-max-concurrent-jobs-to-boost-performance-of-github-actions/",
          "publishedOn": "2022-09-16T15:31:30.000Z",
          "wordCount": 1680,
          "title": "How we tripled max concurrent jobs to boost performance of GitHub Actions"
        },
        {
          "id": "https://github.blog/?p=67059",
          "author": "Rizel Scarlett",
          "description": "Developers all over the world are using GitHub Copilot to help speed up their development and increase developer productivity. With GitHub Copilot available to developers everywhere, we’ve found some fun and useful examples of how developers can use GitHub Copilot for things you may not be thinking about.",
          "link": "https://github.blog/2022-09-14-8-things-you-didnt-know-you-could-do-with-github-copilot/",
          "publishedOn": "2022-09-14T16:00:43.000Z",
          "wordCount": 1871,
          "title": "8 things you didn’t know you could do with GitHub Copilot"
        },
        {
          "id": "https://github.blog/?p=67031",
          "author": "Taylor Blau",
          "description": "A tour of recent work to re-engineer Git’s garbage collection process to scale to our largest and most active repositories.",
          "link": "https://github.blog/2022-09-13-scaling-gits-garbage-collection/",
          "publishedOn": "2022-09-13T16:00:49.000Z",
          "wordCount": 5413,
          "title": "Scaling Git’s garbage collection"
        },
        {
          "id": "https://github.blog/?p=66996",
          "author": "Abby Cabunoc Mayes",
          "description": "We’re thrilled to be back at the Grace Hopper Celebration at Open Source Day, the largest celebration of women in open source. Stop by and say hi at one of our workshops.",
          "link": "https://github.blog/2022-09-13-join-github-at-the-grace-hopper-celebration-2022/",
          "publishedOn": "2022-09-13T13:30:56.000Z",
          "wordCount": 1059,
          "title": "Join GitHub at the Grace Hopper Celebration 2022"
        },
        {
          "id": "https://github.blog/?p=67018",
          "author": "Matthew Dyson",
          "description": "Calling all students and teachers!  With semester change coming soon, now is the time to start using the latest features within GitHub Education and Global Campus!",
          "link": "https://github.blog/2022-09-12-gear-up-and-unlock-the-newest-github-global-campus-features/",
          "publishedOn": "2022-09-12T19:17:17.000Z",
          "wordCount": 1468,
          "title": "Gear-up and unlock the newest GitHub Global Campus features"
        },
        {
          "id": "https://github.blog/?p=66930",
          "author": "Brittany O'Shea",
          "description": "We’re taking a look at two commonly-used security tools and detailing how they can help secure your projects.",
          "link": "https://github.blog/2022-09-09-sca-vs-sast-what-are-they-and-which-one-is-right-for-you/",
          "publishedOn": "2022-09-09T15:16:13.000Z",
          "wordCount": 1540,
          "title": "SCA vs SAST: what are they and which one is right for you?"
        },
        {
          "id": "https://github.blog/?p=66919",
          "author": "Elise Hollowed",
          "description": "After a year in technical preview, GitHub Copilot, an AI pair programmer, is now free for all teachers verified on GitHub Global Campus.",
          "link": "https://github.blog/2022-09-08-github-copilot-now-available-for-teachers/",
          "publishedOn": "2022-09-08T18:00:49.000Z",
          "wordCount": 1156,
          "title": "GitHub Copilot now available for teachers"
        },
        {
          "id": "https://github.blog/?p=66902",
          "author": "Mala Kumar",
          "description": "Read the new GitHub report on OSS in India, Kenya, Egypt, and Mexico. Available now in English, and in Spanish and Arabic later this year.",
          "link": "https://github.blog/2022-09-08-research-open-source-software-in-india-kenya-egypt-and-mexico/",
          "publishedOn": "2022-09-08T07:00:33.000Z",
          "wordCount": 1079,
          "title": "Research: open source software in India, Kenya, Egypt, and Mexico"
        },
        {
          "id": "https://github.blog/?p=66877",
          "author": "Jakub Oleksy",
          "description": "In August, we experienced one incident resulting in significant impact to Codespaces. We’re still investigating that incident and will include it in next month’s report. This report also sheds light into an incident that impacted Codespaces in July.",
          "link": "https://github.blog/2022-09-07-github-availability-report-august-2022/",
          "publishedOn": "2022-09-07T18:00:24.000Z",
          "wordCount": 1044,
          "title": "GitHub Availability Report: August 2022"
        },
        {
          "id": "https://github.blog/?p=66861",
          "author": "Eirini Kalliamvakou",
          "description": "When the GitHub Copilot Technical Preview launched just over one year ago, we wanted to know one thing: Is this tool helping developers? The GitHub Next team conducted research using a combination of surveys and experiments, which led us to expected and unexpected answers.",
          "link": "https://github.blog/2022-09-07-research-quantifying-github-copilots-impact-on-developer-productivity-and-happiness/",
          "publishedOn": "2022-09-07T16:00:28.000Z",
          "wordCount": 2016,
          "title": "Research: quantifying GitHub Copilot’s impact on developer productivity and happiness"
        },
        {
          "id": "https://github.blog/?p=66836",
          "author": "Andrea Griffiths",
          "description": "Live on September 15, 2022, with talks by industry experts in Spanish, Portuguese, and English, on topics including software development, security, technical project management, community, open source, professional development and best practices.",
          "link": "https://github.blog/2022-09-06-join-us-for-octogatosconf-2022/",
          "publishedOn": "2022-09-06T16:00:05.000Z",
          "wordCount": 1780,
          "title": "Join us for OctogatosConf 2022"
        },
        {
          "id": "https://github.blog/?p=66851",
          "author": "Ariel Deitcher",
          "description": "A software engineer’s personal journey to becoming an open source contributor.",
          "link": "https://github.blog/2022-09-06-contributing-to-open-source-at-github/",
          "publishedOn": "2022-09-06T13:30:26.000Z",
          "wordCount": 1650,
          "title": "Contributing to open source at GitHub"
        },
        {
          "id": "https://github.blog/?p=66830",
          "author": "Michelle Mannering",
          "description": "We’ve been gearing up to launch GitHub Universe 2022 and our community has been launching cool projects left right and center.  These projects include everything from world-changing technology to developer tooling, and weekend hobbies. Here are some of the open source projects that released major version updates this August. Read more about these projects in […]",
          "link": "https://github.blog/2022-09-02-release-radar-aug-2022/",
          "publishedOn": "2022-09-02T23:13:06.000Z",
          "wordCount": 1498,
          "title": "Release Radar · August 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66812",
          "author": "Derrick Stolee",
          "description": "This fifth and final part of our blog series exploring Git's internals shows several strategies for scaling your Git repositories that match related database sharding techniques.",
          "link": "https://github.blog/2022-09-02-gits-database-internals-v-scalability/",
          "publishedOn": "2022-09-02T13:05:05.000Z",
          "wordCount": 3778,
          "title": "Git’s database internals V: scalability"
        },
        {
          "id": "https://github.blog/?p=66793",
          "author": "Ben De St Paer-Gotch",
          "description": "Now your team can spend less time managing infrastructure and more time writing code.",
          "link": "https://github.blog/2022-09-01-github-actions-introducing-the-new-larger-github-hosted-runners-beta/",
          "publishedOn": "2022-09-01T16:08:20.000Z",
          "wordCount": 674,
          "title": "GitHub Actions: introducing the new, larger GitHub-hosted runners beta"
        },
        {
          "id": "https://github.blog/?p=66776",
          "author": "Derrick Stolee",
          "description": "We're examining Git’s internals to help make your engineering system more efficient. This post views Git as a distributed database and looks into its synchronization techniques, specifically ‘git fetch’ and ‘git push’.",
          "link": "https://github.blog/2022-09-01-gits-database-internals-iv-distributed-synchronization/",
          "publishedOn": "2022-09-01T13:00:20.000Z",
          "wordCount": 5344,
          "title": "Git’s database internals IV: distributed synchronization"
        },
        {
          "id": "https://github.blog/?p=66724",
          "author": "Jeimy Ruiz",
          "description": "Register now to attend GitHub Universe virtually or in-person at the Yerba Buena Center for the Arts in San Francisco on November 9-10.",
          "link": "https://github.blog/2022-08-31-what-you-can-expect-at-github-universe-2022-cloud-security-community-and-ai/",
          "publishedOn": "2022-08-31T16:00:42.000Z",
          "wordCount": 1016,
          "title": "What you can expect at GitHub Universe 2022: cloud, security, community, and AI"
        },
        {
          "id": "https://github.blog/?p=66739",
          "author": "Derrick Stolee",
          "description": "Git’s file history queries use specialized algorithms that are tailored to common developer behavior. Level up your history spelunking skills by learning how different history modes behave and which ones to use when you need them.",
          "link": "https://github.blog/2022-08-31-gits-database-internals-iii-file-history-queries/",
          "publishedOn": "2022-08-31T14:00:42.000Z",
          "wordCount": 4841,
          "title": "Git’s database internals III: file history queries"
        },
        {
          "id": "https://github.blog/?p=66689",
          "author": "Derrick Stolee",
          "description": "This post explores Git commit history as a database where ‘git log’ is the query language. Learn about Git’s custom query index – the commit-graph file – and how to make sure it's enabled in your repositories.",
          "link": "https://github.blog/2022-08-30-gits-database-internals-ii-commit-history-queries/",
          "publishedOn": "2022-08-30T16:00:11.000Z",
          "wordCount": 5733,
          "title": "Git’s database internals II: commit history queries"
        },
        {
          "id": "https://github.blog/?p=66673",
          "author": "Derrick Stolee",
          "description": "This blog series will examine Git’s internals to help make your engineering system more efficient. Part I discusses how Git stores its data in packfiles using custom compression techniques.",
          "link": "https://github.blog/2022-08-29-gits-database-internals-i-packed-object-store/",
          "publishedOn": "2022-08-29T13:00:06.000Z",
          "wordCount": 4598,
          "title": "Git’s database internals I: packed object store"
        },
        {
          "id": "https://github.blog/?p=66657",
          "author": "Ashley Wolf",
          "description": "The future of software development does not exist without open source. However, to maintain today’s software and create the software of the future, the largest organizations and beneficiaries of open source need to expand their collaboration with the community and help it grow.",
          "link": "https://github.blog/2022-08-26-3-ways-every-company-can-get-started-with-an-open-source-software-strategy/",
          "publishedOn": "2022-08-26T16:00:50.000Z",
          "wordCount": 1046,
          "title": "3 ways every company can get started with an open-source software strategy"
        },
        {
          "id": "https://github.blog/?p=66604",
          "author": "Klint Finley",
          "description": "Whether you’re committing 30 minutes or 3 hours a day to learning, consistency is key. Klint Finley asks 3 tech professionals at different stages in their career for more advice.",
          "link": "https://github.blog/2022-08-25-keeping-your-skillset-fresh-as-a-developer/",
          "publishedOn": "2022-08-25T17:00:22.000Z",
          "wordCount": 2379,
          "title": "Keeping your skillset fresh as a developer"
        },
        {
          "id": "https://github.blog/?p=66578",
          "author": "Matthew Draper",
          "description": "We've open sourced Trilogy, the database adapter we use to connect Ruby on Rails to MySQL-compatible database servers.",
          "link": "https://github.blog/2022-08-25-introducing-trilogy-a-new-database-adapter-for-ruby-on-rails/",
          "publishedOn": "2022-08-25T14:16:34.000Z",
          "wordCount": 842,
          "title": "Introducing Trilogy: a new database adapter for Ruby on Rails"
        },
        {
          "id": "https://github.blog/?p=66595",
          "author": "Rizel Scarlett",
          "description": "This month's featured open source project, Open Sauced, connects contributors and maintainers through analytical insights.",
          "link": "https://github.blog/2022-08-25-open-source-monthly-august-2022-edition/",
          "publishedOn": "2022-08-25T13:00:25.000Z",
          "wordCount": 1424,
          "title": "Open Source Monthly: August 2022 Edition"
        },
        {
          "id": "https://github.blog/?p=66571",
          "author": "Lee Reilly",
          "description": "We are pleased to announce the full lineup of talks and workshops for this year’s Git Merge conference in Chicago. 17 talks, 3 workshops, 1 panel, and some great company!",
          "link": "https://github.blog/2022-08-23-the-full-lineup-for-git-merge-2022-revealed/",
          "publishedOn": "2022-08-23T13:00:23.000Z",
          "wordCount": 734,
          "title": "The full lineup for Git Merge 2022 revealed"
        }
      ]
    },
    {
      "title": "Building Nubank",
      "feedUrl": "https://building.nubank.com.br/feed/",
      "siteUrl": "https://building.nubank.com.br/",
      "articles": [
        {
          "id": "https://building.nubank.com.br/?p=19067",
          "author": "Nubank Editorial",
          "description": "Product Marketing Managers (PMM) are marketing professionals who act within product teams as a bridge between business, brand, and client development.\nThe post What is it like being a Product Marketing Manager at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/product-marketing-manager-at-nubank/",
          "publishedOn": "2022-09-16T17:37:43.000Z",
          "wordCount": 3506,
          "title": "What is it like being a Product Marketing Manager at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=19042",
          "author": "Nubank Editorial",
          "description": "Today you’ll be introduced to Adrian Cockcroft, Nubank's first technical advisor. Dive into his legacy in the technology field and motivations to join the Nubank team!\nThe post Interview: meet Adrian Cockcroft, Nubank’s new Tech Advisor appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/interview-meet-adrian-cockcroft-nubanks-new-tech-advisor/",
          "publishedOn": "2022-09-12T18:35:00.000Z",
          "wordCount": 3553,
          "title": "Interview: meet Adrian Cockcroft, Nubank’s new Tech Advisor"
        },
        {
          "id": "https://building.nubank.com.br/?p=19027",
          "author": "Ana Carolina Tavares - Engineering Tech Manager at Nubank",
          "description": "The greatest wish for any woman in the tech field is to have the opportunity of working with other women on the team. Check out how is this experience at Nubank:\nThe post 9 reasons for women to build their career in the field of Engineering at Nubank appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/9-reasons-for-women-to-build-their-career-in-the-field-of-engineering-at-nubank/",
          "publishedOn": "2022-09-09T21:40:00.000Z",
          "wordCount": 3798,
          "title": "9 reasons for women to build their career in the field of Engineering at Nubank"
        },
        {
          "id": "https://building.nubank.com.br/?p=18897",
          "author": "Felipe Almeida - Machine Learning Engineer at Nubank",
          "description": "Practical tips to help you succeed in your next Data Science and/or Machine Learning interview\nThe post Acing the Data Science Interview: 8 Practical Tips with Examples appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/data-science-interview-pratical-tips/",
          "publishedOn": "2022-09-02T18:54:28.000Z",
          "wordCount": 4272,
          "title": "Acing the Data Science Interview: 8 Practical Tips with Examples"
        },
        {
          "id": "https://building.nubank.com.br/?p=18840",
          "author": "Nubank Editorial",
          "description": "Going beyond maternity leave helps fight gender inequality, encourages family bonds, and creates a safer environment for professionals with children.\nThe post How does parental leave work at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/parental-leave-at-nubank/",
          "publishedOn": "2022-08-31T20:23:52.000Z",
          "wordCount": 3611,
          "title": "How does parental leave work at Nubank?"
        },
        {
          "id": "https://building.nubank.com.br/?p=18813",
          "author": "Nubank Editorial",
          "description": "Do you know what an Associate Product Manager does? Our Nubankers tell us what is their scope of work and expected skills.\nThe post What is it like to be an Associate Product Manager at Nubank? appeared first on Building Nubank.",
          "link": "https://building.nubank.com.br/associate-product-manager-at-nubank/",
          "publishedOn": "2022-08-26T18:13:40.000Z",
          "wordCount": 3521,
          "title": "What is it like to be an Associate Product Manager at Nubank?"
        }
      ]
    },
    {
      "title": "HackerOne",
      "feedUrl": "https://www.hackerone.com/blog.rss",
      "siteUrl": "https://www.hackerone.com/",
      "articles": [
        {
          "id": "https://hackerone.com/application-security/introducing-unified-hackerone-scope-management-burp-suite-support",
          "author": "Tim Matthews",
          "description": "This post will start with the basics of defining scope and how ethical hackers and testers use it in their testing workflow. If you’re already famil",
          "link": "https://www.hackerone.com/application-security/introducing-unified-hackerone-scope-management-burp-suite-support",
          "publishedOn": "2022-09-15T22:00:00.000Z",
          "wordCount": 1668,
          "title": "Introducing Unified HackerOne Scope Management with Burp Suite Support"
        }
      ]
    },
    {
      "title": "Netflix TechBlog - Medium",
      "feedUrl": "https://netflixtechblog.com/feed",
      "siteUrl": "https://netflixtechblog.com?source=rss----2615bd06b42e---4",
      "articles": [
        {
          "id": "https://medium.com/p/6cbc5263a32a",
          "author": "Netflix Technology Blog",
          "description": "by Ehtsham Elahi\nwith James McInerney, Nathan Kallus, Dario Garcia Garcia and Justin Basilico",
          "link": "https://netflixtechblog.com/reinforcement-learning-for-budget-constrained-recommendations-6cbc5263a32a?source=rss----2615bd06b42e---4",
          "publishedOn": "2022-08-24T17:57:33.000Z",
          "wordCount": 2743,
          "title": "Reinforcement Learning for Budget Constrained Recommendations"
        }
      ]
    },
    {
      "title": "All Eyes on Markets",
      "feedUrl": "https://marketradar.substack.com/feed.xml",
      "siteUrl": "https://marketradar.substack.com",
      "articles": [
        {
          "id": "https://marketradar.substack.com/p/portfolio-review-august-2022",
          "author": "Market Radar",
          "description": "Balanced and Pure Stocks Portfolios",
          "link": "https://marketradar.substack.com/p/portfolio-review-august-2022",
          "publishedOn": "2022-09-06T16:40:09.000Z",
          "wordCount": null,
          "title": "Portfolio Review: August 2022",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc3b2ba7b-6100-466a-8f16-0f928f540cdd_1236x793.png",
            "length": "0",
            "type": "image/jpeg"
          }
        },
        {
          "id": "https://marketradar.substack.com/p/charts-to-watch-7",
          "author": "Market Radar",
          "description": "A mix of charts on stocks, indices and crypto",
          "link": "https://marketradar.substack.com/p/charts-to-watch-7",
          "publishedOn": "2022-08-23T18:27:14.000Z",
          "wordCount": null,
          "title": "Charts to Watch #7",
          "itunes": {},
          "enclosure": {
            "url": "https://substackcdn.com/image/fetch/h_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0616b815-b9f0-471a-a06b-b9fac4f0b26a_1786x744.png",
            "length": "0",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "BetterExplained",
      "feedUrl": "https://betterexplained.com/feed/",
      "siteUrl": "https://betterexplained.com",
      "articles": []
    },
    {
      "title": "busybee: Code",
      "feedUrl": "https://beesbuzz.biz/code/feed",
      "siteUrl": "https://beesbuzz.biz/code/feed",
      "articles": []
    }
  ],
  "cliVersion": "1.11.3"
}